{
    "dictionary": [
        {
            "id": 0,
            "phrase": "change out of something",
            "definition": "to take off a set of clothing and put on another. I have to change out of these wet clothes.  You should change out of your casual clothes and put on something more formal for dinner."
        },
        {
            "id": 1,
            "phrase": "change over (from someone or something) (to someone or something)",
            "definition": "to convert from something to something else; to convert from someone to someone else.  We decided to change over from oil to gas heat.  We changed over to gas from oil."
        },
        {
            "id": 2,
            "phrase": "change places with someone",
            "definition": "to trade or exchange situations or locations with someone. He has a much higher salary, but I wouldn’t change places with him for the world.  Juan decided to change places with Ken in the bus."
        },
        {
            "id": 3,
            "phrase": "change someone or something into someone or something",
            "definition": "to make someone or something change form or state.  The wizard claimed he could change a horse into a unicorn. He suddenly changed himself into a smiling friend rather than the gruff old man we had long known."
        },
        {
            "id": 4,
            "phrase": "change someone’s mind",
            "definition": "to cause a person to think differently (about someone or something).  Tom thought Mary was unkind, but an evening out with her changed his mind. I can change my mind if you convince me that you are right."
        },
        {
            "id": 5,
            "phrase": "change someone’s tune",
            "definition": "to change the manner of a person, usually from bad to good, or from rude to pleasant. The teller was most unpleasant until she learned that I’m a bank director. Then she changed her tune.  “I will help change your tune by fining you $150,” said the judge to the rude defendant."
        },
        {
            "id": 6,
            "phrase": "change something back†",
            "definition": "to cause something to return to the original or a previous form.  Whoever changed the television channel should change it back.  Change back the channel to the game!"
        },
        {
            "id": 7,
            "phrase": "change something with someone",
            "definition": "to trade or exchange something with someone. I changed coats with Fred and his is much warmer.  Will you change seats with me?"
        },
        {
            "id": 8,
            "phrase": "change the channel",
            "definition": "Sl. to switch to some other topic of conversation.  Just a minute. I think you changed the channel. Let’s go back to the part about you owing me money.  Let’s change the channel here before there is a fight."
        },
        {
            "id": 9,
            "phrase": "change the subject",
            "definition": "to begin talking about something different.  They changed the subject suddenly when the person whom they had been discussing entered the room.  We’ll change the subject if we are embarrassing you."
        },
        {
            "id": 10,
            "phrase": "change to something",
            "definition": "to convert to something; to give up one and choose another. We will change to standard time in the fall. I decided to change to gas for heating and cooking."
        },
        {
            "id": 11,
            "phrase": "channel something in(to something)",
            "definition": "to divert water or other liquid through a channel into something.  The farmer channeled the irrigation water into the field."
        },
        {
            "id": 12,
            "phrase": "channel something off†",
            "definition": "to drain off water or some other liquid through a channel.  The front yard is flooded, and we will have to channel the water off.  Let’s channel off the water before it gets too deep."
        },
        {
            "id": 13,
            "phrase": "chapter and verse",
            "definition": "very specifically detailed, in reference to sources of information. (A reference to the method of referring to biblical text.) _ He gave chapter and verse for his reasons for disputing that Shakespeare had written the play.  The suspect gave chapter and verse of his associate’s activities."
        },
        {
            "id": 14,
            "phrase": "character assassination",
            "definition": "seriously harming someone’s reputation.  The review was more than a negative appraisal of his performance. It was total character assassination."
        },
        {
            "id": 15,
            "phrase": "charge at someone or something",
            "definition": "to move quickly forward to attack someone or something.  The elephant charged at the hunter.  I was afraid that the water buffalo was going to charge our vehicle."
        },
        {
            "id": 16,
            "phrase": "charge down on someone or something",
            "definition": "[for an animal or vehicle] to race or move quickly against someone or something. The angry elephant charged down on the hunters.  The speeding truck charged down on the small shed."
        },
        {
            "id": 17,
            "phrase": "charge in(to some place)",
            "definition": "to move quickly or run wildly into a place. The people charged into the store on the day of the sale.  They all charged in trying to be first in line."
        },
        {
            "id": 18,
            "phrase": "Charge it to the dust and let the rain settle it.",
            "definition": "Rur. Do not expect to be paid for this. (A humorous answer to a question like, “Who is going to pay for this?”) _ Tom: Who’s going to pay me all that money you owe? Mary: Charge it to the dust and let the rain settle it!"
        },
        {
            "id": 19,
            "phrase": "charge off",
            "definition": "to move quickly or run away.  He got angry and charged off.  Juan charged off to talk to the boss."
        },
        {
            "id": 20,
            "phrase": "charge out (of some place)",
            "definition": "to move quickly or stomp out of some place.  Carol charged out of the house, trying to catch Sally before she got on the bus.  Juan got mad and suddenly charged out."
        },
        {
            "id": 21,
            "phrase": "charge someone up†",
            "definition": "to excite someone; to make a person enthusiastic about something.  The speaker charged up the crowd.  He reread the report, hoping to charge himself up enough to make some positive comments."
        },
        {
            "id": 22,
            "phrase": "charge someone with something",
            "definition": "1. to place criminal charges against someone.  The police charged Max with robbery. 2. to order someone to do a particular task.  The president charged him with organizing the meeting.  We charged her with locating new office space."
        },
        {
            "id": 23,
            "phrase": "charge something against something",
            "definition": "to debit or assign the cost of something against something.  Can I charge this item against the entertainment account? _ Don’t even try to charge it against your business expenses."
        },
        {
            "id": 24,
            "phrase": "charge (something) for someone",
            "definition": "to demand an amount of money to pay for someone’s ticket, fare, admission, treatment, etc. Tickets are expensive. They charged sixty dollars for each seat.  I didn’t realize they charged for children."
        },
        {
            "id": 25,
            "phrase": "charge (something) for something",
            "definition": "to set a price in payment for something. You are charging too much for this. You really shouldn’t charge for it at all."
        },
        {
            "id": 26,
            "phrase": "charge something off as something",
            "definition": "to consider something a legitimate expense and deduct it from one’s taxes; to assign something to the tax loss category in accounting.  I will have to charge this off as a loss.  Try to charge it off as a business expense."
        },
        {
            "id": 27,
            "phrase": "charge something on something",
            "definition": "1. to put the cost of something on a credit card or credit account.  I would like to charge this purchase on my credit card. What card do you want to charge it on? 2. to demand the payment of interest or a penalty on something.  They charged an enormous amount of interest on the loan.  The bank charged a penalty on the late payment."
        },
        {
            "id": 28,
            "phrase": "charge something up†",
            "definition": "to apply an electrical charge to a battery.  How long will it take to charge this battery up? _ It takes an hour to charge up your battery."
        },
        {
            "id": 29,
            "phrase": "charged up",
            "definition": "[of something such as a battery] full of electrical power.  The battery is completely charged up. If the battery isn’t charged, the car won’t start."
        },
        {
            "id": 30,
            "phrase": "Charity begins at home.",
            "definition": "Prov. You should take care of family and people close to you before you worry about helping others.  I don’t think our church should worry so much about a foreign relief fund when there are people in need right here in our city. Charity begins at home. If you really want to make the world a better place, start by being polite to your sister. Charity begins at home."
        },
        {
            "id": 31,
            "phrase": "*a charley horse",
            "definition": "a painful, persistent cramp in the arm or leg, usually from strain. (*Typically: get ~; have ~; give someone ~.) _ Don’t hike too far or you’ll get a charley horse."
        },
        {
            "id": 32,
            "phrase": "charm someone with something",
            "definition": "to enchant or fascinate someone with something.  He charmed her with stories of his house on the beach.  She charmed him with her bright smile."
        },
        {
            "id": 33,
            "phrase": "charm the pants off someone",
            "definition": "to use very charming behavior to persuade someone to do something. (Use with caution.) _She is so nice. She just charms the pants off you.  He will try to charm the pants off you, but you can still refuse to take the job if you don’t want to do it."
        },
        {
            "id": 34,
            "phrase": "chart something out† (for someone or something)",
            "definition": "to lay out a plan or course for someone or something.  The navigator charted the course out for the captain.  The captain charted out the course for us."
        },
        {
            "id": 35,
            "phrase": "chase around after someone or something",
            "definition": "to look here and there for something; to seek someone or something in many different places.  I don’t want to have to spend a whole day chasing around after exotic ingredients for this recipe of yours.  I chased around after Roger and never found him."
        },
        {
            "id": 36,
            "phrase": "chase someone or something around†",
            "definition": "to follow someone or something around in pursuit. (There is an implication that the person or thing pursued is attempting to elude whatever is in pursuit.) _ The dog chased us around in play.  It chased around all the children."
        },
        {
            "id": 37,
            "phrase": "chase someone or something down†",
            "definition": "to track down and seize someone or something.  Larry set out to chase the pickpocket down.  The police chased down the suspect."
        },
        {
            "id": 38,
            "phrase": "chase someone or something up†",
            "definition": "to seek someone or something out; to look high and low for someone or something.  I will chase Tom up for you.  I will try to chase up a buyer for your car."
        },
        {
            "id": 39,
            "phrase": "chase someone or something up something",
            "definition": "to drive someone or an animal up something, such as a tree, a hill, a cliff, etc.  The ranchers chased the mountain lion up a tree.  The bull chased the rodeo clown up into the stands."
        },
        {
            "id": 40,
            "phrase": "chat about someone or something",
            "definition": "to talk idly or informally about someone or something.  We need to chat about Molly.  I want to chat about your expenditures a little."
        },
        {
            "id": 41,
            "phrase": "chatter about someone or something",
            "definition": "to talk idly and actively about someone or something. All the guests were chattering about something or other.  People are chattering about you and Claire. Do you want to know what they are saying?"
        },
        {
            "id": 42,
            "phrase": "chatter (away) (at someone or something)",
            "definition": "to talk incessantly or noisily to or at someone or something.  The parrot was chattering away at its ref lection in the mirror.  The kids were chattering away.  Stop chattering at me!"
        },
        {
            "id": 43,
            "phrase": "chatter from something",
            "definition": "[for one’s teeth] to shake noisily with a chill from the cold, the dampness, a fever, etc.  My teeth were chattering from the extreme cold.  It was a terrible illness. My teeth chattered from the chills that followed the fever."
        },
        {
            "id": 44,
            "phrase": "cheat at something",
            "definition": "to use deception while competing [against someone].  They say she cheats at cards.  The mob is likely to cheat at getting the contracts."
        },
        {
            "id": 45,
            "phrase": "cheat on someone",
            "definition": "to commit adultery; to be unfaithful to one’s spouse or lover.  “Have you been cheating on me?” cried Mrs. Franklin.  He was caught cheating on his wife."
        },
        {
            "id": 46,
            "phrase": "cheat someone out of something",
            "definition": "to get something from someone by deception.  Are you trying to cheat me out of what is rightfully mine? _ She cheated herself out of an invitation because she lied about her affiliation."
        },
        {
            "id": 47,
            "phrase": "check back (on someone or something)",
            "definition": "to look into the state of someone or something again at a later time. I’ll have to check back on you later."
        },
        {
            "id": 48,
            "phrase": "check back (with someone)",
            "definition": "to inquire of someone again at a later time.  Please check back with me later."
        },
        {
            "id": 49,
            "phrase": "check in (at something)",
            "definition": "to go to a place to record one’s arrival.  When you get there, check in at the front office."
        },
        {
            "id": 50,
            "phrase": "check in (with someone)",
            "definition": "to go to someone and indicate that one has arrived some place. Please check in with the desk clerk."
        },
        {
            "id": 51,
            "phrase": "check in(to something)",
            "definition": "to sign oneself into a place to stay, such as a hotel, hospital, motel, etc.  She checked into a private hospital for some kind of treatment.  They checked into the first motel they came to on the highway. "
        },
        {
            "id": 52,
            "phrase": "check on someone or something",
            "definition": "to look into the legitimacy or condition of someone or something. Sarah will check on the matter and report to us.  I will check on Jeff while he’s not feeling well."
        },
        {
            "id": 53,
            "phrase": "check out",
            "definition": "[for someone or something] to prove to be correctly represented.  Everything you told me checks out with what other witnesses said."
        },
        {
            "id": 54,
            "phrase": "check out the plumbing",
            "definition": "Euph. to go to the bathroom. (The order is fixed.) _ I think I’d better check out the plumbing before we get on the highway."
        },
        {
            "id": 55,
            "phrase": "check someone in†",
            "definition": "to record the arrival of someone. Ask the guard to check you in when you get there.  Tell the guard to check in the visitors as they arrive."
        },
        {
            "id": 56,
            "phrase": "check someone or something off†",
            "definition": "to mark or cross out the name of a person or thing on a list. I am glad to see that you were able to come. I will check you off.  I checked the items off.  I checked off the recent arrivals."
        },
        {
            "id": 57,
            "phrase": "check someone or something out†",
            "definition": "to evaluate someone or something.  That stock sounds good. I’ll check it out.  I’ll check out the competition."
        },
        {
            "id": 58,
            "phrase": "check someone or something out† (of something)",
            "definition": "to do the paperwork necessary to remove someone or something from something or some place. I will have the manager check you out of the hotel and send you the bill.  The librarian checked out the computer to me."
        },
        {
            "id": 59,
            "phrase": "check someone or something over†",
            "definition": "to examine someone or something closely. You should have the doctor check you over before you go back to work.  The doctor checked over the children who had shown the worst symptoms.  The mechanic checked the car over."
        },
        {
            "id": 60,
            "phrase": "check someone or something through (something)",
            "definition": "to allow one to pass through something after checking one’s identification, tickets, passes, etc. (Fixed order.) _ The guard checked us through the gate, and we went about our business.  We checked them through security."
        },
        {
            "id": 61,
            "phrase": "check something in†",
            "definition": "1. to record that someone has returned something.  I asked the librarian to check the book in for me. Did the librarian check in the book? 2. to take something to a place, return it, and make sure that its return has been recorded.  I checked the book in on time.  Did you really check in the book on time? 3. to examine a shipment or an order received and make certain that everything ordered was received. I checked the order in and sent a report to the manager.  Tim checked in the order from the supplier to make sure that everything was there."
        },
        {
            "id": 62,
            "phrase": "check something out†",
            "definition": "to examine or try something; to think about something.  It’s something we all have to be concerned with. Check it out.  Check out the new comedy show on tonight."
        },
        {
            "id": 63,
            "phrase": "check that",
            "definition": "cancel that; ignore that (last remark). Check that. I was wrong. At four, no, check that, at three o’clock this afternoon, the shipment arrived and was signed for."
        },
        {
            "id": 64,
            "phrase": "check through something",
            "definition": "to examine something or a collection of things. (Usually refers to papers or written work, or to details in the paperwork.) _ Check through this and look for missing pages.  I’ll check through it for typographical errors also."
        },
        {
            "id": 65,
            "phrase": "check up (on someone or something)",
            "definition": "to determine the state of someone or something.  Please don’t check up on me. I can be trusted.  I see no need to check up."
        },
        {
            "id": 66,
            "phrase": "check with someone (about something)",
            "definition": "to ask someone about something.  You should check with the concierge about the bus to the airport. Please check with your agent."
        },
        {
            "id": 67,
            "phrase": "checks and balances",
            "definition": "a system, as in the U.S. Constitution, where power is shared between the various branches of government.  The newspaper editor claimed that the system of checks and balances built into our Constitution has been subverted by party politics."
        },
        {
            "id": 68,
            "phrase": "*a checkup",
            "definition": "a physical examination by a physician. (*Typically: get ~; have ~; give someone ~.) _ She got a checkup yesterday.  I’m going to have a checkup in the morning. I hope I’m okay."
        },
        {
            "id": 69,
            "phrase": "cheek by jowl",
            "definition": "side by side; close together.  The pedestrians had to walk cheek by jowl along the narrow streets. The two families lived cheek by jowl in one house."
        },
        {
            "id": 70,
            "phrase": "cheer for someone or something",
            "definition": "to give a shout of encouragement for someone or something.  Everyone cheered for the team.  I cheered for the winning goal."
        },
        {
            "id": 71,
            "phrase": "cheer someone or something on†",
            "definition": "to encourage someone or a group to continue to do well, as by cheering.  We cheered them on, and they won. We cheered on the team.  Sam cheered Jane on."
        },
        {
            "id": 72,
            "phrase": "cheer someone up†",
            "definition": "to make a sad person happy.  When Bill was sick, Ann tried to cheer him up by reading to him.  Interest rates went up, and that cheered up all the bankers."
        },
        {
            "id": 73,
            "phrase": "cheer up",
            "definition": "[for a sad person] to become happy.  After a while, she began to cheer up and smile more.  Cheer up! Things could be worse."
        },
        {
            "id": 74,
            "phrase": "cheese someone off†",
            "definition": "Sl. to make someone very angry.  You sure know how to cheese Laurel off.  Bobby cheesed off every person in the club."
        },
        {
            "id": 75,
            "phrase": "*cheesed off",
            "definition": "Sl. angry; disgusted. (*Typically: be ~; get ~; get someone ~.) _ Clare was really cheesed off at the waiter.  The waiter was cheesed off at the cook."
        },
        {
            "id": 76,
            "phrase": "cherry-pick something",
            "definition": "to choose something very carefully. (As if one were closely examining cherries on the tree, looking for the best.) _ We have to cherry-pick the lumber we want to use for the cabinetry. Nothing but the best will do."
        },
        {
            "id": 77,
            "phrase": "chew (away) at something",
            "definition": "to gnaw or chew something for a period of time.  The puppy chewed away at the leather belt all night."
        },
        {
            "id": 78,
            "phrase": "chew one’s own tobacco",
            "definition": "Rur. to mind one’s own business. Sally: You seem awfully happy all of a sudden. How come? Tom: Chew your own tobacco. I’m just sitting here chewing my own tobacco, not bothering anybody."
        },
        {
            "id": 79,
            "phrase": "chew one’s",
            "definition": "cud Fig. to think deeply; to be deeply involved in private thought. (Alludes to the cow’s habit of bringing food back from the first stomach into the mouth to chew it, called chewing the cud.) _ He’s chewing his cud about what to do next."
        },
        {
            "id": 80,
            "phrase": "chew someone or something up†",
            "definition": "to damage or ruin someone or something by pinching, grinding, biting, etc.  Stay away from the mower blade or it will chew you up.  The lawn mower chewed up the f lowers."
        },
        {
            "id": 81,
            "phrase": "chew something away†",
            "definition": "to gnaw something off; to gnaw at something until it’s all gone.  You can see what’s left of it. Most of it has been chewed away by some animal. Your puppy chewed away the top of my shoe!"
        },
        {
            "id": 82,
            "phrase": "chew something up†",
            "definition": "to grind food with the teeth until it can be swallowed. You had better chew that stuff up well.  Please chew up your food well."
        },
        {
            "id": 83,
            "phrase": "chicken feed",
            "definition": "a small amount of anything, especially of money.  Of course I can afford $800. That’s just chicken feed.  It may be chicken feed to you, but that’s a month’s rent to me."
        },
        {
            "id": 84,
            "phrase": "chicken out (of something)",
            "definition": "Inf. to manage to get out of something, usually because of fear or cowardice. Come on! Don’t chicken out now! _ Freddy chickened out of the plan at the last minute."
        },
        {
            "id": 85,
            "phrase": "chicken out on someone",
            "definition": "Inf. to decide not to do something for or with someone.  Come on, don’t chicken out on me now! _ Ken chickened out on us and won’t be going with us."
        },
        {
            "id": 86,
            "phrase": "chicken-hearted",
            "definition": "cowardly.  Yes, I’m a chicken-hearted softie. I never try anything too risky."
        },
        {
            "id": 87,
            "phrase": "The chickens come home to roost.",
            "definition": "Prov. You have to face the consequences of your mistakes or bad deeds.  Jill: Emily found out that I said she was incompetent, and now she won’t recommend me for that job. Jane: The chickens have come home to roost, I see."
        },
        {
            "id": 88,
            "phrase": "chide someone for something",
            "definition": "to tease or scold someone for doing something.  Maria chided Gerald for being late."
        },
        {
            "id": 89,
            "phrase": "chief cook and bottle washer",
            "definition": "the person in charge of practically everything (such as in a very small business).  I’m the chief cook and bottle washer around here. I do everything."
        },
        {
            "id": 90,
            "phrase": "child’s play",
            "definition": "something very easy to do.  The test was child’s play to those who took good notes. Finding the right street was child’s play with a map."
        },
        {
            "id": 91,
            "phrase": "Children and fools tell the truth.",
            "definition": "Prov. Children have not yet learned, and fools never did learn, that it is often advantageous to lie. Fred: What will I tell Ellen when she asks why I’m so late getting home? Alan: Tell her the truth— we were out having a few drinks. Fred: Children and fools tell the truth, Alan."
        },
        {
            "id": 92,
            "phrase": "Children should be seen and not heard.",
            "definition": "Prov. Children should not speak in the presence of adults. (Often used as a way to rebuke a child who has spoken when he or she should not.) _You may come out and meet the party guests if you’ll remember that children should be seen and not heard."
        },
        {
            "id": 93,
            "phrase": "chill someone’s action",
            "definition": "Sl. to squelch someone; to prevent someone from accomplishing something. Freddie is trying to chill my action, and he’d better stop and leave me alone."
        },
        {
            "id": 94,
            "phrase": "*chilled to the bone",
            "definition": "very cold. (*Typically: be ~; get ~.) _ I got chilled to the bone in that snowstorm.  The children were chilled to the bone from their swim in the ocean."
        },
        {
            "id": 95,
            "phrase": "chime in (with something)",
            "definition": "to add a comment to the discussion.  Little Billy chimed in with a suggestion.  He chimed in too late; the meeting was breaking up."
        },
        {
            "id": 96,
            "phrase": "chin music",
            "definition": "Inf. talk; conversation.  Whenever those two get together, you can be sure there’ll be plenty of chin music. Bill just loves to hear himself talk. He’ll make chin music for hours at a time."
        },
        {
            "id": 97,
            "phrase": "a chink in one’s armor",
            "definition": "a special weakness that provides a means for attacking or impressing someone otherwise invulnerable. (Alludes to an opening in a suit of armor that allows a weapon to penetrate.) _ Jane’s insecurity is the chink in her armor.  The boss seems mean, but the chink in his armor is that he is easily f lattered."
        },
        {
            "id": 98,
            "phrase": "chip away",
            "definition": "[for something] to break off or break away in small chips.  The edges of the marble step chipped away over the years. Some of the stone figures had chipped away so badly that we couldn’t see what they were."
        },
        {
            "id": 99,
            "phrase": "chip (away) at something",
            "definition": "to break off tiny pieces of something little by little.  The mason chipped away at the bricks.  He chipped at the block of marble gently."
        },
        {
            "id": 100,
            "phrase": "a chip off the old block",
            "definition": "a person (usually a male) who behaves in the same way as his father or resembles his father.  John looks like his father—a real chip off the old block.  Bill Jones, Jr., is a chip off the old block. He’s a banker just like his father."
        },
        {
            "id": 101,
            "phrase": "*a chip on one’s shoulder",
            "definition": "a bad attitude that tends to get someone easily upset. (*Typically: get ~; have ~; give one ~.) _Why did you get so angry at the slightest criticism? You seem to have a chip on your shoulder."
        },
        {
            "id": 102,
            "phrase": "chip something away† (from something)",
            "definition": "to break off tiny pieces of something.  Many years of heavy use chipped the marble steps away.  Someone chipped away little bits of the marble from that step."
        },
        {
            "id": 103,
            "phrase": "chips and dip",
            "definition": "potato chips, or some other kind of crisp snack food, and a sauce or dressing to dip them into before eating them.  There were tons of chips and dip and all kinds of cold drinks available for everyone."
        },
        {
            "id": 104,
            "phrase": "chisel in (on someone or something)",
            "definition": "Sl. to use deception to get a share of something.  I won’t chisel in on your deal.  You had better not chisel in!"
        },
        {
            "id": 105,
            "phrase": "chock full of something",
            "definition": "very full of something.  These cookies are chock full of big chunks of chocolate."
        },
        {
            "id": 106,
            "phrase": "choke on something",
            "definition": "to gag and cough on something stuck in the throat. The dog choked on the meat. The restaurant patron began to choke on a fish bone."
        },
        {
            "id": 107,
            "phrase": "choke someone off†",
            "definition": "to prevent someone from continuing to talk. (A figurative use; does not imply physical choking.) _The opposition choked the speakers’ debate off before they finished.  Why did they want to choke off the speakers?"
        },
        {
            "id": 108,
            "phrase": "choke someone up†",
            "definition": "to cause someone to feel like starting to cry.  Sad stories like that always choke me up.  The movie was sad and it choked up most of the audience."
        },
        {
            "id": 109,
            "phrase": "choke something back†",
            "definition": "to fight hard to keep something from coming out of one’s mouth, such as sobs, tears, angry words, vomit, etc.  I tried to choke the unpleasant words back, but I could not.  She choked back her grief, but it came forth nonetheless.  I could hardly choke my tears back."
        },
        {
            "id": 110,
            "phrase": "choke something down†",
            "definition": "to eat something, even though it is hard to swallow or tastes bad.  The cough medicine tasted terrible, but I managed to choke it down.  She choked down four of those pills all at once."
        },
        {
            "id": 111,
            "phrase": "choke something off†",
            "definition": "to restrict or strangle a living creature’s windpipe. The tight collar on the cat tended to choke its airstream off. The collar choked off its airstream."
        },
        {
            "id": 112,
            "phrase": "choke something up†",
            "definition": "1. to clog something up; to fill up and block something.  Branches and leaves choked the sewer up. Rust choked up the pipes. 2. to cough or choke until something that has blocked one’s windpipe is brought up.  The old man choked up the candy that was stuck in his windpipe.  He choked up the chunk of meat and could breathe again."
        },
        {
            "id": 113,
            "phrase": "choke up",
            "definition": "1. to feel like crying. I choked up when I heard the news. He was beginning to choke up as he talked. 2. to become emotional or saddened so that one cannot speak.  I choked up when I heard about the disaster.  I was choking up, and I knew I would not be able to go on."
        },
        {
            "id": 114,
            "phrase": "choose among someone or something",
            "definition": "to make a choice of a person or thing from a variety of possibilities. We will choose among the names on the list you gave us.  I need to choose among the car models available."
        },
        {
            "id": 115,
            "phrase": "choose between two people or things",
            "definition": "to choose one from a selection of two persons or things in any combination. For dessert, you can choose between chocolate and vanilla ice cream. I am unable to choose between promoting John and hiring one of the others."
        },
        {
            "id": 116,
            "phrase": "choose from someone or something",
            "definition": "to make a selection from a group of persons or things.  You will have to choose from these people only.  Ron chose from the items in the catalog."
        },
        {
            "id": 117,
            "phrase": "choose someone as something",
            "definition": "to select someone to be something.  We will choose her as our representative.  I chose Sam as my assistant."
        },
        {
            "id": 118,
            "phrase": "choose someone or something for something",
            "definition": "to select someone or something for a particular purpose, office, title, etc. I chose red for the color or the carpet. I will choose Alice for office manager."
        },
        {
            "id": 119,
            "phrase": "choose something for someone",
            "definition": "to select something for someone, perhaps as a gift.  I will probably choose f lowers for your mother. I chose a funny card for his birthday."
        },
        {
            "id": 120,
            "phrase": "choose (up) sides",
            "definition": "to select from a group to be on opposing sides for a debate, fight, or game. (Fixed order.) _Let’s choose up sides and play basketball.  The children chose up sides and began the game."
        },
        {
            "id": 121,
            "phrase": "chop someone off†",
            "definition": "to stop someone in the middle of a sentence or speech. (Abruptly, as if actually chopping or cutting.) _ I’m not finished. Don’t chop me off! _ The moderator chopped off the speaker."
        },
        {
            "id": 122,
            "phrase": "chop someone or something (up†) (in(to) something)",
            "definition": "to cut something up into something smaller, perhaps with an axe or a cleaver.  The butcher chopped up the beef loin into small fillets.  I chopped up the onion into little pieces."
        },
        {
            "id": 123,
            "phrase": "chop something back†",
            "definition": "to prune vegetation; to reduce the size of plants by cutting.  Why don’t you chop those bushes back while you have the shears out? _Chop back the bushes, please."
        },
        {
            "id": 124,
            "phrase": "chop something down†",
            "definition": "to cut down something, such as a tree, with an ax.  Please don’t chop my favorite tree down.  Don’t chop down this tree!"
        },
        {
            "id": 125,
            "phrase": "chow (something) down",
            "definition": "Sl. to eat something, usually quickly or without good manners.  We can chow this pizza down in about two minutes! _ I found a box of cookies and chowed it down before anybody knew what I was doing."
        },
        {
            "id": 126,
            "phrase": "Christmas comes but once a year.",
            "definition": "Prov. Since Christmas only happens once a year, we should treat it as a special time by being good to others or by indulging children.  Christmas comes but once a year, so we urge you to give to those less fortunate through this Christmas charity campaign."
        },
        {
            "id": 127,
            "phrase": "chuck it in",
            "definition": "Inf. to quit; to give up. (Fixed order.) _ I was so depressed, I almost chucked it in.  If I didn’t have to keep the job to pay my bills, I’d have chucked it in long ago."
        },
        {
            "id": 128,
            "phrase": "chuck someone or something away†",
            "definition": "to push or shove someone or something out of the way quickly or roughly. She chucked the children away and ran to lock the door to protect them.  He chucked away his clothes in a drawer.  The rock star approached, and the guard chucked the teenagers away."
        },
        {
            "id": 129,
            "phrase": "chuck someone under the chin",
            "definition": "to tap someone, as a child, lightly under the chin, as a sign of affection.  He said hello to little Mary and chucked her under the chin.  Please don’t chuck me under the chin! I am not a child, you know!"
        },
        {
            "id": 130,
            "phrase": "chuck something away†",
            "definition": "to throw something away; to dispose of something. Would you please just chuck this garbage bag away? _ I don’t want to chuck away any paper that’s been used on only one side."
        },
        {
            "id": 131,
            "phrase": "chuck something down†",
            "definition": "Sl. to eat something very quickly.  Don’t just chuck your food down. Enjoy it! _ I’ll be with you as soon as I chuck down this hamburger."
        },
        {
            "id": 132,
            "phrase": "chuck something over something",
            "definition": "to throw something over something.  Here, chuck this over the wall, and let’s go. If you chuck another can over the fence, I will file a complaint."
        },
        {
            "id": 133,
            "phrase": "chuck something up†",
            "definition": "to vomit something up.  Don’t give chocolate to the dog. It will just chuck it up later. The dog chucked up the grass it had eaten."
        },
        {
            "id": 134,
            "phrase": "chug along",
            "definition": "[for a train engine] to labor along slowly. (Steam locomotives made the sound “chug, chug.”) _ The train chugged along to the top of the hill."
        },
        {
            "id": 135,
            "phrase": "chum up to someone",
            "definition": "to try or seem to become friendly with someone.  Todd chummed up to Martin.  I don’t want to have to chum up to anyone I don’t want to work with."
        },
        {
            "id": 136,
            "phrase": "chum up with someone",
            "definition": "to become friendly with someone.  He seems to have chummed up with Fred.  Juan quickly chummed up with all the guys in his class."
        },
        {
            "id": 137,
            "phrase": "a chunk of change",
            "definition": "a lot of money. Tom’s new sports car cost a real big chunk of change!"
        },
        {
            "id": 138,
            "phrase": "chunk something",
            "definition": "Rur. to throw something. The kids were out chunking rocks into the lake.  Somebody chunked a snowball at me!"
        },
        {
            "id": 139,
            "phrase": "Church ain’t out till they quit singing.",
            "definition": "Rur. things have not yet reached the end. Charlie: No way our team can win now. Mary: Church ain’t out till they quit singing. There’s another inning to go."
        },
        {
            "id": 140,
            "phrase": "church key",
            "definition": "a two-ended device used to remove bottle tops and to pierce a hole in can lids. I’m looking for the church key so I can open this beer.  She opened the can of tomato juice with the church key."
        },
        {
            "id": 141,
            "phrase": "churn something out†",
            "definition": "to produce something in large numbers, perhaps carelessly. We churn toys out by the thousand.  This factory can churn out these parts day and night."
        },
        {
            "id": 142,
            "phrase": "churn something up†",
            "definition": "to stir up a liquid; to mix up material suspended in water.  The oars of our boat churned the shallow water up, leaving little clouds of sediment in our wake.  The oars churned up the mud."
        },
        {
            "id": 143,
            "phrase": "circle around (over someone or something)",
            "definition": "[for a plane or a bird] to fly around above someone, something, or some place.  The plane circled around over us for a few minutes and then went on. It circled around over the field."
        },
        {
            "id": 144,
            "phrase": "circulate among someone or something",
            "definition": "to move at random within a gathering of people or things.  Karen circulated among the guests, serving drinks.  The guests circulated among the various rooms in the house."
        },
        {
            "id": 145,
            "phrase": "circulate something through something",
            "definition": "to route something through something; to make something travel through something.  Walter circulated the memo from the boss through the department.  I would like for you to circulate this through the members of the club."
        },
        {
            "id": 146,
            "phrase": "circulate through something",
            "definition": "[for a fluid in a closed system of pipes or tubes] to flow through the various pathways of pipes and tubes.  Cold water circulates through the entire building and keeps it cool.  Blood circulates through the veins and arteries, reaching all parts of the body."
        },
        {
            "id": 147,
            "phrase": "Circumstances alter cases.",
            "definition": "Prov. In unusual situations, people are allowed to do unusual things.  Cashier: I’m sorry, this store does not accept personal checks. Customer: But I need this medicine, and I don’t have any cash. I’ve shopped at this store for fifteen years. Surely you can trust me this once. Cashier: Well, all right. Circumstances alter cases."
        },
        {
            "id": 148,
            "phrase": "cite someone for something",
            "definition": "1. to honor someone for doing something; to give someone a citation of honor for doing something good. The town council cited her for bravery. They cited Maria for her courageous act. 2. to charge or arraign someone for breaking a law; to issue a legal citation to someone for breaking a law.  An officer cited the driver for driving too fast. The housing department cited the landlord for sanitary violations."
        },
        {
            "id": 149,
            "phrase": "city slicker",
            "definition": "someone from the city who is not familiar with country ways. Them city slickers think we’re stupid just because we talk different. The city slicker didn’t know the first thing about fishing for trout."
        },
        {
            "id": 150,
            "phrase": "claim a life",
            "definition": "[for something] to take the life of someone.  The killer tornado claimed the lives of six people at the trailer park.  The athlete’s life was claimed in a skiing accident."
        },
        {
            "id": 151,
            "phrase": "claim something for someone or something",
            "definition": "to declare rights to or control of something for someone, or that something is the property of someone, a group, or a nation.  The small country claimed the mountainous area for itself.  Roger claimed all the rest of the ice cream for himself."
        },
        {
            "id": 152,
            "phrase": "claim something for something",
            "definition": "to make a claim for money in payment for damages.  David claimed one thousand dollars for the damaged car.  She claimed a lot of money for the amount of harm she experienced."
        },
        {
            "id": 153,
            "phrase": "clam up",
            "definition": "to say nothing. (Closing one’s mouth in the way that a clam closes up.) _ The minute they got him in for questioning, he clammed up.  You’ll clam up if you know what’s good for you."
        },
        {
            "id": 154,
            "phrase": "clamber up (something)",
            "definition": "to climb up something, especially in a particular way.  The wall climbers clambered up the wall quickly.  Tricia clambered up the ladder and cautiously went down again."
        },
        {
            "id": 155,
            "phrase": "clamor against someone or something",
            "definition": "to raise a great outcry against someone or something. The protestors clamored against the mayor. The citizens clamored against the new taxes."
        },
        {
            "id": 156,
            "phrase": "clamor for someone or something",
            "definition": "to raise a great outcry for someone or something.  Everyone was clamoring for Mark. They just loved him. The children were clamoring for ice cream."
        },
        {
            "id": 157,
            "phrase": "clamp down (on someone or something)",
            "definition": "to become strict with someone; to become strict about something.  Because Bob’s grades were getting worse, his parents clamped down on him.  The police have clamped down on speeders in this town."
        },
        {
            "id": 158,
            "phrase": "clap eyes on someone or something",
            "definition": "to see someone or something, perhaps for the first time; to set eyes on someone or something.  I wish she had never clapped eyes on her fiancé.  I haven’t clapped eyes on a red squirrel for years."
        },
        {
            "id": 159,
            "phrase": "clap someone in(to) some place",
            "definition": "to shove or push someone into a place, usually jail.  Be good or the sheriff will clap you into jail.  The cops clapped Max into a cell."
        },
        {
            "id": 160,
            "phrase": "clap something on(to) something",
            "definition": "to slap or attack something onto something else. The police came and clapped a sign onto the car saying it was abandoned.  Do not clap any signs on my fence."
        },
        {
            "id": 161,
            "phrase": "clap something out†",
            "definition": "to clap the rhythmic beat of something in order to learn it. (Said of music.) _All right, now. Let’s clap the rhythm out.  We’ll clap out the rhythm in time with our singing."
        },
        {
            "id": 162,
            "phrase": "clap something together",
            "definition": "to slap two things, usually hands, together so that they make a noise.  The boys clapped their hands together whenever a goal was scored.  One of the orchestra members clapped two blocks of wood together periodically, making a very loud noise."
        },
        {
            "id": 163,
            "phrase": "clash against something",
            "definition": "to wage a battle or attack against someone or something.  The troops clashed against the enemy. We clashed against the opposite side for over three days."
        },
        {
            "id": 164,
            "phrase": "clash (with someone) (over someone or something)",
            "definition": "to fight or argue with someone about someone or something.  The customer clashed with the pharmacist over the price of the medicine.  I clashed over my pay increase with the school principal."
        },
        {
            "id": 165,
            "phrase": "clash with something",
            "definition": "[for the color of something] to conflict with or mismatch another color.  This red carpet clashes with the purple of the drapes.  This red does not clash with purple. It looks gorgeous."
        },
        {
            "id": 166,
            "phrase": "clasp someone or something to something",
            "definition": "to hold on to and press someone or something to a part of one’s body.  He clasped a wad of cloth to the bleeding wound.  She clasped the child to her breast and hugged him."
        },
        {
            "id": 167,
            "phrase": "class someone or something with someone or something",
            "definition": "to group someone or something with someone or something considered similar.  Please don’t class this car with anything you’ve ever driven before. The sportswriters classed this team with some of the all-time best in history."
        },
        {
            "id": 168,
            "phrase": "claw one’s way to the top",
            "definition": "to climb to the most prestigious level of something ruthlessly. He was the type of hard-hitting guy who claws his way to the top. She clawed her way to the top, fighting at every step."
        },
        {
            "id": 169,
            "phrase": "*a clean bill of health",
            "definition": "a physician’s determination that a person is in good condition, especially following an illness, surgery, etc. (*Typically: get ~; have ~; give someone ~.) _ Sally got a clean bill of health from the doctor.  Now that Sally has a clean bill of health, she can go back to work."
        },
        {
            "id": 170,
            "phrase": "clean one’s act up†",
            "definition": "to reform one’s conduct; to improve one’s performance.  We were told to clean our act up or move out.  I cleaned up my act, but not in time. I got kicked out."
        },
        {
            "id": 171,
            "phrase": "clean someone or something down†",
            "definition": "to clean someone or something by brushing or with flowing water.  He was covered with mud, and we used the garden hose to clean him down.  Please clean down the sidewalk."
        },
        {
            "id": 172,
            "phrase": "clean someone or something up†",
            "definition": "to get someone or something clean. Please go into the bathroom and clean yourself up.  I’ll clean up the kids before we leave for dinner.  Can you clean this place up a little?"
        },
        {
            "id": 173,
            "phrase": "clean someone out†",
            "definition": "1. Fig. to get or use up all of someone’s money.  The bill for supper cleaned me out, and we couldn’t go to the f lick.  The robbers cleaned out all the bank’s cash. 2. Fig. to empty someone’s bowels.  That medicine I took really cleaned me out.  Whatever was in that stew cleaned out every kid in the entire scout camp."
        },
        {
            "id": 174,
            "phrase": "clean someone’s plow",
            "definition": "Rur. to beat someone up.  If Joe crosses me one more time, I’ll clean his plow for sure.  Somebody must have really cleaned Bill’s plow last night. He had two black eyes this morning!"
        },
        {
            "id": 175,
            "phrase": "clean something out†",
            "definition": "to remove dirt or unwanted things from the inside of something. Someone has to clean the garage out.  I’ll clean out my closet tonight."
        },
        {
            "id": 176,
            "phrase": "a clean sweep",
            "definition": "a broad movement clearing or affecting everything in its pathway.  The manager and everybody in accounting got fired in a clean sweep of that department.  Everybody got a pay rise. It was a clean sweep."
        },
        {
            "id": 177,
            "phrase": "clean the floor up† with someone",
            "definition": "to beat someone up.  If you don’t shut up, I’ll clean up the f loor with you.  You won’t clean the f loor up with me!"
        },
        {
            "id": 178,
            "phrase": "clean up (on something)",
            "definition": "to make a lot of money on something.  The promoters cleaned up on the product.  If we get this invention to market soon, we can clean up."
        },
        {
            "id": 179,
            "phrase": "clean (up) one’s plate",
            "definition": "to eat all the food on one’s plate.  You have to clean up your plate before you can leave the table.  Mom said we can’t watch TV tonight unless we clean our plates."
        },
        {
            "id": 180,
            "phrase": "clean-cut",
            "definition": "having to do with a person (usually male) who is neat and tidy. He’s a very clean-cut guy, and polite too.  He’s sort of clean-cut looking, but with curly hair."
        },
        {
            "id": 181,
            "phrase": "cleaned out",
            "definition": "1. Fig. broke; with no money.  I’m cleaned out. Not a cent left.  Tom’s cleaned out. How will he pay his bills now? 2. Fig. with one’s digestive tract emptied.  That medicine really left me cleaned out."
        },
        {
            "id": 182,
            "phrase": "Cleanliness is next to godliness.",
            "definition": "Prov. It is very important to keep yourself clean.  Child: How come I have to take a bath? Mother: Cleanliness is next to godliness.  The woman sitting next to me on the bus had obviously never heard that cleanliness is next to godliness."
        },
        {
            "id": 183,
            "phrase": "*clear as a bell",
            "definition": "very clear, as with the sound of a bell. (*Also: as ~.) _ I fixed the radio, so now all the stations come in clear as a bell.  Through the wall, I could hear the neighbors talking, just as clear as a bell."
        },
        {
            "id": 184,
            "phrase": "*clear as crystal",
            "definition": "1. Cliché very clear; transparent. (*Also: as ~.) _The stream was as clear as crystal. She cleaned the windowpane until it was clear as crystal. 2. Cliché very clear; easy to understand. (*Also: as ~.) _The explanation was as clear as crystal.  Her lecture was not clear as crystal, but at least it was not dull."
        },
        {
            "id": 185,
            "phrase": "*clear as mud",
            "definition": "1. Cliché not clear at all. (*Also: as ~.) _ Your swimming pool needs cleaning; the water is clear as mud. 2. Cliché not easy to understand. (*Also: as ~.) _ This physics chapter is clear as mud to me.  I did all the reading, but it’s still as clear as mud."
        },
        {
            "id": 186,
            "phrase": "*clear of something",
            "definition": "without touching something; away from something. (*Typically: keep ~; move ~; remain ~; stand ~.) _ Please stand clear of the doors while the train is moving. Make sure the dog moves clear of the driveway before backing the car up."
        },
        {
            "id": 187,
            "phrase": "clear out (of some place)",
            "definition": "to get out of some place.  Will you all clear out of here? _ Please clear out!"
        },
        {
            "id": 188,
            "phrase": "clear someone of something",
            "definition": "to show that a person is innocent; to exonerate someone of a crime.  An investigation cleared me of any wrongdoing.  They were unable to clear themselves of the charges."
        },
        {
            "id": 189,
            "phrase": "clear someone’s name",
            "definition": "to prove that someone is not guilty of a crime or misdeed.  I was accused of theft, but the real thief confessed and I cleared my name."
        },
        {
            "id": 190,
            "phrase": "clear something away†",
            "definition": "to take something away.  Please clear the children’s toys away.  Would you clear away the dishes?"
        },
        {
            "id": 191,
            "phrase": "clear something for publication",
            "definition": "to approve the release of something so it can be published.  The government refused to clear the story for publication.  I want to clear this for publication as soon as possible."
        },
        {
            "id": 192,
            "phrase": "clear something from some place",
            "definition": "to take something away from a place.  Please clear all these papers from the desk.  Would you clear the dishes from the table?"
        },
        {
            "id": 193,
            "phrase": "clear something up†",
            "definition": "1. to make something more clear.  Let the muddy water stand overnight so it will clear up.  A strong wind blew in and cleared up the smoke in the air. 2. to explain something; to solve a mystery. I think that we can clear this matter up without calling in the police.  First we have to clear up the problem of the missing jewels. 3. to cause a rash or inflammation to return to normal; to cause skin to “clear.” _There is some new medicine that will clear your rash up. 4. to cure a disease or a medical condition. The doctor will give you something to clear up your congestion."
        },
        {
            "id": 194,
            "phrase": "clear something with someone or something",
            "definition": "to get someone’s approval for something.  You will have to clear this expenditure with the main office.  I will clear your trip with Dad."
        },
        {
            "id": 195,
            "phrase": "clear the air",
            "definition": "to get rid of stale or bad air.  Open some windows and clear the air. It’s stuffy in here."
        },
        {
            "id": 196,
            "phrase": "clear the decks",
            "definition": "[for everyone] leave the deck of a ship and prepare for action. (A naval expression urging seaman to stow gear and prepare for battle or other action.) _ An attack is coming. Clear the decks."
        },
        {
            "id": 197,
            "phrase": "clear the table",
            "definition": "to remove the dishes and other eating utensils from the table after a meal. (Compare this with set the table.) _ Will you please help clear the table? _ After you clear the table, we’ll play cards."
        },
        {
            "id": 198,
            "phrase": "Clear the way!",
            "definition": "Please get out of the way, because someone or something is coming through and needs room! _ The movers were shouting, “Clear the way!” because they needed room to take the piano out of the house."
        },
        {
            "id": 199,
            "phrase": "clear up",
            "definition": "1. [for the sky] to become more clear or sunny. Suddenly, the sky cleared up. When the sky cleared up, the breeze began to blow. 2. [for something] to become more understandable.  At about the middle of the very confusing lecture, things began to clear up.  I was having trouble, but things are beginning to clear up. 3. [for a rash or skin condition] to clear the skin and return to normal. I’m sure your rash will clear up soon. 4. [for a minor illness] to improve or become cured.  His cold cleared up after a couple of weeks."
        },
        {
            "id": 200,
            "phrase": "cleave to someone",
            "definition": "to be sexually faithful, usually to one’s husband. (Biblical. As in the traditional marriage ceremony, “And cleave only unto him.”) _ She promised to cleave only to him for the rest of her life."
        },
        {
            "id": 201,
            "phrase": "click with someone",
            "definition": "1. [for something] to be understood or comprehended by someone suddenly.  His explanation clicked with Maggie at once. 2. [for someone or something new] to catch on with someone; to become popular or friendly with someone very quickly.  The new product clicked with consumers and was an instant success.  I clicked with Tom the moment I met him."
        },
        {
            "id": 202,
            "phrase": "climb down (from something)",
            "definition": "to dismount something; to come down from something. The child climbed down from the roof.  Please climb down!"
        },
        {
            "id": 203,
            "phrase": "climb out (of something)",
            "definition": "to get, crawl, or move out of something.  He climbed out of the wreckage and examined himself carefully for injuries.  He climbed out very carefully."
        },
        {
            "id": 204,
            "phrase": "climb the wall(s)",
            "definition": "to be very agitated, anxious, bored, or excited.  He was home for only three days; then he began to climb the wall.  I was climbing the walls to get back to work."
        },
        {
            "id": 205,
            "phrase": "climb up (something)",
            "definition": "to ascend something; to scale something. (Fixed order.) _ The hikers took two hours to climb up the hill.  The adventurer tried to climb up the side of the cliff."
        },
        {
            "id": 206,
            "phrase": "cling to someone or something",
            "definition": "to hold on tight to someone or something.  The child clung tightly to his mother.  As she drifted in the sea, she clung to a f loating log."
        },
        {
            "id": 207,
            "phrase": "cling together",
            "definition": "[for two or more people or animals] to hold on tightly to each other.  The two children clung together throughout the ordeal. The baby baboon and its mother clung together and could not be separated."
        },
        {
            "id": 208,
            "phrase": "clip someone’s wings",
            "definition": "to restrain someone; to reduce or put an end to someone’s privileges. (Alludes to clipping a bird’s wings to keep it from flying away.) _You had better learn to get home on time, or I will clip your wings.  My mother clipped my wings. I can’t go out tonight."
        },
        {
            "id": 209,
            "phrase": "clip something from something",
            "definition": "to cut something out of or away from something; to cut something off something.  I clipped the picture from the magazine.  I clipped the straggly hairs from his head."
        },
        {
            "id": 210,
            "phrase": "cloak someone or something in secrecy",
            "definition": "to hide or conceal someone or something in secrecy.  Patrick cloaked his activities in secrecy.  The agents cloaked the spy in secrecy, making her identity a mystery."
        },
        {
            "id": 211,
            "phrase": "cloak-and-dagger",
            "definition": "involving secrecy and plotting.  A great deal of cloak-and-dagger stuff goes on in political circles.  A lot of cloak-and-dagger activity was involved in the appointment of the director."
        },
        {
            "id": 212,
            "phrase": "clock in",
            "definition": "to record one’s time of arrival, usually by punching a time clock.  What time did she clock in? _ She forgot to clock in today."
        },
        {
            "id": 213,
            "phrase": "clock out",
            "definition": "to record one’s time of departure, usually by punching a time clock.  I will clock out just before I go home.  Jim clocked out early Tuesday to go to the doctor."
        },
        {
            "id": 214,
            "phrase": "clock someone in",
            "definition": "to observe and record someone’s time of arrival.  The manager says he clocked you in at noon. That’s a bit late, isn’t it?"
        },
        {
            "id": 215,
            "phrase": "clock someone or something at something",
            "definition": "to measure the speed of someone or something to be a certain figure.  I clocked the runner at a record speed for the race.  Karen clocked the race at three minutes f lat."
        },
        {
            "id": 216,
            "phrase": "clock someone out",
            "definition": "to observe and record someone’s time of departure.  Jane clocked herself out and went home."
        },
        {
            "id": 217,
            "phrase": "clock something up†",
            "definition": "1. to record the accumulated hours, miles, etc., of some device or machine. (The recording is usually done by a meter of some type such as a speedometer, an elapsed time meter, etc.  She must have clocked two hundred f lying hours up in six months.  She clocked up a lot of hours. 2. to reach a goal that is worthy of being recorded. (Typically sports journalism. Compare this with chalk something up.) _ Patrick clocked a fantastic number of points up this year.  He sure clocked up a lot of goals."
        },
        {
            "id": 218,
            "phrase": "clock-watcher",
            "definition": "someone—a worker or a student—who is always looking at the clock, anticipating when something will be over.  There are four clock-watchers in our office.  People who don’t like their jobs can turn into clockwatchers."
        },
        {
            "id": 219,
            "phrase": "clog someone up†",
            "definition": "[for some kind of food] to constipate someone.  This cheese clogs me up. I can’t eat it.  This food clogs up people who eat it."
        },
        {
            "id": 220,
            "phrase": "clog something up†",
            "definition": "[for something] to obstruct a channel or conduit.  The leaves clogged the gutters up.  They clogged up the gutter."
        },
        {
            "id": 221,
            "phrase": "clog something with something",
            "definition": "to block or obstruct a channel or conduit with something.  The neighbors clogged the creek with their brush and leaves.  Please don’t clog the drain with garbage."
        },
        {
            "id": 222,
            "phrase": "clog up",
            "definition": "[for a channel or conduit] to become blocked.  The canal clogged up with leaves and mud."
        },
        {
            "id": 223,
            "phrase": "*close as two coats of paint",
            "definition": "Cliché close and intimate. (*Also: as ~.) _ When Tom and Mary were in high school, they were as close as two coats of paint.  All their lives, the cousins were close as two coats of paint."
        },
        {
            "id": 224,
            "phrase": "close at hand",
            "definition": "within reach; handy.  I’m sorry, but your letter isn’t close at hand. Please remind me what you said in it. When you’re cooking, you should keep all the ingredients close at hand."
        },
        {
            "id": 225,
            "phrase": "Close, but no cigar.",
            "definition": "Cliché Some effort came close to succeeding, but did not succeed. (Alludes to not quite winning a cigar as a prize.) _ Jill: How did you do in the contest? Jane: Close, but no cigar. I got second place."
        },
        {
            "id": 226,
            "phrase": "close chewer and a tight spitter",
            "definition": "Rur. someone who hates to spend money; a cheapskate. He’s a close chewer and a tight spitter. Everything about him looks run-down, but he’s probably the richest man in the county."
        },
        {
            "id": 227,
            "phrase": "close enough to use the same toothpick",
            "definition": "Rur. very close. (Used to describe close friends.) _ We’ve been friends since we were five years old. We’re close enough to use the same toothpick."
        },
        {
            "id": 228,
            "phrase": "close (in) around someone or something",
            "definition": "to move to surround someone or something.  The police closed in around the thieves. We closed in around the enemy camp."
        },
        {
            "id": 229,
            "phrase": "close in (on someone or something)",
            "definition": "to move inward on someone or something.  The cops were closing in on the thugs.  They closed in quietly and trapped the bear."
        },
        {
            "id": 230,
            "phrase": "close on something",
            "definition": "to formally complete the sale and transfer of property, especially real estate.  We closed on the new house on April 16.  We were able to close on our old house on June 2."
        },
        {
            "id": 231,
            "phrase": "Close only counts in horseshoes (and hand grenades).",
            "definition": "Prov. Coming close but not succeeding is not good enough.  I came close to winning the election, but close only counts in horseshoes and hand grenades."
        },
        {
            "id": 232,
            "phrase": "close ranks",
            "definition": "to move closer together in a military formation. The soldiers closed ranks and marched on the enemy in tight formation."
        },
        {
            "id": 233,
            "phrase": "close ranks (behind someone or something)",
            "definition": "to support someone or something; to back someone or something.  We will close ranks behind the party’s nominee. Let’s close ranks behind her and give her the support she needs."
        },
        {
            "id": 234,
            "phrase": "close ranks (with someone)",
            "definition": "to join with someone in a cause, or agreement. We can fight this menace only if we close ranks.  Let’s all close ranks with Ann and adopt her suggestions."
        },
        {
            "id": 235,
            "phrase": "close someone or something down†",
            "definition": "to force someone or someone’s business, office, shop, etc., to close permanently or temporarily. The health department closed the restaurant down.  They closed down the same place last year, too."
        },
        {
            "id": 236,
            "phrase": "close someone or something in (something)",
            "definition": "to contain someone or something in something or some place; to seal someone or something inside something. Don’t close the bird in such a small cage.  Don’t close me in! Leave the door open."
        },
        {
            "id": 237,
            "phrase": "close someone up†",
            "definition": "to close a surgical wound at the end of a surgical procedure.  Fred, would you close her up for me? _ Fred closed up the patient."
        },
        {
            "id": 238,
            "phrase": "close something off†",
            "definition": "to prevent entrance into something; to block something off. Please don’t close this passageway off.  They closed off the passageway anyway."
        },
        {
            "id": 239,
            "phrase": "close something out†",
            "definition": "1. to sell off a particular kind of merchandise with the intention of not selling it in the future.  These are not selling. Let’s close them out.  They closed out all of last season’s merchandise. 2. to prevent further registration in something. We are going to have to close this class out.  The registrar closed out the class."
        },
        {
            "id": 240,
            "phrase": "close something to someone",
            "definition": "to prevent someone or some type of person from participating in or attending something.  We closed membership to anyone who signed up late.  They had to close the registration to nonresidents."
        },
        {
            "id": 241,
            "phrase": "close something up†",
            "definition": "1. to close someone’s business, office, shop, etc., temporarily or permanently.  Tom’s restaurant nearly went out of business when the health department closed him up. The health department closed up the restaurant. 2. to close something that is open, such as a door or a box.  Please close the door when you leave."
        },
        {
            "id": 242,
            "phrase": "close the books on someone or something",
            "definition": "to declare that a matter concerning someone or something is finished. (The books here originally referred to financial accounting records.) _It’s time to close the books on Fred. He’s had enough time to apologize to us."
        },
        {
            "id": 243,
            "phrase": "close to home",
            "definition": "affecting one personally and intimately.  Her remarks were a bit too close to home. I took her review as a personal insult."
        },
        {
            "id": 244,
            "phrase": "*close to someone",
            "definition": "friendly or intimate with someone. (*Typically: be ~; get ~.) _ She is very shy and really won’t let anyone get close to her.  It is difficult to get close to a loner like Wally."
        },
        {
            "id": 245,
            "phrase": "*close to someone or something",
            "definition": "1. near someone or something. (*Typically: get ~; stand ~; sit ~; move ~.) _ Don’t get close to me. I have a cold.  If you get close to the fire, you may get burned. 2. approximating someone or something in some quality or measure. (*Typically: be ~; get ~.) _ This brand of frozen fish does not even get close to that brand in f lavor and freshness.  Tom doesn’t even get close to Nancy when it comes to artistic ability."
        },
        {
            "id": 246,
            "phrase": "close up",
            "definition": "[for an opening] to close completely.  The door closed up and would not open again. The wound will close up completely in a day or so."
        },
        {
            "id": 247,
            "phrase": "close up shop",
            "definition": "to quit working, for the day or forever. (Fixed order.) _ It’s five o’clock. Time to close up shop.  I can’t make any money in this town. The time has come to close up shop and move to another town."
        },
        {
            "id": 248,
            "phrase": "close with someone or something",
            "definition": "to end a performance with a particular act or event.  The show is almost over and we will close with Sarah Miles, who will announce her own song title.  The evening closed with a magic act."
        },
        {
            "id": 249,
            "phrase": "closet someone with someone",
            "definition": "to put someone into a private room with someone else for the purposes of conducting business.  She closeted herself with the president and finally, once and for all, had her say."
        }
    ]
}