{
    "dictionary": [
        {
            "id": 0,
            "phrase": "under the counter",
            "definition": "[bought or sold] in secret or illegally. (Compare this to over the counter.) _ The drugstore owner was arrested for selling liquor under the counter.  The clerk sold dirty books under the counter."
        },
        {
            "id": 1,
            "phrase": "under the influence (of alcohol)",
            "definition": "Euph. drunk; nearly drunk; affected by alcohol.  She behaves quite rudely when under the inf luence of alcohol.  Ed was stopped by a police officer for driving while under the inf luence."
        },
        {
            "id": 2,
            "phrase": "under the sun",
            "definition": "anywhere on earth at all.  This is the largest cattle ranch under the sun.  Isn’t there anyone under the sun who can help me with this problem?"
        },
        {
            "id": 3,
            "phrase": "under the table",
            "definition": "1. Sl. intoxicated.  Jed was under the table by midnight. By 3:00 in the morning, everyone was under the table. 2. Fig. secret; clandestine. (This is hyphenated before a nominal.) _It was strictly an under-the-table deal.  The mayor made a few bucks under the table, too."
        },
        {
            "id": 4,
            "phrase": "under the weather",
            "definition": "1. ill.  I feel sort of under the weather today. Whatever I ate for lunch is making me feel a bit under the weather. 2. intoxicated.  Daddy’s had a few beers and is under the weather again.  Wally’s just a tad under the weather."
        },
        {
            "id": 5,
            "phrase": "under the wire",
            "definition": "just barely in time or on time.  I turned in my report just under the wire.  Bill was the last person to get in the door. He got in under the wire."
        },
        {
            "id": 6,
            "phrase": "*under way",
            "definition": "moving; running; started. (*Typically: be ~; get something ~; have something ~.) _The time has come to get this game under way.  Now that the president has the meeting under way, I can relax."
        },
        {
            "id": 7,
            "phrase": "*under wraps",
            "definition": "concealed; suppressed. (*Typically: be ~; have ~; hold ~; keep ~.) _ We kept the candidate’s conviction under wraps until after the election. The plan we had under wraps had to be scrapped anyway."
        },
        {
            "id": 8,
            "phrase": "undertake to do something",
            "definition": "to try to do something; to take the responsibility of doing something.  The carpenter undertook to repair the door frame.  I will undertake to fix it."
        },
        {
            "id": 9,
            "phrase": "Uneasy lies the head that wears a crown.",
            "definition": "Prov. A person who has a lot of power and prestige also has a lot of responsibilities, and therefore worries more than other people. (From Shakespeare’s play, Henry IV, Part II.) _ Susan began to have trouble sleeping shortly after she was promoted to head of her department. “Uneasy lies the head that wears a crown,” her friends teased."
        },
        {
            "id": 10,
            "phrase": "The unexpected always happens.",
            "definition": "Prov. The things you do not foresee will happen to you; when you plan, you cannot think of everything that might happen.  It took us an hour to drive to the restaurant, and when we got there, it was closed. I would never have expected a restaurant to be closed on a Friday night, but the unexpected always happens. Especially to me."
        },
        {
            "id": 11,
            "phrase": "unfamiliar territory",
            "definition": "an area of knowledge unknown to the speaker.  We are in unfamiliar territory and I don’t know the answer.  Astronomy is unfamiliar territory for me, and I cannot answer any questions about the stars."
        },
        {
            "id": 12,
            "phrase": "unfold into something",
            "definition": "1. [for something folded up] to unfold into something.  The greeting card unfolded into a little paper house.  It unfolded into a cute scene. 2. Fig. [for a story] to develop into something interesting. (Fig. on Q.) _ The story unfolded into a real mystery.  The tale unfolded into a farce."
        },
        {
            "id": 13,
            "phrase": "unfold something into something",
            "definition": "to spread something out into something. The child unfolded the page into a model village. I unfolded the brochure into a large colorful sheet of advertising."
        },
        {
            "id": 14,
            "phrase": "unify someone or something into something",
            "definition": "to combine people or things into a united whole.  The mayor unified his party into a powerful force.  I unified the committee into a strong body."
        },
        {
            "id": 15,
            "phrase": "Union is strength.",
            "definition": "Prov. If people join together, they are more powerful than if they work by themselves.  The students decided to join together in order to present their grievances to the faculty, since union is strength. We cannot allow our opponents to divide us. Union is strength."
        },
        {
            "id": 16,
            "phrase": "unite against someone or something",
            "definition": "to join against someone or something.  We will unite against the opposing forces.  We must unite against the incumbent legislators."
        },
        {
            "id": 17,
            "phrase": "unite for something",
            "definition": "to join together for some purpose.  All the forces united for the attack.  We will unite for a great party."
        },
        {
            "id": 18,
            "phrase": "unite in something",
            "definition": "to come together in something.  Let us unite in our efforts.  We will unite in song."
        },
        {
            "id": 19,
            "phrase": "unite someone against someone or something",
            "definition": "to cause people to join together against someone or something. The mayor united his staff against the federal investigators.  Ted united us against John.  They united themselves against the enemy."
        },
        {
            "id": 20,
            "phrase": "unite someone in something",
            "definition": "to join two or more people in something, usually marriage.  The preacher united the couple in matrimony.  A judge united them in marriage."
        },
        {
            "id": 21,
            "phrase": "unite someone or something into something",
            "definition": "to form something by merging people together; to form something by merging things together.  Let us unite the party into a powerful political force.  We will unite ourselves into a powerful force."
        },
        {
            "id": 22,
            "phrase": "unite someone or something (together†)",
            "definition": "to join people or groups of people together.  They united all the workers together for the strike. The event united together the people who cared about the quality of life."
        },
        {
            "id": 23,
            "phrase": "unite someone or something with someone or something",
            "definition": "to join people or things, in any combination.  We united Tom with his brother Arnold during the evening.  We united our committee with the president in an effort to expand our inf luence."
        },
        {
            "id": 24,
            "phrase": "unite with someone",
            "definition": "to join with someone; to go or come together with someone.  I was pleased to unite with my family for the holidays.  The brothers united with their sister after many years of separation."
        },
        {
            "id": 25,
            "phrase": "United we stand, divided we fall.",
            "definition": "Prov. People who join together as a group are much harder to defeat than they would be separately.  The tenants of this building must band together if we are to make the landlord agree to our demands. United we stand, divided we fall! _ We had better all agree on what we are going to say to the boss before we go in there and say it. United we stand, divided we fall."
        },
        {
            "id": 26,
            "phrase": "*an unknown quantity",
            "definition": "a person or thing about which no one is certain. (*Typically: be ~; become ~.) _ John is an unknown quantity. We don’t know how he’s going to act.  The new clerk is an unknown quantity. Things may not turn out all right."
        },
        {
            "id": 27,
            "phrase": "unleash someone or something against someone or something",
            "definition": "to turn someone or something loose against someone or something. The army unleashed a horrible attack against the enemy. Max unleashed his bullies against the helpless merchants."
        },
        {
            "id": 28,
            "phrase": "unleash someone or something (up)on someone or something",
            "definition": "to turn someone or something loose on someone or something. (Upon is formal and less commonly used than on.) _ The air force unleashed a bombing attack upon the enemy. The mob chief unleashed his tough guys on Lefty."
        },
        {
            "id": 29,
            "phrase": "unload someone or something on(to) someone",
            "definition": "to get rid of a burdensome person or thing on someone else.  I unloaded my obnoxious little cousin onto his aunt.  I didn’t mean to unload my problems onto you."
        },
        {
            "id": 30,
            "phrase": "unload something from something",
            "definition": "to take things off of something; to remove the burden from something.  Please unload the groceries from the car.  I unloaded the groceries from the bags."
        },
        {
            "id": 31,
            "phrase": "unsung hero",
            "definition": "a hero who has gotten no praise or recognition.  The time has come to recognize all the unsung heroes of the battle for low-cost housing."
        },
        {
            "id": 32,
            "phrase": "until all hours",
            "definition": "until very late. Mary is out until all hours, night after night.  If I’m up until all hours two nights in a row, I’m just exhausted."
        },
        {
            "id": 33,
            "phrase": "(un)til the cows come home",
            "definition": "Rur. until the last; until very late. (Referring to the end of the day, when the cows come home to be fed and milked.) _ We were having so much fun that we decided to stay at the party until the cows came home. Where’ve you been? Who said you could stay out till the cows come home?"
        },
        {
            "id": 34,
            "phrase": "*up a blind alley",
            "definition": "at a dead end; on a route that leads nowhere. (*Typically: be ~; go ~.) _ I have been trying to find out something about my ancestors, but I’m up a blind alley. I can’t find anything. The police are up a blind alley in their investigation of the crime."
        },
        {
            "id": 35,
            "phrase": "*up a storm",
            "definition": "[doing or making] a great amount with fury or intensity. (*Typically: cook ~; gab ~; sing ~; kick ~; talk ~.) _Whenever we get together, we always talk up a storm.  Everyone was gabbing up a storm and didn’t hear the chairman come in."
        },
        {
            "id": 36,
            "phrase": "up a tree",
            "definition": "1. confused; without an answer to a problem; in difficulty. This whole business has me up a tree. I’m up a tree, and I need some help. 2. intoxicated.  Only two glasses of booze and he was up a tree for sure.  My buddy here is up a tree and needs a place to crash for the night."
        },
        {
            "id": 37,
            "phrase": "*up against someone or something",
            "definition": "in opposition to someone or something, as in a contest. (*Typically: be ~; come ~; go ~; run ~; team ~.) _ Let’s team up against Paul and Tony in the footrace.  We came up against a very strong team."
        },
        {
            "id": 38,
            "phrase": "*up against something",
            "definition": "1. Fig. resting firmly against something. (*Typically: be ~; place something ~.) _The car is up against the back of the garage! Back out a little! 2. Fig. in conflict with something; facing something as a barrier. (Fig. on Q. *Typically: be ~; go ~.) _I am up against some serious problems."
        },
        {
            "id": 39,
            "phrase": "*up against the wall",
            "definition": "in serious difficulties. (*Typically: be ~; get ~; push someone ~.) _ Let’s face it, we’re up against the wall this time.  It’s when you’re up against the wall that your true character shows."
        },
        {
            "id": 40,
            "phrase": "up and at ’em",
            "definition": "up and taking action.  Dad woke me at seven, saying, “Up and at ’em!” _It’s six-thirty. Time for us to be up and at ’em."
        },
        {
            "id": 41,
            "phrase": "up and away",
            "definition": "[of a bird or an airplane] up into the air and into flight. After a few seconds of speeding down the runway, our f light to Tucson was up and away.  Just before the cat pounced on the sparrows, they were up and away and the cat was left with empty paws and jaws."
        },
        {
            "id": 42,
            "phrase": "up and running",
            "definition": "[of a machine] functioning.  As soon as we can get the tractor up and running, we will plant the corn crop."
        },
        {
            "id": 43,
            "phrase": "*up before someone",
            "definition": "standing in front of someone to receive something. (Especially in front of a judge. *Typically: be ~; come ~; stand ~.) _ Have you been up before me before? _ I have never been up before any judge."
        },
        {
            "id": 44,
            "phrase": "*up for auction",
            "definition": "to be sold at an auction. (*Typically: be ~; come ~; go ~; put something ~.) _ The old farm where I lived as a child is up for auction."
        },
        {
            "id": 45,
            "phrase": "up for grabs",
            "definition": "1. Fig. available for anyone; not yet claimed. The election is up for grabs. Everything is still very chancy. I don’t know who will get the promotion. It’s up for grabs. 2. Fig. in total chaos.  This is a madhouse. The whole place is up for grabs. When the market crashed, the whole office was up for grabs."
        },
        {
            "id": 46,
            "phrase": "*up for reelection",
            "definition": "to be running for reelection to an office or position. (*Typically: be ~; come ~.) _ The governor is up for reelection in the fall.  Lily is up for reelection this fall."
        },
        {
            "id": 47,
            "phrase": "*up for sale",
            "definition": "available for purchase. (*Typically: be ~; come ~; put something ~.) _ When this lot comes up for sale, let me know.  Is this property up for sale?"
        },
        {
            "id": 48,
            "phrase": "up front",
            "definition": "1. in the forefront; under fire (at the front).  You guys who are up front are gonna get the most fire.  You two go up front and see if you can help. 2. Fig. at the beginning; in advance. She wanted $200 up front. The more you pay up front, the less you’ll have to finance. 3. Fig. open; honest; forthcoming.  She is a very up front gal— trust her.  I wish the salesman had been more up front about it."
        },
        {
            "id": 49,
            "phrase": "*up in arms",
            "definition": "1. Fig. in armed rebellion. (*Typically: be ~; get ~.) _The entire population is up in arms. They are up in arms, ready to fight. 2. Fig. very angry. (Fig. on Q, but without weapons. *Typically: be ~; get ~.) _ Wally was up in arms about the bill for the broken window.  I am really up in arms about what happened."
        },
        {
            "id": 50,
            "phrase": "up in the air (about someone or something)",
            "definition": "undecided about someone or something; uncertain about someone or something.  I don’t know what Sally plans to do. Things were sort of up in the air the last time we talked.  Let’s leave this question up in the air until next week."
        },
        {
            "id": 51,
            "phrase": "up North",
            "definition": "to or at the northern part of the country or the world.  I don’t like living up North. I want to move down South where it’s warm. When you say “up North,” do you mean where the polar bears live or just in the northern states?"
        },
        {
            "id": 52,
            "phrase": "up one side and down the other",
            "definition": "Rur. thoroughly.  She scolded him up one side and down the other.  They shopped the whole downtown up one side and down the other."
        },
        {
            "id": 53,
            "phrase": "up stakes",
            "definition": "to prepare for leaving and then leave. (Up has the force of a verb here. The phrase suggests pulling up tent stakes in preparation for departure.) _ They just upped stakes and left without saying good-bye.  It’s that time of the year when I feel like upping stakes and moving to the country."
        },
        {
            "id": 54,
            "phrase": "up the pole",
            "definition": "intoxicated.  You sound a little up the pole. Why don’t you call back when you’re sober? _ She’s up the pole and shouldn’t drive."
        },
        {
            "id": 55,
            "phrase": "up the river",
            "definition": "Sl. in prison. (Underworld.) _ Gary was up the river for a couple of years, but that doesn’t make him an outcast, does it? _The judge who sent him up the river was indicted for accepting bribery. If Gary had only known sooner!"
        },
        {
            "id": 56,
            "phrase": "up the wall",
            "definition": "in a very bad situation; very upset or anxious.  He’s really up the wall about Mary’s illness.  We were all up the wall until the matter was resolved."
        },
        {
            "id": 57,
            "phrase": "*up to here (with something)",
            "definition": "having had as much as one can bear. (*Typically: be ~; get ~.) _ I’m up to here with your excuses! _ We are all up to here with this mystery."
        },
        {
            "id": 58,
            "phrase": "up to no good",
            "definition": "doing something bad.  I could tell from the look on Tom’s face that he was up to no good.  There are three boys in the front yard. I don’t know what they are doing, but I think they are up to no good."
        },
        {
            "id": 59,
            "phrase": "*up to one’s knees",
            "definition": "deep in something, such as paperwork or water. (The idea is that it is hard to move or make progress. *Typically: be ~; get ~.) _ We’re up to our knees with orders and getting more all the time.  The orders are up to our knees."
        },
        {
            "id": 60,
            "phrase": "up to par",
            "definition": "as good as the standard or average; up to standard.  I’m just not feeling up to par today. I must be coming down with something. The manager said that the report was not up to par and gave it back to Mary to do over again."
        },
        {
            "id": 61,
            "phrase": "*up to the minute",
            "definition": "current. (*Typically: be ~; bring something ~.) _This report is up to the minute and fresh from the wire services."
        },
        {
            "id": 62,
            "phrase": "up-and-coming",
            "definition": "enterprising and alert.  Jane is a hard worker—really up-and-coming.  Bob is also an upand- coming youngster who is going to become well known."
        },
        {
            "id": 63,
            "phrase": "upbraid someone for something",
            "definition": "to scold someone for doing something.  The judge upbraided David severely for his crime.  Walter upbraided his son for denting the car."
        },
        {
            "id": 64,
            "phrase": "upgrade someone or something to something",
            "definition": "to raise someone or something to a higher grade or rank.  Please upgrade me to first class. They upgraded the terrorist alert status to red."
        },
        {
            "id": 65,
            "phrase": "upgrade to something",
            "definition": "to move up to a higher grade or rank. I would like to upgrade to a first-class seat. Please upgrade me to a better room."
        },
        {
            "id": 66,
            "phrase": "upon impact",
            "definition": "at the place or time of an impact. The car crumpled upon impact with the brick wall.  The man who fell from the top of the building died on impact."
        },
        {
            "id": 67,
            "phrase": "upper crust",
            "definition": "the higher levels of society; the upper class. (From the top, as opposed to the bottom, crust of a pie.) _Jane speaks like that because she pretends to be from the upper crust, but her father was a miner. James is from the upper crust, but he is penniless."
        },
        {
            "id": 68,
            "phrase": "*the upper hand (on someone)",
            "definition": "a position superior to someone; the advantage of someone. (*Typically: get ~; have ~; give someone ~.) _ John is always trying to get the upper hand on someone. He never ends up having the upper hand, though."
        },
        {
            "id": 69,
            "phrase": "uproot someone from some place",
            "definition": "to cause someone to move from a well-established home or setting.  You should not uproot people from the land in which they were born.  I just couldn’t uproot myself from my home."
        },
        {
            "id": 70,
            "phrase": "uproot something from some place",
            "definition": "to take up a plant or tree, roots and all.  Wally uprooted the bush from the backyard and replanted it on the other side of the house.  Who uprooted a rosebush from my garden?"
        },
        {
            "id": 71,
            "phrase": "upset someone’s plans",
            "definition": "to ruin someone’s plans.  I hope it doesn’t upset your plans if I’m late for the meeting.  No, it won’t upset my plans at all."
        },
        {
            "id": 72,
            "phrase": "upset the apple cart",
            "definition": "to mess up or ruin something.  Tom really upset the apple cart by telling Mary the truth about Jane.  I always knew he’d tell secrets and upset the apple cart."
        },
        {
            "id": 73,
            "phrase": "the upshot of something",
            "definition": "the result or outcome of something.  The upshot of my criticism was a change in policy.  The upshot of the argument was an agreement to hire a new secretary."
        },
        {
            "id": 74,
            "phrase": "*upside-down",
            "definition": "in a financial state such that one owes more money on a car, truck, house, etc., than its resale value. (*Typically: be ~; get ~.) _When I tried to trade in the car, I found that I was upside-down and couldn’t close the deal without more money.  I took a loan period that was too long and was upside-down in two years."
        },
        {
            "id": 75,
            "phrase": "*up-to-date",
            "definition": "modern or contemporary. (*Typically: be ~; get ~.) _Is the room up-to-date, or is it standard? _ Your knowledge is not really up-to-date on this matter."
        },
        {
            "id": 76,
            "phrase": "up-to-date",
            "definition": "modern; up to the current standards of fashion; having the most current information. I’d like to see a more up-to-date report on Mr. Smith.  This is not an up-to-date record of the construction project."
        },
        {
            "id": 77,
            "phrase": "up-to-the-minute",
            "definition": "the very latest or most recent.  I want to hear some up-to-the-minute news on the hostage situation. I just got an up-to-the-minute report on Tom’s health."
        },
        {
            "id": 78,
            "phrase": "urban legend",
            "definition": "a myth or piece of folklore that is totally false.  That story about the rats in the sewer being as big as dogs is an urban legend. It’s just not so."
        },
        {
            "id": 79,
            "phrase": "urge someone along",
            "definition": "to encourage someone to continue or go faster.  We urged them along with much encouragement.  They won’t do well, but we urged them along anyway."
        },
        {
            "id": 80,
            "phrase": "urge someone forward",
            "definition": "to encourage someone to move forward.  The generals urged the troops forward.  Sally urged Timmy forward into the classroom."
        },
        {
            "id": 81,
            "phrase": "urge someone to do something",
            "definition": "to try to get someone to do something.  I urge you to give skiing a try.  Ken urged Lily to finish her dinner."
        },
        {
            "id": 82,
            "phrase": "urge something (up)on someone",
            "definition": "to try to get someone to take something. (Upon is formal and less commonly used than on.) _ Arnold urged the new policy on the employees.  He urged restraint upon them."
        },
        {
            "id": 83,
            "phrase": "use every trick in the book",
            "definition": "to use every method possible. I used every trick in the book, but I still couldn’t manage to get a ticket to the game Saturday. Bob tried to use every trick in the book, but he still failed."
        },
        {
            "id": 84,
            "phrase": "use foul language",
            "definition": "Euph. to swear.  There’s no need to use foul language.  When she gets angry, she tends to use foul language."
        },
        {
            "id": 85,
            "phrase": "use some elbow grease",
            "definition": "use some effort, as in scrubbing something. (As if lubricating one’s elbow would make one more efficient. Note the variations in the examples.) _ Come on, Bill. You can do it. Just use some elbow grease.  I tried elbow grease, but it doesn’t help get the job done."
        },
        {
            "id": 86,
            "phrase": "use someone or something as an excuse",
            "definition": "to blame someone or something (for a failure). John used his old car as an excuse for not going to the meeting. My husband was sick in bed, and I used him as an excuse."
        },
        {
            "id": 87,
            "phrase": "use someone or something as something",
            "definition": "to make someone or something function as something.  You have used me as your tool! _ I don’t like your using my car as your private taxi."
        },
        {
            "id": 88,
            "phrase": "use someone or something for something",
            "definition": "to make use of someone or something for a specific purpose.  Would you please use Don for your errands? _ You can use my car for the trip."
        },
        {
            "id": 89,
            "phrase": "use someone up",
            "definition": "to use all the effort or talent a person has.  His career simply used him up.  I used myself up. I’m done. I can’t function anymore."
        },
        {
            "id": 90,
            "phrase": "use something before something",
            "definition": "1. to consume or use something before using something else.  Use this jar before that one. This one is older. I used the old one before the one you just bought. 2. to consume or use something before a specified date.  I will use this bottle of catsup before May.  You should use this one before the date stamped on the bottom."
        },
        {
            "id": 91,
            "phrase": "use something by something",
            "definition": "to consume or complete the use of something by a specified time.  Please use this jar of mayonnaise by the last day of the month. Use this one by next week."
        },
        {
            "id": 92,
            "phrase": "use something over (again)",
            "definition": "to reuse something.  Do I have to use this stuff over again? _ Yes. Please use it over."
        },
        {
            "id": 93,
            "phrase": "use something up†",
            "definition": "to consume or use all of something.  Use the f lour up. I have more in the cupboard.  Use up every bit of it. Go ahead."
        },
        {
            "id": 94,
            "phrase": "use something with something",
            "definition": "to use something in a particular manner.  Use this tool with a lot of skill and caution.  Use this one with great care."
        },
        {
            "id": 95,
            "phrase": "use strong language",
            "definition": "Euph. to swear, threaten, or use abusive language.  I wish you wouldn’t use strong language in front of the children.  If you feel that you have to use strong language with the manager, perhaps you had better let me do the talking."
        },
        {
            "id": 96,
            "phrase": "*used to someone or something",
            "definition": "accustomed to someone or something; familiar and comfortable with someone or something. (*Typically: be ~; become ~; get ~.) _ I am used to eating better food than this.  I am used to the doctor I have and I don’t want to change."
        },
        {
            "id": 97,
            "phrase": "user friendly",
            "definition": "easy to use. (Hyphenated before nominals.) _ The set-up instructions for the printer were very user friendly.  I have a user-friendly computer that listens to my voice and does what I tell it."
        },
        {
            "id": 98,
            "phrase": "usher someone to something",
            "definition": "to escort or lead someone to something, such as a seat, the door, etc. The well-dressed gentleman ushered the bride to the altar. Her father ushered her to the altar."
        },
        {
            "id": 99,
            "phrase": "utilize someone or something for something",
            "definition": "to use someone or something for something or for some purpose.  Is there any way you can utilize Peter for the project? _ Can you utilize this contraption for anything?"
        },
        {
            "id": 100,
            "phrase": "vaccinate someone or an animal against something",
            "definition": "to inoculate or immunize someone or an animal against some disease.  They had to vaccinate us against yellow fever.  The vet vaccinated the horse against everything that threatened it."
        },
        {
            "id": 101,
            "phrase": "vaccinate someone or an animal with something",
            "definition": "to inoculate or immunize someone or an animal with some substance.  This time the doctor vaccinated Tom with killed virus.  The vet vaccinated the cat with something that would prevent rabies."
        },
        {
            "id": 102,
            "phrase": "vacillate between someone and someone else or something and something else",
            "definition": "to waver between a choice of people or a choice of things.  He kept vacillating between Fred and Alice. Wayne vacillated between chocolate and vanilla."
        },
        {
            "id": 103,
            "phrase": "vacuum something out†",
            "definition": "to clean an enclosed area out with a vacuum cleaner.  Please vacuum this car out now! _ Can you vacuum out the car?"
        },
        {
            "id": 104,
            "phrase": "vacuum something up† (from something)",
            "definition": "to clean something up from something with a vacuum cleaner.  Fred vacuumed the dirt up from the carpet.  He vacuumed up the birdseed from the kitchen f loor."
        },
        {
            "id": 105,
            "phrase": "value someone or something above someone or something",
            "definition": "to hold someone or something to be more important than someone or something.  I value her above all things.  He values his car above his family!"
        },
        {
            "id": 106,
            "phrase": "value someone or something as something",
            "definition": "to hold someone or something in esteem as something; to find someone or something to be as good as something.  I value you as a close friend.  I value this watch as a keepsake."
        },
        {
            "id": 107,
            "phrase": "value someone or something for something",
            "definition": "to hold someone or something in esteem for a particular quality.  I value him for his skill in negotiation. I value this car for its speed and dependability."
        },
        {
            "id": 108,
            "phrase": "value something at something",
            "definition": "to consider something to be worth a certain amount. The museum curator valued the vase at one million dollars.  I value this vase at one million dollars."
        },
        {
            "id": 109,
            "phrase": "vanish away",
            "definition": "to disappear. (The away is considered redundant.) _ The pizza vanished away in no time at all.  The city lights vanished away as dawn broke."
        },
        {
            "id": 110,
            "phrase": "vanish from something",
            "definition": "to disappear from something or some place.  The money vanished from the desk drawer.  My glasses have vanished from sight again."
        },
        {
            "id": 111,
            "phrase": "vanish into something",
            "definition": "to disappear by going into something.  All the deer vanished into the forest.  Money seems to vanish into a black hole."
        },
        {
            "id": 112,
            "phrase": "vanish into thin air",
            "definition": "Cliché to disappear without leaving a trace.  My money gets spent so fast. It seems to vanish into thin air.  When I came back, my car was gone. I had locked it, and it couldn’t have vanished into thin air!"
        },
        {
            "id": 113,
            "phrase": "Variety is the spice of life.",
            "definition": "Prov. Cliché You should try many different kinds of experiences, because trying different things keeps life interesting.  I know we usually spend our summer vacation camping out, but I think we should try something different this year. Variety is the spice of life."
        },
        {
            "id": 114,
            "phrase": "vary between something and something else",
            "definition": "to fluctuate between one thing and another.  The daytime temperatures vary between 80 and 90 degrees. She varies between angry and happy."
        },
        {
            "id": 115,
            "phrase": "vary (from something) (in something)",
            "definition": "to differ from something.  This one varies from that one in many ways.  It varies from the other one a little."
        },
        {
            "id": 116,
            "phrase": "vary from something to something",
            "definition": "to fluctuate over the range from something to something.  The colors vary from red to orange.  It varies from warm to very hot during the summer."
        },
        {
            "id": 117,
            "phrase": "vary with something",
            "definition": "1. to be at variance with someone’s figures or a sum or estimate. My figures vary with yours considerably. Her estimate varies with yours by a few dollars. 2. to change according to something.  The rainfall in New York State varies with the season. His mood varies with the stock market average."
        },
        {
            "id": 118,
            "phrase": "vault into something",
            "definition": "to jump or dive into something.  The diver vaulted into the pool.  He vaulted into bed and pulled up the covers."
        },
        {
            "id": 119,
            "phrase": "vault over someone or something",
            "definition": "to jump or leap over someone or something. Molly vaulted over Ted and kept on running.  She vaulted over the trunk."
        },
        {
            "id": 120,
            "phrase": "veer (away) (from someone or something)",
            "definition": "to swerve away from someone or something; to turn aside to avoid someone or something.  The plane veered away from the mountain.  The car veered from the children who were in its path."
        },
        {
            "id": 121,
            "phrase": "veer off (from someone or something)",
            "definition": "to turn or steer sharply away from someone or something.  The bird veered off from the cluster of trees.  The bird veered off and missed hitting the post."
        },
        {
            "id": 122,
            "phrase": "veer toward someone or something",
            "definition": "to turn sharply or swerve toward someone or something. The car suddenly veered toward me.  The horse veered toward the side of the bridle path."
        },
        {
            "id": 123,
            "phrase": "veg out",
            "definition": "to cease working and take it easy; to vegetate.  Someday, I just want to veg out and enjoy life. I think I’ll just veg this weekend."
        },
        {
            "id": 124,
            "phrase": "vegged out",
            "definition": "debilitated by drugs or alcohol. Ernie is vegged out and has quit his job and everything. Won’t be long till Larry is vegged out altogether."
        },
        {
            "id": 125,
            "phrase": "vent one’s spleen",
            "definition": "to get rid of one’s feelings of anger caused by someone or something by attacking someone or something else.  Jack vented his spleen at his wife whenever things went badly at work.  Peter vented his spleen on his car by kicking it when it broke down."
        },
        {
            "id": 126,
            "phrase": "vent something (up)on someone or something",
            "definition": "to release one’s emotional tension on someone or something. (Upon is formal and less commonly used than on.) _ Henry vented his anger on Carl.  It’s no use to vent your hatred on a door. Kicking it won’t help."
        },
        {
            "id": 127,
            "phrase": "venture forth",
            "definition": "1. Fig. to set out; to go forward; to go out cautiously.  George ventured forth into the night.  I think I will venture forth. It looks safe. 2. Fig. to go forth bravely.  Let us venture forth and conquer the enemy.  We will arm ourselves and venture forth against our foe."
        },
        {
            "id": 128,
            "phrase": "venture out ((of ) something)",
            "definition": "to go out of something cautiously. (Of is usually retained before pronouns.) _ Peter ventured out of his house for only a minute into the cold.  He ventured out the door for only a moment."
        },
        {
            "id": 129,
            "phrase": "venture (up)on someone or something",
            "definition": "to come upon someone or something by chance. (Upon is formal and less commonly used than on. The entire expression is formal or stilted.) _David ventured upon Fred, who was out looking for mushrooms.  I ventured on a little shop on Maple Street that deals in old model trains."
        },
        {
            "id": 130,
            "phrase": "verge into something",
            "definition": "to change gradually into something.  The reds verged into a violet color that seemed to glow.  The cool morning verged imperceptibly into a steamy midday."
        },
        {
            "id": 131,
            "phrase": "verge (up)on something",
            "definition": "to be almost identical to something; to be similar to or almost the same as something. (Upon is formal and less commonly used than on.) _Your actions verge upon mutiny.  What you said verges on an insult."
        },
        {
            "id": 132,
            "phrase": "verify something with someone",
            "definition": "to check with someone to make sure that something is the truth. I will have to verify your story with the storekeeper.  I verified your story with the other witness."
        },
        {
            "id": 133,
            "phrase": "Very good.",
            "definition": "1. It is good. John: How do you like your lobster? Alice: Mmm. Very good.  Jane: What did you think of the movie? Fred: Very good. Jane: Is that all? Fred: Yeah. 2. Thank you for your instructions. (Typically said by someone in a serving role, such as a clerk, waiter, waitress, butler, maid, etc.) _ Waiter: What are you drinking, madam? Sue: It’s just soda. No more, thanks. Waiter: Very good. Mary: Would you charge this to my account? Clerk: Very good."
        },
        {
            "id": 134,
            "phrase": "the very last",
            "definition": "the end; an absolute end of something.  At the very last of the movie, the hero gets killed.  Bill stayed at the party until the very last."
        },
        {
            "id": 135,
            "phrase": "the (very) picture of something",
            "definition": "the perfect example of something; an exact image of something. The young newlyweds were the picture of happiness. My doctor told me that I was the very picture of good health."
        },
        {
            "id": 136,
            "phrase": "the very thing",
            "definition": "the exact thing that is required. The vacuum cleaner is the very thing for cleaning the stairs.  I have the very thing to remove that stain."
        },
        {
            "id": 137,
            "phrase": "vest someone with something",
            "definition": "to grant power, rights, or ownership to someone.  Who vested you with the power to order me around? _The dictator vested himself with the power to imprison almost anyone."
        },
        {
            "id": 138,
            "phrase": "vest something in someone or something",
            "definition": "to grant sole power or control over something to someone or some group.  The king vested all the military power in his own hands.  The constitution vests the power to tax in the legislature."
        },
        {
            "id": 139,
            "phrase": "*a vested interest in something",
            "definition": "a personal or biased interest, often financial, in something. (*Typically: have ~; give someone ~.) _Margaret has a vested interest in wanting her father to sell the family firm. She has shares in it and would make a large profit.  Bob has a vested interest in keeping the village traffic-free. He has a summer home there."
        },
        {
            "id": 140,
            "phrase": "the villain of the piece",
            "definition": "someone or something that is responsible for something bad or wrong. (Fig. on the villainous role in a drama.) _I wonder who told the newspapers about the local scandal. I discovered that Jane was the villain of the piece. We couldn’t think who had stolen the meat. The dog next door turned out to be the villain of the piece."
        },
        {
            "id": 141,
            "phrase": "vim and vigor",
            "definition": "Cliché energy; enthusiasm.  Show more vim and vigor! Let us know you’re alive.  She’s sure got a lot of vim and vigor."
        },
        {
            "id": 142,
            "phrase": "vindicate someone of something",
            "definition": "to clear or acquit someone of something.  The police sought to vindicate Donald of the charges.  They vindicated themselves of the charges with a clear alibi."
        },
        {
            "id": 143,
            "phrase": "virtual reality",
            "definition": "computer imaging that attempts to mimic real scenes or places. The movie had so much virtual reality that the regular photographic scenes began to look funny."
        },
        {
            "id": 144,
            "phrase": "Virtue is its own reward.",
            "definition": "Prov. You should not be virtuous in hopes of getting a reward, but because it makes you feel good to be virtuous.  Bill: If I help you, will you pay me? Fred: Virtue is its own reward."
        },
        {
            "id": 145,
            "phrase": "a visit from the stork",
            "definition": "a birth. (According to legend, babies are brought to their parents by a stork.) _ I hear that Maria is expecting a visit from the stork.  The young couple had a visit from the stork."
        },
        {
            "id": 146,
            "phrase": "visit something (up)on someone",
            "definition": "to inflict something upon someone. (Stilted. Upon is formal and less commonly used than on.) _ The FBI visited a plague of investigations on the mayor’s staff.  The storm visited disaster on the little village."
        },
        {
            "id": 147,
            "phrase": "visit the plumbing",
            "definition": "Euph. to go to the bathroom.  I think I’d better visit the plumbing before we go.  I want you kids to visit the plumbing before we get in the car."
        },
        {
            "id": 148,
            "phrase": "visit with someone",
            "definition": "to pay a social call on someone.  I would like to come by and visit with you for a while. I will enjoy visiting with you."
        },
        {
            "id": 149,
            "phrase": "visualize someone or something as someone or something",
            "definition": "to imagine or envision someone as someone or something or something as something.  I can almost visualize you as the president. I visualize this room as a meeting place for everyone."
        },
        {
            "id": 150,
            "phrase": "visually impaired",
            "definition": "Euph. blind or partly blind.  I am visually impaired, but I like TV just as much as the next person.  The disease left him visually impaired."
        },
        {
            "id": 151,
            "phrase": "volunteer as something",
            "definition": "to submit oneself as a person ready or willing to do something. Would you be willing to volunteer as a marcher? _ I will volunteer as a helper in the hospital."
        },
        {
            "id": 152,
            "phrase": "volunteer for something",
            "definition": "1. to submit oneself for some task without being asked. I volunteered for the job. I didn’t volunteer for this. 2. to work as an unpaid volunteer for a charity, etc.  On Sundays she volunteers as a receptionist at the hospital."
        },
        {
            "id": 153,
            "phrase": "vomit something out†",
            "definition": "[for something] to spill forth a great deal of something.  The volcano vomited the lava out for days.  It vomited out hot lava for months."
        },
        {
            "id": 154,
            "phrase": "vomit something up†",
            "definition": "to bring up something from the stomach by vomiting. The dog vomited the chocolate cake up.  Fido vomited up the rabbit."
        },
        {
            "id": 155,
            "phrase": "vote a split ticket",
            "definition": "to cast a ballot on which one’s votes are divided between two or more parties. I always vote a split ticket since I detest both parties.  Mary voted a split ticket for the first time in her life."
        },
        {
            "id": 156,
            "phrase": "vote a straight ticket",
            "definition": "to cast a ballot on which all one’s votes are for members of the same political party.  I’m not a member of any political party, so I never vote a straight ticket.  I usually vote a straight ticket because I believe in the principles of one party and not in the other’s."
        },
        {
            "id": 157,
            "phrase": "vote against someone or something",
            "definition": "to cast a ballot against someone or something. Are you going to vote against the provision? _ I plan to vote against David."
        },
        {
            "id": 158,
            "phrase": "vote for someone or something",
            "definition": "to cast a ballot in favor of someone or something. Did you vote for Alice? _I plan to vote for the tax freeze.  Of course, I voted for myself! Wouldn’t you?"
        },
        {
            "id": 159,
            "phrase": "a vote of confidence",
            "definition": "a poll taken to discover whether or not a person, party, etc., still has the majority’s support. The government easily won the vote of confidence called for by the opposition.  The president of the club resigned when one of the members called for a vote of confidence in his leadership."
        },
        {
            "id": 160,
            "phrase": "a vote of thanks",
            "definition": "a speech expressing appreciation and thanks to a speaker, lecturer, organizer, etc., and inviting the audience to applaud.  John gave a vote of thanks to Professor Jones for his talk.  Mary was given a vote of thanks for organizing the dance."
        },
        {
            "id": 161,
            "phrase": "vote someone on(to something)",
            "definition": "to elect someone to something, such as a board.  Let’s vote Christine onto the board.  We voted Dave on last term."
        },
        {
            "id": 162,
            "phrase": "vote someone or something down†",
            "definition": "to defeat someone or something in an election. The community voted the proposal down.  They voted down the proposal."
        },
        {
            "id": 163,
            "phrase": "vote something through†",
            "definition": "to get something through a set of procedures by voting in favor of it. They were not able to vote the bill through.  They voted through the bill."
        },
        {
            "id": 164,
            "phrase": "vote (up)on someone or something",
            "definition": "to make a decision about someone or something by ballot. (Upon is formal and less commonly used than on.) _The committee decided to vote on it.  Are we going to vote on this?"
        },
        {
            "id": 165,
            "phrase": "vote with one’s feet",
            "definition": "to express one’s dissatisfaction with something by leaving, especially by walking away.  I think that the play is a total f lop. Most of the audience voted with its feet during the second act.  I am prepared to vote with my feet if the meeting appears to be a waste of time."
        },
        {
            "id": 166,
            "phrase": "vouch for someone or something",
            "definition": "to support or back someone or something; to endorse someone or something.  I can vouch for Tom.  Irene will vouch for my honesty."
        },
        {
            "id": 167,
            "phrase": "wade across something",
            "definition": "to walk across something covered by water.  Let’s wade across the stream at this point.  If I wade across it, I will get wet."
        },
        {
            "id": 168,
            "phrase": "wade in(to something)",
            "definition": "1. to walk into an area covered by water. The horse waded right into the stream. It waded right in. 2. Fig. to get quickly and directly involved in something. (Fig. on Q.) _ Don’t just wade into things. Stop and think about what you are doing.  Just wade in and get started."
        },
        {
            "id": 169,
            "phrase": "wade through something",
            "definition": "1. to walk with effort through a substance, such as water, mud, garbage, etc.  The soldiers waded through the mud on the way to battle.  They waded through the mess to get to where they were going. 2. Fig. to struggle through something with difficulty. (Fig. on Q.) _You mean I have to wade through all these applications? _ I have to wade through forty term papers in the next two days."
        },
        {
            "id": 170,
            "phrase": "wag one’s chin",
            "definition": "Rur. to talk.  She loves to visit. She’ll wag her chin for hours. He was on the phone, wagging his chin to his buddy."
        },
        {
            "id": 171,
            "phrase": "wage something against someone or something",
            "definition": "to carry on something against someone or a group. They waged war against the aggressors.  Are you still waging your battle against your father?"
        },
        {
            "id": 172,
            "phrase": "wager on someone or something",
            "definition": "to bet on someone or something.  I wouldn’t want to wager on the outcome.  I’ll wager on Bill, the fastest runner in town."
        },
        {
            "id": 173,
            "phrase": "wager something on someone or something",
            "definition": "to bet a certain amount of money on someone or something. I’ll wager twenty bucks on you.  I would never wager anything on that horse!"
        },
        {
            "id": 174,
            "phrase": "wait at something (for someone or something)",
            "definition": "to stay at something or some place until something happens or someone or something arrives. Wait at the door for me.  I waited at the office for your call."
        },
        {
            "id": 175,
            "phrase": "wait for the other shoe to drop",
            "definition": "to wait for the inevitable next step or the final conclusion.  He just opened his mail and moaned. Now, I’m waiting for the other shoe to drop when he finds the subpoena."
        },
        {
            "id": 176,
            "phrase": "wait on someone hand and foot",
            "definition": "to serve someone very well, attending to all personal needs.  I don’t mind bringing you your coffee, but I don’t intend to wait on you hand and foot.  I don’t want anyone to wait on me hand and foot. I can take care of myself."
        },
        {
            "id": 177,
            "phrase": "wait (on) tables",
            "definition": "to serve food and tend diners, as at a restaurant.  I waited on tables for years to pay my college tuition."
        },
        {
            "id": 178,
            "phrase": "wait one’s turn",
            "definition": "to keep from doing something until everyone ahead of you has done it.  You can’t cross the intersection yet. You must wait your turn. I can’t wait my turn. I’m in a tremendous hurry."
        },
        {
            "id": 179,
            "phrase": "wait something out†",
            "definition": "to wait until something ends.  I will wait the summer out, and if nothing happens, I’ll write again.  I can wait out the storm inside."
        },
        {
            "id": 180,
            "phrase": "Wait up (a minute)!",
            "definition": "Wait for me while I catch up with you! _Tom, who was following Mary down the street, said, “Wait up a minute! I need to talk to you.” _ John: Hey, Sally! Wait up! Sally: What’s happening?"
        },
        {
            "id": 181,
            "phrase": "wait up (until something)",
            "definition": "to delay going to bed until a certain time or until something happens or someone arrives.  Are you going to wait up until midnight? _ We waited up until we heard him come in the back door."
        },
        {
            "id": 182,
            "phrase": "wait (up)on someone",
            "definition": "to pay homage to someone. (Stilted.) _Do you expect me to wait upon you like a member of some medieval court? _She waited on her grown children as if they were gods and goddesses."
        },
        {
            "id": 183,
            "phrase": "wait-and-see attitude",
            "definition": "a skeptical attitude; an uncertain attitude in which someone will just wait to see what happens before reacting.  John thought that Mary couldn’t do it, but he took a wait-and-see attitude.  His wait-and-see attitude seemed to indicate that he didn’t really care what happened."
        },
        {
            "id": 184,
            "phrase": "waiting in the wings",
            "definition": "ready or prepared to do something, especially to take over someone else’s job or position.  Mr. Smith retires as manager next year, and Mr. Jones is just waiting in the wings. Jane was waiting in the wings, hoping that a member of the hockey team would drop out and she would get a place on the team."
        },
        {
            "id": 185,
            "phrase": "wake someone or an animal up†",
            "definition": "to cause someone or an animal to awaken.  Please don’t wake me up until noon.  Wake up your brother at noon."
        },
        {
            "id": 186,
            "phrase": "wake someone (up†) from something",
            "definition": "to awaken someone from something, such as a sound sleep, a nap, dreams, etc. Henry woke Fred up from his dreams. He woke up Fred from a deep sleep."
        },
        {
            "id": 187,
            "phrase": "wake someone up† (to something)",
            "definition": "to cause someone to become alert and pay attention. (Does not refer to some- one actually asleep.) _ We tried to wake them up to the dangers.  Try to wake up the students to their responsibilities."
        },
        {
            "id": 188,
            "phrase": "wake the dead",
            "definition": "to be so loud as to wake those who are “sleeping” the most soundly: the dead. You are making enough noise to wake the dead.  Stop hollering! You’ll wake the dead!"
        },
        {
            "id": 189,
            "phrase": "wake up",
            "definition": "to awaken; to become alert. Wake up! We have to get on the road.  It’s time to wake up!"
        },
        {
            "id": 190,
            "phrase": "Wake up and smell the coffee.",
            "definition": "Prov. Try to pay attention to what’s going on.  Things have changed around here, Wallace J. Hodder! Wake up and smell the coffee!"
        },
        {
            "id": 191,
            "phrase": "wake (up) from something",
            "definition": "to awaken from something, such as a sound sleep, sleep, dreams, etc.  She woke up from a deep sleep.  Elaine woke from her dreams with a start."
        },
        {
            "id": 192,
            "phrase": "walk a tightrope",
            "definition": "to be in a situation where one must be very cautious.  I’ve been walking a tightrope all day. I need to relax.  Our business is about to fail. We’ve been walking a tightrope for three months."
        },
        {
            "id": 193,
            "phrase": "walk across something",
            "definition": "to move across something on foot.  We walked across the bridge carefully.  Jerry walked across the field and examined the fence on the other side."
        },
        {
            "id": 194,
            "phrase": "walk ahead of someone or something",
            "definition": "to move on ahead of someone or something on foot. Please walk ahead of me where I can see you.  The road was so bad, I had to walk ahead of the car and look for potholes."
        },
        {
            "id": 195,
            "phrase": "walk all over someone or something",
            "definition": "to tread on someone or something. Who walked all over the posters I had spread out on the f loor? _The rioters walked all over a child who had fallen in the confusion."
        },
        {
            "id": 196,
            "phrase": "walk along",
            "definition": "to move along on foot.  I was just walking along when my heel broke off.  I’m in no hurry. I’ll just walk along at my own speed."
        },
        {
            "id": 197,
            "phrase": "walk along something",
            "definition": "to move beside something on foot. Let’s not walk along the road. It’s too dangerous. Walk along the wall where it’s safer."
        },
        {
            "id": 198,
            "phrase": "walk around",
            "definition": "to move around walking; to pace around.  I need to walk around and get some fresh air.  Why don’t we walk around for a while before we go in?"
        },
        {
            "id": 199,
            "phrase": "walk around something",
            "definition": "1. to avoid something by passing around it. Let’s walk around this muddy place in the path. 2. to tour something or some place on foot.  I will walk around the park while I am waiting for you. Let me walk around the grounds and see what potential they offer."
        },
        {
            "id": 200,
            "phrase": "walk away from someone or something",
            "definition": "1. to depart from someone or something on foot.  Don’t walk away from me while I am talking to you.  I walked away from the concert by myself. 2. to abandon someone or something; to go away and leave someone or something.  Todd walked away from the problem.  I walked away from him and never saw him again."
        },
        {
            "id": 201,
            "phrase": "walk away with someone or an animal",
            "definition": "to lead, take, accompany, or carry someone or an animal away.  I walked away with my brother.  The young man walked away with the heifer."
        },
        {
            "id": 202,
            "phrase": "walk back ((to) something)",
            "definition": "to return to something or some place on foot.  I walked back to my office alone.  She walked back home.  Thanks for the offer of a ride. I’ll walk back."
        },
        {
            "id": 203,
            "phrase": "walk down something",
            "definition": "to go down something on foot.  She walked down the path and turned to the right.  Todd was walking down the road when they caught up with him."
        },
        {
            "id": 204,
            "phrase": "walk in on someone or something",
            "definition": "to interrupt someone or something by entering a place.  I didn’t mean to walk in on you. I didn’t know anyone was in here.  Alice walked in on the meeting by accident."
        },
        {
            "id": 205,
            "phrase": "walk in(to something)",
            "definition": "to enter something on foot.  We walked into the parking garage and tried to find our car.  He walked in and sat down."
        },
        {
            "id": 206,
            "phrase": "walk off",
            "definition": "to walk away; to leave on foot abruptly.  She didn’t even say good-bye. She just walked off.  He walked off and never looked back."
        },
        {
            "id": 207,
            "phrase": "walk off the job",
            "definition": "1. Fig. to abandon a job abruptly.  I was so mad I almost walked off the job.  Fred almost walked off the job when he saw how bad things were. 2. Fig. to go on strike at a workplace.  The workers walked off the job and refused to negotiate.  They walked off the job and called a strike."
        },
        {
            "id": 208,
            "phrase": "walk on",
            "definition": "to continue walking.  Walk on. Go all the way to the end.  I knew I wasn’t there yet, so I just walked on."
        },
        {
            "id": 209,
            "phrase": "walk on air",
            "definition": "to be very happy; to be euphoric.  Ann was walking on air when she got the job.  On the last day of school, all the children are walking on air."
        },
        {
            "id": 210,
            "phrase": "walk on eggshells",
            "definition": "1. Fig. to walk very carefully; to take steps gingerly.  Since he stumbled and fell against the china cabinet, Bill has been walking on eggshells. 2. Fig. to be very diplomatic and inoffensive.  I was walking on eggshells trying to explain the remark to her without offending her further."
        },
        {
            "id": 211,
            "phrase": "walk on stage and off again",
            "definition": "to play a very small role where one goes on stage and quickly leaves again.  It was a very small part. I walked on stage and right off again."
        },
        {
            "id": 212,
            "phrase": "walk out (of something)",
            "definition": "to exit something or some place.  We walked out of the shop when we had made our purchases.  She went to the door and walked out."
        },
        {
            "id": 213,
            "phrase": "walk out (on someone)",
            "definition": "to abandon someone; to leave one’s spouse.  Mr. Franklin walked out on Mrs. Franklin last week.  Bob walked out on Jane without saying goodbye."
        },
        {
            "id": 214,
            "phrase": "walk out (on something)",
            "definition": "to leave a performance (of something by someone).  We didn’t like the play at all, so we walked out. John was giving a very dull speech, and a few people even walked out on him."
        },
        {
            "id": 215,
            "phrase": "walk out with someone",
            "definition": "to exit something or some place with someone on foot. After the play, Jane and I walked out together and had a nice talk. We walked out with Mr. Wilson, who had sat next to us during the show."
        },
        {
            "id": 216,
            "phrase": "walk over (to someone or something)",
            "definition": "to move to someone or something on foot. I walked over to her and asked her what she thought.  I just walked over."
        },
        {
            "id": 217,
            "phrase": "walk right in",
            "definition": "to enter on foot without hesitation.  He went up to the door, opened it, and walked right in. Please just walk right in!"
        },
        {
            "id": 218,
            "phrase": "walk (right) into a trap",
            "definition": "to fall right into a trap or deception. You walked right into my trap. Now I have you right where I want you.  The unsuspecting agent walked into the FBI setup."
        },
        {
            "id": 219,
            "phrase": "walk (right) into someone or something",
            "definition": "to bump into someone or something.  Fred walked right into the edge of the door and broke his nose.  Sam walked into Liz and frightened her."
        },
        {
            "id": 220,
            "phrase": "walk right up (to someone or something)",
            "definition": "to move up close to someone or something, on foot; not to hesitate to approach someone or something. Walk right up to him and ask him what you want to know.  Just walk right up."
        },
        {
            "id": 221,
            "phrase": "walk soft",
            "definition": "to be unobtrusive; to be gentle and humble.  I try to walk soft and not rock the boat. The guy’s a tyrant. He walks soft just to mislead people."
        },
        {
            "id": 222,
            "phrase": "walk someone out",
            "definition": "to accompany someone out, walking.  I’ll walk you out. The exit is hard to find.  Please let me walk you out so you don’t get lost."
        },
        {
            "id": 223,
            "phrase": "walk someone over to someone or something",
            "definition": "to accompany someone a short distance on foot to someone or something. I’ll walk her over to the personnel department and show her what to do.  I will walk her over to Richard. I think he’s in his office. She walked herself over to the window and looked out."
        },
        {
            "id": 224,
            "phrase": "walk someone’s feet off",
            "definition": "to walk too much and tire out someone’s feet, including one’s own.  I’ve gone all over town today. I walked my feet off, looking for just the right present for Jill.  I need to know where I am going before I leave so I won’t walk my feet off."
        },
        {
            "id": 225,
            "phrase": "walk someone through something",
            "definition": "1. to lead or accompany someone through an opening, arch, doorway, etc. Mike walked Mary through the arch into a lovely garden. Todd walked Rita through the doorway, into the ballroom. 2. Fig. to lead someone through a complex problem or thought process. Mary walked Jane through the complex solution to the calculus problem.  Do I have to walk you through this solution?"
        },
        {
            "id": 226,
            "phrase": "walk tall",
            "definition": "to be brave and self-assured.  I know I can walk tall because I’m innocent.  You go out on that stage and walk tall. There is no reason to be afraid."
        },
        {
            "id": 227,
            "phrase": "walk the floor",
            "definition": "to pace nervously while waiting.  While Bill waited for news of the operation, he walked the f loor for hours on end. Walking the f loor won’t help. You might as well sit down and relax."
        },
        {
            "id": 228,
            "phrase": "walk the plank",
            "definition": "to suffer punishment at the hand of someone. (Fig. on the image of pirates making their blindfolded captives die by walking off the end of a plank jutting out over the open sea.) _Fred may think he can make the members of my department walk the plank, but we will fight back.  Tom thought he could make John walk the plank, but John fought back."
        },
        {
            "id": 229,
            "phrase": "walk through something",
            "definition": "to rehearse something in a casual way; to go through a play or other performed piece, showing where each person is to be located during each speech or musical number. Let’s walk through this scene one more time."
        },
        {
            "id": 230,
            "phrase": "walk together",
            "definition": "[for two or more people] to walk as a group.  Let’s all walk together so we can talk to one another.  We walked together for a while."
        },
        {
            "id": 231,
            "phrase": "walk up something",
            "definition": "1. to move up an incline or stairs on foot. Sally will have to walk up the stairs by herself. 2. to walk the length of something.  I walked slowly up the hall."
        },
        {
            "id": 232,
            "phrase": "walk up to someone or something",
            "definition": "to approach someone or something on foot. I walked up to the manager and told him my problem. Eric walked up to the door and rang the bell."
        },
        {
            "id": 233,
            "phrase": "walk with someone",
            "definition": "to walk in the company of someone.  Why don’t you walk with me for a while? _ Can I walk with you?"
        },
        {
            "id": 234,
            "phrase": "walk with something",
            "definition": "1. to walk with the aid of something, such as a cane, crutches, etc.  You can recognize her easily. She walks with a cane.  Dan walks with the help of a crutch. 2. to walk in a characteristic manner, such as with a limp, halting gait, a sprightly step, etc. Martha’s uncle walks with a limp.  I have always walked with a halting gait."
        },
        {
            "id": 235,
            "phrase": "wall someone or something in†",
            "definition": "to contain someone or something behind or within a wall. (Implies a constriction of space, but not necessarily an inescapable area. See wall something up.) _ The count walled his prisoner in permanently. Jane decided to wall in the little garden at the side of the house.  She walled the garden in."
        },
        {
            "id": 236,
            "phrase": "wall someone or something off†",
            "definition": "to separate or segregate someone or something by building a wall.  She sat right across from me at her desk, listening to every phone call I made. Finally, the manager walled her off so we now can carry on our business in privacy. They walled off the south door to the building."
        },
        {
            "id": 237,
            "phrase": "wall something off† (from someone or something)",
            "definition": "to deny access to an area by building a wall as a barrier.  The manager was told to wall the incinerator area off from the machinery area.  Please wall off the incinerator area."
        },
        {
            "id": 238,
            "phrase": "wall something up†",
            "definition": "1. to seal something up behind a wall. We simply walled the old furnace up. It was cheaper than removing it. They walled up the old furnace. 2. to fill up an opening, such as a window or door, by building a wall.  We will have to hire someone to wall the doorway up.  They walled up the doorway."
        },
        {
            "id": 239,
            "phrase": "wallow (around) in something",
            "definition": "to roll around in something. Pigs enjoy wallowing around in mud. They wallow in mud to keep cool."
        },
        {
            "id": 240,
            "phrase": "wallow in something",
            "definition": "to experience an abundance of something. (Fig. on wallow (around) in something.) _ Roger and Wilma are just wallowing in money.  Claire spent the entire day wallowing in self-pity.  The villagers are all wallowing in superstition."
        },
        {
            "id": 241,
            "phrase": "Walls have ears.",
            "definition": "Prov. Someone may be listening. (A warning that you think your conversation is being overheard.) _ Jill: Did I tell you what I found out about Fred? He— Jane: Shhh! Walls have ears.  Don’t say anything about our business dealings in here. Walls have ears."
        },
        {
            "id": 242,
            "phrase": "wall-to-wall (with) something",
            "definition": "covered with something in all places. (From wall-to-wall carpeting.) _ The hallway is wall-to-wall with Jimmy’s toys. The beach was wall-to-wall tourists."
        },
        {
            "id": 243,
            "phrase": "waltz around something",
            "definition": "to move around or through a place happily or proudly. She waltzed around the room, very pleased with herself.  Who is that person waltzing around, trying to look important?"
        },
        {
            "id": 244,
            "phrase": "waltz in(to some place)",
            "definition": "to step or walk into a place briskly and easily. She waltzed into the room and showed off her ring.  Eric waltzed in and said hello."
        },
        {
            "id": 245,
            "phrase": "waltz off",
            "definition": "to depart briskly and easily.  They said good-bye and waltzed off."
        },
        {
            "id": 246,
            "phrase": "waltz off (with something)",
            "definition": "to take something away easily.  The thieves waltzed off with a giant screen television in broad daylight. They just picked the thing up and waltzed off. Nobody asked them any questions."
        },
        {
            "id": 247,
            "phrase": "waltz through something",
            "definition": "to get through something easily.  I waltzed through my comps and started on my research in my second year of grad school. I tried to waltz through my assignment, but it was too hard."
        },
        {
            "id": 248,
            "phrase": "waltz up (to someone)",
            "definition": "to approach someone boldly.  He just waltzed up to her and introduced himself.  He waltzed up and said hello."
        },
        {
            "id": 249,
            "phrase": "wander from something",
            "definition": "to stray from something, such as a path, a set of rules, etc.  Please do not wander from the path I have set for you.  If you wander from our guidelines, your finished product may not be acceptable."
        }
    ]
}