{
    "dictionary": [
        {
            "id": 0,
            "phrase": "What’s the scoop?",
            "definition": "Inf. What is the news?; What’s new with you? _ Bob: Did you hear about Tom? Mary: No, what’s the scoop? _ “Hi, you guys!” beamed John’s little brother. “What’s the scoop?”"
        },
        {
            "id": 1,
            "phrase": "What’s (there) to know?",
            "definition": "Inf. This doesn’t require any special knowledge, so what are you talking about? _ Bill: Do you know how to wind a watch? Bob: Wind a watch? What’s there to know? _ Sue: We must find someone who knows how to repair a broken lawnmower. Tom: What’s to know? Just a little tightening here and there. That’s all it needs."
        },
        {
            "id": 2,
            "phrase": "What’s up?",
            "definition": "Inf. Hello. What is happening? _ What’s up? How’re you doing? _ Hey, Chuck! What’s up?"
        },
        {
            "id": 3,
            "phrase": "What’s up, doc?",
            "definition": "Cliché What’s happening around here?; What are you doing? _ Your bike’s spread out all over the garage. What’s up, Doc?"
        },
        {
            "id": 4,
            "phrase": "What’s with someone or something?",
            "definition": "Why is someone or something in that condition?; What’s going on with someone or something? _ Mary: What’s with Tom? He looks depressed. Bill: He broke up with Sally. “What’s with this stupid coffee maker? It won’t get hot!” groused Alice."
        },
        {
            "id": 5,
            "phrase": "What’s wrong?",
            "definition": "There is something wrong here. What has happened? _ Mary: Oh, good grief! Bill: What’s wrong? Mary: I forgot to feed the cat.  Sue (crying): Hello, Sally? Sally: Sue, what’s wrong? Sally: Oh, nothing. Tom left me."
        },
        {
            "id": 6,
            "phrase": "What’s your age?",
            "definition": "Sl. Hello, how are you? _ Tim: What’s your age? Joe: Hey, Tim, what’s going on with you? _ Yo, Sam! What’s your age?"
        },
        {
            "id": 7,
            "phrase": "What’s yours is mine, and what’s mine is mine.",
            "definition": "Prov. A humorous way of saying, “Everything belongs to me.”; (A jocular variant of “What’s yours is mine, and what’s mine is yours,” an expression of generosity.) _ I know you won’t mind lending me your radio. After all, what’s yours is mine, and what’s mine is mine.  The thief took his confederate’s share of the money they had stolen, saying, “What’s yours is mine, and what’s mine is mine.”"
        },
        {
            "id": 8,
            "phrase": "what someone or something is cracked up to be",
            "definition": "what someone or something is supposed to be. This pizza isn’t what it’s cracked up to be.  I wanted to find out whether this stuff was what it is cracked up to be."
        },
        {
            "id": 9,
            "phrase": "What the deuce?",
            "definition": "Sl. What has happened?; What? (Deuce is an old word for devil.) _ What the deuce! Who are you? _ What the deuce! Who did this?"
        },
        {
            "id": 10,
            "phrase": "What the eye doesn’t see, the heart doesn’t grieve over.",
            "definition": "Prov. You cannot be upset by something you do not know about.  When Robbie cracked his mother’s favorite vase, he simply turned the cracked side toward the wall. “What the eye doesn’t see, the heart doesn’t grieve over,” he thought."
        },
        {
            "id": 11,
            "phrase": "What the heck!",
            "definition": "Inf. It doesn’t matter! (Often with the force of an exclamation.) _ Oh, what the heck! Come on in. It doesn’t matter. Oh, what the heck! I’ll have another beer. Nobody’s counting."
        },
        {
            "id": 12,
            "phrase": "What was the name again?",
            "definition": "Please tell me your name again. (More typical of a clerk than of someone just introduced.) _ Clerk: What was the name again? Bill: Bill.  “What was the name again? I didn’t write it down,” confessed Fred."
        },
        {
            "id": 13,
            "phrase": "what with something",
            "definition": "because of something.  What with the children being at home and my parents coming to stay, I have too much to do. The Smiths find it difficult to manage financially, what with Mr. Smith losing his job and Mrs. Smith being too ill to work."
        },
        {
            "id": 14,
            "phrase": "What would you like to drink?",
            "definition": "an offer to prepare or serve a drink.  Bill: Come in and sit down. What would you like to drink? Andy: Nothing, thanks. I just need to relax a moment.  Waiter: What would you like to drink? Alice: Do you have any grape soda? Waiter: I’ll bring you some ginger ale, if that’s all right. Alice: Well, okay. I guess."
        },
        {
            "id": 15,
            "phrase": "What would you say if...?",
            "definition": "an expression introducing a request for an opinion or a judgment. Bill: What would you say if I ate the last piece of cake? Bob: Go ahead. I don’t care.  Mary: What would you say if we left a little early? Sally: It’s okay with me."
        },
        {
            "id": 16,
            "phrase": "What you see is what you get.",
            "definition": "The product you are looking at is exactly what you get if you buy it. It comes just like this. What you see is what you get. What you see is what you get. The ones in the box are just like this one."
        },
        {
            "id": 17,
            "phrase": "What(ever) goes around, comes around.",
            "definition": "Prov. The results of things that one has done will someday have an effect on the person who started the events. So he finally gets to see the results of his activities. What goes around, comes around.  Now he is the victim of his own policies. Whatever goes around comes around."
        },
        {
            "id": 18,
            "phrase": "Whatever turns you on.",
            "definition": "1. Inf. Whatever pleases or excites you is okay.  Mary: Do you mind if I buy some of these f lowers? Bill: Whatever turns you on.  Mary: I just love to hear a raucous saxophone play some smooth jazz. Bob: Whatever turns you on, baby. 2. Inf. a comment implying that it is strange to get so excited about something. (Essentially sarcastic.) _ Bob: I just go wild whenever I see pink gloves on a woman. I don’t understand it. Bill: Whatever turns you on.  Jane: You see, I never told anybody this, but whenever I see snow falling, I just go sort of mushy inside. Sue: Weird, Jane, weird. But, whatever turns you on."
        },
        {
            "id": 19,
            "phrase": "wheedle someone into something",
            "definition": "to get someone to agree to do something by begging or flattery.  She is always trying to wheedle us into coming for a visit.  You can’t wheedle me into doing that!"
        },
        {
            "id": 20,
            "phrase": "wheel and deal",
            "definition": "to take part in clever (but sometimes dishonest or immoral) business deals.  John loves to wheel and deal in the money markets.  Jack got tired of all the wheeling and dealing of big business and retired to run a pub in the country."
        },
        {
            "id": 21,
            "phrase": "wheel around",
            "definition": "to turn around quickly; to change direction quickly.  She wheeled around quickly to face him.  Suddenly, Roger wheeled around and started chasing Wally."
        },
        {
            "id": 22,
            "phrase": "wheel someone or something around†",
            "definition": "to push or steer around someone or something on wheels. I had to wheel my great-uncle around all day when we visited the zoo.  I wheeled around my uncle so he could enjoy the park.  I wheeled the heavy shopping cart around the grocery store."
        },
        {
            "id": 23,
            "phrase": "wheel someone or something away†",
            "definition": "to push away someone or something on wheels. The nurse wheeled the old man away, into the shelter of the porch. She wheeled away the old man."
        },
        {
            "id": 24,
            "phrase": "wheel someone or something off†",
            "definition": "to push or steer someone or something on wheels some distance away. The nurse wheeled the old man off.  Karen wheeled off the patient."
        },
        {
            "id": 25,
            "phrase": "wheeze something out†",
            "definition": "to say something, while wheezing; to say something, using a wheeze for a voice. (As if one is out of breath.) _ He was out of breath from running and was only able to wheeze a few words out. Liz wheezed out a quick hello."
        },
        {
            "id": 26,
            "phrase": "when all is said and done",
            "definition": "Cliché when everything is finished and settled; when everything is considered.  When all is said and done, this isn’t such a bad part of the country to live in after all.  When all is said and done, I believe I had a very enjoyable time on my vacation."
        },
        {
            "id": 27,
            "phrase": "When do we eat?",
            "definition": "What time is the next meal served? (Indicates that the speaker is hungry, but considered impolite.) _Bill: This is a lovely view, and your apartment is great. When do we eat? Mary: We’ve already eaten. Weren’t you just leaving? Bill: I guess I was.  Andy: Wow! Something really smells good! When do we eat? Rachel: Oh, mind your manners."
        },
        {
            "id": 28,
            "phrase": "When in Rome(, do as the Romans do).",
            "definition": "Prov. Behave however the people around you behave. Adapt yourself to the customs of the places you visit.  Jill: Everyone in my new office dresses so casually. Should I dress that way, too? Jane: By all means. When in Rome, do as the Romans do."
        },
        {
            "id": 29,
            "phrase": "when it comes right down to it",
            "definition": "Cliché all things considered; when one really thinks about something. When it comes right down to it, I’d like to find a new job. When it comes right down to it, he can’t really afford a new car."
        },
        {
            "id": 30,
            "phrase": "when it comes to something",
            "definition": "as for something; speaking about something.  When it comes to fishing, John is an expert. When it comes to trouble, Mary really knows how to cause it."
        },
        {
            "id": 31,
            "phrase": "when least expected",
            "definition": "when one does not expect something.  An old car is likely to give you trouble when least expected.  My pencil usually breaks when least expected."
        },
        {
            "id": 32,
            "phrase": "When one door shuts, another opens.",
            "definition": "Prov. When you lose one opportunity, you often find a different one.  Jane: I just found out I’m failing two classes. I’ll never get into college with grades like this. Jill: Well, maybe you’ll find something better than college. When one door shuts, another opens."
        },
        {
            "id": 33,
            "phrase": "when one is good and ready",
            "definition": "when one is completely ready. I’ll be there when I’m good and ready. Ann will finish the job when she’s good and ready and not a minute sooner."
        },
        {
            "id": 34,
            "phrase": "when one’s ship comes in",
            "definition": "when one becomes rich and successful.  When my ship comes in, we’ll live in one of these huge mansions on the hill, my lass.  When your ship comes in, Otto, I’ll probably die of amazement!"
        },
        {
            "id": 35,
            "phrase": "When the cat’s away, the mice will play.",
            "definition": "Prov. When no one in authority is present, the subordinates can do as they please.  When the teacher left for a few minutes, the children nearly wrecked the classroom. When the cat’s away, the mice will play.  Jill: You shouldn’t be reading a novel at your desk. Jane: But the boss isn’t here. And when the cat’s away, the mice will play."
        },
        {
            "id": 36,
            "phrase": "when the chips are down",
            "definition": "at the final, critical moment; when things really get difficult.  When the chips are down, I know that I can depend on Jean to help out. I knew you would come and help when the chips were down."
        },
        {
            "id": 37,
            "phrase": "when the dust settles",
            "definition": "when the dust falls out of the air.  When the dust settles, we will have to begin sweeping it up."
        },
        {
            "id": 38,
            "phrase": "When the going gets tough, the tough get going.",
            "definition": "Prov. When things are difficult, strong people take action and do not despair. (Can be used to encourage someone to take action.) _ The football team was losing the game, so at halftime the coach reminded them that when the going gets tough, the tough get going.  Jill: I don’t think I can walk all the way to the top of this hill; it’s so steep! Jane: Don’t give up. When the going gets tough, the tough get going."
        },
        {
            "id": 39,
            "phrase": "when the shit hits the fan",
            "definition": "Sl. when all the expected trouble materializes. When the shit hits the fan, you had better be prepared to support those of us who are involved in this mess."
        },
        {
            "id": 40,
            "phrase": "when the time is ripe",
            "definition": "at exactly the right time.  I’ll tell her the good news when the time is ripe. When the time is ripe, I’ll bring up the subject again."
        },
        {
            "id": 41,
            "phrase": "Where do (you think) you get off?",
            "definition": "Inf. What do you think you are doing?; Who do you think you are? (A sharp reply to something offensive or impolite.) _ How rude! Where do you think you get off ? _ Where do you get off, talking to me like that?"
        },
        {
            "id": 42,
            "phrase": "Where have you been all my life?",
            "definition": "Inf. an expression of admiration usually said to a lover.  Mary: I feel very happy when I’m with you. John: Oh, Mary, where have you been all my life? _ John grasped her hand, stared directly at her left ear, and stuttered, “Where have you been all my life?”"
        },
        {
            "id": 43,
            "phrase": "Where ignorance is bliss, ’tis folly to be wise.",
            "definition": "Prov. If knowing something makes you unhappy, it would be better not to know it. (Also the cliché: ignorance is bliss.) _Ellen: The doctor didn’t tell Dad that Mom probably won’t recover from her illness. Do you think we should tell him? Bill: No. It would only make him unhappy and ruin their last months together. Where ignorance is bliss, ’tis folly to be wise."
        },
        {
            "id": 44,
            "phrase": "Where in the world...?",
            "definition": "Inf. Where? (An intensive form of where. See examples for variations.) _ Where in the world have you been? _ Where in the world did I put my glasses?"
        },
        {
            "id": 45,
            "phrase": "Where is the restroom?",
            "definition": "the appropriate way of asking for the toilet in a public place.  Bob: ’Scuse me. Waiter: Yes, sir. Bob: Where is the restroom? Waiter: To your left, sir.  Mary: Where is the restroom, please? Clerk: Behind the elevators, ma’am."
        },
        {
            "id": 46,
            "phrase": "where it’s at",
            "definition": "Sl. what one is aiming for; what is needed. (This does not refer to a place.) _ Keep on trying. That’s where it’s at! _ Good strong friends. That’s where it’s at."
        },
        {
            "id": 47,
            "phrase": "Where on (God’s green) earth?",
            "definition": "Inf. (Exactly) where? (An intensive form of where. See examples for variations.) _ Where on God’s green earth did you get that ridiculous hat? _Where on earth is my book? _Where on God’s green earth were you?"
        },
        {
            "id": 48,
            "phrase": "where one is coming from",
            "definition": "one’s point of view. I think I know what you mean. I know where you’re coming from.  Man, you don’t know where I’m coming from! You don’t understand a single word I say."
        },
        {
            "id": 49,
            "phrase": "Where’s the beef?",
            "definition": "Inf. Where is the substance?; Where is the important content? _That’s really clever and appealing, but where’s the beef ? _ Where’s the beef ? There’s no substance in this proposal."
        },
        {
            "id": 50,
            "phrase": "Where’s the fire?",
            "definition": "Inf. Where are you going in such a hurry? (Typically said by a police officer after stopping a speeding driver.) _ Officer: Okay, where’s the fire? Mary: Was I going a little fast? _ “Where’s the fire?” Bob called ahead to Sue, who had gotten well ahead of him in her excitement."
        },
        {
            "id": 51,
            "phrase": "where someone is at",
            "definition": "Sl. what mental condition someone is in.  I know where you’re at. I know what you are talking about.  You said it! I know just where you’re at!"
        },
        {
            "id": 52,
            "phrase": "where someone lives",
            "definition": "Inf. at one’s core; in one’s personal situation.  That really hits you where you live, doesn’t it? _ Yes, that gets me where I live."
        },
        {
            "id": 53,
            "phrase": "where someone’s head is at",
            "definition": "Inf. the state of one’s mental well-being.  As soon as I figure where my head is at, I’ll be okay.  He doesn’t know where his head is at."
        },
        {
            "id": 54,
            "phrase": "where the action is",
            "definition": "where important things are happening.  I want to be where the action is.  Right there in city hall. That’s where the action is."
        },
        {
            "id": 55,
            "phrase": "where the rubber meets the road",
            "definition": "at the point in a process where there are challenges, issues, or problems.  Now we have spelled out the main area of dissent. This is where the rubber meets the road."
        },
        {
            "id": 56,
            "phrase": "where the sun don’t shine",
            "definition": "Sl. in a dark place, namely the anus. I don’t care what you do with it. Just put it where the sun don’t shine.  For all I care you can shove it where the sun don’t shine."
        },
        {
            "id": 57,
            "phrase": "Where there’s a will, there’s a way.",
            "definition": "Prov. Cliché If you truly want to do something, you will find a way to do it, in spite of obstacles.  We’ll get this piano up the stairs somehow. Where there’s a will, there’s a way.  I have no doubt that Bob will find a publisher for his novel. Where there’s a will, there’s a way."
        },
        {
            "id": 58,
            "phrase": "Where will I find you?",
            "definition": "Please give me directions for finding you. (Said when people are arranging a meeting somewhere.) _ Sue: Where will I find you? Bob: I’ll be sitting in the third row somewhere.  Tom: We’ll get to the farm about noon. Where will we find you? Sally: Probably in the barn. If you can’t find me, just go up to the house and make yourself comfortable on the porch."
        },
        {
            "id": 59,
            "phrase": "*the wherewithal (to do something)",
            "definition": "the means to do something, especially energy or money. (*Typically: get ~; have ~; give someone ~.) _ He has good ideas, but he doesn’t have the wherewithal to carry them out.  I could do a lot if only I could get the wherewithal."
        },
        {
            "id": 60,
            "phrase": "whet someone’s appetite",
            "definition": "to cause someone to be interested in something and to be eager to have, know, learn, etc., more about it.  Seeing that film really whetted my sister’s appetite for horror films. She now sees as many as possible.  My appetite for theater was whetted when I was very young."
        },
        {
            "id": 61,
            "phrase": "whether or not",
            "definition": "either if something is the case or if something is not the case; one way or the other.  I’ll drive to New York tomorrow whether or not it rains.  I’m going to the mall whether you come with me or not."
        },
        {
            "id": 62,
            "phrase": "which brings me to the (main) point",
            "definition": "a transitional phrase that introduces the main point of a discussion.  Bill: Keeping safe at times like this is very important—which brings me to the main point. Does your house have an adequate burglar alarm? Sally: I knew you were trying to sell me something! Out! _ Lecturer: . . . which brings me to the point. John (whispering): Thank heavens! I knew there was a point to all this."
        },
        {
            "id": 63,
            "phrase": "*a whiff of something",
            "definition": "the smell or odor of something. (*Typically: get ~; catch ~; have ~; take ~; give someone ~.) _ Did you get a whiff of the turkey roasting? Yummy.  I caught a whiff of something rather unpleasant in the attic. I think there is a dead mouse up there."
        },
        {
            "id": 64,
            "phrase": "while a period of time away† (doing something)",
            "definition": "to spend or waste time doing something. I whiled an hour away just staring at the sea.  Liz whiled away the entire afternoon, snoozing.  I just love to while away the hours."
        },
        {
            "id": 65,
            "phrase": "whine about someone or something",
            "definition": "to whimper or complain about someone or something.  Please don’t whine about Sally. She is sorry she couldn’t come to your party, but it’s not the end of the world. The dog is whining about its hurt paw."
        },
        {
            "id": 66,
            "phrase": "whine something out†",
            "definition": "to say something in a whine; to say something, using a whine for a voice.  She whined her complaint out so everyone could hear it. Jake whined out his usual complaints."
        },
        {
            "id": 67,
            "phrase": "whip around",
            "definition": "1. to reverse suddenly. (As with the tip of a whip.) _ The rope suddenly whipped around and struck me in the face.  A branch whipped around and tore my shirt. 2. to turn around very quickly and suddenly. John whipped around when he heard the noise. Claire whipped around to face her opponent."
        },
        {
            "id": 68,
            "phrase": "whip back (on someone)",
            "definition": "[for something] to snap back and strike someone.  The branch whipped back and struck Jill in the leg. It whipped back and slapped my side."
        },
        {
            "id": 69,
            "phrase": "whip into something",
            "definition": "to go quickly into something or some place.  They whipped into the parking space before I could get there. I whipped into the store to pick up a few things."
        },
        {
            "id": 70,
            "phrase": "whip someone into a state",
            "definition": "to excite, arouse, or foment someone into some state. (Based on whip someone into doing something.) _The governor’s speech whipped the audience into a frenzy.  The angry cries from the audience whipped the speaker into a rage."
        },
        {
            "id": 71,
            "phrase": "whip someone into doing something",
            "definition": "to beat someone into doing something.  The cruel captain whipped his men into going on with the journey.  You can’t whip me into betraying my friends."
        },
        {
            "id": 72,
            "phrase": "whip someone or something around†",
            "definition": "to cause someone or something to reverse direction quickly.  The roller coaster whipped around the riders, right and left, until they were almost sick.  The sharp turn whipped me around, but I wasn’t hurt."
        },
        {
            "id": 73,
            "phrase": "whip someone or something into shape",
            "definition": "to cause someone or something to be in a better condition. The coach was not able to whip the players into shape before the game.  I think I can whip this proposal into shape quickly.  Hey, Tom, whip yourself into shape. You look a mess."
        },
        {
            "id": 74,
            "phrase": "whip someone or something on†",
            "definition": "to force someone or something to continue by whipping or beating.  The rider whipped his horse on, faster and faster.  The stage coach driver whipped on the team of horses."
        },
        {
            "id": 75,
            "phrase": "whip someone up†",
            "definition": "to excite or stir up someone.  Well, you’ve certainly whipped them up with that speech. Harry whipped up the crowd with a few good jokes."
        },
        {
            "id": 76,
            "phrase": "whip something away† (from someone)",
            "definition": "to jerk something away from someone suddenly.  The mugger whipped Sally’s purse away from her and ran.  The thief whipped away the purse."
        },
        {
            "id": 77,
            "phrase": "whip something into something",
            "definition": "to beat one soft ingredient into another.  Whip the butter into the egg and make a smooth paste.  First, you must whip the egg whites into the cream."
        },
        {
            "id": 78,
            "phrase": "whip something off†",
            "definition": "1. Inf. to do or create something quickly.  If you need another receipt, I can whip one off in a jiffy.  She whipped off another set of earrings for the tourist. 2. Inf. to remove something, such as an item of clothing, quickly. He whipped the coat off and dived into the water.  I whipped off my cap."
        },
        {
            "id": 79,
            "phrase": "whip something out†",
            "definition": "1. Inf. to complete making or working on something quickly. I think I can whip one out for you very quickly.  The factory whips out twenty of these every minute. 2. Inf. to jerk something out [of some place].  Liz whipped a pencil out of her pocket.  She whipped out a pencil and signed the contract."
        },
        {
            "id": 80,
            "phrase": "whip something over (to someone)",
            "definition": "to send or give something to someone with great speed. I will whip this letter over to Mr. Franklin right away.  Sam whipped the package over to Alice immediately."
        },
        {
            "id": 81,
            "phrase": "whip something up†",
            "definition": "to prepare, create, or put something together.  I haven’t written my report yet, but I’ll whip one up before the deadline. I will whip up the most beautiful arrangement you have ever seen."
        },
        {
            "id": 82,
            "phrase": "whip something written off† to someone",
            "definition": "Inf. to write and send off a letter to someone quickly.  After I got her letter, I whipped an answer off to her the same afternoon.  Liz whipped off a letter to her grandmother."
        },
        {
            "id": 83,
            "phrase": "whip through something",
            "definition": "to work through something very fast. Do this carefully. Don’t just whip through it.  She whipped through her homework and went outside to play."
        },
        {
            "id": 84,
            "phrase": "a whipping boy",
            "definition": "someone who is punished for someone else’s misdeeds.  The president has turned out to be the whipping boy for his party."
        },
        {
            "id": 85,
            "phrase": "whirl around",
            "definition": "to turn around very quickly. I tapped him on the shoulder and he whirled around to see who it was.  Todd whirled around and grabbed Max by the wrists."
        },
        {
            "id": 86,
            "phrase": "whirl someone or something around†",
            "definition": "to turn someone or something around quickly.  I grabbed him by the shoulder and whirled him around to face me. I whirled around the book display and found what I wanted."
        },
        {
            "id": 87,
            "phrase": "whisk someone around†",
            "definition": "to move someone around rapidly from place to place.  I didn’t get much chance to see the city. They just whisked me around.  We whisked around the visitor from place to place."
        },
        {
            "id": 88,
            "phrase": "whisk someone or an animal off†",
            "definition": "to brush [something] off someone or an animal.  The barber quickly whisked him off and collected the fee.  The barber whisked off the customer."
        },
        {
            "id": 89,
            "phrase": "whisk someone or something away†",
            "definition": "to move someone or something out of the way rapidly. The firemen came and whisked the students away to a safe place.  The agents whisked away a number of people."
        },
        {
            "id": 90,
            "phrase": "whisk someone or something off† (to something)",
            "definition": "to move someone or something to something or some place rapidly.  The government agents whisked the witness off to a secret place.  They whisked off the suspect to a holding cell."
        },
        {
            "id": 91,
            "phrase": "whisper about someone or something",
            "definition": "to speak about someone or something in a quiet, breathy voice, as if telling secrets.  I hope they aren’t whispering about me.  Everyone is whispering about the incident in the lunchroom."
        },
        {
            "id": 92,
            "phrase": "whisper something around",
            "definition": "to spread secrets or gossip around. Now, don’t whisper this around, but Sam is going to run away from home.  If you whisper this around, you will spoil the surprise."
        },
        {
            "id": 93,
            "phrase": "whistle at someone or something",
            "definition": "to indicate approval or disapproval of someone or something by whistling. The men whistled at the beautiful woman who walked by.  Everyone whistled at the enormous roast of beef the cook’s assistant carried in."
        },
        {
            "id": 94,
            "phrase": "whistle for someone or something",
            "definition": "to summon someone or something by whistling. I stood on the corner and whistled for a cab, but they all ignored me.  I whistled for the dog, but it did not appear."
        },
        {
            "id": 95,
            "phrase": "whistle in the dark",
            "definition": "to guess aimlessly; to speculate as to a fact. Am I close, or am I just whistling in the dark? _ She was whistling in the dark. She has no idea of what’s going on."
        },
        {
            "id": 96,
            "phrase": "white elephant",
            "definition": "something that is large and unwieldy and is either a nuisance or expensive to keep up. Bob’s fatherin- law has given him an old Rolls Royce, but it’s a real white elephant. He has no place to park it and can’t afford the gas for it.  Those antique vases Aunt Mary gave me are white elephants. They’re ugly and I have no place to put them."
        },
        {
            "id": 97,
            "phrase": "white knuckle something",
            "definition": "to survive something threatening through strained endurance, that is to say, holding on tight.  The f light from New York was terrible. We had to white knuckle the entire f light."
        },
        {
            "id": 98,
            "phrase": "whittle at something",
            "definition": "to cut or carve at something.  He just sat there, whittling at a chunk of wood. I am not carving anything, I am just whittling at some wood."
        },
        {
            "id": 99,
            "phrase": "whittle someone down to size",
            "definition": "to reduce someone’s ego; to cause someone to have better, more respectful behavior. (Fig. on whittle something down (to size).) _ After a few days at camp, the counselors had whittled young Walter down to size.  It took some doing, but they whittled him down to size."
        },
        {
            "id": 100,
            "phrase": "whittle something away†",
            "definition": "to cut or carve something away. The carver whittled the wood away until only a small figure was left.  He whittled away the wood."
        },
        {
            "id": 101,
            "phrase": "whittle something out of something",
            "definition": "to carve something out of something.  The young man whittled a small boat out of wood.  Can you whittle an elephant out of this chunk of wood?"
        },
        {
            "id": 102,
            "phrase": "whiz past someone or something",
            "definition": "to move or travel past someone or something at a high speed.  The train whizzed past one little town after another. I whizzed past Chuck because I did not recognize him."
        },
        {
            "id": 103,
            "phrase": "whiz (right) through something",
            "definition": "1. to speed through a place.  One car after another whizzed right through the little town. We whizzed through the kitchen, stopping just long enough for a glass of iced tea. 2. to work one’s way through something quickly.  She whizzed right through the test with no trouble.  Jane whizzed through her interview and got the job."
        },
        {
            "id": 104,
            "phrase": "Who cares?",
            "definition": "Does anyone really care?; It is of no consequence.  John: I have some advice for you. It will make things easier for you. Bob: Who cares? John: You might.  Sue: You missed a spot shaving. Fred: Who cares?"
        },
        {
            "id": 105,
            "phrase": "Who do you think you are?",
            "definition": "Inf. Why do you think you can lord it over people that way?; Why are you so arrogant? (Usually in anger.) _ Tom: Just a minute! Who do you think you are? You can’t talk to me that way! Bob: Says who? _ “Who do you think you are, bursting in here like that?” sputtered the doorman as Fred bolted into the club lobby."
        },
        {
            "id": 106,
            "phrase": "Who do you think you’re kidding?",
            "definition": "Inf. You aren’t fooling anyone.; Surely, you do not think you can fool me, do you? _ Bill: I must pull down about eighty thou a year. Bob: You? Who do you think you’re kidding? _ Mary: This carpet was made in Persia centuries ago. Tom: Who do you think you’re kidding?"
        },
        {
            "id": 107,
            "phrase": "Who do you think you’re talking to?",
            "definition": "Inf. Do you know the importance of the person who you are talking to? _Who do you think you’re talking to? I’m the boss here, you know? _ Don’t talk to me that way! Who do you think you are talking to?"
        },
        {
            "id": 108,
            "phrase": "Who is this?",
            "definition": "Who is making this telephone call?; Who is on the other end of this telephone line? _ Tom (answering the phone): Hello? Fred: Hello. Do you have any fresh turkeys? Tom: Who is this? Fred: Isn’t this the Harrison Poultry Shop? Tom: No. Fred: I guess I have the wrong number.  Mary (answering the phone): Hello? Sue: Hello, who is this? Mary: Well, who did you want? Sue: I want Grandma. Mary: I’m sorry, I think you have the wrong number."
        },
        {
            "id": 109,
            "phrase": "Who knows?",
            "definition": "Who knows the answer to that question? _ Tom: When will this train get in? Rachel: Who knows? _ Andy: Why can’t someone put this stuff away? Rachel: Who knows? Why don’t you put it away?"
        },
        {
            "id": 110,
            "phrase": "Who’s calling(, please)?",
            "definition": "Who is this making this telephone call? _ Rachel: Yes, Tom is here. Who’s calling, please? Tom: Who is it? Rachel: It’s Fred.  Fred (answering the phone): Hello? Tom: Hello, is Bill there? Fred: Who’s calling, please? Tom: This is Tom Wilson returning his call."
        },
        {
            "id": 111,
            "phrase": "Who’s your friend?",
            "definition": "Sl. Who is that following along behind you? _John: Hi, Tom. Who’s your friend? Tom: Oh, this is my little brother, Willie. John: Hi, Willie.  Looking at the little dog almost glued to Bob’s pants cuff, Sally asked, “Who’s your friend?”"
        },
        {
            "id": 112,
            "phrase": "Who was it?",
            "definition": "Who called on the telephone or who was at the door? (Assumes that the caller is not waiting on the telephone or at the door.) _ Sue (as Mary hangs up the telephone): Who was it? Mary: None of your business.  Bill (as he leaves the door): What a pest! Sue: Who was it? Bill: Some silly survey."
        },
        {
            "id": 113,
            "phrase": "Whoa, Nellie!",
            "definition": "Rur. Wait! Stop! _ Tom: When I get that money, I’m gonna get me my own place, and then you and I can get married, and— Jane: Whoa, Nellie! When did I say I was going to marry you? _ Whoa, Nellie! Did you measure them boards before you started cuttin’ ’em?"
        },
        {
            "id": 114,
            "phrase": "whole bag of tricks",
            "definition": "everything; every possibility, argument, or technique.  Well now. I’ve used my whole bag of tricks, and we still haven’t solved this.  It may take my whole bag of tricks to do it, but I’ll try."
        },
        {
            "id": 115,
            "phrase": "the whole enchilada",
            "definition": "Inf. the whole thing; everything. (From Spanish.) _Nobody, but nobody, ever gets the whole enchilada.  Richard wants the whole enchilada."
        },
        {
            "id": 116,
            "phrase": "the whole kit and caboodle",
            "definition": "Inf. a group of pieces of equipment or belongings. (The word caboodle is used only in this expression.) _ When I bought Bob’s motorhome, I got furniture, refrigerator, and linen—the whole kit and caboodle.  The salesman managed to sell John the whole kit and caboodle."
        },
        {
            "id": 117,
            "phrase": "a (whole) mess of someone or something",
            "definition": "Rur. a lot of someone or something.  We went out on the lake and caught a whole mess of bluegill. I cooked up a mess of chili and had all my friends over to eat it."
        },
        {
            "id": 118,
            "phrase": "a (whole) new ball game",
            "definition": "a completely different situation; something completely different. Now that you’re here, it’s a whole new ball game. With a faster computer, it’s a whole new ball game."
        },
        {
            "id": 119,
            "phrase": "the whole nine yards",
            "definition": "Sl. the entire amount; everything, as far as possible. For you I’ll go the whole nine yards.  You’re worth the whole nine yards."
        },
        {
            "id": 120,
            "phrase": "a whole nother thing",
            "definition": "Rur. a completely different matter. (Often “corrected” to a whole other thing. The word nother is a shortening of another.) _ Borrowing! That’s a whole nother thing! I thought you said stealing!"
        },
        {
            "id": 121,
            "phrase": "the whole shebang",
            "definition": "everything; the whole thing.  Mary’s all set to give a fancy dinner party. She’s got a fine tablecloth, good crystal, and silverware, the whole shebang.  How much do you want for the whole shebang?"
        },
        {
            "id": 122,
            "phrase": "the whole wide world",
            "definition": "everywhere; everywhere and everything.  It’s the best in the whole wide world.  I’ve searched the whole wide world for just the right hat."
        },
        {
            "id": 123,
            "phrase": "the whole works",
            "definition": "everything; the complete amount.  I cashed my paycheck and lost the whole works playing the ponies."
        },
        {
            "id": 124,
            "phrase": "Whom the gods love die young.",
            "definition": "Prov. Virtuous or gifted people die at an early age, because the gods want those people to be with them in the afterlife.  So many brilliant authors and artists died before the age of fifty that it’s easy to believe that whom the gods love die young."
        },
        {
            "id": 125,
            "phrase": "whoop it up",
            "definition": "to celebrate, especially with cheers and whoops. It was a very noisy party. Everyone was whooping it up well past midnight.  The campaign workers whooped it up for their candidate.  I can’t get out there and whoop it up for something I don’t believe in."
        },
        {
            "id": 126,
            "phrase": "why don’t you?",
            "definition": "a question tag that is put onto the end of a command.  Andy: Move aside, why don’t you? Bob: Okay. Sorry. I didn’t know I was in the way.  “Just keep bugging me, why don’t you?” threatened Wally. Andy: Try it again, why don’t you? Sue: I hope I get it right this time."
        },
        {
            "id": 127,
            "phrase": "Why keep a dog and bark yourself?",
            "definition": "Prov. You should not do something you have hired someone else to do.  Ellen: The cleaning lady washes my f loors every Tuesday, but I always wash them over again. Jane: Don’t be silly, Ellen. Why keep a dog and bark yourself ?"
        },
        {
            "id": 128,
            "phrase": "Why not?",
            "definition": "Please explain your negative answer.  Mother: No, you can’t. Mary: Why not? _Sue: Could I have another piece of cake? Mary: No. Sue: Why not? Mary: I want it."
        },
        {
            "id": 129,
            "phrase": "the whys and wherefores of something",
            "definition": "the reasons or causes relating to something. I refuse to discuss the whys and wherefores of my decision. It’s final. Bob doesn’t know the whys and wherefores of his contract. He just knows that it means he will get a lot of money when he finishes the work."
        },
        {
            "id": 130,
            "phrase": "*wide of the mark",
            "definition": "far from the target. (*Typically: be ~; fall ~.) _Tom’s shot was wide of the mark.  The pitch was quite fast but wide of the mark.  The arrow fell wide of the mark."
        },
        {
            "id": 131,
            "phrase": "wide open",
            "definition": "1. as fast as possible; at full throttle.  I was driving along wide open when I became aware of a f lashing red light.  It was wide open and still wouldn’t do better than eighty. 2. [of a town or place] full of crime or corruption; vice-ridden. This town is wide open! _Because the prison is understaffed, it is wide open."
        },
        {
            "id": 132,
            "phrase": "a wide place in the road",
            "definition": "a very small town. The town is little more than a wide place in the road.  We stopped at a wide place in the road called Adamsville."
        },
        {
            "id": 133,
            "phrase": "wig out",
            "definition": "Sl. to become intoxicated.  One more drink and Wally will wig out. This guy has wigged out. Get him out of here."
        },
        {
            "id": 134,
            "phrase": "wiggle out of something",
            "definition": "1. Lit to get out of something or some place; to squirm out of something or some place.  The kitten was able to wiggle out of the cage in which it had been put.  The squirrel wiggled out of the trap we caught it in. 2. Fig. to manage to get out of a job, the blame for something, or a responsibility.  Don’t try to wiggle out of your job! _ You are to blame and don’t try to wiggle out of it!"
        },
        {
            "id": 135,
            "phrase": "wild about someone or something",
            "definition": "very excited about someone or something. I’m just wild about comedies. John is wild about antique cars."
        },
        {
            "id": 136,
            "phrase": "wild and woolly",
            "definition": "Inf. exciting.  Things get a little wild and woolly on a Friday evening at Wally’s place. The ride home was a little wild and woolly."
        },
        {
            "id": 137,
            "phrase": "Wild horses couldn’t drag someone away (from something.)",
            "definition": "Prov. Someone is determined to remain with something.  Once Elaine starts playing a video game, wild horses can’t drag her away from it.  Jim was determined to remain fishing at the lake. Wild horses couldn’t drag him away from it."
        },
        {
            "id": 138,
            "phrase": "a wild-goose chase",
            "definition": "a worthless hunt or chase; a futile pursuit.  I wasted all afternoon on a wild-goose chase.  John was angry because he was sent out on a wild-goose chase."
        },
        {
            "id": 139,
            "phrase": "will be the death of someone or something (yet)",
            "definition": "[the thing named] will be the end or ruin of someone or something.  This job will be the death of me! _ Rough roads will be the death of these tires."
        },
        {
            "id": 140,
            "phrase": "will come of something",
            "definition": "will result from something.  I don’t think that much will come of this.  Nothing at all will come of it."
        },
        {
            "id": 141,
            "phrase": "Will do.",
            "definition": "Inf. I will do it. Will do. I’ll get right on it. Fix the stuck window? Will do."
        },
        {
            "id": 142,
            "phrase": "Will I see you again?",
            "definition": "a question asked toward the end of a date implying that further dating would please the speaker. (This question leaves it open to the other party to confirm that the interest is mutual by requesting a further date. Compare this with Can I see you again?) _ Tom: I had a wonderful time tonight, Mary. Good night. Mary: Will I see you again? Tom: That would be nice. Can I call you tomorrow? _ “Will I see you again?” asked Sally, cautiously and hopefully."
        },
        {
            "id": 143,
            "phrase": "will something away†",
            "definition": "to give something away in a will.  The old man simply willed all his money away. He said he wouldn’t need it when he was dead. She had willed away all of her treasures to her grandchildren."
        },
        {
            "id": 144,
            "phrase": "will stop at nothing",
            "definition": "Cliché will do everything possible (to accomplish something); will be unscrupulous.  Bill would stop at nothing to get his way.  Bob is completely determined to get promoted. He’ll stop at nothing."
        },
        {
            "id": 145,
            "phrase": "wimp out (of something)",
            "definition": "Sl. to chicken out (of something); to get out of something difficult, inconvenient, or dangerous, leaving others to carry the burden.  Come on! Don’t wimp out now that there’s all this work to be done.  Ted wimped out on us."
        },
        {
            "id": 146,
            "phrase": "Win a few, lose a few.",
            "definition": "Sometimes one succeeds, and sometimes one fails.  Tom: Well, I lost out on that Wilson contract, but I got the Jones job. Sally: That’s life. Win a few, lose a few.  “Win a few, lose a few,” said Fred, staring at yesterday’s stock prices."
        },
        {
            "id": 147,
            "phrase": "win at something",
            "definition": "to triumph at some competition.  Will I ever be able to win at golf ? _ She always wins at poker."
        },
        {
            "id": 148,
            "phrase": "win by a nose",
            "definition": "to win by the slightest amount of difference. (Can be literal in horses races.) _I ran the fastest race I could, but I only won by a nose. Sally won the race, but she only won by a nose."
        },
        {
            "id": 149,
            "phrase": "win someone away (from someone or something)",
            "definition": "to convince someone to dissociate from someone or something. We were not able to win Christine away from her strange ideas.  We tried to win her away but failed."
        },
        {
            "id": 150,
            "phrase": "win someone or something back (from someone or something)†",
            "definition": "to regain someone or something from someone or something.  I hope to win the money I lost back from the other poker players.  We were not able to win Sally back from the cult.  We won back everything.  We won back Sally."
        },
        {
            "id": 151,
            "phrase": "win someone over† (to something)",
            "definition": "to succeed in making someone favorable to something. I hope I can win them all over to our side.  I won over the mayor to our side."
        },
        {
            "id": 152,
            "phrase": "win something at something",
            "definition": "to win a prize in some sort of competition.  I won this silly doll at the ring-toss game.  Did you win anything at the fair?"
        },
        {
            "id": 153,
            "phrase": "win through something",
            "definition": "to succeed by a certain method or procedure.  Winning is no good if you have to win through dishonesty.  Sally won through her own hard work."
        },
        {
            "id": 154,
            "phrase": "wince at something",
            "definition": "to shrink back because of something, such as pain.  She winced at the pain but did not cry out. After he had just winced at the pain for a while, he finally screamed."
        },
        {
            "id": 155,
            "phrase": "wind around",
            "definition": "[for something, such as a road] to make a turn or turns around.  The road wound around and ended up at the lake.  The path wound around and came to a stop at the cabin door."
        },
        {
            "id": 156,
            "phrase": "wind around someone or something",
            "definition": "to twist or coil around someone or something.  The python wound around the rabbit, suffocating it.  The vines wound around the gatepost."
        },
        {
            "id": 157,
            "phrase": "wind back",
            "definition": "[for something, such as a road] to turn so that it heads in the direction from whence it came. The road we got lost on wound back and we were not able to reach the lake on time.  When we were lost, we found a stream in the woods, but it wound back and did not lead us in the direction we wanted."
        },
        {
            "id": 158,
            "phrase": "wind down",
            "definition": "to start running or operating slower. Things will begin to wind down at the end of the summer.  As things wind down, life will be a lot easier.  The clock wound down and finally stopped."
        },
        {
            "id": 159,
            "phrase": "wind into something",
            "definition": "to coil up into something.  The snake wound into a tight coil.  The rubber bands wound into a knot and were worthless."
        },
        {
            "id": 160,
            "phrase": "wind someone up",
            "definition": "1. Inf. Fig. to get someone excited.  That kind of music really winds me up! 2. Inf. Fig. to get someone set to do a lot of talking. (Fig. on winding up a clock.) _ The excitement of the day wound Kelly up and she talked almost all night.  A good movie tends to wind me up for a while."
        },
        {
            "id": 161,
            "phrase": "wind something around something",
            "definition": "to twist or coil something around something.  Wind this cloth around your hand to stop the bleeding.  Wind the string around this stick so it won’t get all tangled up."
        },
        {
            "id": 162,
            "phrase": "wind something down†",
            "definition": "to slow something down; to make something less hectic.  Let’s wind this party down and try to get people to go home. It’s really late.  We tried to wind down the party, but it kept running."
        },
        {
            "id": 163,
            "phrase": "wind something in†",
            "definition": "to reel something in.  She wound in the rope that was tied to the anchor.  Liz wound in the cable that raised the awning."
        },
        {
            "id": 164,
            "phrase": "wind something off†",
            "definition": "to unreel or unwind something. He wound the rope off, little by little, until he had as much as he needed.  Karen wound off as much as she needed."
        },
        {
            "id": 165,
            "phrase": "wind something up†",
            "definition": "to tighten the spring in something, such as a watch or a clock. Please wind your watch up now—before it runs down. Wind up your watch before you forget."
        },
        {
            "id": 166,
            "phrase": "wind through something",
            "definition": "[for a pathway] to twist or turn through an area.  The trail wound through the jungle, avoiding the densest places.  A path wound through the woods, leading us to the main road."
        },
        {
            "id": 167,
            "phrase": "wind up (as) something",
            "definition": "to end up as something.  Roger wound up as a millionaire. He thought he would wind up a pauper."
        },
        {
            "id": 168,
            "phrase": "wind up somehow",
            "definition": "to end up in some fashion.  I don’t want to wind up broke and depressed.  You don’t want to wind up like Ted, do you?"
        },
        {
            "id": 169,
            "phrase": "wind up with someone or something",
            "definition": "to end up having someone or something. I don’t want to wind up with all the kids for the weekend. We wound up with Thanksgiving at our house again."
        },
        {
            "id": 170,
            "phrase": "a window of opportunity",
            "definition": "a brief time period in which an opportunity exists.  This afternoon, I had a brief window of opportunity when I could discuss this with the boss, but she wasn’t receptive."
        },
        {
            "id": 171,
            "phrase": "wine and dine someone",
            "definition": "to treat someone to an expensive meal of the type that includes fine wines; to entertain someone lavishly. The lobbyists wined and dined the senators one by one in order to inf luence them.  We were wined and dined every night and given the best hotel accommodations in town."
        },
        {
            "id": 172,
            "phrase": "wing it",
            "definition": "to improvise; to do something extemporaneously. I lost my lecture notes, so I had to wing it. Don’t worry. Just go out there and wing it."
        },
        {
            "id": 173,
            "phrase": "wink at someone",
            "definition": "to close one eye at a person as a sign of friendliness or flirtation. She winked at him and he was shocked.  I hope she winks at me again."
        },
        {
            "id": 174,
            "phrase": "wink at something",
            "definition": "to pretend not to see something; to condone something wrong.  The police officer winked at my failure to make a complete stop. I cannot wink at blatant infractions of the law!"
        },
        {
            "id": 175,
            "phrase": "wink something away†",
            "definition": "to blink the eyes to try to clear them of tears, dirt, etc.  He looked up at me and tried to wink away his tears, but he was just too upset.  Jane winked away her tears."
        },
        {
            "id": 176,
            "phrase": "winner take all",
            "definition": "a situation where the one who defeats others takes all the spoils of the conflict.  The contest was a case of winner take all. There was no second place or runner-up."
        },
        {
            "id": 177,
            "phrase": "winter over (some place)",
            "definition": "to spend the winter at some place.  The bears all winter over in their dens.  All the animals are getting ready either to migrate or to winter over.  My parents winter over in Florida."
        },
        {
            "id": 178,
            "phrase": "Wipe it off!",
            "definition": "Inf. Wipe that smile off your face! _ It’s not funny. Wipe it off! _ Wipe it off! Nothing funny here, soldier."
        },
        {
            "id": 179,
            "phrase": "wipe out",
            "definition": "1. Inf. to crash.  I wiped out on the curve.  The car wiped out on the curve. 2. Inf. to fall off or away from something, such as a bicycle, skates, a surfboard, a skateboard, etc.  I wiped out and skinned my knee.  If I wipe out again, my mother says I’m through. 3. Inf. to fail badly.  The test was terrible! I’m sure I wiped out.  It was a bad test. I wiped out for sure."
        },
        {
            "id": 180,
            "phrase": "wipe someone or something off†",
            "definition": "to clean something off someone or something by wiping.  She wiped the baby off and put clean clothes on him.  Please wipe off your shoes.  John fell in the mud and Sam wiped him off."
        },
        {
            "id": 181,
            "phrase": "wipe someone or something off the face of the earth",
            "definition": "to demolish every trace of someone or something.  A great storm will come and wipe all the people off the face of the earth.  The wind blew my old barn off the face of the earth! Nothing was left."
        },
        {
            "id": 182,
            "phrase": "wipe someone or something (off†) (with something)",
            "definition": "to clean someone or something by wiping with something. Tony wiped the baby off with a soft cloth.  Jane wiped off the counter with a rag.  Tom fell in the mud and asked Ralph to wipe him off."
        },
        {
            "id": 183,
            "phrase": "wipe someone out†",
            "definition": "1. Sl. to kill someone. Max intended to wipe Lefty’s gang out.  Lefty wiped out Max’s gang. 2. Sl. to exhaust or debilitate someone.  The long walk wiped me out.  The trip wiped out the hikers. 3. Inf. to ruin someone financially.  The loss of my job wiped us out. The storm ruined the corn crop and wiped out everyone in the county."
        },
        {
            "id": 184,
            "phrase": "wipe something away†",
            "definition": "to clean or mop something away. Wipe all this mud away and scrub the f loor clean. Jake wiped away the mud."
        },
        {
            "id": 185,
            "phrase": "wipe something down†",
            "definition": "to rub or mop something down.  Wipe the counter down and keep it clean! _ Don will wipe down the counter."
        },
        {
            "id": 186,
            "phrase": "wipe something off†",
            "definition": "1. to remove something (from something else) by wiping or rubbing.  There is mud on your shirt. Please wipe it off. I must wipe off the ketchup from my shirt. 2. to tidy or clean something by wiping (something else) off.  Please wipe the table off. There’s water on it.  Wipe off your shirt. There’s ketchup on it."
        },
        {
            "id": 187,
            "phrase": "wipe something (off†) (on something)",
            "definition": "to remove something by wiping it on something else.  Don’t wipe your feet off on the carpet.  Don’t wipe off your feet on the carpet.  Wipe them on the mat."
        },
        {
            "id": 188,
            "phrase": "wipe something off (one’s face)",
            "definition": "to remove something, such as food or dirt, from one’s own face.  Wipe that peanut butter off your face!"
        },
        {
            "id": 189,
            "phrase": "wipe something out†",
            "definition": "Sl. to use up all of something.  I wiped the cookies out—not all at once, of course.  Who wiped out the strawberry preserves?"
        },
        {
            "id": 190,
            "phrase": "wipe something up†",
            "definition": "1. to clean something up by wiping. Please wipe that spilled milk up. Jim wiped up the spill. 2. to clean something dirty by wiping.  The f loor was sticky so I wiped it up.  Please wipe up the countertop."
        },
        {
            "id": 191,
            "phrase": "wipe the floor up† with someone",
            "definition": "Inf. to beat or physically abuse someone. (Usually said as a threat.) _You say that to me one more time, and I’ll wipe the f loor up with you. Oh, yeah! You’re not big enough to wipe up the f loor with anybody!"
        },
        {
            "id": 192,
            "phrase": "wire ahead (for something)",
            "definition": "to send a telegram to one’s destination, requesting something to be available upon one’s arrival.  I wired ahead for a room. I hope that they still have one by the time we get to the hotel.  We wired ahead for reservations."
        },
        {
            "id": 193,
            "phrase": "wire for something",
            "definition": "to send for something by telegram.  I wired for money, but it hasn’t come yet.  I will have to wire for further advice."
        },
        {
            "id": 194,
            "phrase": "wire someone or something for something",
            "definition": "to send a telegram to someone or something requesting something. I wired my father for some money. I’m sure he’ll send it, officer.  Sarah wired the supplier for a replacement part."
        },
        {
            "id": 195,
            "phrase": "wire something back to someone",
            "definition": "to send something, such as a reply or money, back to someone by telegram.  Please wire your answer back to me by tomorrow.  The reply wasn’t wired back in time."
        },
        {
            "id": 196,
            "phrase": "wire something in†",
            "definition": "to send something into a central point by telegram.  I can’t mail my story to my editor in time, so I will have to wire it in.  I’ve got to wire in this story."
        },
        {
            "id": 197,
            "phrase": "wire something together",
            "definition": "to bind the pieces of something together with wire; to bind things together with wire.  I wired the car’s exhaust pipe together, hoping to get a few more miles out of it. I will wire it together to keep it from dragging on the roadway."
        },
        {
            "id": 198,
            "phrase": "wire something up†",
            "definition": "1. to repair or reattach something with wire, especially something electrical. I will wire this light fixture up and it will work like new.  As soon as I wire up this again, it will work very well. 2. to attach something to a high place with wire. We wired the satellite dish up to the side of the chimney.  We wired up the antenna to the chimney."
        },
        {
            "id": 199,
            "phrase": "wired into someone or something",
            "definition": "Sl. closely concerned with someone or something; really involved with someone or something.  Mary is really wired into classical music.  Sam and Martha are totally wired into one another."
        },
        {
            "id": 200,
            "phrase": "wise someone up (about someone or something)",
            "definition": "Inf. to instruct someone about something; to give someone important information.  Let me wise you up about the way we do things around here. I will do what I can to wise her up."
        },
        {
            "id": 201,
            "phrase": "*wise to someone or something",
            "definition": "fully aware of someone or something. (*Typically: be ~; get ~; put someone ~.) _ The cops are wise to the plan."
        },
        {
            "id": 202,
            "phrase": "wise up (to someone or something)",
            "definition": "to (finally) begin to understand someone or something; to realize and accept the facts about someone or something. (Also as a command.) _ Sally finally wised up to Richard.  Come on, Sally! Wise up!"
        },
        {
            "id": 203,
            "phrase": "wish for someone or something",
            "definition": "to wish to have someone or something.  She spent most of her life wishing for Prince Charming, who would come along and sweep her off her feet.  She still wishes for escape."
        },
        {
            "id": 204,
            "phrase": "The wish is father to the thought.",
            "definition": "Prov. People sometimes come to believe something that they wish were true.  Jane hoped that her boss would resign, and the wish was father to the thought. Soon she had told everyone in the office that she was sure her boss was leaving."
        },
        {
            "id": 205,
            "phrase": "wish list",
            "definition": "a list of things one wishes to have.  I put a new car at the top of my wish list. I have a DVD player on my wish list."
        },
        {
            "id": 206,
            "phrase": "wish someone or something away†",
            "definition": "to wish that someone or something would go away.  You can’t just wish him away. You’ll have to ask him to leave! _ Don’t try to wish away the difficulties of your life."
        },
        {
            "id": 207,
            "phrase": "wish someone or something (off†) on someone",
            "definition": "to foist someone or something off on someone else.  I would never wish my uncle off on you, even for an hour.  I wouldn’t wish off my cousin Roger on anyone. I wouldn’t wish this matter on you."
        },
        {
            "id": 208,
            "phrase": "wishful thinking",
            "definition": "believing that something is true or that something will happen just because one wishes that it were true or would happen.  Hoping for a car as a birthday present is just wishful thinking. Your parents can’t afford it. Mary thinks that she is going to get a big raise, but that’s wishful thinking. Her boss is so tight with money."
        },
        {
            "id": 209,
            "phrase": "with a heavy heart",
            "definition": "Cliché sadly.  With a heavy heart, she said good-bye. We left our summer cottage on the last day with a heavy heart."
        },
        {
            "id": 210,
            "phrase": "with a vengeance",
            "definition": "Cliché with determination and eagerness.  The angry soldier attacked the enemy with a vengeance.  Bill ate all his dinner and gobbled up his dessert with a vengeance."
        },
        {
            "id": 211,
            "phrase": "with a will",
            "definition": "with determination and enthusiasm.  The children worked with a will to finish the project on time.  The workers set about manufacturing the new products with a will."
        },
        {
            "id": 212,
            "phrase": "with all one’s heart (and soul)",
            "definition": "Cliché very sincerely.  Oh, Bill, I love you with all my heart and soul, and I always will! _ She thanked us with all her heart and soul for the gift."
        },
        {
            "id": 213,
            "phrase": "with all the fixin(g)s",
            "definition": "Rur. with all the condiments or other dishes that accompany a certain kind of food. For $12.99 you get a turkey dinner with all the fixings.  Max likes his hamburgers with all the fixin’s."
        },
        {
            "id": 214,
            "phrase": "with all the trimmings",
            "definition": "with all the extra things, especially with food.  We had a lovely Thanksgiving dinner with all the trimmings. I look forward to roast turkey with all the trimmings."
        },
        {
            "id": 215,
            "phrase": "with bated breath",
            "definition": "Cliché while holding one’s breath.  We stood there with bated breath while the man hung on the side of the bridge.  They listened with bated breath for the announcement about the winner."
        },
        {
            "id": 216,
            "phrase": "with bells on (one’s toes)",
            "definition": "eagerly, willingly, and on time. Oh, yes! I’ll meet you at the restaurant. I’ll be there with bells on.  All the smiling children were there waiting for me with bells on their toes."
        },
        {
            "id": 217,
            "phrase": "*with child",
            "definition": "Euph. pregnant. (Biblical. *Typically: be ~; get a woman ~.) _The first thing he did after he got married was to get his wife with child. She deliberately set out to get herself with child, as they say."
        },
        {
            "id": 218,
            "phrase": "with each passing day",
            "definition": "as days pass, one by one; day by day.  Things grow more expensive with each passing day.  We are all growing older with each passing day."
        },
        {
            "id": 219,
            "phrase": "with ease",
            "definition": "without effort.  The smart student passed the test with ease.  The gymnast did a back f lip with ease."
        },
        {
            "id": 220,
            "phrase": "with every (other) breath",
            "definition": "[saying something] repeatedly or continually.  Bob was out in the yard, raking leaves and cursing with every other breath.  The child was so grateful that she was thanking me with every breath."
        },
        {
            "id": 221,
            "phrase": "with everything (on it)",
            "definition": "[of a sandwich] ordered with everything available on it, such as ketchup, mustard, onions, cheese, peppers, chili, lettuce, tomato, etc., as appropriate.  Do you want it with everything? _ Give me a cheeseburger with everything on it."
        },
        {
            "id": 222,
            "phrase": "with flying colors",
            "definition": "Cliché easily and excellently.  John passed his geometry test with f lying colors.  Sally qualified for the race with f lying colors."
        },
        {
            "id": 223,
            "phrase": "(with) hat in hand",
            "definition": "with humility. (Fig. on the image of someone standing, respectfully, in front of a powerful person, asking for a favor.) _ She stormed off but came back with hat in hand when she ran out of money.  We had to go hat in hand to the committee to get a grant for our proposal."
        },
        {
            "id": 224,
            "phrase": "with impunity",
            "definition": "without risk of punishment; with immunity from the negative consequences of an act; while being exempt from punishment.  The diplomat parked in illegal parking spaces with impunity.  Bob used his brother’s property with impunity."
        },
        {
            "id": 225,
            "phrase": "with it",
            "definition": "1. Inf. alert and knowledgeable.  Jane isn’t making any sense. She’s not really with it tonight.  Jean’s mother is not really with it anymore. She’s going senile.  Peter’s not with it yet. He’s only just come round from the anesthetic. 2. Inf. up-to-date. My parents are so old-fashioned. I’m sure they were never with it. Why do you wear those baggy old clothes? Why aren’t you with it?"
        },
        {
            "id": 226,
            "phrase": "with my blessing",
            "definition": "a phrase expressing consent or agreement; yes. Bob: Can I take this old coat down to the rummage sale? Sue: With my blessing.  Mary: Shall I drive Uncle Tom to the airport a few hours early? Sue: Oh, yes! With my blessing!"
        },
        {
            "id": 227,
            "phrase": "with (one’s) eyes (wide) open",
            "definition": "totally aware of what is going on. I went into this with my eyes open. We all started with eyes open but didn’t realize what could happen to us."
        },
        {
            "id": 228,
            "phrase": "with one’s tail between one’s legs",
            "definition": "appearing frightened or cowardly. (Fig. on the image of a frightened or defeated dog going off threatened or humiliated.) _John seems to lack courage. When people criticize him unjustly, he just goes away with his tail between his legs and doesn’t tell them that they’re wrong. The frightened dog ran away with its tail between its legs when the bigger dog growled."
        },
        {
            "id": 229,
            "phrase": "With or without?",
            "definition": "Do you wish your tea or coffee to be with or without sugar or with or without milk? _ How do you like your tea? With or without? _Do you drink your coffee with or without?"
        },
        {
            "id": 230,
            "phrase": "With pleasure.",
            "definition": "a phrase indicating eager consent to do something. Fred: Would you please take this note over to the woman in the red dress? Waiter: With pleasure, sir.  Sue: Would you kindly bring in the champagne now? Jane: With pleasure."
        },
        {
            "id": 231,
            "phrase": "with relish",
            "definition": "with pleasure or enjoyment. John put on this new coat with great relish.  We accepted the offer to use their beach house with relish."
        },
        {
            "id": 232,
            "phrase": "with respect to someone or something",
            "definition": "of or about someone or something. With respect to radiation, this power plant is very safe. This article examines experiments with respect to ethical issues."
        },
        {
            "id": 233,
            "phrase": "with someone or something for some time",
            "definition": "employed by or associated with someone or something for a period of time. I’ve been with the company for nearly ten years.  Lily has been with Max for years."
        },
        {
            "id": 234,
            "phrase": "with the best will in the world",
            "definition": "however much one wishes to do something or however hard one tries to do something. With the best will in the world, Jack won’t be able to help Mary get the job.  With the best will in the world, they won’t finish the job in time."
        },
        {
            "id": 235,
            "phrase": "with the naked eye",
            "definition": "with eyes that are not aided by telescopes, microscopes, or binoculars.  The moon is quite visible with the naked eye.  Bacteria are too small to be seen with the naked eye."
        },
        {
            "id": 236,
            "phrase": "With whom do you wish to speak?",
            "definition": "a polite phrase used by people who answer the telephone to find out whom the caller wants to speak to. (Compare this with Who do you want to talk to?) _ John answered the telephone and then said, “With whom do you wish to speak?” _ Tom (answering the phone): Good morning, Acme Air Products. With whom do you wish to speak? Sue: Sorry, I have the wrong number. Tom: That’s perfectly all right. Have a nice day."
        },
        {
            "id": 237,
            "phrase": "withdraw from something",
            "definition": "1. to depart from something physically.  I withdrew from the smoky room and ran to the open window to get some air.  I withdrew from the unpleasant-looking cafe and looked for something more to my liking. 2. to end one’s association with someone or something.  I decided to withdraw from all my professional organizations.  I had to withdraw from the association because the dues had become too high."
        },
        {
            "id": 238,
            "phrase": "withdraw into oneself",
            "definition": "to become introverted; to concern oneself with one’s inner thoughts.  After a few years of being ignored, she withdrew into herself.  I have to struggle to keep from withdrawing into myself."
        },
        {
            "id": 239,
            "phrase": "withdraw into something",
            "definition": "to pull back into something.  The turtle withdrew into its shell.  The mouse withdrew into its hole."
        },
        {
            "id": 240,
            "phrase": "withdraw someone from something",
            "definition": "1. to pull someone out of something physically. She withdrew the child from the water just in time.  I had to withdraw my child from the kindergarten room. He was having such a good time, he wouldn’t leave on his own. 2. to remove someone from an organization or a nomination. The committee withdrew John from nomination and put up someone else.  I withdrew my son from kindergarten."
        },
        {
            "id": 241,
            "phrase": "withdraw something from someone or something",
            "definition": "to pull something out of someone or something. She withdrew the book from the stack. I withdrew the splinter from Dave carefully."
        },
        {
            "id": 242,
            "phrase": "withdraw something into something",
            "definition": "to pull something back into something.  The turtle withdrew its head into its shell.  It then withdrew its feet into the shell also."
        },
        {
            "id": 243,
            "phrase": "wither away",
            "definition": "to shrivel up; to shrink up. Soon, the wart withered away.  Many of our roses withered away in the hot sun."
        },
        {
            "id": 244,
            "phrase": "wither up",
            "definition": "to shrivel up.  It was so hot that the leaves of the trees withered up."
        },
        {
            "id": 245,
            "phrase": "withhold something from someone or an animal",
            "definition": "to hold something back or in reserve from someone or an animal.  We withheld some of the food from the guests.  I had to withhold some food from the dog so there would be enough for tomorrow."
        },
        {
            "id": 246,
            "phrase": "within an inch of one’s life",
            "definition": "very close to losing one’s life; almost to death.  The accident frightened me within an inch of my life.  When Mary was seriously ill in the hospital, she came within an inch of her life."
        },
        {
            "id": 247,
            "phrase": "*within earshot (of something)",
            "definition": "close enough to something to hear it. (*Typically: be ~; come ~; get ~; move ~.) _ As soon as I got within earshot of the music, I decided that I really didn’t belong there."
        },
        {
            "id": 248,
            "phrase": "*within one’s grasp",
            "definition": "where one can grasp something with one’s hand. (*Typically: be ~; get ~; get something ~.) _The rope was within his grasp, but he was too weak to reach for it."
        },
        {
            "id": 249,
            "phrase": "*within one’s rights",
            "definition": "acting legally in one’s own interest. (*Typically: be ~; act ~.) _ I know I am within my rights when I make this request.  You are not within your rights!"
        }
    ]
}