{
    "dictionary": [
        {
            "id": 0,
            "phrase": "get laid",
            "definition": "to have sexual intercourse. (Use caution.) _ Tommy wanted nothing more out of life than to get laid."
        },
        {
            "id": 1,
            "phrase": "get lost",
            "definition": "1. to become lost; to lose one’s way. We got lost on the way home.  Follow the path, or you might get lost. 2. Inf. Go away!; Stop being an annoyance! (Always a command.) _ Stop bothering me. Get lost! _ Get lost! I don’t need your help."
        },
        {
            "id": 2,
            "phrase": "get mad (at something)",
            "definition": "to muster all one’s physical and mental resources in order to do something difficult.  Come on, Bill. If you’re going to lift your end of the piano, you’re going to have to get mad at it.  The sergeant keeps yelling, “Work, work! Push, push! Come on, you guys, get mad!”"
        },
        {
            "id": 3,
            "phrase": "get married",
            "definition": "to become united as husband and wife. Bill and Sally got married when they were in college.  We got married in Texas just after we graduated from college."
        },
        {
            "id": 4,
            "phrase": "get moving",
            "definition": "to get busy; to get started; to work harder or faster.  Come on, everybody. Get moving! _ The director is coming. You had better get moving."
        },
        {
            "id": 5,
            "phrase": "get nowhere fast",
            "definition": "not to make progress; to get nowhere.  I can’t seem to make any progress. No matter what I do, I’m just getting nowhere fast.  Come on. Speed up this car. We’re getting nowhere fast."
        },
        {
            "id": 6,
            "phrase": "get off",
            "definition": "1. to start off (on a friendship).  Tom and Bill had never met before. They seemed to get off all right, though.  I’m glad they got off so well. 2. to leave; to depart.  What time did they get off ? _We have to get off early in the morning before the traffic gets heavy. "
        },
        {
            "id": 7,
            "phrase": "get off a few good ones",
            "definition": "to tell a few good jokes; to land a few good punches; to manage to make a few strong criticisms. The comedian managed to get off a few good ones, but most of his material was old or obscene."
        },
        {
            "id": 8,
            "phrase": "Get off it!",
            "definition": "1. Inf. Stop acting so arrogant! _ Get off it, you jerk! _Get off it! That’s too much! 2. Inf. You’re lying! _ Get off it, you liar! _ Get off it! That can’t be true."
        },
        {
            "id": 9,
            "phrase": "Get off my back!",
            "definition": "Inf. Stop harassing me!; Leave me alone about this matter! _Tom: You’d better get your paper written. Bill: I’ll do it when I’m good and ready. Get off my back! _ Alice: I’m tired of your constant criticism! Get off my back! Jane: I was just trying to help."
        },
        {
            "id": 10,
            "phrase": "get off someone’s tail",
            "definition": "1. Fig. to stop following someone closely, usually in an automobile.  Get off my tail! Keep your distance! _I wish that car behind me would get off my tail. 2. Fig. to stop bothering someone; to stop monitoring someone’s actions.  Get off my tail! I can manage without you.  Who needs your help? Get off my tail!"
        },
        {
            "id": 11,
            "phrase": "get off (something)",
            "definition": "to climb down from something.  Please get off the stairs. You know you shouldn’t play on the stairs.  I wish that the children would get off that ladder before they fall off."
        },
        {
            "id": 12,
            "phrase": "get off the dime",
            "definition": "Sl. to start moving; to get out of a stopped position.  Why don’t you get off the dime and complete some of these projects that you started? _As soon as the board of directors gets off the dime on this proposal, we will have some action."
        },
        {
            "id": 13,
            "phrase": "get off to sleep",
            "definition": "to manage to get to sleep finally. About midnight everyone finally got off to sleep.  I wasn’t able to get off to sleep until dawn."
        },
        {
            "id": 14,
            "phrase": "get off (to something)",
            "definition": "to leave for something. I’ve got to get off to my violin lesson.  We have to get off to the hospital immediately!"
        },
        {
            "id": 15,
            "phrase": "get off (with something)",
            "definition": "to receive only a light punishment for something. Let’s hope John gets off with a light sentence.  Max got off with only a few years in prison."
        },
        {
            "id": 16,
            "phrase": "get on one’s horse",
            "definition": "Sl. to prepare to leave. (Usually fig., with no horse present.) _ It’s time to get on my horse and get out of here.  I’ve got to get on my horse and go."
        },
        {
            "id": 17,
            "phrase": "get on with something",
            "definition": "to continue doing something.  Let’s get on with the game! _ We need to get on with our lives."
        },
        {
            "id": 18,
            "phrase": "get one right here",
            "definition": "to affect one deeply in a specific way. (Usually accompanied with a hand gesture showing exactly where one is affected: the heart = lovingly, the stomach or bowels = sickeningly.) _That sort of thing gets me right here. Pete clasped his hand to his chest and said, “That sort of thing gets me right here.”"
        },
        {
            "id": 19,
            "phrase": "get one’s act together",
            "definition": "to get oneself organized and on schedule. I’ve got to get my act together and start getting my work done. When I have my act together, I’ll get a job."
        },
        {
            "id": 20,
            "phrase": "get one’s bowels in an uproar",
            "definition": "Sl. to get oneself anxious or excited. (Normally fig.) _ Cool it! Don’t get your bowels in an uproar.  Fred’s always getting his bowels in an uproar about nothing."
        },
        {
            "id": 21,
            "phrase": "get one’s comeuppance",
            "definition": "to get a deserved punishment.  I can’t wait till that snobbish girl gets her comeuppance.  Joe got his comeuppance when the teacher caught him making fun of her."
        },
        {
            "id": 22,
            "phrase": "get one’s ducks in a row",
            "definition": "to get one’s affairs in order or organized.  Jane is organized. She really gets all her ducks in a row right away.  You can’t hope to go into a company and sell something until you get your ducks in a row."
        },
        {
            "id": 23,
            "phrase": "get one’s ears pinned back",
            "definition": "to experience a severe scolding.  Jimmy was ordered to report to the principal’s office and got his ears pinned back."
        },
        {
            "id": 24,
            "phrase": "get one’s feet wet",
            "definition": "to get a little first-time experience with something. (Obvious literal possibilities.) _ Of course he can’t do the job right. He’s hardly got his feet wet yet.  I’m looking forward to learning to drive. I can’t wait to get behind the steering wheel and get my feet wet."
        },
        {
            "id": 25,
            "phrase": "get one’s fingers burned",
            "definition": "to receive harm or punishment for one’s actions. (Normally fig.) _I had my fingers burned the last time I questioned the company policy. I tried that once before and got my fingers burned. I won’t try it again."
        },
        {
            "id": 26,
            "phrase": "get one’s foot in the door",
            "definition": "to complete the first step in a process. (Alludes to people selling things from doorto- door and blocking the door with a foot so it cannot be closed on them.) _I think I could get the job if I could only get my foot in the door. It pays to get your foot in the door. Try to get an appointment with the boss."
        },
        {
            "id": 27,
            "phrase": "get one’s head together",
            "definition": "to get one’s thoughts or attitude properly organized. I’ve got to get my head together and get going.  I need to take some time off and get my head together."
        },
        {
            "id": 28,
            "phrase": "get one’s kicks (from someone or something)",
            "definition": "Inf. to get pleasure from someone or something.  Do you get your kicks from this sort of thing? _ I get my kicks from Billy Simpson. What a great entertainer!"
        },
        {
            "id": 29,
            "phrase": "get one’s knuckles rapped",
            "definition": "to get one’s knuckles struck with a ruler as a punishment.  I got my knuckles rapped for whispering too much.  You will have your knuckles rapped if you are not careful."
        },
        {
            "id": 30,
            "phrase": "get one’s lumps",
            "definition": "Inf. to get the result or punishment one deserves.  If she keeps acting that way, she’ll get her lumps.  We will see that Dave gets his lumps."
        },
        {
            "id": 31,
            "phrase": "get one’s nose out of someone’s business",
            "definition": "to stop interfering in someone else’s business; to mind one’s own business.  Go away! Get your nose out of my business! _ Bob just can’t seem to get his nose out of other people’s business."
        },
        {
            "id": 32,
            "phrase": "get one’s rocks off (on something)",
            "definition": "1. Sl. [for a male] to ejaculate. (Considered coarse.) Boys normally don’t talk about getting their rocks off. 2. Sl. to enjoy something. (Fixed order.) _ I really get my rocks off on heavy metal.  I’ve listened to the stuff, but I sure don’t get my rocks off on it."
        },
        {
            "id": 33,
            "phrase": "get one’s ticket punched",
            "definition": "Sl. to die; to be killed. (Literally, to be cancelled.) _ Poor Chuck got his ticket punched while he was waiting for a bus. Watch out there, or you’ll get your ticket punched."
        },
        {
            "id": 34,
            "phrase": "get (oneself) into a stew (over someone or something)",
            "definition": "to be worried or upset about someone or something.  Please don’t get yourself into a stew over Walter. Liz is the kind of person who gets into a stew over little problems."
        },
        {
            "id": 35,
            "phrase": "get out",
            "definition": "1. [for someone or an animal] to depart to the outside or to escape.  When did your dog get out and run away? _ When did he get out of jail? 2. [for information or a secret] to become publicly known.  We don’t want the secret to get out.  The word soon got out that he had a prison record."
        },
        {
            "id": 36,
            "phrase": "get out of a jam",
            "definition": "to get free from a problem or a bad situation. Would you lend me five hundred dollars? I need it to get out of a jam.  I need some help getting out of a jam."
        },
        {
            "id": 37,
            "phrase": "get out of a mess",
            "definition": "to get free of a bad situation. (Also with this, such a, etc.) _How can anyone get out of a mess like this? _ Please help me get out of this mess!"
        },
        {
            "id": 38,
            "phrase": "Get out (of here)!",
            "definition": "Go away!; Leave this place! _ John: I’ve heard enough of this! Get out of here! Bill: I’m going! I’m going! _ Where have you been? You smell like a sewer! Get out of here!"
        },
        {
            "id": 39,
            "phrase": "Get out of my sight!",
            "definition": "Go away immediately! (Usually said in anger.) _ Get out of my sight! _ Please get out of my sight forever!"
        },
        {
            "id": 40,
            "phrase": "get out of one’s face",
            "definition": "Inf. to stop bothering or intimidating someone.  Look, get out of my face, or I’ll poke you in yours! _He told you to get out of his face, you creep!"
        },
        {
            "id": 41,
            "phrase": "get out of someone’s hair",
            "definition": "Inf. to stop annoying someone.  Will you get out of my hair! You are a real pain!"
        },
        {
            "id": 42,
            "phrase": "Get out of town!",
            "definition": "Beat it!; Get out of here! _ Go away, you bother me! Get out of town! _ You’d better get out of town, my friend. You are a pest."
        },
        {
            "id": 43,
            "phrase": "Get out with it!",
            "definition": "Get it said! _ Stop stuttering around! Get out with it! _ Get out with it! I don’t have all day to wait for you!"
        },
        {
            "id": 44,
            "phrase": "get out with one’s life",
            "definition": "to survive a serious or lifethreatening incident or an accident without dying.  We were lucky to get out with our lives."
        },
        {
            "id": 45,
            "phrase": "Get over it!",
            "definition": "Forget about it and be done with it! (Said to someone who is fretting and stewing over some kind of problem.) _ Forget about her. She’s gone. Get over it!"
        },
        {
            "id": 46,
            "phrase": "get over someone or something",
            "definition": "to move or climb over someone or something.  I managed to get over the sand dunes and moved on toward the shoreline.  I couldn’t get over the huge rock in the path, so I went around it."
        },
        {
            "id": 47,
            "phrase": "get over something",
            "definition": "to recover from a disease. It took a long time to get over the f lu.  I thought I would never get over the mumps."
        },
        {
            "id": 48,
            "phrase": "get over (to some place)",
            "definition": "1. to go to some place.  I have to get over to Molly’s place and pick up some papers.  Go ahead and start without me. I’ll get over as soon as I can. 2. to cross over something to get somewhere. I want to get over to the other side.  I can’t find a way to get over!"
        },
        {
            "id": 49,
            "phrase": "get past (someone or something)",
            "definition": "1. to move around or ahead of someone or something that is in the way.  We have to get past the cart that is blocking the hallway.  We just couldn’t get past. 2. to pass ahead of someone or something that is moving.  I want to get past this truck, then we can get into the right lane.  When we get past, I’ll stop and let you drive."
        },
        {
            "id": 50,
            "phrase": "Get real!",
            "definition": "Inf. Start acting realistically! _ Hey, chum! You are way off base! Get real! _ Get real! Wake up to reality!"
        },
        {
            "id": 51,
            "phrase": "get religion",
            "definition": "to become serious (about something), usually after a powerful experience. (Sometimes literal.) _When I had an automobile accident, I really got religion. Now I’m a very safe driver."
        },
        {
            "id": 52,
            "phrase": "get right on something",
            "definition": "to do something immediately.  I know it has to be done today. I’ll get right on it.  Please get right on these reports as soon as possible."
        },
        {
            "id": 53,
            "phrase": "get rolling",
            "definition": "to get started. Come on. It’s time to leave. Let’s get rolling! _ Bill, it’s 6:30. Time to get up and get rolling!"
        },
        {
            "id": 54,
            "phrase": "get screwed",
            "definition": "1. Sl. to have sexual intercourse. (Considered a crude usage.) _ A lot of the college kids on spring break in Florida do nothing but get drunk and get screwed. 2. Sl. to get cheated. I really got screwed on that last deal."
        },
        {
            "id": 55,
            "phrase": "Get serious!",
            "definition": "Inf. Get realistic!; Stop horsing around! _ Oh, come on! Get serious! You don’t really mean that!"
        },
        {
            "id": 56,
            "phrase": "get smart (with someone)",
            "definition": "to become fresh with someone; to talk back to someone.  Don’t you get smart with me! _ If you get smart again, I’ll bop you."
        },
        {
            "id": 57,
            "phrase": "get some kind of mileage out of something",
            "definition": "to achieve some level of efficiency with a vehicle. (Some kind of typically includes more, better, good, etc.) _ Do you get good mileage out of a vehicle like this."
        },
        {
            "id": 58,
            "phrase": "get (some) steam up†",
            "definition": "[for a steam engine] to build up steam pressure and become more powerful.  As the engine got up steam, it began to move faster."
        },
        {
            "id": 59,
            "phrase": "get some weight off one’s feet",
            "definition": "to sit down. Come in and get some weight off your feet.  I need to sit down and get some weight off my feet."
        },
        {
            "id": 60,
            "phrase": "get someone (all) wrong",
            "definition": "to misunderstand someone’s intentions or character.  I think you’ve got me all wrong. I want to be your friend, not your enemy."
        },
        {
            "id": 61,
            "phrase": "get someone around the table",
            "definition": "to collect people together for discussion or bargaining.  We have to get everyone around the table on this matter. If I can get them around the table, I’m sure I can make them agree."
        },
        {
            "id": 62,
            "phrase": "get someone down",
            "definition": "to depress a person; to make a person very sad.  My dog ran away, and it really got me down.  Oh, that’s too bad. Don’t let it get you down."
        },
        {
            "id": 63,
            "phrase": "get someone going",
            "definition": "to get someone excited; to get someone talking excitedly. I guess I really got him going on the subject of politics. The whole business really makes me mad. Don’t get me going."
        },
        {
            "id": 64,
            "phrase": "get someone off",
            "definition": "1. to get someone cleared of a criminal charge.  Ted’s lawyer got him off, although we all knew he was guilty. I hope someone can get her off. She is innocent no matter how it looks. 2. to get someone freed from a responsibility.  I think I can get you off.  What do I need to do to get myself off ?"
        },
        {
            "id": 65,
            "phrase": "get someone or something away from someone or something",
            "definition": "to take someone or something away from someone or something, in any combination.  Please get that cigar away from me! _ See if you can get Timmy away from the horse."
        },
        {
            "id": 66,
            "phrase": "get someone or something back†",
            "definition": "to receive someone or something back; to recover someone who had been taken away; to recover something that had been taken away.  Beth finally got her car back from the service station. She got back her car."
        },
        {
            "id": 67,
            "phrase": "get someone or something down† (from something)",
            "definition": "to bring someone or something down from a higher place.  See if you can get my cat down from the tree. Please get down the sugar from the top shelf."
        },
        {
            "id": 68,
            "phrase": "get someone or something free (from someone or something)",
            "definition": "to liberate someone or something from someone or something.  We finally got cousin George free from the talkative old man.  We managed to get the animal’s paw free from the trap."
        },
        {
            "id": 69,
            "phrase": "get someone or something out of one’s sight",
            "definition": "to remove someone or something from one’s presence. (Often said in anger.) _ Get that child out of my sight! _ Please get that cake out of my sight."
        },
        {
            "id": 70,
            "phrase": "get someone or something through (to someone or something)",
            "definition": "to manage to get someone or something transported or connected to someone or something.  I hope I can get her through to her hometown in Italy.  Do you think I can get this parcel through to Istanbul?"
        },
        {
            "id": 71,
            "phrase": "get someone or something together",
            "definition": "to gather people or things together. Let’s see if we can get both sides together and discuss this.  I want to get Tom and Sharon together for a conference."
        },
        {
            "id": 72,
            "phrase": "get someone out of a jam",
            "definition": "to get someone out of trouble.  Thanks for getting my brother out of that jam.  How am I going to get myself out of this jam?"
        },
        {
            "id": 73,
            "phrase": "get someone out of one’s hair",
            "definition": "Inf. to cause someone to stop annoying oneself. What do I have to do to get this guy out of my hair."
        },
        {
            "id": 74,
            "phrase": "get someone’s blood up",
            "definition": "to get someone or oneself angry. (Fixed order.) _ That kind of language really gets my blood up.  That will really get his blood up!"
        },
        {
            "id": 75,
            "phrase": "get someone’s drift",
            "definition": "to understand what someone is saying or implying. (Akin to if you get my drift.) _ I don’t want to hear anymore about her or you. Do you get my drift?"
        },
        {
            "id": 76,
            "phrase": "get someone’s goat",
            "definition": "to irritate someone; to annoy and arouse someone to anger. I’m sorry. I didn’t mean to get your goat.  Jean got Sally’s goat and Sally made quite a fuss about it."
        },
        {
            "id": 77,
            "phrase": "get someone through (to someone or something)",
            "definition": "to manage to get something to someone or some place.  Can I get a message through to Rome? _ I hope Bob can get word through to his cousin."
        },
        {
            "id": 78,
            "phrase": "get someone up (for something)",
            "definition": "to get someone into peak condition for something; to prepare someone for something. I hope we can get Walter up for the race. Sharon was not quite prepared for the race, and the trainer did everything possible to get her up."
        },
        {
            "id": 79,
            "phrase": "get something down†",
            "definition": "to manage to swallow something, especially something large or unpleasant.  The pill was huge, but I got it down.  I get down all the pills despite their size.  It was the worst food I have ever had, but I got it down somehow. "
        },
        {
            "id": 80,
            "phrase": "get something for an amount of money",
            "definition": "to buy something for a certain amount of money.  I got my car for only $1500.  She got her dinner for a song."
        },
        {
            "id": 81,
            "phrase": "get something for someone",
            "definition": "to obtain something for the use or benefit of someone.  I will get a new book for you. Sorry I messed the old one up.  Would you get a glass of water for me?"
        },
        {
            "id": 82,
            "phrase": "get something for something",
            "definition": "to obtain a part or attachment for an object. I need to get a part for the vacuum cleaner.  Would you please get a bulb for my f lashlight?"
        },
        {
            "id": 83,
            "phrase": "get something from someone or something",
            "definition": "1. to receive something from someone or something.  I got this belt from my aunt for my birthday. I got a letter from the bank about the loan we applied for. 2. to contract a disease from someone or something.  I got chicken pox from my son.  I probably got my cold from walking in the rain."
        },
        {
            "id": 84,
            "phrase": "get something going with someone",
            "definition": "to start a romance or affair with someone.  Todd got something going with Amy, and they both look pretty happy. I want to get something going with Chuck."
        },
        {
            "id": 85,
            "phrase": "get something home to someone or something",
            "definition": "to carry something home [quickly] to someone or something.  I have to get this pizza home to my parents before it gets cold.  Please get this ice cream home to the refrigerator."
        },
        {
            "id": 86,
            "phrase": "get something into a mess",
            "definition": "to cause something to become messy or untidy; to cause something to become unmanageable.  When he made the spaghetti sauce, he got the kitchen into a real mess. You have got these accounts into a mess!"
        },
        {
            "id": 87,
            "phrase": "get something off one’s chest",
            "definition": "to unburden oneself; to confess something; to criticize or make a personal complaint to someone. You will feel better if you get it off your chest.  I have to get this off my chest. I’m tired of your rudeness to me!"
        },
        {
            "id": 88,
            "phrase": "get something off the ground",
            "definition": "to get something into the air.  I’ll announce the weather to the passengers as soon as we get the plane off the ground. I hope they get this plane off the ground soon."
        },
        {
            "id": 89,
            "phrase": "get something out†",
            "definition": "to remove or extricate something. Please help me get this splinter out. Would you help me get out this splinter? _ The tooth was gotten out without much difficulty."
        },
        {
            "id": 90,
            "phrase": "get something out of one’s system",
            "definition": "to get something like food or medicine out of one’s body, usually through natural elimination.  He’ll be more active once he gets the medicine out of his system.  My baby, Mary, ate applesauce and has been crying for three hours. She’ll stop when she gets the applesauce out of her system."
        },
        {
            "id": 91,
            "phrase": "get something over (to someone)",
            "definition": "1. to deliver something to someone.  Get these papers over to Mr. Wilson’s office right away.  He needs it now, so try to get it over as soon as you can. 2. to make someone understand something; to succeed in explaining something to someone. I finally got the basic concepts of trigonometry over to him.  He tries to understand what I’m talking about, but I can’t get it over."
        },
        {
            "id": 92,
            "phrase": "get something past (someone or something)",
            "definition": "to move something around or ahead of someone or something that is in the way.  Let’s get the piano past the bump in the f loor, then we’ll figure out how to move it farther.  See if you can get the ball past their goalie by shooting high."
        },
        {
            "id": 93,
            "phrase": "get something straight",
            "definition": "to understand something clearly.  Now get this straight. You’re going to fail history.  Let me get this straight. I’m supposed to go there in the morning?"
        },
        {
            "id": 94,
            "phrase": "get something straight from the horse’s mouth",
            "definition": "Prov. to get information from the person most directly involved or best informed.  Jill: Sue is going to have a baby. Jane: Who told you that? Jill: I got it straight from the horse’s mouth.  There’s a rumor that Randolph is moving to Alaska, but I won’t believe it until I get it straight from the horse’s mouth."
        },
        {
            "id": 95,
            "phrase": "get something together (for a particular time)",
            "definition": "to arrange a party or other gathering for a certain time. (Fixed order.) _ I’ll try to get a meeting together for Friday afternoon.  I’m sure we can get something together."
        },
        {
            "id": 96,
            "phrase": "get something up†",
            "definition": "to organize, plan, and assemble something.  Let’s get a team up and enter the tournament.  I think we can get up a team quite easily."
        },
        {
            "id": 97,
            "phrase": "get started on something",
            "definition": "to begin doing something; to take the first steps to do something.  When do we get started on this project? _ I want to get started on this right away."
        },
        {
            "id": 98,
            "phrase": "get the draw on someone",
            "definition": "to be faster than one’s opponent in a fight. (Alludes originally to an Old West gunfight.) _The sheriff got the draw on Arizona Slim and shot him in the arm.  Bill’s competitor got the draw on him. She was the first one in town to start selling those popular new shoes."
        },
        {
            "id": 99,
            "phrase": "get the drift of something",
            "definition": "to understand the general idea of something. I knew enough German to get the drift of this article.  I don’t get the drift of what you’re trying to tell me."
        },
        {
            "id": 100,
            "phrase": "get the drop on someone",
            "definition": "1. Sl. [for person A] to manage to get a gun aimed at person B before person B can aim back at person A. (The gun is then “dropped” by person B.) _Fred got the drop on Wilbur in a f lash. Wilbur was too stoned to get the drop on Fred. 2. Sl. to succeed in getting an advantage over someone. I guess I got the drop on you because I was early. I got the drop on almost everybody by sending in my registration by e-mail."
        },
        {
            "id": 101,
            "phrase": "get the gate",
            "definition": "Inf. to be sent away; to be rejected.  I thought he liked me, but I got the gate.  I was afraid I’d get the gate, and I was right."
        },
        {
            "id": 102,
            "phrase": "get the go-by",
            "definition": "Inf. to be ignored or passed by.  It was my turn, but I got the go-by.  Tom stood on the road for fifteen minutes trying to get a ride, but all he could get was the go-by."
        },
        {
            "id": 103,
            "phrase": "get the hell out (of here)",
            "definition": "Inf. to depart as rapidly as possible. Time for us all to get the hell out of here, I think. The cafe is closing now.  He got the hell out before he was fired."
        },
        {
            "id": 104,
            "phrase": "get the kinks (ironed) out",
            "definition": "to fix a problem associated with something.  The actors had to get the kinks out before they were ready to present the play to an audience.  That’ll be a right nice car, when you get the kinks ironed out in the engine."
        },
        {
            "id": 105,
            "phrase": "get the most out of someone or something",
            "definition": "to achieve the greatest output of work, effort, production, etc., out of someone or something.  I do what I can to get the most out of life.  I try to get the most out of my employees."
        },
        {
            "id": 106,
            "phrase": "get the point (of something)",
            "definition": "to understand the purpose, intention, or central idea of something. I wish he would stop telling jokes and get to the point of his speech."
        },
        {
            "id": 107,
            "phrase": "get the shaft",
            "definition": "Sl. to be cheated; to be taken advantage of; to be mistreated. Why do I get the shaft when I did nothing wrong?"
        },
        {
            "id": 108,
            "phrase": "get the word",
            "definition": "to receive an explanation; to receive the final and authoritative explanation.  I’m sorry, I didn’t get the word. I didn’t know the matter had been settled. Now that I have gotten the word, I can be more effective in answering questions."
        },
        {
            "id": 109,
            "phrase": "get the wrinkles out (of something)",
            "definition": "to remove the wrinkles from fabric by ironing or flattening in some way. This has been packed in my suitcase for a week, and I know I’ll never be able to get the wrinkles out of it."
        },
        {
            "id": 110,
            "phrase": "get through (something)",
            "definition": "to penetrate something. We couldn’t get through the hard concrete with a drill, so we will have to blast.  The hardest drill bit we have couldn’t get through."
        },
        {
            "id": 111,
            "phrase": "get through (to someone)",
            "definition": "to reach someone; to manage to communicate to someone. I called her on the telephone time after time, but I couldn’t get through to her.  I tried every kind of communication, but I couldn’t get through."
        },
        {
            "id": 112,
            "phrase": "get through (to something)",
            "definition": "to make contact by radio or telephone with a company, organization, or group.  I could not get through to the police because the telephone line was down.  Harry couldn’t get through to his office."
        },
        {
            "id": 113,
            "phrase": "get through (with someone or something)",
            "definition": "to manage to transport someone or something through difficulties or barriers. Customs was a mess, but we got through with all our baggage in only twenty minutes. I got through with my aged father without any trouble. "
        },
        {
            "id": 114,
            "phrase": "get to one’s feet",
            "definition": "to stand up.  On a signal from the teacher, the students got to their feet.  I was so weak, I could hardly get to my feet."
        },
        {
            "id": 115,
            "phrase": "get to the bottom of something",
            "definition": "to get an understanding of the causes of something. We must get to the bottom of this problem immediately.  There is clearly something wrong here, and I want to get to the bottom of it."
        },
        {
            "id": 116,
            "phrase": "get to the point (of something)",
            "definition": "to arrive at a discussion or explanation of the purpose of something. Please get to the point of all this. Will you kindly get to the point?"
        },
        {
            "id": 117,
            "phrase": "get to the top (of something)",
            "definition": "to get to the highest point of something.  We finally got to the top of the mountain and planted the f lag. We had tried twice before to get to the top."
        },
        {
            "id": 118,
            "phrase": "get tough (with someone)",
            "definition": "to become firm with someone; to use physical force against someone.  The teacher had to get tough with the class because the students were acting badly.  I’ve tried nicely to get you to behave, but it looks like I’ll have to get tough and really punish you."
        },
        {
            "id": 119,
            "phrase": "get under someone’s skin",
            "definition": "to bother or irritate someone.  John is so annoying. He really gets under my skin.  I know he’s bothersome, but don’t let him get under your skin."
        },
        {
            "id": 120,
            "phrase": "get under something",
            "definition": "to get beneath something.  The cat came in and got under the sofa where she couldn’t be seen.  Why don’t you get under the table where Billy won’t find you?"
        },
        {
            "id": 121,
            "phrase": "get up",
            "definition": "to wake up and get out of bed.  What time do you usually get up? _ I get up when I have to."
        },
        {
            "id": 122,
            "phrase": "get up a (full) head of steam",
            "definition": "[for a steam engine] to build steam pressure in order to start operating.  It took nearly thirty minutes to get up a full head of steam so that the locomotive could start moving."
        },
        {
            "id": 123,
            "phrase": "get up against someone or something",
            "definition": "to press close against someone or something.  I got up against the wall, out of the way. The child got up against his father to stay warm."
        },
        {
            "id": 124,
            "phrase": "get up an appetite",
            "definition": "to do something to make one very hungry. (Usually in this order.) _ He can’t seem to get up an appetite these days. Whenever I jog, I really get up an appetite."
        },
        {
            "id": 125,
            "phrase": "get up (from something)",
            "definition": "to go to a standing position from a lower position.  She got up from the chair and walked to the door.  I don’t want to get up from this hammock unless I just have to."
        },
        {
            "id": 126,
            "phrase": "get up (off (of ) something)",
            "definition": "to rise up and get off something. (Of is usually retained before pronouns.) _ Please get up off the sofa. I have to turn the cushions over.  Get up off of it!"
        },
        {
            "id": 127,
            "phrase": "get up on one’s hind legs",
            "definition": "to get angry and assertive. (Alludes to the action of a horse when it is excited or frightened.) _ She got up on her hind legs and told them all to go to blazes.  She has a tendency to get up on her hind legs and tell people off."
        },
        {
            "id": 128,
            "phrase": "get up something",
            "definition": "to manage to climb something.  I was so tired I couldn’t get up the stairs.  The entire group was able to get up the side of the mountain."
        },
        {
            "id": 129,
            "phrase": "get up to something",
            "definition": "to climb up to something, at a certain height or level.  We finally got up to the top.  How long will it take to get up to the tenth f loor?"
        },
        {
            "id": 130,
            "phrase": "get well",
            "definition": "to become healthy again.  Ann had a cold for a week, and then she got well.  Hurry up and get well!"
        },
        {
            "id": 131,
            "phrase": "get wet",
            "definition": "to become moist or soaked with water.  Get out of the rain or you’ll get wet.  Don’t get wet, or you’ll catch a cold."
        },
        {
            "id": 132,
            "phrase": "get with it",
            "definition": "1. Inf. to modernize one’s attitudes and behavior.  Get with it, Martin. Go out and buy some new clothes! _ You really have to get with it, Ernie. 2. Inf. to hurry up and get busy; to be more industrious with something.  Get with it; we’ve got a lot to do.  Let’s get with it. There’s a lot of work to be done."
        },
        {
            "id": 133,
            "phrase": "get with something",
            "definition": "to become alert. (Often with it.) _Hey, stupid. Get with it! _ Wake up, Bill. Get with what’s going on!"
        },
        {
            "id": 134,
            "phrase": "get with the program",
            "definition": "follow the rules; do what you are supposed to do. (Implies that there is a clearly known method or “program” that is usually followed.) _ Come on, Mark. Get with the program. Do what you are told.  Jane just can’t seem to get with the program. She has to do everything her way, right or wrong."
        },
        {
            "id": 135,
            "phrase": "Get your head out of the clouds!",
            "definition": "Inf. Stop daydreaming! _ Get your head out of the clouds and watch where you are driving! You’re going to kill us all."
        },
        {
            "id": 136,
            "phrase": "a ghost of a chance",
            "definition": "even the slightest chance. (Usually negative.) _ She can’t do it. She doesn’t have a ghost of a chance.  There is just a ghost of a chance that I’ll be there on time."
        },
        {
            "id": 137,
            "phrase": "giggle at someone or something",
            "definition": "to snicker or chuckle at someone or something.  Are you giggling at me? _ Fran giggled at the antics of the clown."
        },
        {
            "id": 138,
            "phrase": "gild the lily",
            "definition": "to add ornament or decoration to something that is pleasing in its original state; to attempt to improve something that is already fine the way it is. (Often refers to flattery or exaggeration.) _Your house has lovely brickwork. Don’t paint it. That would be gilding the lily.  Oh, Sally. You’re beautiful the way you are. You don’t need makeup. You would be gilding the lily."
        },
        {
            "id": 139,
            "phrase": "gird up one’s loins",
            "definition": "to get ready, especially for hard work; to prepare oneself (for something).  Well, I guess I had better gird up my loins and go to work.  Somebody has to do something about the problem. Why don’t you gird up your loins and do something?"
        },
        {
            "id": 140,
            "phrase": "give a good account of oneself",
            "definition": "to do (something) well or thoroughly.  John gave a good account of himself when he gave his speech last night.  Mary was not feeling well, and she didn’t give a good account of herself in last night’s game."
        },
        {
            "id": 141,
            "phrase": "give a little",
            "definition": "to give a small amount of something, probably money. If everyone will just give a little, we can have enough money to provide a nice Thanksgiving dinner for the needy."
        },
        {
            "id": 142,
            "phrase": "give as good as one gets",
            "definition": "to give as much as one receives; to pay someone back in kind. (Usually in the present tense.) _ John can take care of himself in a fight. He can give as good as he gets.  Sally usually wins a formal debate. She gives as good as she gets."
        },
        {
            "id": 143,
            "phrase": "give birth to someone or something",
            "definition": "to have a child; [for an animal] to bring forth young.  She gave birth to a baby girl.  The cat gave birth to a large number of adorable kittens."
        },
        {
            "id": 144,
            "phrase": "give cause for something",
            "definition": "to serve as a just cause for something; to warrant something. Your comments give cause for further investigation.  I didn’t give cause for you to worry so much."
        },
        {
            "id": 145,
            "phrase": "give chase (to someone or something)",
            "definition": "to chase someone or something. The dogs gave chase to the fox. A mouse ran by, but the cat was too tired to give chase."
        },
        {
            "id": 146,
            "phrase": "give credence to someone or something",
            "definition": "to consider someone or something as believable or trustworthy. How can you give credence to a person like Henry? _I can’t give any credence to Donald.  He tells lies. Don’t give credence to what he says.  Please don’t give credence to that newspaper article."
        },
        {
            "id": 147,
            "phrase": "Give credit where credit is due.",
            "definition": "Prov. Acknowledge someone’s contribution or ability.  Jill: Jane, that was a wonderful meal. Jane: I must give credit where credit is due; Alan helped with all of the cooking.  Ellen: Roger is pompous, petty, and immature. I think he’s completely worthless. Jane: Now, Ellen, give credit where credit is due; he’s also extremely smart."
        },
        {
            "id": 148,
            "phrase": "give currency to something",
            "definition": "to spread a story around. (With a negative if there is doubt about what is said.) _ I can’t give any currency to anything Ralph Jones says.  We give no currency to those stories. His actions gave currency to the rumor that he was about to leave."
        },
        {
            "id": 149,
            "phrase": "give evidence of something",
            "definition": "to show signs of something; to give proof of something. You are going to have to give evidence of your good faith in this matter. A nominal deposit would be fine.  She gave evidence of being prepared to go to trial, so we settled the case."
        },
        {
            "id": 150,
            "phrase": "give ground",
            "definition": "to retreat, yielding land or territory. I approached the barking dog, but it wouldn’t give ground."
        },
        {
            "id": 151,
            "phrase": "give in",
            "definition": "cave in; to push in. The rotting door gave in when we pushed, and we went inside.  The wall gave in where I kicked it."
        },
        {
            "id": 152,
            "phrase": "give in (to someone or something)",
            "definition": "to yield to someone or something; to give up to someone or something.  He argued and argued and finally gave in to my demands.  I thought he’d never give in."
        },
        {
            "id": 153,
            "phrase": "Give it a rest!",
            "definition": "Inf. Stop talking so much. Give your mouth a rest. (Familiar or rude. Compare this with Give me a rest!) _ Mary: So, I really think we need to discuss things more and go over all our differences in detail. Bill: Stop! I’ve heard enough. Give it a rest! Mary: Oh, am I disturbing you? _ Tom: Now, I would also like to say something else. Alice: Give it a rest, Tom. We’re tired of listening to you."
        },
        {
            "id": 154,
            "phrase": "Give it all you’ve got!",
            "definition": "Inf. Do your very best! _ Go out there and try. Give it all you’ve got!"
        },
        {
            "id": 155,
            "phrase": "Give it time.",
            "definition": "Be patient.; In time, things will change. (Usually said to encourage someone to wait or be patient.) _ Things will get better. Don’t worry. Give it time.  Of course, things will improve. Give it time."
        },
        {
            "id": 156,
            "phrase": "give it to someone (straight)",
            "definition": "to tell something to someone clearly and directly.  Come on, give it to me straight. I want to know exactly what happened.  Quit wasting time, and tell me. Give it to me straight."
        },
        {
            "id": 157,
            "phrase": "Give it up!",
            "definition": "Inf. Stop trying!; You are wasting your time! (Fixed order.) _Bob: I just can’t understand calculus! Bill: Give it up! Get out of that course and get into something less cruel.  Tom: I’m just not a very good singer, I guess. Sue: It’s no good, Tom. Give it up! Tom: Don’t you think I’m doing better, though? Sue: Give it up, Tom!"
        },
        {
            "id": 158,
            "phrase": "Give me a chance!",
            "definition": "1. Please give me an opportunity to do something! _ Mary: I just know I can do it. Oh, please give me a chance! Sue: All right. Just one more chance.  Bob: Do you think you can do it? Jane: Oh, I know I can. Just give me a chance! 2. Please give me a fair chance and enough time to complete the task. Alice: Come on! I need more time to finish the test. Give me a chance! Teacher: Would another ten minutes help? _ Bob: You missed that one! Bill: You moved it! There was no way I could hit it. Give me a chance! Hold it still!"
        },
        {
            "id": 159,
            "phrase": "Give me a rest!",
            "definition": "Inf. Stop being such a pest!; Stop bothering me with this problem! (Compare this with Give it a rest!) _“Go away and stop bothering me!” moaned Bob. “Give me a rest!” _ Bob: I need an answer to this right away! Bill: I just gave you an answer! Bob: That was something different. This is a new question. Bill: Give me a rest! Can’t it wait?"
        },
        {
            "id": 160,
            "phrase": "give of oneself",
            "definition": "to be generous with one’s time and concern.  Tom is very good with children because he gives of himself.  If you want to have more friends, you have to learn to give of yourself."
        },
        {
            "id": 161,
            "phrase": "give one one’s freedom",
            "definition": "to set someone free; to divorce someone.  Mrs. Brown wanted to give her husband his freedom.  Well, Tom, I hate to break it to you this way, but I have decided to give you your freedom."
        },
        {
            "id": 162,
            "phrase": "give (one’s) notice",
            "definition": "to formally tell one’s employer that one is quitting one’s job.  Did you hear that James is leaving? He gave his notice yesterday.  Lisa gave notice today. She got a job offer from another company."
        },
        {
            "id": 163,
            "phrase": "give oneself over to someone or something",
            "definition": "to surrender to someone or something.  He went to the station and gave himself over to the police.  Max gave himself over to the officer."
        },
        {
            "id": 164,
            "phrase": "give oneself up (to someone or something)",
            "definition": "to surrender to someone or something.  Fran gave herself up to the disease. Walter gave himself up to the police."
        },
        {
            "id": 165,
            "phrase": "give out",
            "definition": "1. to wear out and stop; to quit operating.  My old bicycle finally gave out.  I think that your shoes are about ready to give out. 2. to be depleted. The paper napkins gave out, and we had to use paper towels.  The eggs gave out, and we had to eat cereal for breakfast for the rest of the camping trip."
        },
        {
            "id": 166,
            "phrase": "give (out) with something",
            "definition": "Inf. to give out information.  Come on, give out with the facts, man.  Give with the info. We’re in a hurry. "
        },
        {
            "id": 167,
            "phrase": "give rise to something",
            "definition": "to cause something; to instigate something.  The attack gave rise to endless arguments. Her ludicrous living gave rise to further speculation as to the source of her money."
        },
        {
            "id": 168,
            "phrase": "give some thought to something",
            "definition": "to think about something; to devote some time to thinking about something.  After I have had time to give some thought to the matter, I will call you."
        },
        {
            "id": 169,
            "phrase": "give someone a dig",
            "definition": "Sl. to insult someone; to say something which will irritate a person.  Jane gave Bob a dig about his carelessness with money.  The headmaster’s daughter gets tired of people giving her digs about favoritism."
        },
        {
            "id": 170,
            "phrase": "give someone a (good) bawling out",
            "definition": "to bawl someone out; to chastise someone.  When the teacher caught Billie, he gave him a good bawling out."
        },
        {
            "id": 171,
            "phrase": "give someone a pain",
            "definition": "to annoy or bother someone.  Please don’t give me a pain. I’ve had a hard day. You give me a pain! _ She’s such a pest. She really gives me a pain."
        },
        {
            "id": 172,
            "phrase": "give someone a piece of one’s mind",
            "definition": "to bawl someone out; to tell someone off.  I’ve had enough from John. I’m going to give him a piece of my mind.  Sally, stop it, or I’ll give you a piece of my mind."
        },
        {
            "id": 173,
            "phrase": "give someone a red face",
            "definition": "to make someone visibly embarrassed.  We really gave him a red face when we caught him eavesdropping. His error gave him a very red face."
        },
        {
            "id": 174,
            "phrase": "give someone away (to someone)",
            "definition": "1. Fig. [for the bride’s father] to give the bride away to the groom. (Customarily done just prior to the actual marriage ceremony.) _ Mr. Franklin gave Amy away to Terry just as he had done in the rehearsal.  He was reluctant to give his daughter away. 2. Fig. to reveal something secret about someone to someone else. Please don’t give me away. I don’t want anyone to know my plans.  Alice did everything she could to keep from giving herself away."
        },
        {
            "id": 175,
            "phrase": "Give someone enough rope and he’ll hang himself.",
            "definition": "Prov. If you give someone that you suspect of bad behavior the freedom to behave badly, eventually he or she will be caught and punished.  Jill: I think Matilda’s been stealing things out of my desk. Should I tell the boss? Jane: No; give her enough rope and she’ll hang herself. One of these days she’ll steal something important, the boss will find out for himself, and he’ll fire her."
        },
        {
            "id": 176,
            "phrase": "give someone Hail Columbia",
            "definition": "Inf. to scold someone severely.  The teacher gave her students Hail Columbia over their poor test scores.  If Miss Ellen finds out I broke her window, she’ll give me Hail Columbia for sure!"
        },
        {
            "id": 177,
            "phrase": "give someone odds that...",
            "definition": "to propose a sham bet to someone, the implication being that even at favorable odds the outcome will defy the odds. (Often with a negative.) _ I’ll give you odds that you won’t be able to order a decent steak at this restaurant."
        },
        {
            "id": 178,
            "phrase": "give someone or something a wide berth",
            "definition": "to keep a reasonable distance from someone or something; to steer clear (of someone or something). (Originally referred to sailing ships.) _The dog we are approaching is very mean. Better give it a wide berth.  Give Mary a wide berth. She’s in a very bad mood."
        },
        {
            "id": 179,
            "phrase": "give someone or something away†",
            "definition": "to reveal a secret about someone or something.  I thought no one knew where I was, but my loud breathing gave me away. We know that Billy ate the cherry pie. The cherry juice on his shirt gave him away.  I had planned a surprise, but John gave away my secret."
        },
        {
            "id": 180,
            "phrase": "give someone or something back† (to someone or something)",
            "definition": "to return someone or something to someone or something.  Please give it back to me.  You took my lunch away from me. You had better give it back. Give back the book right now!"
        },
        {
            "id": 181,
            "phrase": "give someone or something up† (for lost)",
            "definition": "to abandon someone or something as being lost; to quit looking for someone or something that is lost.  After a week we had given the cat up for lost when suddenly she appeared. We gave up the cat for lost."
        },
        {
            "id": 182,
            "phrase": "give someone or something up† (to someone)",
            "definition": "to hand someone or something over to someone; to relinquish claims on someone or something in favor of someone else. We had to give the money we found up to the police. We gave up the money to the police."
        },
        {
            "id": 183,
            "phrase": "give someone pause (for thought)",
            "definition": "to cause someone to stop and think.  When I see a golden sunrise, it gives me pause for thought.  Witnessing an accident is likely to give all of us pause."
        },
        {
            "id": 184,
            "phrase": "give someone some lip",
            "definition": "Inf. to speak rudely or disrespectfully to someone; to sass someone.  Billy gave me some lip, so I whupped him.  Jane is always giving the teacher some lip."
        },
        {
            "id": 185,
            "phrase": "give someone some skin",
            "definition": "Sl. [for two people] to touch two hands together in a special greeting, like a handshake. (One hand may be slapped down on top of the other, or they may be slapped together palm to palm with the arms held vertically. Usually said as a command.) _ Hey, Bob, give me some skin! _Come over here, you guys. I want you to meet my brother and give him some skin!"
        },
        {
            "id": 186,
            "phrase": "give someone some sugar",
            "definition": "Rur. to give someone a kiss.  Come here, honey, and give me some sugar.  “Give me some sugar!” Grandma said when she saw me."
        },
        {
            "id": 187,
            "phrase": "give someone static",
            "definition": "to argue with someone; to give someone back talk.  I want you to do it and do it now! Don’t give me any static!"
        },
        {
            "id": 188,
            "phrase": "give someone the eye",
            "definition": "to look at someone in a way that communicates romantic interest. Ann gave John the eye. It really surprised him. Tom kept giving Sally the eye. She finally got disgusted and left."
        },
        {
            "id": 189,
            "phrase": "give someone the finger",
            "definition": "1. Fig. to display the middle finger upright as a sign of derision. (The gesture is derisive and offensive. See also flip someone off, flip someone the bird.) _ Did one of you guys give Ted the finger? _ Somebody gave the cop the finger. 2. Fig. Inf. to mistreat someone; to insult someone.  You’ve been giving me the finger ever since I started working here. What’s wrong? _ I’m tired of everybody giving me the finger around here just because I’m new."
        },
        {
            "id": 190,
            "phrase": "give someone the gate",
            "definition": "Sl. to get rid of someone.  The chick was a pest, so I gave her the gate.  He threatened to give me the gate, so I left."
        },
        {
            "id": 191,
            "phrase": "give someone the go-by",
            "definition": "to bypass someone; to ignore someone.  Gert gave us all the go-by when she took up with that rich boyfriend. I didn’t mean to give you the goby. I’m preoccupied, that’s all."
        },
        {
            "id": 192,
            "phrase": "give someone the raspberry",
            "definition": "Inf. to make a rude noise with the lips at someone.  The audience gave him the raspberry, which gave him some second thoughts about his choice of career. Even after his grandstand play, they gave him the raspberry."
        },
        {
            "id": 193,
            "phrase": "give someone the shaft",
            "definition": "Sl. to cheat or deceive someone; to mistreat someone. The boss really gave Wally the shaft.  Somebody always gives me the shaft."
        },
        {
            "id": 194,
            "phrase": "give someone the shirt off one’s back",
            "definition": "to give anything that is asked for, no matter the sacrifice required.  Tom would give any of his old army buddies the shirt off his back.  You can always count on Mark when you’re in trouble; he’d give you the shirt off his back."
        },
        {
            "id": 195,
            "phrase": "give someone the slip",
            "definition": "Sl. to escape from a pursuer.  We were on his tail until he gave us the slip.  I can give her the slip in no time at all."
        },
        {
            "id": 196,
            "phrase": "give someone tit for tat",
            "definition": "to give someone something equal to what was given you; to exchange a series of very similar things, one by one, with someone. They gave me the same kind of difficulty that I gave them. They gave me tit for tat.  He punched me, so I punched him. Every time he hit me, I hit him. I just gave him tit for tat."
        },
        {
            "id": 197,
            "phrase": "give someone to understand something",
            "definition": "to explain something to someone; to imply something to someone. (Possibly misleading someone, accidentally or intentionally. See also given to understand.) _ Mr. Smith gave Sally to understand that she should be home by midnight. The mayor gave the citizens to understand that there would be no tax increase. He didn’t promise, though."
        },
        {
            "id": 198,
            "phrase": "give someone up† for dead",
            "definition": "to give up hope for someone who is dying; to abandon a dying person as already dead.  The cowboys gave up their comrade for dead and rode off. We gave up the poor old man for dead and went to telephone the police."
        },
        {
            "id": 199,
            "phrase": "give something away† (to someone)",
            "definition": "1. to donate to, or bestow something upon, someone.  I gave the old clothing away to Tom.  I gave away my coat to Tom. 2. to tell a secret to someone.  Please don’t give the surprise away to anyone.  Don’t give away my secret. 3. to reveal the answer to a question, riddle, or problem to someone.  Don’t give the answer away to them! _Don’t give away the answer!"
        },
        {
            "id": 200,
            "phrase": "give something back† (to someone) (with interest)",
            "definition": "to return money to someone with an additional amount for interest.  You are going to have to give that money back to me with interest.  Please give back the proper amount...with interest!"
        },
        {
            "id": 201,
            "phrase": "give something for something",
            "definition": "to exchange something for something. I will give two brownies for that piece of cake in your lunch box.  Jed gave two pigs for an old motorcycle."
        },
        {
            "id": 202,
            "phrase": "give something off†",
            "definition": "to release something, such as smoke, a noise, an odor, fragrance, etc.  The little animal gave a foul smell off.  The f lower gave off its heavy perfume at dusk."
        },
        {
            "id": 203,
            "phrase": "give something out†",
            "definition": "to distribute something; to pass something out.  The teacher gave the test papers out.  The teacher gave out the papers."
        },
        {
            "id": 204,
            "phrase": "give something over (to someone or something)",
            "definition": "to hand something over to someone or something.  Please give the money over to Sherri, who handles the accounts.  She is waiting at the front office. Just go there and give it over."
        },
        {
            "id": 205,
            "phrase": "give something to someone",
            "definition": "to bestow something, such as a gift, on someone. Please give this to Sally Wilson. Who gave this book to me? I want to thank whoever it was."
        },
        {
            "id": 206,
            "phrase": "give something under (the) threat of something",
            "definition": "to give something only because one is threatened.  He gave the money under threat of exposure. I think that is blackmail.  You are asked to give your testimony under the threat of being jailed if you don’t."
        },
        {
            "id": 207,
            "phrase": "give something up†",
            "definition": "1. to forsake something; to stop using or eating something.  I gave coffee up because of the caffeine. They advised me to give up sugar in all forms. 2. to quit doing something.  Oh, give it up! You’re not getting anywhere.  You should give up smoking."
        },
        {
            "id": 208,
            "phrase": "give the game away",
            "definition": "to reveal a plan or strategy.  Now, all of you have to keep quiet. Please don’t give the game away.  If you keep giving out hints, you’ll give the game away."
        },
        {
            "id": 209,
            "phrase": "give the lie to something",
            "definition": "to show that something is a lie.  The evidence gives the lie to your testimony.  Your own admission of your part in the conspiracy gives the lie to your earlier testimony."
        },
        {
            "id": 210,
            "phrase": "give up",
            "definition": "to quit; to quit trying. I give up! I won’t press this further.  Are you going to give up or keep fighting?"
        },
        {
            "id": 211,
            "phrase": "give up (all) hope",
            "definition": "to stop hoping for something. (Fixed order.) _ Don’t give up hope. There’s always a chance.  We had given up all hope when a miracle happened."
        },
        {
            "id": 212,
            "phrase": "give up (on someone or something)",
            "definition": "to give up trying to do something with someone or something, such as being friendly, giving advice, managing, etc. I gave up on jogging. My knees went bad. Gloria tried to be friendly with Kelly, but finally gave up."
        },
        {
            "id": 213,
            "phrase": "give up the ghost",
            "definition": "Euph. to die. (Fixed order. Often used to describe machines breaking down.) _The old man gave up the ghost.  My poor old car finally gave up the ghost."
        },
        {
            "id": 214,
            "phrase": "Give us the tools, and we will finish the job.",
            "definition": "Prov. A reply to someone who wants you to do a task for which you lack the equipment.  How am I supposed to wash the upstairs windows without a ladder? Give us the tools, and we will finish the job!"
        },
        {
            "id": 215,
            "phrase": "give vent to something",
            "definition": "to express anger. (The something is usually anger, ire, irritation, etc.) _John gave vent to his anger by yelling at Sally.  Bill couldn’t give vent to his frustration because he had been warned to keep quiet."
        },
        {
            "id": 216,
            "phrase": "give voice to something",
            "definition": "to express a feeling or an opinion in words; to speak out about something.  The bird gave voice to its joy in the golden sunshine.  The protestors gave voice to their anger at Congress."
        },
        {
            "id": 217,
            "phrase": "give way to someone or something",
            "definition": "to yield to someone or something; to give preference to someone or something.  The cars gave way to the pedestrians.  The motorboats have to give way to the sailboats."
        },
        {
            "id": 218,
            "phrase": "give weight to something",
            "definition": "to attach importance to something. I give a lot of weight to your opinion. Kelly gave no weight at all to the comments by Betty."
        },
        {
            "id": 219,
            "phrase": "give with something",
            "definition": "Inf. to give something to someone; to tell something to someone.  Come on! Give with the money! _ You had better give with the information if you know what’s good for you."
        },
        {
            "id": 220,
            "phrase": "given to doing something",
            "definition": "likely to do something; inclined to do something habitually.  Mary is given to singing in the shower. Bob is given to shouting when things don’t go his way."
        },
        {
            "id": 221,
            "phrase": "given to understand",
            "definition": "[of someone] made to believe [something].  They were given to understand that there would be no tax increase, but after the election taxes went up.  She was given to understand that she had to be home by midnight."
        },
        {
            "id": 222,
            "phrase": "*the glad hand",
            "definition": "an overly friendly welcome; a symbol of insincere attention. (*Typically: get ~; give someone ~.) _ Whenever I go into that store, I get the glad hand.  I hate to go to a party and get the glad hand."
        },
        {
            "id": 223,
            "phrase": "glance around (some place)",
            "definition": "to look quickly around some place.  He glanced around the room, looking for his favorite cap. Mary glanced around, looking for her friend."
        },
        {
            "id": 224,
            "phrase": "glance at someone or something",
            "definition": "to look quickly at someone or something. Sharon glanced at Todd to see if he looked as if he was ready to go.  I glanced at my watch and realized how long all this had taken."
        },
        {
            "id": 225,
            "phrase": "glance back (at someone)",
            "definition": "1. to look quickly at someone who is looking at you.  He glanced back at Mary, so he could remember her smile. She hoped he would notice her but he never even glanced back. 2. to look quickly at someone who is behind you.  Dan glanced back at the man chasing him and ran on even faster. He glanced back and ran faster."
        },
        {
            "id": 226,
            "phrase": "glance down (at something)",
            "definition": "to look quickly downward at something. Sherri glanced down at her watch and then pressed on the accelerator. She glanced down and hurried off."
        },
        {
            "id": 227,
            "phrase": "glance off (someone or something)",
            "definition": "to bounce off someone or something.  The bullet glanced off the huge boulder.  The baseball glanced off of Tom and left a bruise on his side where it had touched."
        },
        {
            "id": 228,
            "phrase": "glance over someone or something",
            "definition": "to examine someone or something very quickly.  I only glanced over the papers. They look okay to me. The doctor glanced over the injured woman and called for an ambulance."
        },
        {
            "id": 229,
            "phrase": "glance through something",
            "definition": "to look quickly at the contents of something.  I glanced through the manuscript, and I don’t think it is ready yet. Would you glance through this report when you have a moment?"
        },
        {
            "id": 230,
            "phrase": "glare at someone or something",
            "definition": "to scowl at someone or something. Don’t glare at me! _I glared at the cat and thought mean thoughts."
        },
        {
            "id": 231,
            "phrase": "glare down on someone or something",
            "definition": "1. [for someone] to scowl down at someone or something. The judge glared down on the accused.  I glared down on the cat, which ignored me, as usual. 2. [for the sun] to burn down brightly on someone or something. The sun glared down on the beach and made the sand hot to the touch.  The bright sun glared down on the desert rocks."
        },
        {
            "id": 232,
            "phrase": "glass something in†",
            "definition": "to enclose something, such as a porch, in glass.  I want to glass this porch in, so we can use it in the winter.  We glassed in our porch last year."
        },
        {
            "id": 233,
            "phrase": "glaze over",
            "definition": "[for something] to be covered over with a coat of something cloudy or ice. The roads glazed over and became very dangerous.  The street is glazed over badly."
        },
        {
            "id": 234,
            "phrase": "gleam with something",
            "definition": "to sparkle or shine with something.  The crystal goblets gleamed with the sparkling candlelight.  The glass gleamed with a bright ref lection."
        },
        {
            "id": 235,
            "phrase": "glide across something",
            "definition": "to float or slide across something.  The skaters glided across the frozen expanse of the river.  The small plane glided across the sky."
        },
        {
            "id": 236,
            "phrase": "glide away (from someone or something)",
            "definition": "to slide or float away from someone or something.  The skaters glided away from the center of the rink. The canoes glided away from the judge who had started off the canoe race."
        },
        {
            "id": 237,
            "phrase": "glint with something",
            "definition": "to sparkle or shine with something.  Her bright eyes glinted with the sunlight.  The crystal goblet glinted with the orange firelight."
        },
        {
            "id": 238,
            "phrase": "glisten with something",
            "definition": "to sparkle or shimmer with something.  The trees glistened with a thin coating of ice from the freezing rain.  Fran’s eyes glistened with a few tears."
        },
        {
            "id": 239,
            "phrase": "glitter with something",
            "definition": "1. to sparkle with something.  Her earrings glittered with many tiny diamonds. The tree glittered with tiny ice crystals. 2. [for eyes] to shine with a strong emotion.  Her eyes glittered with anger.  The eyes of the great beast glittered with ravenous hunger."
        },
        {
            "id": 240,
            "phrase": "gloat over something",
            "definition": "to rejoice smugly over something; to be glad that something unfortunate has happened to someone else. He gloated over his good luck in a way that made all of us angry.  Please don’t gloat over my misfortune."
        },
        {
            "id": 241,
            "phrase": "Glory be!",
            "definition": "Inf. an exclamation expressing surprise or shock. (A bit old-fashioned.) _ Mary: Glory be! Is that what I think it is? Sue: Well, it’s a kitten, if that’s what you thought. Sally: First a car just missed hitting her, then she fell down on the ice. Mary: Glory be!"
        },
        {
            "id": 242,
            "phrase": "glory in something",
            "definition": "to take great pleasure in something; to revel in something. He just glories in all the attention he is getting.  Martha tends to glory in doing things just exactly right."
        },
        {
            "id": 243,
            "phrase": "gloss over something",
            "definition": "to cover up, minimize, or play down something bad.  Don’t gloss over your own role in this fiasco! _ I don’t want to gloss this matter over, but it really isn’t very important, is it?"
        },
        {
            "id": 244,
            "phrase": "The gloves are off.",
            "definition": "There is going to be a serious dispute. (As if boxers had removed their gloves in order to inflict more damage. See also take the gloves off.) _Bob got mad and yelled, “Ok, the gloves are off!” and started cussing and pounding the table."
        },
        {
            "id": 245,
            "phrase": "glow with something",
            "definition": "[for something] to put out light, usually because of high heat.  The embers glowed with the remains of the fire.  The last of the coals still glowed with fire."
        },
        {
            "id": 246,
            "phrase": "glower at someone or something",
            "definition": "to scowl intently at someone or something.  The judge glowered at the irate wit- ness until order was restored. Fred glowered at the painting of his uncle, hating the subject of the picture."
        },
        {
            "id": 247,
            "phrase": "glue something down†",
            "definition": "to fix something down onto something with cement. Glue the edge of the rug down before someone trips over it.  You should glue down the rug."
        },
        {
            "id": 248,
            "phrase": "glue something together†",
            "definition": "to attach the pieces of something together with glue.  She glued the pieces of the model plane together.  She glued together all the loose pieces."
        },
        {
            "id": 249,
            "phrase": "glued to someone or something",
            "definition": "following someone everywhere; very close to or touching something.  His little sister was glued to him all afternoon. Finally he sent her home."
        }
    ]
}