{
    "dictionary": [
        {
            "id": 0,
            "phrase": "flank (up)on someone or something",
            "definition": "to be at the side of someone or something. (Upon is formal and less commonly used than on.) _ The Victorian mansion flanked on the tall, modern apartment building.  It f lanked on a broad expanse of fir trees."
        },
        {
            "id": 1,
            "phrase": "flap around",
            "definition": "[for a sheet of something] to blow, flop, or slap around, perhaps in the wind.  The sails f lapped around, making a lot of noise.  The awning f lapped around during the night."
        },
        {
            "id": 2,
            "phrase": "flare out",
            "definition": "to spread out; to widen. (Said especially of one opening of a tube or round-topped vessel.) _ The end of the pipe f lared out to a larger diameter.  The top of the vase f lared out, and was decorated with little blobs of colored glass."
        },
        {
            "id": 3,
            "phrase": "flare something out†",
            "definition": "to spread something out; to make something wider. (Said especially of one end of a tube or round-topped vessel.) _Can you f lare the end of this pipe out a little? _ Flare out the end of this pipe."
        },
        {
            "id": 4,
            "phrase": "flash a smile (at someone)",
            "definition": "to smile quickly and perhaps briefly at someone.  She f lashed a smile at me as if she recognized me."
        },
        {
            "id": 5,
            "phrase": "flash across something",
            "definition": "[for something bright] to move quickly across something.  The telephone number f lashed across the television screen too fast for me to copy it down.  The spotlight f lashed across the audience, blinding me as it went by."
        },
        {
            "id": 6,
            "phrase": "flash back (on someone or something)",
            "definition": "to provide a glimpse of someone or something in the past. (In films, literature, and television.) _ The next scene f lashed back on Fred’s murder.  The story then f lashed back, giving us information out of the past."
        },
        {
            "id": 7,
            "phrase": "flash back (to someone or something)",
            "definition": "to return briefly to a view of someone or something in the past. (In films, literature, and television.) _ The story suddenly f lashed back to Tom when he was a child. The story f lashed back to Tom’s childhood."
        },
        {
            "id": 8,
            "phrase": "a flash in the pan",
            "definition": "someone or something that draws a lot of attention for a very brief time.  I’m afraid that my success as a painter was just a f lash in the pan.  Tom had hoped to be a major film star, but his career was only a f lash in the pan."
        },
        {
            "id": 9,
            "phrase": "flash into one’s mind",
            "definition": "[for an idea or image] to enter one’s mind for an instant.  A brilliant idea f lashed into her mind, and she wrote it down.  When the idea f lashed into my mind, I closed my eyes and tried to forget it."
        },
        {
            "id": 10,
            "phrase": "flash into view",
            "definition": "to move quickly into view.  Suddenly, a doe and her fawn f lashed into view. A bright parrot f lashed into view and squawked raucously."
        },
        {
            "id": 11,
            "phrase": "flash off",
            "definition": "[for a light] to go off suddenly.  The light f lashed off and it was dark for a few minutes. When the lights f lashed off, I was setting my watch."
        },
        {
            "id": 12,
            "phrase": "flash on",
            "definition": "[for a light] to turn on suddenly.  The light f lashed on and woke us up.  When the light f lashed on, I had just been getting to sleep."
        },
        {
            "id": 13,
            "phrase": "flash on someone or something",
            "definition": "[for a light] to shine on someone or something suddenly or in bursts.  The orange neon light f lashed on John’s face, making him look quite strange.  The light f lashed on the window shade, startling the occupants of the room."
        },
        {
            "id": 14,
            "phrase": "flash on something",
            "definition": "Sl. to remember something suddenly and vividly.  Then I f lashed on a great idea.  I was trying to f lash on her name, but I couldn’t bring it to mind."
        },
        {
            "id": 15,
            "phrase": "flash out",
            "definition": "[for a light] to shine out of something suddenly or in bursts.  The light f lashed out, signaling us to stay away from the rocks. Under the door, we saw a light f lashing out. Someone was watching television in that room."
        },
        {
            "id": 16,
            "phrase": "flash something around†",
            "definition": "to display something so everyone can see it. (Usually something one would hold in one’s hand.) _ Don’t f lash your money around on the streets.  She f lashed around the pictures of her grandchildren every chance she got."
        },
        {
            "id": 17,
            "phrase": "flash something at someone or something",
            "definition": "to shine a light quickly on someone or something.  Larry f lashed a light at Frank to verify his identity. We f lashed the light at each doorway, looking for the address we had been sent to."
        },
        {
            "id": 18,
            "phrase": "flash something up† (some place)",
            "definition": "to shine a light upwards toward something.  Flash your light up into the tree.  She f lashed up her light at the cat in the tree.  Gloria f lashed the light up."
        },
        {
            "id": 19,
            "phrase": "flash through one’s mind",
            "definition": "[for an idea or image] to move quickly through one’s mind.  Suddenly, a great idea f lashed through my mind. The same idea f lashed through all of our minds at once."
        },
        {
            "id": 20,
            "phrase": "flat on one’s ass",
            "definition": "1. Fig. Inf. completely exhausted. (Potentially offensive. Use only with discretion.) _ I’m just f lat on my ass. I need some rest.  After the day of the marathon, Pete was f lat on his ass for a week. 2. Fig. Inf. broke; financially destroyed. (Potentially offensive. Use only with discretion. An elaboration of flat broke.) _ Sorry, I can’t help you. I’m broke—flat on my ass.  The guy’s f lat on his ass. Can you help him out with a loan?"
        },
        {
            "id": 21,
            "phrase": "(flat) on one’s back",
            "definition": "ill in bed. I’ve been on my back with the f lu for two weeks.  She was f lat on her back during her illness."
        },
        {
            "id": 22,
            "phrase": "flat out",
            "definition": "1. clearly and definitely; holding nothing back.  I told her f lat out that I didn’t like her.  They reported f lat out that the operation was a failure. 2. at top speed.  How fast will this car go f lat out? _ This car will hit about 110 miles per hour f lat out."
        },
        {
            "id": 23,
            "phrase": "flatten someone or something out†",
            "definition": "to make someone or something flat.  If you fall under the steamroller, it will f latten you out.  Flatten out that dough a little more.  Please f latten it out."
        },
        {
            "id": 24,
            "phrase": "flatter one’s figure",
            "definition": "[for clothing] to make one look thin or to make one’s figure look better than it is.  The lines of this dress really f latter your figure.  The trousers had a full cut that f lattered Maria’s figure."
        },
        {
            "id": 25,
            "phrase": "Flattery will get you nowhere.",
            "definition": "Flattering me will not increase your chances of success.  A: Gee, you can do almost anything, can’t you? B: Probably, but f lattery will get you nowhere."
        },
        {
            "id": 26,
            "phrase": "flavor food with something",
            "definition": "to season a food with something.  He f lavors his gravy with a little sage.  Can you f lavor the soup with a little less pepper next time?"
        },
        {
            "id": 27,
            "phrase": "fleck something with something",
            "definition": "to put little specks of something on something.  They f lecked the little figures with some kind of powder that made them sparkle.  His hair was f lecked with gray."
        },
        {
            "id": 28,
            "phrase": "flee from someone or something",
            "definition": "to run away from someone or something.  The robber f led from the scene of the crime.  The children f led from the wrath of the old man."
        },
        {
            "id": 29,
            "phrase": "flee to something",
            "definition": "to escape to something or some place.  We f led to our little place on the coast. They never found us.  The little mouse f led to its hole in the wall when the cat came around."
        },
        {
            "id": 30,
            "phrase": "fleet of foot",
            "definition": "able to run fast.  Frederick, who was notably f leet of foot, outran all the other boys and won the prize."
        },
        {
            "id": 31,
            "phrase": "a fleeting glance",
            "definition": "a quick glance; a very brief look.  I had a f leeting glance at the car as it sped by, but I couldn’t read the license place number."
        },
        {
            "id": 32,
            "phrase": "flesh out",
            "definition": "to become more fleshy.  She began to f lesh out at the age of thirteen.  After his illness, Tom fleshed out and regained his strength."
        },
        {
            "id": 33,
            "phrase": "flesh something out† (with something)",
            "definition": "to make something more detailed, bigger, or fuller.  This is basically a good outline. Now you’ll have to f lesh it out. The play was good, except that the author needed to f lesh out the third act. It was too short."
        },
        {
            "id": 34,
            "phrase": "flex something out of shape",
            "definition": "to bend something out of its normal shape. Don’t f lex all the hangers out of shape. We need a few in the closet.  Who flexed the gate out of shape?"
        },
        {
            "id": 35,
            "phrase": "flexed out of shape",
            "definition": "Sl. very angry; bent out of shape. The boss was completely f lexed out of shape. I am truly f lexed out of shape."
        },
        {
            "id": 36,
            "phrase": "flick out",
            "definition": "1. [for the ends of a flame] to reach out as the flame burns. The flames of the campfire f licked out and threatened the cold fingers that were too close. The flames f licked out from the burning house and set a nearby tree on fire. 2. [for the tongue of a reptile] to come out suddenly.  The snake’s tongue f licked out regularly.  The lizard’s tongue f licked out, grabbed the insect and ate it."
        },
        {
            "id": 37,
            "phrase": "flick something off†",
            "definition": "to turn something off, using a toggle switch. Mary f licked the light off and went out of the room.  Please f lick the light off as you go out the door.  Please f lick off the light. "
        },
        {
            "id": 38,
            "phrase": "flick something on†",
            "definition": "to turn something on, using a toggle switch.  Mary came into the room and flicked the light on.  Please f lick on the light."
        },
        {
            "id": 39,
            "phrase": "flick something out†",
            "definition": "[for a reptile] to push out its tongue quickly.  The lizard f licked its tongue out repeatedly.  The lizard kept f licking out its tongue at regular intervals."
        },
        {
            "id": 40,
            "phrase": "flick something with something",
            "definition": "to brush or knock something with something quickly or lightly. She f licked her finger at the f ly that had lighted nearby.  Tom flicked the vase with his sleeve and knocked it over."
        },
        {
            "id": 41,
            "phrase": "flick through something",
            "definition": "to turn quickly through the pages of something.  Colleen f licked through the magazine, looking only at the advertisements.  I have only had time to f lick through the manuscript, but it looks okay."
        },
        {
            "id": 42,
            "phrase": "flicker out",
            "definition": "[for a flame] to dwindle, little by little, until it goes out.  The candle f lickered out, leaving us in total darkness.  When the last f lame f lickered out, the room began to get cold."
        },
        {
            "id": 43,
            "phrase": "flight of fancy",
            "definition": "an idea or suggestion that is out of touch with reality or possibility. What is the point in indulging in f lights of fancy about exotic vacations when you cannot even afford the rent?"
        },
        {
            "id": 44,
            "phrase": "flinch from someone or something",
            "definition": "to move back suddenly from someone or something; to shrink (back) (from someone or something) suddenly. She struck at him and he f linched from her.  At the last minute the center fielder f linched from the ball."
        },
        {
            "id": 45,
            "phrase": "fling one’s head back†",
            "definition": "to tilt one’s head back quickly.  She f lung her head back and laughed heartily.  She flung back her head and laughed."
        },
        {
            "id": 46,
            "phrase": "fling someone or something around†",
            "definition": "to sling or throw someone or something around.  Don’t f ling your wet clothing around. You are messing up the whole room.  Don’t f ling around all your clothes."
        },
        {
            "id": 47,
            "phrase": "fling someone or something aside†",
            "definition": "to toss or sling someone or something aside or out of the way. She flung aside the covers and leaped out of bed.  She f lung the covers aside."
        },
        {
            "id": 48,
            "phrase": "fling someone or something away†",
            "definition": "to throw or sling someone or something away or out of the way.  You can’t just f ling me away! I am your eldest son! _ You can’t just f ling away the things you don’t want!"
        },
        {
            "id": 49,
            "phrase": "fling someone or something back†",
            "definition": "1. to sling or throw someone or something backwards.  I had to f ling the child back, away from the fire.  I f lung back the door and ran out. Walt grabbed at the door and f lung it back. 2. to return someone or something by slinging or throwing.  She took the little fish and f lung it back into the water.  Did you f ling back the ball to Roger?"
        },
        {
            "id": 50,
            "phrase": "fling someone or something down†",
            "definition": "to throw or push someone or something down. He flung the book down in great anger.  He flung down the book and ran from the room."
        },
        {
            "id": 51,
            "phrase": "fling something at someone or something",
            "definition": "to throw something roughly or carelessly at someone or something.  Don’t f ling that towel at me! _ Don’t just f ling that paper at the wastebasket, hoping it will get there!"
        },
        {
            "id": 52,
            "phrase": "fling something up† in someone’s face",
            "definition": "to bring a problem up and confront someone with it.  Don’t f ling it up in my face! It’s not my fault! _ I don’t like anyone to f ling up my past in my face."
        },
        {
            "id": 53,
            "phrase": "fling something up† (in something)",
            "definition": "to throw one’s arms or hands up in an expression of some emotion, such as despair, horror, disgust, resignation.  She f lung her hands up in despair.  She flung up her hands and cried out for help."
        },
        {
            "id": 54,
            "phrase": "fling up",
            "definition": "Sl. to empty one’s stomach; to vomit.  I was afraid I was going to f ling up.  Who flung up on the sidewalk?"
        },
        {
            "id": 55,
            "phrase": "flip around",
            "definition": "to turn end for end, all the way around, quickly.  The alligator f lipped around and hissed at us.  The kitten f lipped around and pounced on my hand."
        },
        {
            "id": 56,
            "phrase": "flip out",
            "definition": "Sl. to lose control of oneself.  After a sleepless night, Wally simply f lipped out.  I felt like I was going to f lip out from the steady dripping of the faucet."
        },
        {
            "id": 57,
            "phrase": "flip over",
            "definition": "to turn over quickly.  The fish f lipped over and f lipped back over again.  The cat f lipped over and ran away."
        },
        {
            "id": 58,
            "phrase": "flip over someone or something",
            "definition": "Sl. to become very excited about someone or something; to lose control because of someone or something.  I f lipped over her the first time I ever saw her.  The guests really f lipped over the Beef Wellington!"
        },
        {
            "id": 59,
            "phrase": "the flip side",
            "definition": "the “other” side of a phonograph record. On the f lip side, we have another version of “Love Me Tender” sung by Sandy Softly.  You really should listen to the f lip side sometime."
        },
        {
            "id": 60,
            "phrase": "flip someone for something",
            "definition": "to flip [a coin] with someone to determine the posession of something or the right to do something. Maybe it’s yours; maybe it’s mine. I’ll f lip you for it."
        },
        {
            "id": 61,
            "phrase": "flip someone or something over†",
            "definition": "to turn someone or something over quickly. He f lipped over the fish and removed the scales from its other side. Billy f lipped Bobby over and started hitting him on the other side."
        },
        {
            "id": 62,
            "phrase": "flirt with someone",
            "definition": "to tease or trifle with someone alluringly.  Are you f lirting with me? _ Everyone knows that married men aren’t supposed to f lirt with anyone."
        },
        {
            "id": 63,
            "phrase": "flirt with the idea of doing something",
            "definition": "to think about doing something; to toy with an idea; to consider something, but not too seriously.  I f lirted with the idea of going to Europe for two weeks.  Jane f lirted with the idea of quitting her job."
        },
        {
            "id": 64,
            "phrase": "flit about",
            "definition": "to move about quickly; to dart about._A large number of hummingbirds were f litting about. Butterf lies and moths flitted about among the trees and f lowers."
        },
        {
            "id": 65,
            "phrase": "flit from person to person",
            "definition": "to move quickly from person to person or thing to thing.  Tom flitted quickly from person to person, handing out snacks and beverages.  The singer f litted from table to table, working the crowd for tips."
        },
        {
            "id": 66,
            "phrase": "flit from something to something else",
            "definition": "[for an insect] to fly quickly from one thing to another.  The butterf ly f litted from f lower to f lower."
        },
        {
            "id": 67,
            "phrase": "float a loan",
            "definition": "to get a loan of money; to arrange for a loan of money.  I couldn’t afford to pay cash for the car, so I f loated a loan.  They needed money, so they had to f loat a loan."
        },
        {
            "id": 68,
            "phrase": "float around",
            "definition": "to float from here to there freely. All sorts of paper and trash were f loating around on the surface of the pond. Water hyacinths f loated around, making a very tropical scene."
        },
        {
            "id": 69,
            "phrase": "float into something",
            "definition": "to move on water or in air into something. The huge cruise ship f loated majestically into the harbor.  The kite f loated into a tree and was ruined."
        },
        {
            "id": 70,
            "phrase": "float on air",
            "definition": "[for someone] to feel free and euphoric.  I was so happy, I was f loating on air. Mary was f loating on air after she won first prize."
        },
        {
            "id": 71,
            "phrase": "float through something",
            "definition": "to move slowly through water or air, gently.  The boats f loated through the water slowly and gracefully.  As the clouds f loated through the sky, they cast blotchy shadows on the ground."
        },
        {
            "id": 72,
            "phrase": "float (up)on something",
            "definition": "to drift as if on the surface of something; to drift along through the air. (Upon is formal and less commonly used than on.) _The little tufts of dandelion seeds f loated upon the breeze.  The f luff f loated on the breeze."
        },
        {
            "id": 73,
            "phrase": "flock after someone or something",
            "definition": "to follow someone or something in a group. The children f locked after the man playing the f lute.  Fans f locked after the movie star as he went from his limo into the hotel."
        },
        {
            "id": 74,
            "phrase": "flock around someone or something",
            "definition": "to crowd around someone or something. All the children will f lock around the magician to see how the tricks are performed.  The guests f locked around the birthday cake."
        },
        {
            "id": 75,
            "phrase": "flock in((to) some place)",
            "definition": "[for people] to move into some place in crowds. People were f locking into the store where everything was on sale."
        },
        {
            "id": 76,
            "phrase": "flock to someone or something",
            "definition": "[for people] to come to someone or something in great numbers.  Many people f locked to the shopping mall for the postholiday discounts.  The kids f locked to the movie theater on Saturday afternoon."
        },
        {
            "id": 77,
            "phrase": "flock together",
            "definition": "to gather together in great numbers. (Typically said of birds and sheep.) _A large number of blackbirds f locked together, making a lot of noise.  Do sheep really f lock together in a storm?"
        },
        {
            "id": 78,
            "phrase": "flog someone to death",
            "definition": "to beat someone to death with a whip.  In the movie, the captain ordered the first mate to f log the sailor to death."
        },
        {
            "id": 79,
            "phrase": "flog something to death",
            "definition": "to dwell on something so much that it no longer has any interest.  Stop talking about this! You’ve f logged it to death.  Walter almost f logged the whole matter to death before we stopped him."
        },
        {
            "id": 80,
            "phrase": "flood in(to something)",
            "definition": "[for a fluid] to flow quickly into something in great volume.  The water f looded in and soaked the carpets."
        },
        {
            "id": 81,
            "phrase": "flood out (of something)",
            "definition": "[for water or something that flows] to rush out of something. The water flooded out of the break in the dam."
        },
        {
            "id": 82,
            "phrase": "flood someone or something with something",
            "definition": "to cover or inundate someone or something with something.  We f looded them with praise and carried them on our shoulders.  The rains f looded the fields with standing water."
        },
        {
            "id": 83,
            "phrase": "*the floor",
            "definition": "the exclusive right to address the audience. (*Typically: get ~; have ~; hold ~; grant someone ~.) _When I get the f loor, I’ll make a short speech. The last time you had the f loor, you talked for an hour."
        },
        {
            "id": 84,
            "phrase": "floor it",
            "definition": "to press down hard and fast on the accelerator of a vehicle.  She f loored it and sped off over the hill."
        },
        {
            "id": 85,
            "phrase": "floor someone",
            "definition": "to surprise and astound someone.  His brashness simply f loored me!"
        },
        {
            "id": 86,
            "phrase": "flop around",
            "definition": "[for something] to turn around awkwardly; [for a fish out of water] to squirm and flap.  The hose f lopped around, throwing water first this way and then that, knocking down plants as it f lopped.  A number of fish f lopped around in the bottom of the boat."
        },
        {
            "id": 87,
            "phrase": "flop as something",
            "definition": "to be a failure in a particular aspect of something in one’s life or career. He f lopped as an actor.  I don’t want to f lop as a public speaker."
        },
        {
            "id": 88,
            "phrase": "flop down",
            "definition": "to sit down heavily or awkwardly.  Be graceful. Don’t just f lop down! _ When I reached the chair, all I could do was f lop down."
        },
        {
            "id": 89,
            "phrase": "flop into something",
            "definition": "[for someone] to fall or drop into something, such as bed, a chair, a bathtub, etc.  Maggie f lopped into the chair and slipped off her shoes.  Tom f lopped into bed and fell fast asleep."
        },
        {
            "id": 90,
            "phrase": "flop someone or something over†",
            "definition": "to turn someone or something over, awkwardly or carelessly.  They f lopped the unconscious man over, searching for his identification.  They f lopped over the injured man."
        },
        {
            "id": 91,
            "phrase": "flora and fauna",
            "definition": "plants and animals.  The magazine story described the f lora and fauna of Panama. We went for a hike in the Finnish wilderness hoping to learn all about the local f lora and fauna."
        },
        {
            "id": 92,
            "phrase": "floral tribute",
            "definition": "Euph. flowers sent to a funeral.  The church was filled with f loral tributes.  Did you wish to make any arrangements for f loral tributes at your grandmother’s funeral?"
        },
        {
            "id": 93,
            "phrase": "flotsam and jetsam",
            "definition": "the floating wreckage of a ship and its cargo, or floating cargo deliberately cast overboard to stabilize a ship in a rough sea. All sorts of f lotsam and jetsam washed up on the beach."
        },
        {
            "id": 94,
            "phrase": "flounce in(to some place)",
            "definition": "to move into a place with exaggerated or jerky motions. A couple of teenagers f lounced into the store and started examining the most expensive merchandise. They f lounced in and caught the eye of the security guard."
        },
        {
            "id": 95,
            "phrase": "flounce out (of some place)",
            "definition": "to bounce or bound out of some place.  She turned up her nose and f lounced out of the shop.  She f lounced out in anger."
        },
        {
            "id": 96,
            "phrase": "flounder around",
            "definition": "to struggle or wallow around.  The whole company is just f loundering around and getting nowhere.  The horse f loundered around, trying to get across the soggy pasture."
        },
        {
            "id": 97,
            "phrase": "flounder through something",
            "definition": "to struggle through something, such as a mire, swamp, etc.  The Jeep f loundered through the swamp without getting stuck. The horse f loundered through the muddy field."
        },
        {
            "id": 98,
            "phrase": "flow across something",
            "definition": "to stream or glide across something.  A mass of cold air flowed across the city and froze us all. The floodwaters f lowed across the fields and ruined the spring planting."
        },
        {
            "id": 99,
            "phrase": "flow along",
            "definition": "to move along evenly, as a liquid flows.  At the base of the dam, the river began to f low along at a slower pace.  The project flowed along quite nicely."
        },
        {
            "id": 100,
            "phrase": "flow away",
            "definition": "to course or move away.  The f loodwaters flowed away as fast as they had come. All the spilled water f lowed away."
        },
        {
            "id": 101,
            "phrase": "flow from something",
            "definition": "to run out from something.  The blood f lowed from the wound on his hand and stained his shirt.  The oil f lowed from the cracked engine and made a mess on the f loor."
        },
        {
            "id": 102,
            "phrase": "flow (from something) (to something)",
            "definition": "to course from one thing to another. This water f lows all the way from Minnesota to the Gulf of Mexico. Rain flows to the river from this very drain."
        },
        {
            "id": 103,
            "phrase": "flow in(to something)",
            "definition": "to course into something; to pour into something.  The words f lowed into my head, and I felt like I could write again.  The water f lowed in when I opened the door on the f lood."
        },
        {
            "id": 104,
            "phrase": "flow out (of something)",
            "definition": "to course out of something.  The apple juice flowed out of the press as we turned the crank.  It stopped flowing out when we had crushed the apples totally."
        },
        {
            "id": 105,
            "phrase": "flow over someone or something",
            "definition": "[for a liquid or something that flows] to move over someone or something.  The water f lowed over the land, covering everything. She slipped and fell into the icy creek and the water f lowed over her, freezing her almost to death."
        },
        {
            "id": 106,
            "phrase": "flow with something",
            "definition": "to have some liquid coursing on the surface or within someone or something.  The sewers were f lowing with the f loodwaters.  Her veins must f low with ice water. She is so cold."
        },
        {
            "id": 107,
            "phrase": "flub something up†",
            "definition": "to mess something up; to ruin something.  I saw you play in the tournament last Friday. You really f lubbed it up, if you don’t mind me saying so.  You really f lubbed up the tournament."
        },
        {
            "id": 108,
            "phrase": "flub the dub",
            "definition": "Inf. to fail to do the right thing.  Martin is f lubbing the dub with the fund-raising campaign.  Please don’t f lub the dub this time."
        },
        {
            "id": 109,
            "phrase": "flub up",
            "definition": "to make an error.  I f lubbed up again!"
        },
        {
            "id": 110,
            "phrase": "fluctuate between someone and someone else",
            "definition": "to waver between choosing one person and another.  I am f luctuating between Sam and Tony as my choice.  The manager f luctuated between Mary and Sarah as the new assistant."
        },
        {
            "id": 111,
            "phrase": "fluctuate between something and something else",
            "definition": "to move between one thing and another; to change from one thing to another. Things seemed to f luctuate between the very good and the very bad. The temperature in here f luctuates between too hot and too cold."
        },
        {
            "id": 112,
            "phrase": "fluctuate with something",
            "definition": "to vary in accord with something. The tides f luctuate with the phase of the moon.  Frank’s blood pressure f luctuates with his mood."
        },
        {
            "id": 113,
            "phrase": "fluff something out†",
            "definition": "[for a bird] to move its feathers outward. The parrot said good night, f luffed its feathers out, and went to sleep.  The bird f luffed out its feathers."
        },
        {
            "id": 114,
            "phrase": "fluff something up†",
            "definition": "to make something soft appear fuller or higher.  Fluff your pillow up before you go to bed.  She f luffed up her pillow before retiring."
        },
        {
            "id": 115,
            "phrase": "flunk out (of something)",
            "definition": "to leave school or a course because of failure.  Fred flunked out of school and never tried to go back.  That’s it. All F’s. I’ve flunked out."
        },
        {
            "id": 116,
            "phrase": "flunk someone out†",
            "definition": "to give one a grade that forces one to leave school or a course. The math professor flunked me out. He expects too much.  She flunked out half the class!"
        },
        {
            "id": 117,
            "phrase": "flush something away†",
            "definition": "to wash something unwanted away.  Flush all this mess away! _ Fred f lushed away all the leaves on the sidewalk."
        },
        {
            "id": 118,
            "phrase": "flush something out†",
            "definition": "to clean something out with a flow of liquid. Flush the fuel line out to clean it. Please f lush out the fuel line and clean it."
        },
        {
            "id": 119,
            "phrase": "flush with something",
            "definition": "even with something; sharing a surface with something.  The edge of the sink is f lush with the counter.  The wood flooring is f lush with the carpet so people won’t trip."
        },
        {
            "id": 120,
            "phrase": "flutter down",
            "definition": "[for flying or falling things] to flap or float downward. The butterf lies f luttered down onto the flowers.  The leaves f luttered down from the trees when the breeze blew."
        },
        {
            "id": 121,
            "phrase": "flutter over someone or something",
            "definition": "to fly or flap above someone or something. (Also said of a person being fussy about someone or something.) _The little moths f luttered over us while we were in the garden. The birds f lutter over the fountain, eager for a bath."
        },
        {
            "id": 122,
            "phrase": "fly across something",
            "definition": "[for a bird or a plane] to move in the air across something.  A bird f lew across the open area in the forest.  A large jet f lew across the clear blue sky."
        },
        {
            "id": 123,
            "phrase": "fly apart",
            "definition": "to break apart, throwing pieces around. Don’t run the engine too fast or it will f ly apart! _ Mary’s bicycle wheel f lew apart during the race."
        },
        {
            "id": 124,
            "phrase": "fly around",
            "definition": "to soar or float aloft randomly.  There were insects f lying around everywhere. Planes f lew around all day and all night, making it hard to sleep."
        },
        {
            "id": 125,
            "phrase": "fly around someone or something",
            "definition": "to soar or float in the air near someone or something.  We saw seven helicopters f lying around the stadium.  A bunch of mosquitoes f lew around me."
        },
        {
            "id": 126,
            "phrase": "fly at someone or something",
            "definition": "to attack someone or something suddenly and violently.  The angry bird f lew at its attacker.  She f lew at him, threatening to scratch his eyes out."
        },
        {
            "id": 127,
            "phrase": "fly away",
            "definition": "to take flight and depart.  The owl hooted one last hoot and f lew away. All the birds f lew away when the cat came around."
        },
        {
            "id": 128,
            "phrase": "fly by",
            "definition": "to soar past, flying.  Three jet fighters f lew by. A huge hawk f lew by, frightening all the smaller birds."
        },
        {
            "id": 129,
            "phrase": "fly from someone or something (to something)",
            "definition": "to escape from something or some place to a place of safety.  The family had to f ly from their pursuers to a place of safety outside the country. They f lew from the people chasing them."
        },
        {
            "id": 130,
            "phrase": "fly from something (to something)",
            "definition": "to go from something or some place to some other place by air. We had to f ly from Miami to Raleigh to get a f light to Chicago. We were able to f ly from Miami at the last minute."
        },
        {
            "id": 131,
            "phrase": "a fly in the ointment",
            "definition": "a small, unpleasant matter that spoils something; a drawback. We enjoyed the play, but the f ly in the ointment was not being able to find my hat afterward.  It sounds like a good idea, but there must be a f ly in the ointment somewhere."
        },
        {
            "id": 132,
            "phrase": "fly into a rage",
            "definition": "to become enraged suddenly. When he heard the report, he f lew into a rage.  We were afraid that she would f ly into a rage."
        },
        {
            "id": 133,
            "phrase": "fly into the face of danger",
            "definition": "to take great risks; to threaten or challenge danger, as if danger were a person. (This may refer to flying, as in an airplane, but not necessarily.) _ John plans to go bungee jumping this weekend. He really likes f lying into the face of danger. Willard was not exactly the type to f ly into the face of danger, but tonight was an exception, and he ordered extra-hot enchiladas."
        },
        {
            "id": 134,
            "phrase": "fly off",
            "definition": "to take to flight quickly.  The stork f lew off before we got a good look at it.  The little birds f lew off and things were quiet again."
        },
        {
            "id": 135,
            "phrase": "fly off the handle",
            "definition": "to lose one’s temper. Every time anyone mentions taxes, Mrs. Brown f lies off the handle.  If she keeps f lying off the handle like that, she’ll have a heart attack."
        },
        {
            "id": 136,
            "phrase": "fly off with someone or something",
            "definition": "to depart with someone or something by air.  The eagle f lew off with the kitten.  The pilot f lew off with the eight passengers."
        },
        {
            "id": 137,
            "phrase": "fly out (of something)",
            "definition": "to leave a place by air.  We are going to f ly out of Manaus on a charter.  We f lew out on time."
        },
        {
            "id": 138,
            "phrase": "fly over someone or something",
            "definition": "to soar or glide over someone or something.  We saw an eagle f ly over us.  The plane f lew over the desert."
        },
        {
            "id": 139,
            "phrase": "fly past (someone or something)",
            "definition": "to soar or glide past someone or something.  The stone f lew past Mike’s left ear, and he ducked.  The plane f lew past the cloud bank."
        },
        {
            "id": 140,
            "phrase": "fly the coop",
            "definition": "to escape; to get out or get away. (Alludes to a chicken escaping from a chicken coop.) _ I couldn’t stand the party, so I f lew the coop.  The prisoner f lew the coop at the first opportunity."
        },
        {
            "id": 141,
            "phrase": "fly to someone or something",
            "definition": "to go to someone or something quickly and eagerly; to flee to someone or something.  She f lew to his arms as he got off the boat.  Harry f lew to Gloria and hugged her tight."
        },
        {
            "id": 142,
            "phrase": "fly to something",
            "definition": "to go to something or some place by air.  After Miami, we f ly to Chicago.  Let’s f ly to Paris for lunch."
        },
        {
            "id": 143,
            "phrase": "fly up to something",
            "definition": "to go by air to a place at a higher elevation or to a place in the north.  We will f ly up to St. Paul for the holidays. I want to f ly up to Alberta, Canada, for the summer."
        },
        {
            "id": 144,
            "phrase": "fly-by-night",
            "definition": "irresponsible; untrustworthy. (Alludes to a person who sneaks away secretly in the night.) _The carpenter we hired was a f ly-by-night worker who did a very bad job. You shouldn’t deal with a f ly-by-night merchant."
        },
        {
            "id": 145,
            "phrase": "flying high",
            "definition": "1. Fig. very successful in one’s ambitions; in an important or powerful position. (Often with the implication that this is not the usual situation or will change.) _ The government is f lying high just now, but wait until the budget is announced. He’s f lying high these days, but he comes from a very poor family. 2. Fig. in a state of euphoria. (From good news, success, or drugs.) _ Wow! Todd is really f lying high. Did he discover a gold mine? _ Sally is f lying high. What’s she on?"
        },
        {
            "id": 146,
            "phrase": "foam at the mouth",
            "definition": "to create froth or foam around the mouth, as with some diseases.  The poor dog was foaming at the mouth and looked quite dangerous. What does it mean when a cow foams at the mouth?"
        },
        {
            "id": 147,
            "phrase": "foam up",
            "definition": "[for something, such as soap or milk] to make foam or lather.  Milk will foam up when it is boiled.  The boiling soup foamed up and slopped over the pot."
        },
        {
            "id": 148,
            "phrase": "fob someone or something off† (on(to) someone)",
            "definition": "to get rid of someone or something by transferring someone or something to someone.  Don’t try to fob your girlfriend off on me! _ He also fobbed off a bad car on Jane.  Some car dealers are always trying to fob something off."
        },
        {
            "id": 149,
            "phrase": "focus on someone or something",
            "definition": "to aim and adjust a lens (including the lens in the eye) onto someone or something.  I focused on the f lower and pressed the shutter release.  I focused on Fred and snapped just as he moved."
        },
        {
            "id": 150,
            "phrase": "focus something on someone or something",
            "definition": "to aim a lens at someone or something and adjust the lens for clarity.  I focused the binoculars on the bird and stood there in awe at its beauty.  He focused the camera on Jane and snapped the shutter."
        },
        {
            "id": 151,
            "phrase": "fog over",
            "definition": "[for something made of glass] to become covered over with water vapor.  The windshield fogged over because I forgot to turn on the defroster.  The mirror fogged over, and I couldn’t see to shave."
        },
        {
            "id": 152,
            "phrase": "fog something up†",
            "definition": "to make something made of glass become covered with a film of water vapor.  The moisture fogged the windshield up, and we had to stop to clean it off.  The moisture fogged up the glass."
        },
        {
            "id": 153,
            "phrase": "fog up",
            "definition": "[for something made of glass] to become partially or completely obscured by a film of water vapor.  The glass fogged up, and we couldn’t see out."
        },
        {
            "id": 154,
            "phrase": "the foggiest (idea)",
            "definition": "(even) a hazy idea. (Usually in the negative.) _ I’m sorry I don’t know. I haven’t the foggiest.  I don’t have the foggiest idea of how to do this."
        },
        {
            "id": 155,
            "phrase": "foist someone or something off† (on someone or something)",
            "definition": "to cast someone or something unwanted off on someone or a group.  Please don’t try to foist cheap merchandise off on me. Don’t foist off your brother on me! _You can’t foist that stuff off! It’s worthless! People won’t buy it!"
        },
        {
            "id": 156,
            "phrase": "fold back",
            "definition": "[for a sheet of something] to bend back.  The cloth folded back, revealing the faded upholstery below.  The top page folded back, revealing a neatly typed manuscript."
        },
        {
            "id": 157,
            "phrase": "fold one’s hands",
            "definition": "to bring one’s hands together, palm to palm, with the fingers interlocking; to grasp one’s hands together, palm to palm, perpendicular to one another.  Please fold your hands and put them on the table while the teacher reads you a story.  Please fold your hands and be quiet."
        },
        {
            "id": 158,
            "phrase": "fold something away†",
            "definition": "to fold something up and put it away.  Please fold the maps away.  Please fold away the maps neatly."
        },
        {
            "id": 159,
            "phrase": "fold something back†",
            "definition": "to bend a sheet or flap of something back. She very carefully folded the page back to mark her place in the book.  She folded back the page to mark her place in the book. The surgeon folded the f lap of skin back, revealing the torn ligament."
        },
        {
            "id": 160,
            "phrase": "fold something over†",
            "definition": "to double something over on itself; to make a fold in something.  I folded the paper over twice to make something I could fan myself with. Fold over each sheet, and then place it on the stack."
        },
        {
            "id": 161,
            "phrase": "fold something up†",
            "definition": "to double something over into its original folded position.  Please fold the paper up when you are finished.  Please fold up the paper."
        },
        {
            "id": 162,
            "phrase": "fold, spindle, or mutilate",
            "definition": "to harm or disfigure. Referring to a once-standard line printed on machine-readable documents, such as computer punch cards. (Such a document, if folded, placed on a bill spike, or otherwise punctured, would no longer be machine-readable.) _ At the bottom of the bill, it said “do not fold, spindle, or mutilate,” and Jane, in her anger, did all three.  Look here, chum, if you don’t want to get folded, spindled, or mutilated, you had better do what you are told!"
        },
        {
            "id": 163,
            "phrase": "fold up",
            "definition": "[for something] to close by folding.  The table just folded up with no warning, trapping my leg."
        },
        {
            "id": 164,
            "phrase": "folding money",
            "definition": "bills of various dollar denominations.  I don’t want a check. Give me folding money! _You got any folding money with you?"
        },
        {
            "id": 165,
            "phrase": "follow on (after someone or something)",
            "definition": "to depart and arrive after someone or something.  I can’t leave now. I will have to follow on after the others.  I will follow on later."
        },
        {
            "id": 166,
            "phrase": "follow one’s heart",
            "definition": "to act according to one’s feelings; to obey one’s sympathetic or compassionate inclinations.  I couldn’t decide what to do, so I just followed my heart.  I trust that you will follow your heart in this matter."
        },
        {
            "id": 167,
            "phrase": "follow one’s nose",
            "definition": "to go straight ahead, the direction that one’s nose is pointing. The town that you want is straight ahead on this highway. Just follow your nose.  The chief ’s office is right around the corner. Turn left and follow your nose."
        },
        {
            "id": 168,
            "phrase": "follow orders",
            "definition": "to do as one has been instructed.  You have to learn to follow orders if you want to be a Marine.  I didn’t do anything wrong. I was only following orders."
        },
        {
            "id": 169,
            "phrase": "follow someone or something out",
            "definition": "to go out right after someone or something.  I followed her out and asked her if I could take her home. The dog followed Billy out and went to school with him."
        },
        {
            "id": 170,
            "phrase": "follow someone’s lead",
            "definition": "to do as someone else does; to accept someone’s guidance; to follow someone’s direction.  Just follow my lead and you will not get lost.  John followed his father’s lead and became a lawyer."
        },
        {
            "id": 171,
            "phrase": "follow suit",
            "definition": "to follow in the same pattern; to follow someone else’s example. (From card games.) _ Mary went to work for a bank, and Jane followed suit. Now they are both head cashiers.  The Smiths went out to dinner, but the Browns didn’t follow suit. They stayed home."
        },
        {
            "id": 172,
            "phrase": "follow the crowd",
            "definition": "to do what everyone else is doing.  I am an independent thinker. I could never just follow the crowd. When in doubt, I follow the crowd. At least I don’t stand out like a fool."
        },
        {
            "id": 173,
            "phrase": "*fond of someone or something",
            "definition": "liking someone or something. (*Typically: be ~; become ~.) _ I’m fond of chocolate.  Mary isn’t fond of me, but I’m fond of her."
        },
        {
            "id": 174,
            "phrase": "food for thought",
            "definition": "something for someone to think about; issues to be considered.  Your essay has provided me with some interesting food for thought.  My adviser gave me some food for thought about job opportunities."
        },
        {
            "id": 175,
            "phrase": "A fool and his money are soon parted.",
            "definition": "Prov. Foolish people spend money, without thinking. (Perceived as a rebuke if you say it about the person you are addressing.) _ Go ahead and buy a diamond collar for your dog if you really want to. A fool and his money are soon parted. Bill sends a check to every organization that asks him for money. A fool and his money are soon parted."
        },
        {
            "id": 176,
            "phrase": "fool around",
            "definition": "to waste time doing something unnecessary or doing something amateurishly.  Stop fooling around and clean your room as I told you. I wish you didn’t spend so much time fooling around."
        },
        {
            "id": 177,
            "phrase": "fool (around) with someone or something",
            "definition": "1. to waste time in the company of someone or a group.  Stop fooling around with those guys. They’re up to no good most of the time. Better not fool around with part-time work. Go get a good job if you can. 2. to have dealings with or tamper with someone or something.  You had better not fool around with my little sister.  Don’t fool with that thing! 3. to challenge or threaten someone or something. You had better not fool around with me, if you know what’s good for you.  Don’t fool with the police force!"
        },
        {
            "id": 178,
            "phrase": "Fool me once, shame on you; fool me twice, shame on me.",
            "definition": "Prov. After being tricked once, one should be wary, so that the person cannot trick you again. Fred: Would you like a can of peanuts? Jane: The last can of peanuts you gave me had a toy snake in it. Fred: This one really is peanuts. Jane: Fool me once, shame on you; fool me twice, shame on me."
        },
        {
            "id": 179,
            "phrase": "a fool’s paradise",
            "definition": "a state of being happy for foolish or unfounded reasons. I’m afraid that Sue’s marital happiness is a fool’s paradise; there are rumors that her husband is unfaithful.  Fred is confident that he’ll get a big raise this year, but I think he’s living in a fool’s paradise."
        },
        {
            "id": 180,
            "phrase": "fool someone into something",
            "definition": "to deceive someone or oneself into doing something.  You’ll never fool me into believing you. We fooled the boss into giving us all the day off."
        },
        {
            "id": 181,
            "phrase": "Fools rush in where angels fear to tread.",
            "definition": "Prov. Foolish people usually do not understand when a situation is dangerous, so they are not afraid to do things that would frighten more sensible people.  Alan: Bob is too scared to go in and confront the boss, so I’m going to. Jane: Fools rush in where angels fear to tread."
        },
        {
            "id": 182,
            "phrase": "*a foot in both camps",
            "definition": "an interest in or to support each of two opposing groups of people. (*Typically: get ~; have ~; give someone ~.) _The shop steward had been promised a promotion and so had a foot in both camps during the strike—workers and management. Mr. Smith has a foot in both camps in the parent-teacher dispute. He teaches math, but he has a son at the school."
        },
        {
            "id": 183,
            "phrase": "foot the bill (for something)",
            "definition": "to pay for something; to pay for a bill. My boss took me out for lunch and the company footed the bill.  You paid for dinner last time. Let me foot the bill for lunch today."
        },
        {
            "id": 184,
            "phrase": "*a foothold (somewhere)",
            "definition": "an initial position of support; a starting point. (*Typically: get ~; have ~; help someone get ~.) _It’s difficult to get a foothold in the education market when schools are laying off teachers. Max’s father helped him get a foothold in the textile industry."
        },
        {
            "id": 185,
            "phrase": "foot-in-mouth disease",
            "definition": "the tendency to say the wrong thing at the wrong time. I suffer a lot from foot-in-mouth disease.  Well, Ralph has foot-in-mouth disease again."
        },
        {
            "id": 186,
            "phrase": "footloose and fancy-free",
            "definition": "without long-term responsibilities or commitments.  All the rest of them have wives, but John is footloose and fancy-free.  Mary never stays long in any job. She likes being footloose and fancy-free."
        },
        {
            "id": 187,
            "phrase": "for a living",
            "definition": "[of work] done to earn enough money to live.  John paints houses for a living.  What do you do for a living?"
        },
        {
            "id": 188,
            "phrase": "*for a song",
            "definition": "cheaply. (As if the singing of a song were payment. *Typically: buy something ~; get something ~; pick up someone ~.) _No one else wanted it, so I picked it up for a song. I could buy this house for a song, because it’s so ugly."
        },
        {
            "id": 189,
            "phrase": "for all I care",
            "definition": "I don’t care if (something happens).  For all I care, the whole city council can go to the devil.  They can all starve for all I care."
        },
        {
            "id": 190,
            "phrase": "for all I know",
            "definition": "according to the information I have; I think; probably. (Usually implies uncertainty.) _ For all I know, the mayor has resigned already.  She may have gone to town for all I know."
        },
        {
            "id": 191,
            "phrase": "for all intents and purposes",
            "definition": "Cliché seeming as if; looking as if. Tom stood there, looking, for all intents and purposes, as if he could strangle Sally, but, being the gentleman that he is, he just glowered. Mary: Is the car washed now? John: For all intents and purposes, yes, but I didn’t dry it yet."
        },
        {
            "id": 192,
            "phrase": "for (all) one’s trouble",
            "definition": "in spite of one’s efforts; in return for one’s efforts. (Implies that the “trouble” was not worth taking, or was harmful.) _ He got a punch in the jaw for all his trouble.  For her trouble, she got only honorable mention."
        },
        {
            "id": 193,
            "phrase": "for all practical purposes",
            "definition": "as might be reasonably expected; essentially.  For all practical purposes, this is simply a matter of right and wrong.  This should be considered final, for all practical purposes."
        },
        {
            "id": 194,
            "phrase": "for all someone’s problems",
            "definition": "in spite of a person’s problems (as specified).  For all her complaining, she still seems to be a happy person.  For all my aches and pains, I’m still rather healthy."
        },
        {
            "id": 195,
            "phrase": "for all the world",
            "definition": "1. exactly; precisely. (Especially with look.) _ She sat there looking for all the world as if she was going to cry.  It started out seeming for all the world like a beautiful day. Then a storm came up. 2. everything. (Usually in the negative.) _ I wouldn’t give up my baby for all the world.  They wouldn’t sell their property for all the world."
        },
        {
            "id": 196,
            "phrase": "for better or for worse",
            "definition": "under any conditions; no matter what happens.  I married you for better or for worse.  For better or for worse, I’m going to quit my job."
        },
        {
            "id": 197,
            "phrase": "for days on end",
            "definition": "for many days.  We kept on traveling for days on end.  Doctor, I’ve had this pain for days on end."
        },
        {
            "id": 198,
            "phrase": "for fear of something",
            "definition": "out of fear for something; because of fear of something. He doesn’t drive for fear of an accident. They lock their car doors for fear of being attacked."
        },
        {
            "id": 199,
            "phrase": "for free",
            "definition": "for no charge or cost; free of any cost.  They let us into the movie for free.  I will let you have a sample of the candy for free."
        },
        {
            "id": 200,
            "phrase": "for good",
            "definition": "forever; permanently.  I finally left home for good. They tried to repair it many times before they fixed it for good."
        },
        {
            "id": 201,
            "phrase": "for good measure",
            "definition": "as extra; (adding) a little more to make sure there is enough.  When I bought a pound of nails, the clerk threw in a few extra nails for good measure.  I always put a little extra salt in the soup for good measure."
        },
        {
            "id": 202,
            "phrase": "for hours on end",
            "definition": "for many hours.  We sat and waited in the emergency room for hours on end. The children were happy to play video games for hours on end."
        },
        {
            "id": 203,
            "phrase": "for instance",
            "definition": "for example.  I’ve lived in many cities, for instance, Boston, Chicago, and Detroit.  Jane is very generous. For instance, she volunteers at the hospital and gives money to charities."
        },
        {
            "id": 204,
            "phrase": "for keeps",
            "definition": "forever. Does that mean I’m going to have this scar for keeps? _ This is yours for keeps. Enjoy it."
        },
        {
            "id": 205,
            "phrase": "for life",
            "definition": "for the remainder of one’s life.  The accident caused me to become blind for life. She will stay in prison for life."
        },
        {
            "id": 206,
            "phrase": "for miles",
            "definition": "to or in a distance extending two or more miles.  The huge field of wheat extends for miles.  We traveled for miles without stopping."
        },
        {
            "id": 207,
            "phrase": "for my money",
            "definition": "in my opinion (as regards value or worth).  That’s the best brand of tools there is, for my money.  For my money, you can’t go wrong with a pure wool sweater."
        },
        {
            "id": 208,
            "phrase": "for one’s (own) part",
            "definition": "as far as one is concerned; from one’s point of view.  For my own part, I wish to stay here.  For her part, she prefers chocolate."
        },
        {
            "id": 209,
            "phrase": "for one’s (own) sake",
            "definition": "for one’s good or benefit; in honor of someone.  I have to earn a living for my family’s sake.  I did it for my mother’s sake."
        },
        {
            "id": 210,
            "phrase": "for real",
            "definition": "Inf. genuine; not imaginary. Ken is really strange. Is he for real? _ This whole day has been weird, it just isn’t for real."
        },
        {
            "id": 211,
            "phrase": "for safekeeping",
            "definition": "for the purpose of keeping someone or something safe.  I put my jewelry in the vault for safekeeping.  I checked my fur coat at the entrance to the bar for safekeeping."
        },
        {
            "id": 212,
            "phrase": "for sale",
            "definition": "available for purchase; buyable.  Is this item for sale? _ How long has this house been for sale? _ My car is for sale. Are you interested?"
        },
        {
            "id": 213,
            "phrase": "For shame!",
            "definition": "That is shameful! _ Sue: Did you hear that Tom was in jail? Fred: For shame! What did he do? Sue: Nobody knows.  Mary: I’ve decided not to go to the conference. John: For shame! Who will represent us?"
        },
        {
            "id": 214,
            "phrase": "for short",
            "definition": "as an abbreviation.  The Internal Revenue Service is known as the IRS for short.  David goes by Dave for short."
        },
        {
            "id": 215,
            "phrase": "for sure",
            "definition": "for certain.  I will be there for sure.  Sally: Are you ready to go? Bob: For sure. Sally: Then, let’s go."
        },
        {
            "id": 216,
            "phrase": "for that matter",
            "definition": "besides; in addition.  If you’re hungry, take one of my doughnuts. For that matter, take two.  I don’t like this house. The roof leaks. For that matter, the whole place is falling apart.  Tom is quite arrogant. So is his sister, for that matter."
        },
        {
            "id": 217,
            "phrase": "for the asking",
            "definition": "if one just asks (for something); simply by asking; on request.  Do you want to use my car? It’s yours for the asking.  I have an extra winter coat that’s yours for the asking."
        },
        {
            "id": 218,
            "phrase": "*for the better",
            "definition": "to be an improvement. (*Typically: be ~; be a change ~.) _ A change of government would be for the better. A new winter coat would certainly be for the better."
        },
        {
            "id": 219,
            "phrase": "for the birds",
            "definition": "worthless; undesirable. This television program is for the birds.  Winter weather is for the birds."
        },
        {
            "id": 220,
            "phrase": "for the duration",
            "definition": "for the whole time that something continues; for the entire period of time required for something to be completed; for as long as something takes.  We are in this war for the duration. However long it takes, we’ll wait. We are here for the duration."
        },
        {
            "id": 221,
            "phrase": "for the fun of it",
            "definition": "just for the entertainment value of doing it.  We went on a picnic just for the fun of it."
        },
        {
            "id": 222,
            "phrase": "for the good of someone or something",
            "definition": "for the benefit, profit, or advantage of someone or something.  The president said the strict drug laws were for the good of the country. David took a second job for the good of his family."
        },
        {
            "id": 223,
            "phrase": "for the life of me",
            "definition": "at all; even one little bit. (Used with a negative.) _ For the life of me, I can’t figure this out.  I can’t for the life of me climb up a mountain."
        },
        {
            "id": 224,
            "phrase": "for the most part",
            "definition": "mostly; in general. For the most part, the class is enjoying geometry.  I like working here for the most part."
        },
        {
            "id": 225,
            "phrase": "for the record",
            "definition": "so that (one’s own version of ) the facts will be known; for open, public knowledge. (This often is said when there are reporters present.) _ I’d like to say—for the record—that at no time have I ever accepted a bribe from anyone.  For the record, I’ve never been able to get anything done around city hall without bribing someone."
        },
        {
            "id": 226,
            "phrase": "for your information",
            "definition": "a phrase that introduces or follows a piece of information. (Can be spoken with considerable impatience.) _Mary: What is this one? Sue: For your information, it is exactly the same as the one you just asked about. Bob: How long do I have to wait here? Bill: For your information, we will be here until the bus driver feels that it is safe to travel."
        },
        {
            "id": 227,
            "phrase": "forage (around) (for something)",
            "definition": "to search for something, especially something to eat.  I will go to the kitchen and forage around for some cereal or something.  The rabbits got into the garden and were foraging for a good meal."
        },
        {
            "id": 228,
            "phrase": "forbidden fruit",
            "definition": "someone or something that one finds attractive or desirable partly because having the person or thing is immoral or illegal. (Biblical; from the apple in the Garden of Eden that was forbidden to Adam by God.) _ Jim flirts with his sister-in-law only because she’s forbidden fruit.  The boy watches that program only when his parents are out. It’s forbidden fruit."
        },
        {
            "id": 229,
            "phrase": "force someone or an animal from something",
            "definition": "to drive someone or an animal away from something.  We forced the horses from the corral, putting them back into the pasture.  I forced Tom from the room and locked the door."
        },
        {
            "id": 230,
            "phrase": "force someone or something down†",
            "definition": "to press or push someone or something downward.  I forced him down and slipped the handcuffs on him.  The cop forced down the thug and handcuffed him. I forced the dog down and held it there."
        },
        {
            "id": 231,
            "phrase": "force someone or something (off ) on someone",
            "definition": "to make someone take someone or something.  I didn’t want it, but she forced it off on me.  She forced her nephew on me and went out shopping."
        },
        {
            "id": 232,
            "phrase": "force someone or something through something",
            "definition": "to push someone or something through an opening.  First, you must force the others through the opening and then go through yourself. We forced the sofa through the door and scarred up the doorjamb."
        },
        {
            "id": 233,
            "phrase": "force someone’s hand",
            "definition": "to force a person to reveal plans, strategies, or secrets. (Alludes to a handful of cards in card playing.) _We didn’t know what she was doing until Tom forced her hand.  We changed our game plan after we forced the other team’s hand in the first period."
        },
        {
            "id": 234,
            "phrase": "force something down†",
            "definition": "to force oneself to swallow something.  I can’t stand sweet potatoes, but I manage to force them down just to keep from making a scene.  She forced down the sweet potatoes."
        },
        {
            "id": 235,
            "phrase": "force something through something",
            "definition": "to press or drive something through something that resists.  They forced the bill through the legislature. We were not able to force the matter through the board of directors."
        },
        {
            "id": 236,
            "phrase": "a force to be reckoned with",
            "definition": "someone or something that is important and powerful and must not be ignored.  Walter is a force to be reckoned with. Be prepared to deal with him.  The growing discontent with the political system is a powerful force to be reckoned with."
        },
        {
            "id": 237,
            "phrase": "fore and aft",
            "definition": "at the front and the back, usually of a boat or ship. They had to attach new lights fore and aft because the old ones were not bright enough to meet the new regulations.  The captain ordered a watch stationed fore and aft."
        },
        {
            "id": 238,
            "phrase": "foreclose on something",
            "definition": "to take the property on which a mortgage is held; to satisfy an unpaid loan by taking ownership of the property put up for security on the loan.  If you don’t pay, we will be forced to foreclose on your house.  The bank foreclosed on our property."
        },
        {
            "id": 239,
            "phrase": "a foregone conclusion",
            "definition": "Cliché a conclusion already reached; an inevitable result.  That the company was moving to California was a foregone conclusion. That the mayor will win reelection is a foregone conclusion."
        },
        {
            "id": 240,
            "phrase": "Forewarned is forearmed.",
            "definition": "Prov. If you know about something beforehand, you can prepare for it.  Before you meet Lily, I should tell you that she’s a little eccentric. Forewarned is forearmed, right? _ Check the temperature before you go outside. Forewarned is forearmed."
        },
        {
            "id": 241,
            "phrase": "Forget (about) it!",
            "definition": "1. Inf. Drop the subject!; Never mind!; Don’t bother me with it.  Jane: Then, there’s this matter of the unpaid bills. Bill: Forget it! You’ll have to pay them all! _ Sally: What’s this I hear about you and Tom? Sue: Forget about it! I don’t want to talk to you about it. 2. Inf. Nothing.  Sue: What did you say? Mary: Forget it! _ Tom: Now I’m ready to go. Sue: Excuse me? Tom: Oh, nothing. Just forget it. 3. Inf. You’re welcome.; It was nothing.  John: Thank you so much for helping me! Bill: Oh, forget it! _ Bob: We’re all very grateful to you for coming into work today on your day off. Mary: Forget about it! No problem!"
        },
        {
            "id": 242,
            "phrase": "forget about someone or something",
            "definition": "1. to put someone or something out of one’s mind.  Don’t forget about me! _ You ought to forget about all that. 2. to fail to remember something at the appropriate time. She forgot about paying the electric bill until the lights were turned off.  She forgot about the children and they were left standing on the corner."
        },
        {
            "id": 243,
            "phrase": "forget one’s manners",
            "definition": "to do something ill-mannered.  Jimmy! Have we forgotten our manners?"
        },
        {
            "id": 244,
            "phrase": "forget oneself",
            "definition": "to forget one’s manners or training. (Said in formal situations in reference to belching, bad table manners, and, in the case of very young children, pantswetting.) _ Sorry, Mother, I forgot myself.  John, we are going out to dinner tonight. Please don’t forget yourself."
        },
        {
            "id": 245,
            "phrase": "Forget you!",
            "definition": "Sl. Drop dead!; Beat it! _ Oh, yeah! Forget you! _ Forget you! Get a life!"
        },
        {
            "id": 246,
            "phrase": "Forgive and forget.",
            "definition": "Prov. You should not only forgive people for hurting you, you should also forget that they ever hurt you.  When my sister lost my favorite book, I was angry at her for weeks, but my mother finally convinced me to forgive and forget. Jane: Are you going to invite Sam to your party? Sue: No way. Last year he laughed at my new skirt. Jane: Come on, Sue, forgive and forget."
        },
        {
            "id": 247,
            "phrase": "forgive someone for something",
            "definition": "to pardon someone for something.  Please forgive me for being late.  He never forgave himself for harming her."
        },
        {
            "id": 248,
            "phrase": "fork some money out† (for something)",
            "definition": "to pay (perhaps unwillingly) for something. (Often mention is made of the amount of money. See the examples.) _ Do you think I’m going to fork twenty dollars out for that book? _ Forking out lots of money for taxes is part of life."
        },
        {
            "id": 249,
            "phrase": "fork something out† (to someone)",
            "definition": "1. Inf. Lit. to serve food to someone, using a fork.  He forked out the chicken to everyone.  He brought up a big dish of fried chicken and forked it out. 2. Fig. to give out something to someone.  We forked the coupons out to everyone who asked for them.  We forked out the coupons."
        }
    ]
}