{
    "dictionary": [
        {
            "id": 0,
            "phrase": "hang someone in effigy",
            "definition": "to hang a dummy or some other figure of a hated person.  They hanged the dictator in effigy.  The angry mob hanged the president in effigy."
        },
        {
            "id": 1,
            "phrase": "hang someone or something from something",
            "definition": "to suspend someone or something from something.  The captain wanted to hang him from the highest yardarm as punishment.  I hung a colorful decoration from the windowsill."
        },
        {
            "id": 2,
            "phrase": "hang someone or something with something",
            "definition": "to suspend someone or something with something, such as a rope, chain, thread, etc. (The past tense hanged is usually used only with the hanging of people.) _ The executioners hanged the criminal with a rope and later with a chain.  They hung the picture with a golden cord."
        },
        {
            "id": 3,
            "phrase": "hang someone out to dry",
            "definition": "to defeat or punish someone.  The boss was really angry at Billie. He yelled at him and hung him out to dry."
        },
        {
            "id": 4,
            "phrase": "hang something on someone",
            "definition": "Sl. to blame something on someone; to frame someone for something. Don’t try to hang the blame on me! _ The sheriff tried to hang the bank robbery on Jed."
        },
        {
            "id": 5,
            "phrase": "hang something on someone or something",
            "definition": "to drape or hook something on someone or something. Hang this sign on Walter and see how he looks.  Please hang this sign on the front door."
        },
        {
            "id": 6,
            "phrase": "hang something out (of something)",
            "definition": "to suspend something outside of something while it is attached to the inside of something.  He hung the rope out of the window so he could escape the burning building. She ran to the window and hung the rope out."
        },
        {
            "id": 7,
            "phrase": "hang something over someone or something",
            "definition": "to suspend something over someone or something.  Sally hung the colorful mobile over the baby’s crib. Please hang these garlands over the party table."
        },
        {
            "id": 8,
            "phrase": "hang something up†",
            "definition": "to return the telephone receiver to its cradle.  Please hang this up when I pick up the other phone.  Please hang up the phone."
        },
        {
            "id": 9,
            "phrase": "hang together",
            "definition": "1. Fig. [for something or a group of people] to hold together; to remain intact. I hope our bridge group hangs together until we are old and gray.  I don’t think that this car will hang together for another minute. 2. Fig. [for a story] to flow from element to element and make sense.  This story simply does not hang together.  Your novel hangs together quite nicely. 3. Fig. [for people] to spend time together. We hung together for a few hours and then went our separate ways. The boys hung together throughout the evening."
        },
        {
            "id": 10,
            "phrase": "hang tough (on something)",
            "definition": "Sl. to stick to one’s position (on something). I decided I’d hang tough on it. I tend to give in too easy.  Yes, just hang tough."
        },
        {
            "id": 11,
            "phrase": "hang up",
            "definition": "1. [for a machine or a computer] to grind to a halt; to stop because of some internal complication.  Our computer hung up right in the middle of printing the report. I was afraid that my computer would hang up permanently. 2. to replace the telephone receiver after a call; to terminate a telephone call.  I said good-bye and hung up.  Please hang up and place your call again."
        },
        {
            "id": 12,
            "phrase": "hang with someone",
            "definition": "Sl. to spend or waste time with someone.  Dave spent the afternoon hanging with Don, and neither one got anything done. I’m going down to the corner and hang with the guys."
        },
        {
            "id": 13,
            "phrase": "happen to someone or something",
            "definition": "to befall someone or something; to occur to someone or something. What is going to happen to me? _ Something awful happened to your car."
        },
        {
            "id": 14,
            "phrase": "happen (up)on someone or something",
            "definition": "to come upon someone or something, as if by accident. on someone or something.) _ I just happened upon a strange little man in the street who offered to sell me a watch.  Andrew happened on a book that interested him, so he bought it."
        },
        {
            "id": 15,
            "phrase": "a happy camper",
            "definition": "a happy person. The boss came in this morning and found his hard disk trashed. He was not a happy camper."
        },
        {
            "id": 16,
            "phrase": "happy hour",
            "definition": "a time to drink a cocktail, starting at about 5:00 p.m. (Often bars have lower prices during “happy hour.”) _ I think that Mary has been starting happy hour a little early. Before noon I think."
        },
        {
            "id": 17,
            "phrase": "Happy is the bride that the sun shines on.",
            "definition": "Prov. It is supposed to be good luck for the sun to shine on a couple on their wedding day. Our wedding day was a sunny one, and most of my relatives made sure to remind me, “Happy is the bride that the sun shines on.”"
        },
        {
            "id": 18,
            "phrase": "Happy is the country which has no history.",
            "definition": "Prov. Since history tends to record only violent, unfortunate, or tumultuous events, a country with no history would be a country lucky enough to have no such unhappy events to record. The history of our country is so full of greed, violence, and dishonesty; happy is the country which has no history."
        },
        {
            "id": 19,
            "phrase": "harbor something against someone or something",
            "definition": "to have and retain a bad feeling of some kind toward someone or something.  I harbor no ill will against you.  Alice does not harbor any bad feeling against the company that let her go."
        },
        {
            "id": 20,
            "phrase": "*hard as nails",
            "definition": "Cliché [of someone] stern and unyielding. (*Also: as ~.) _ Don’t try to bargain with Liz. She’s as hard as nails. Bob may seem sweet and easily swayed, but in fact he’s hard as nails."
        },
        {
            "id": 21,
            "phrase": "*hard feelings",
            "definition": "feelings of resentment or anger. (*Typically: cause ~; have ~; give someone ~.) _ The argument caused a lot of hard feelings, but finally we got over it."
        },
        {
            "id": 22,
            "phrase": "hard of hearing",
            "definition": "[of someone] unable to hear well or partially deaf.  Please speak loudly. I am hard of hearing.  Tom is hard of hearing, but is not totally deaf."
        },
        {
            "id": 23,
            "phrase": "hard on someone",
            "definition": "harming someone’s feelings; demanding much from someone.  I wish you wouldn’t be so hard on me. So I make mistakes. I never said I was perfect."
        },
        {
            "id": 24,
            "phrase": "*the hard sell",
            "definition": "high-pressure selling techniques. (*Typically: get ~; give someone ~.) _They gave me the hard sell, but I still wouldn’t buy the car.  The clerk gave the customer the hard sell."
        },
        {
            "id": 25,
            "phrase": "hard to take",
            "definition": "difficult or painful to accept.  The news was hard to take, but we soon realized that it was all for the best."
        },
        {
            "id": 26,
            "phrase": "hard up (for something)",
            "definition": "greatly in need of something, especially money.  Ann was hard up for cash to pay the bills.  I was so hard up, I couldn’t afford to buy food."
        },
        {
            "id": 27,
            "phrase": "Hard words break no bones.",
            "definition": "Prov. Verbal abuse does not physically hurt you, and therefore you should not be very upset by it. (Can be used to reply to someone who is verbally abusing you.) _ Jill: I can’t believe some of the names Fred called me. Jane: Well, hard words break no bones."
        },
        {
            "id": 28,
            "phrase": "harden oneself to something",
            "definition": "to make oneself capable of bearing something unpleasant. You will have to learn to harden yourself to tragedies like this. They happen every day in a hospital.  She had learned to harden herself to the kinds of poverty she had to work in."
        },
        {
            "id": 29,
            "phrase": "harden something off†",
            "definition": "to accustom a young plant to normal weather so it can be moved from a protected environment to the out-of-doors.  We put the plants by the open window to harden them off.  We hardened off the plants."
        },
        {
            "id": 30,
            "phrase": "harden something up†",
            "definition": "to make something hard or strong.  Put the meat in the freezer awhile to harden it up before you try to slice it thin. Harden up the ice cream a little in the freezer."
        },
        {
            "id": 31,
            "phrase": "harder than the back of God’s head",
            "definition": "Rur. very hard. The soil was harder than the back of God’s head. We had a hard time digging it. The wood was solid and dense and harder than the back of God’s head."
        },
        {
            "id": 32,
            "phrase": "hardly have time to think",
            "definition": "so busy that one can hardly think properly; very busy. I’ve been so busy that I hardly have time to think.  I hardly have time to think in the job that I do. We are just too busy."
        },
        {
            "id": 33,
            "phrase": "hard-nosed",
            "definition": "stern and unforgiving.  Mr. Howe was known to be very hard-nosed, but he could really be friendly if you got to know him."
        },
        {
            "id": 34,
            "phrase": "hark(en) back to something",
            "definition": "1. to have originated as something; to have started out as something. (Harken is an older word meaning “pay heed to.”) _ The word icebox harks back to refrigerators that were cooled by ice.  Our modern breakfast cereals hark back to the porridge and gruel of our ancestors. 2. to remind one of something.  Seeing a horse and buggy in the park harks back to the time when horses drew milk wagons. Sally says it harkens back to the time when everything was delivered by horse-drawn wagons."
        },
        {
            "id": 35,
            "phrase": "harmonize with someone or something",
            "definition": "to blend with someone or something musically.  Please try to harmonize with the rest of the singers! _Will you harmonize with the piano, please?"
        },
        {
            "id": 36,
            "phrase": "harness an animal up†",
            "definition": "to put a harness on an animal, such as a horse. You had better harness the horses up so we can go.  Please harness up the mare for me."
        },
        {
            "id": 37,
            "phrase": "harness someone or an animal to something",
            "definition": "to attach someone, something, or an animal to something with a harness. The instructor harnessed me to the hang glider, and I really began to get nervous. Andrew harnessed the horses to the little wagon."
        },
        {
            "id": 38,
            "phrase": "harp on someone or something",
            "definition": "to keep talking or complaining about someone or something; to refer to someone or something again and again. I wish you would quit harping on Jeff all the time. He couldn’t be all that bad.  Stop harping on my mistakes and work on your own."
        },
        {
            "id": 39,
            "phrase": "has come and gone",
            "definition": "has already arrived and has already departed.  No, Joy is not here. She’s come and gone.  Sorry, you are too late for your appointment. The doctor has come and gone."
        },
        {
            "id": 40,
            "phrase": "(Has the) cat got your tongue?",
            "definition": "Why are you not saying anything? (Often said by adults to children.) _ Grandpa used to terrify me, both because he was big and fierce-looking and because he usually greeted me by bellowing, “Cat got your tongue?” _ Hi, Lisa! How are you? How’s your husband? Are you surprised to see me? What’s the matter, has the cat got your tongue?"
        },
        {
            "id": 41,
            "phrase": "has the world by the tail (with a downhill drag)",
            "definition": "Rur. has destiny under control. The young businessman had the world by the tail with a downhill drag. He had made a million dollars before he was twenty-five.  She’s got the world by the tail now, but her fame won’t last forever."
        },
        {
            "id": 42,
            "phrase": "hash something over† (with someone)",
            "definition": "to discuss something with someone. I need to hash this matter over with you.  I’ve hashed over this business enough."
        },
        {
            "id": 43,
            "phrase": "hash something up†",
            "definition": "1. to chop something up. Now, hash the onion and garlic up and put it in the skillet. Now, hash up the beef and brown it. 2. to mess something up.  Somebody hashed my manuscript up! _ Somebody hashed up my manuscript!"
        },
        {
            "id": 44,
            "phrase": "Haste makes waste.",
            "definition": "Prov. You do not save any time by working too fast; hurrying will cause you to make mistakes, and you will have to take extra time to do the job over again.  Fred: Hurry up and get my car fixed. Alan: Don’t rush me. Haste makes waste."
        },
        {
            "id": 45,
            "phrase": "hatch an animal out†",
            "definition": "to aid in releasing an animal from an egg.  They hatched lots of ducks out at the hatchery.  The farmer hatched out hundreds of chicks each month."
        },
        {
            "id": 46,
            "phrase": "hatchet man",
            "definition": "a man who does the cruel or difficult things for someone else; someone who does someone else’s dirty work. He served as the president’s hatchet man and ended up doing all the dirty work."
        },
        {
            "id": 47,
            "phrase": "hate someone or something like sin",
            "definition": "to hate someone or something a great deal. She won’t eat brussels sprouts. She hates ’em like sin.  I don’t want that man anywhere near me. I hate him like sin."
        },
        {
            "id": 48,
            "phrase": "hate someone’s guts",
            "definition": "to hate someone very much.  Oh, Bob is terrible. I hate his guts! _You may hate my guts for saying so, but I think you’re getting gray hair."
        },
        {
            "id": 49,
            "phrase": "hats off to someone or something",
            "definition": "let us salute or honor someone or something.  Hat’s off to Perry for planning the dinner and finding such a good band."
        },
        {
            "id": 50,
            "phrase": "haul off and do something",
            "definition": "1. Inf. to draw back and do something, such as strike a person.  She hauled off and slapped him hard. Max hauled off and poked Lefty in the nose. 2. Rur. to do something without a great deal of preparation.  The old man hauled off and bought him- self a house.  Someday, I’m going to haul off and buy me a new car."
        },
        {
            "id": 51,
            "phrase": "haul someone in†",
            "definition": "to arrest someone; [for a police officer] to take someone to the police station.  The cop hauled the drunk driver in.  They hauled in the suspects."
        },
        {
            "id": 52,
            "phrase": "haul someone or something over to something",
            "definition": "to drag someone or something over to something. (Fixed order.) _She hauled the boy over to the mess he made and forced him to clean it up.  Ken hauled the logs over to the fireplace and laid the fire."
        },
        {
            "id": 53,
            "phrase": "haul someone (up†) before someone or something",
            "definition": "to bring someone into the presence of someone or something, usually some officer of the law. The officer hauled the suspect up before the judge.  She hauled up the suspect before the judge."
        },
        {
            "id": 54,
            "phrase": "haul something down†",
            "definition": "to pull something down from a higher level. Terry hauled the sail down and put it away.  Please haul down the mainsail."
        },
        {
            "id": 55,
            "phrase": "haul something up† (from something)",
            "definition": "to drag or pull something up from below. Jeff hauled the bucket up from the bottom of the well.  He hauled up the bucket."
        },
        {
            "id": 56,
            "phrase": "have a bad attitude",
            "definition": "to have a negative outlook on things; to be uncooperative.  Perry has a bad attitude and has nothing positive to contribute to the conversation."
        },
        {
            "id": 57,
            "phrase": "have a bad case of the simples",
            "definition": "Rur. to be stupid.  That boy has a bad case of the simples. He can’t understand anything.  She acts smart enough on the playground, but get her in the classroom and she has a bad case of the simples."
        },
        {
            "id": 58,
            "phrase": "have a bad effect (on someone or something)",
            "definition": "to be bad for someone or something.  Aspirin has a bad effect on me.  Cold weather has a bad effect on roses."
        },
        {
            "id": 59,
            "phrase": "have a ball",
            "definition": "to have an exciting time.  I plan to have a ball while I’m on vacation.  Come on, everybody! Let’s have a ball!"
        },
        {
            "id": 60,
            "phrase": "have a bellyful",
            "definition": "Inf. to have as much as one can stand.  I’ve had a bellyful of your whining. Be quiet!"
        },
        {
            "id": 61,
            "phrase": "have a big mouth",
            "definition": "to be a gossiper; to be a person who tells secrets.  Mary has a big mouth. She told Bob what I was getting him for his birthday. You shouldn’t say things like that about people all the time. Everyone will say you have a big mouth."
        },
        {
            "id": 62,
            "phrase": "have a blast",
            "definition": "Inf. to have a great time; to have a lot of fun.  The food was good and we had a blast. Thanks for inviting us to the party."
        },
        {
            "id": 63,
            "phrase": "Have a blimp!",
            "definition": "Sl. Have a good year! (A reference to the Goodyear blimp, which is famous for being at notable events.) _ Good-bye. Have a blimp! _ Have a blimp! See you next summer."
        },
        {
            "id": 64,
            "phrase": "have a blowout",
            "definition": "1. [for one’s car tire] to burst.  I had a blowout on the way here. I nearly lost control of the car.  If you have a blowout in one tire, you should check the other tires. 2. Sl. to have a big, wild party; to enjoy oneself at a big party.  Mary and Bill had quite a blowout at their house Friday night.  Fred and Tom had quite a blowout last night."
        },
        {
            "id": 65,
            "phrase": "have a bone to pick (with someone)",
            "definition": "to have a disagreement to discuss with someone; to have something to argue about with someone.  Hey, Bill. I’ve got a bone to pick with you. Where is the money you owe me? _ I had a bone to pick with her, but she was so sweet that I forgot about it."
        },
        {
            "id": 66,
            "phrase": "have a brush with something",
            "definition": "to have a brief contact with something; to have an experience with something. (Especially with the law. Sometimes a close brush.) _ Ann had a close brush with the law. She was nearly arrested for speeding. When I was younger, I had a brush with scarlet fever, but I got over it."
        },
        {
            "id": 67,
            "phrase": "have a burr under one’s saddle",
            "definition": "Rur. to be irritated by something. Joe has a burr under his saddle because Jane’s going out with Bill tonight. Mary must have a burr under her saddle. She’s been snapping at me all day."
        },
        {
            "id": 68,
            "phrase": "have a buzz on",
            "definition": "to be intoxicated. (Fixed order.) _ Pete has a buzz on and is giggling a lot.  Both of them had a buzz on by the end of the celebration."
        },
        {
            "id": 69,
            "phrase": "have a case (against someone)",
            "definition": "to have much evidence that can be used against someone in court. Do the police have a case against John? _ No, they don’t have a case."
        },
        {
            "id": 70,
            "phrase": "have a change of heart",
            "definition": "to change one’s attitude or decision, usually from a negative to a positive position.  I had a change of heart at the last minute and gave the beggar some money. Since I talked to you last, I have had a change of heart. I now approve of your marrying Sam."
        },
        {
            "id": 71,
            "phrase": "have a clue (about something)",
            "definition": "to know anything about something; to have even a hint about someone or something. (Usually negative.) _I don’t have a clue about where to start looking for Jim.  Why do you think I have a clue about Tom’s disappearance?s"
        },
        {
            "id": 72,
            "phrase": "have a conniption (fit)",
            "definition": "Rur. to get angry or hysterical.  I got so mad I thought I was going to have a conniption. My father had a conniption fit when I got home this morning."
        },
        {
            "id": 73,
            "phrase": "have a death wish",
            "definition": "to seem to be willing to take all sorts of needless risks.  Look at the way that guy drives. He must have some sort of a death wish."
        },
        {
            "id": 74,
            "phrase": "have a familiar ring (to it)",
            "definition": "[for a story or an explanation] to sound familiar.  Your excuse has a familiar ring. Have you done this before? _ This term paper has a familiar ring to it. I think it has been copied."
        },
        {
            "id": 75,
            "phrase": "have a field day",
            "definition": "to experience freedom from one’s usual work schedule; to have a very enjoyable time. (As with children who are released from classes to take part in sports and athletic contests.) _ The boss was gone and we had a field day today. No one got anything done.  The air was fresh and clear and everyone had a field day in the park during the lunch hour."
        },
        {
            "id": 76,
            "phrase": "have a flair for something",
            "definition": "to have a talent for doing something; to have a special ability in some area.  Alice has quite a f lair for designing.  I have a f lair for fixing clocks."
        },
        {
            "id": 77,
            "phrase": "have a gift for (doing) something",
            "definition": "to have a natural talent for doing something. Tony has a gift for writing short stories.  Sharon has a gift for dealing with animals."
        },
        {
            "id": 78,
            "phrase": "have a glass jaw",
            "definition": "to be susceptible to a knockout when struck on the head. (Said only of boxers who are frequently knocked down by a blow to the head.) _ When the prizefighter was knocked out cold by a right to the chin in the first round, the newspapers said he had a glass jaw.  Once a fighter has a glass jaw, he’s finished as a boxer."
        },
        {
            "id": 79,
            "phrase": "have a good arm",
            "definition": "to have a strong and conditioned arm for sports, especially pitching in baseball. Perry had a good arm, but he often pitched wide of the plate."
        },
        {
            "id": 80,
            "phrase": "have a good command of something",
            "definition": "to know something well.  Bill has a good command of French.  Jane has a good command of economic theory."
        },
        {
            "id": 81,
            "phrase": "have a good head on one’s shoulders",
            "definition": "to have common sense; to be sensible and intelligent.  Mary doesn’t do well in school, but she’s got a good head on her shoulders. John has a good head on his shoulders and can be depended on to give good advice."
        },
        {
            "id": 82,
            "phrase": "have a (good) mind to do something",
            "definition": "have an inclination to do something.  I have a good mind to tell him just what I think of him.  She had a mind to go to college, but her folks talked her out of it."
        },
        {
            "id": 83,
            "phrase": "have a good thing going",
            "definition": "to have something of an ongoing nature arranged for one’s own benefit.  Sally paints pictures and sells them at art fairs. She has a good thing going, and she makes good money.  John inherited a fortune and doesn’t have to work for a living anymore. He’s got a good thing going."
        },
        {
            "id": 84,
            "phrase": "Have a good time.",
            "definition": "Enjoy yourself in what you are about to do. (Often said when someone is about to leave for an event.) _ Bill: I’m leaving for the party now. Father: Have a good time.  Sue: Tonight is the formal dance at the Palmer House, and I’m going. Mary: Have a good time. I’m watching television right here."
        },
        {
            "id": 85,
            "phrase": "have a green thumb",
            "definition": "to have the ability to grow plants well.  Just look at Mr. Simpson’s garden. He has a green thumb.  My mother has a green thumb when it comes to houseplants."
        },
        {
            "id": 86,
            "phrase": "have a head for something",
            "definition": "have the mental capacity for something.  Jane has a good head for directions and never gets lost.  Bill doesn’t have a head for figures and should never become an accountant."
        },
        {
            "id": 87,
            "phrase": "have a heart",
            "definition": "to be compassionate; to be generous and forgiving; to have an especially compassionate heart.  Oh, have a heart! Give me some help! _If Anne had a heart, she’d volunteer to help us on the charity drive."
        },
        {
            "id": 88,
            "phrase": "have a heart of gold",
            "definition": "Cliché to be generous, sincere, and friendly. Mary is such a lovely person. She has a heart of gold. You think Tom stole your watch? Impossible! He has a heart of gold."
        },
        {
            "id": 89,
            "phrase": "have a heart of stone",
            "definition": "to be cold and unfriendly.  Sally has a heart of stone. She never even smiles. The villain in the play had a heart of stone. He was cruel to everyone."
        },
        {
            "id": 90,
            "phrase": "have a heart-to-heart (talk)",
            "definition": "to have a sincere and intimate talk. I had a heart-to-heart talk with my father before I went off to college.  I have a problem, John. Let’s sit down and have a heart-to-heart."
        },
        {
            "id": 91,
            "phrase": "have a hitch in one’s gitalong",
            "definition": "Rur. to have a permanent or temporary limp.  Pappy’s got quite a hitch in his gitalong since he broke his hip."
        },
        {
            "id": 92,
            "phrase": "have a keen interest in something",
            "definition": "to have a strong interest in something; to be very interested in something.  Tom had always had a keen interest in music, so he started a band. The children have a keen interest in having a pet, so I bought them a cat."
        },
        {
            "id": 93,
            "phrase": "have a kick to it",
            "definition": "to have a strong or spicy flavor; to have a high alcohol content. I like that salsa. It has a kick to it.  Tom’s moonshine sure has a kick to it—don’t drink too much of it, now!"
        },
        {
            "id": 94,
            "phrase": "have a lot going (for one)",
            "definition": "to have many things working to one’s benefit.  Jane is so talented. She has a lot going for her.  She has a good job and a nice family. She has a lot going."
        },
        {
            "id": 95,
            "phrase": "have a lot on one’s mind",
            "definition": "to have many things to worry about; to be preoccupied.  I’m sorry that I’m so grouchy. I have a lot of troubles on my mind.  He forgot to go to his appointment because he had a lot on his mind."
        },
        {
            "id": 96,
            "phrase": "have a low boiling point",
            "definition": "to anger easily.  Be nice to John. He’s upset and has a low boiling point. Mr. Jones sure has a low boiling point. I hardly said anything, and he got angry."
        },
        {
            "id": 97,
            "phrase": "have a mind as sharp as a steel trap",
            "definition": "to be very intelligent.  She’s a smart kid. Has a mind as sharp as a steel trap.  They say the professor has a mind as sharp as a steel trap, but then why can’t he figure out which bus to take in the morning?"
        },
        {
            "id": 98,
            "phrase": "have a mind of one’s own",
            "definition": "to be very independent. There is no point in telling her what to do. She has a mind of her own."
        },
        {
            "id": 99,
            "phrase": "have a mind to",
            "definition": "to be inclined to do something.  I have a mind to accept your challenge.  Tom had a mind to call up Sally and ask her to dinner."
        },
        {
            "id": 100,
            "phrase": "have a near miss",
            "definition": "to nearly crash or collide.  The airplanes—flying much too close—had a near miss. I had a near miss with a bike while driving over here."
        },
        {
            "id": 101,
            "phrase": "Have a nice flight.",
            "definition": "Please enjoy your flight. (Said when wishing someone well on an airplane trip. Often said by airline personnel to their passengers.) _Clerk: Here’s your ticket, sir. Have a nice f light. Fred: Thanks.  As Mary boarded the plane, the f light attendant said, “Have a nice f light.”"
        },
        {
            "id": 102,
            "phrase": "have a nose for something",
            "definition": "to have the ability to sense or find something, such as news, trouble, gossip, etc.  She really has a nose for news. She’s a good reporter. Fred has a nose for gossip."
        },
        {
            "id": 103,
            "phrase": "have a one-track mind",
            "definition": "to think entirely or almost entirely about one subject.  Adolescent boys often have one-track minds. All they’re interested in is the opposite sex.  Bob has a one-track mind. He can only talk about football."
        },
        {
            "id": 104,
            "phrase": "have a passion for someone or something",
            "definition": "to have a strong feeling of need or desire for someone, something, or some activity. Mary has a great passion for chocolate.  John has a passion for fishing, so he fishes as often as he can."
        },
        {
            "id": 105,
            "phrase": "have a penchant for doing something",
            "definition": "to have a taste, desire, or inclination for doing something.  John has a penchant for eating fattening foods.  Ann has a penchant for buying clothes."
        },
        {
            "id": 106,
            "phrase": "have a place in something",
            "definition": "to have a role in some plan or some activity.  Do I have a place in the negotiations? _ Mary did not have a place in any of this."
        },
        {
            "id": 107,
            "phrase": "have a rare old time",
            "definition": "a fine and enjoyable time at a party or something similar.  We had a rare old time at Tom’s the other night.  I haven’t had a rare old time like that in years."
        },
        {
            "id": 108,
            "phrase": "have a roving eye",
            "definition": "Euph. to be flirtatious; to be interested in having sexual relations outside of marriage. (Usually used to describe men.) _ Poor Maria. Her husband has a roving eye.  When they were first married, he had a roving eye."
        },
        {
            "id": 109,
            "phrase": "have a run of something",
            "definition": "to have a continuous series of events. (Especially bad luck.) _ I had a run of bad luck at the casino.  The city had a run of serious crimes that angered the citizens. The company had a run of huge sales increases over the last few years."
        },
        {
            "id": 110,
            "phrase": "have a run-in (with someone or something)",
            "definition": "to have trouble with someone or something.  I had a run-in with Mrs. Wilson. She’s a hard case. We’ve had a run-in before."
        },
        {
            "id": 111,
            "phrase": "have a score to settle (with someone)",
            "definition": "to have a problem to clear up with someone; to have to get even with someone about something.  I have a score to settle with John since he insulted me at our party.  John and I have a score to settle."
        },
        {
            "id": 112,
            "phrase": "have a scrape (with someone or something)",
            "definition": "to come into contact with someone or something; to have a small battle with someone or something.  I had a scrape with the county sheriff.  John and Bill had a scrape, but they are friends again now."
        },
        {
            "id": 113,
            "phrase": "have a seat",
            "definition": "to sit down. (Often a polite invitation to sit down.) _ Have a seat. I’ll be with you in a minute."
        },
        {
            "id": 114,
            "phrase": "have a set-to (with someone)",
            "definition": "to have an argument or fight with someone.  Perry and Emmet had quite a setto over the choice of music."
        },
        {
            "id": 115,
            "phrase": "have a soft spot (in one’s heart) for someone or an animal",
            "definition": "to have a fondness for someone, something, or an animal.  I have a soft spot in my heart for Jeff. I’ll always be his friend.  Elaine has a soft spot for kittens."
        },
        {
            "id": 116,
            "phrase": "have a spaz",
            "definition": "Sl. to get angry or hysterical; to have a conniption (fit). (Spaz is short for a spastic attack or fit.) _ If my dad hears about this, he’ll have a spaz. The teacher had a spaz when I came in so late."
        },
        {
            "id": 117,
            "phrase": "have a stake in something",
            "definition": "to have something at risk in something; to have a financial or other interest in something.  I have a stake in that company. I want it to make a profit.  I don’t have a stake in it, so I don’t care."
        },
        {
            "id": 118,
            "phrase": "have a stroke",
            "definition": "to experience sudden unconsciousness or paralysis due to an interruption in the blood supply to the brain. (Also used as an exaggeration. See the last example.) _ The patient who received an artificial heart had a stroke two days after the operation. My great-uncle Bill— who is very old—had a stroke last May. Calm down, Bob. Don’t have a stroke over a silly mistake."
        },
        {
            "id": 119,
            "phrase": "have a sweet tooth",
            "definition": "to desire to eat many sweet foods—especially candy and pastries.  I have a sweet tooth, and if I don’t watch it, I’ll really get fat.  John eats candy all the time. He must have a sweet tooth."
        },
        {
            "id": 120,
            "phrase": "have a thing about someone or something",
            "definition": "1. to have a special fear or dislike of someone or something.  Kelly has a thing about Tim. She simply hates him.  I have a thing about snakes. 2. to have a craving for someone or something.  I have a thing about Maggie. I guess I’m in love.  Elaine has a thing about strawberry ice cream. She can’t get enough of it."
        },
        {
            "id": 121,
            "phrase": "have a thirst for something",
            "definition": "to be thirsty for something to drink.  I have a thirst for a tall glass of iced tea."
        },
        {
            "id": 122,
            "phrase": "have (a) use for someone or something",
            "definition": "1. to have need for someone or something. (Often negative. Note the use of any and no in several examples.) _I have no use for Josh and his big fancy car.  See if you have use for this hammer.  Do you have any use for this? _ I have no use for that. 2. to like someone or something. (Often negative. Note the use of any and no.) _ I don’t have any use for sweet potatoes.  I have no use for Harry."
        },
        {
            "id": 123,
            "phrase": "have a way with someone or something",
            "definition": "to have a special and effective way of dealing with someone or something.  She has a way with Jeff. She can get him to do anything.  Sarah has a way with f lowers. She can arrange them beautifully."
        },
        {
            "id": 124,
            "phrase": "have a way with words",
            "definition": "to have talent in the effective or stylish use of words.  Ask Perry to make the announcement. He has a way with words."
        },
        {
            "id": 125,
            "phrase": "have a weakness for someone or something",
            "definition": "to be unable to resist someone or something; to be (figuratively) powerless against someone or something. I have a weakness for chocolate.  John has a weakness for Mary. I think he’s in love."
        },
        {
            "id": 126,
            "phrase": "have a weight problem",
            "definition": "Euph. to be fat; to be overweight.  He had a weight problem when he was a teenager, but he slimmed down once he started exercising. She has a weight problem, but she’s a lovely woman."
        },
        {
            "id": 127,
            "phrase": "have a whale of a time",
            "definition": "to have an exciting or fun time; to have a big time. (Whale is a way of saying big.) _ We had a whale of a time at Sally’s birthday party. Enjoy your vacation! I hope you have a whale of a time."
        },
        {
            "id": 128,
            "phrase": "have all one’s marbles",
            "definition": "to have all one’s mental faculties; to be mentally sound. (Very often with a negative or said to convey doubt.) _I don’t think he has all his marbles.  Do you think Bob has all his marbles?"
        },
        {
            "id": 129,
            "phrase": "have an accident",
            "definition": "1. to experience something that was not foreseen or intended.  Traffic is very bad. I almost had an accident.  Drive carefully. Try to avoid having an accident. 2. Euph. to lose control of the bowels or the bladder. (Usually said of a young child.) _ “Oh, Ann,” cried Mother. “It looks like you’ve had an accident!” _ Mother asked Billy to go to the bathroom before they left so that he wouldn’t have an accident in the car."
        },
        {
            "id": 130,
            "phrase": "have an affair (with someone)",
            "definition": "to have a love affair with someone. When I was 20, I had an affair with a rock star, and really made a fool of myself."
        },
        {
            "id": 131,
            "phrase": "have an appetite for something",
            "definition": "to have a desire to eat something in particular.  I have an appetite for a nice big steak."
        },
        {
            "id": 132,
            "phrase": "have an argument (with someone)",
            "definition": "to argue with someone.  Let’s not have an argument with the boss.  Tom and John had an argument."
        },
        {
            "id": 133,
            "phrase": "have an ax(e) to grind",
            "definition": "to have something to complain about.  Tom, I need to talk to you. I have an ax to grind.  Bill and Bob went into the other room to argue. They had an axe to grind."
        },
        {
            "id": 134,
            "phrase": "have an ear for something",
            "definition": "to have the ability to learn music or languages.  Bill doesn’t have an ear for music. He can’t carry a tune. Mary has a good ear for languages."
        },
        {
            "id": 135,
            "phrase": "have an easy time of it",
            "definition": "to have an experience with something that is less difficult or severe than others have experienced. We were given a hard assignment, but Fred had an easy time of it."
        },
        {
            "id": 136,
            "phrase": "have an effect on someone or something",
            "definition": "to cause a result in someone or something.  The storm had a bad effect on the baby, who cried all night.  Will this have an effect on my taxes?"
        },
        {
            "id": 137,
            "phrase": "have an eye for someone or something",
            "definition": "to have a taste or an inclination for someone or something. Bob has an eye for beauty.  He has an eye for color."
        },
        {
            "id": 138,
            "phrase": "have an impact on someone or something",
            "definition": "to leave an impression on someone or something. The sharp change in interest rates had an impact on the housing market.  Your story really had an impact on me."
        },
        {
            "id": 139,
            "phrase": "have arrived",
            "definition": "to have reached a position of power, authority, or prominence.  Jane saw her picture on the cover of the magazine and felt that she had finally arrived. When I got an office with a window, I knew that I had arrived."
        },
        {
            "id": 140,
            "phrase": "Have at it.",
            "definition": "Start doing it.; Start eating your food.  John: Here’s your hamburger. Have at it. Jane: Thanks. Where’s the mustard? _ John: Did you notice? The driveway needs sweeping. Jane: Here’s the broom. Have at it."
        },
        {
            "id": 141,
            "phrase": "have at someone",
            "definition": "to go at someone; to attack someone.  The boys had at the gang members and gave them a beating.  I just knew John was going to have at Fred."
        },
        {
            "id": 142,
            "phrase": "have bats in one’s belfry",
            "definition": "Inf. Fig. to be crazy. You must really have bats in your belfry if you think I’ll put up with that kind of stuff.  Pay no attention to her. She has bats in her belfry."
        },
        {
            "id": 143,
            "phrase": "have been around",
            "definition": "to be experienced in life. (Use with caution since this can also be taken to mean to be promiscuous.) _Ask Sally about how the government works. She’s been around the state capital for years.  They all know a lot about life. They’ve been around."
        },
        {
            "id": 144,
            "phrase": "have been to hell and back",
            "definition": "to have survived a great deal of trouble.  What a terrible day! I feel like I have been to hell and back. After a day of shopping, I feel like I have been to hell and back."
        },
        {
            "id": 145,
            "phrase": "have broad shoulders",
            "definition": "to have wide shoulders.  She has broad shoulders because she exercises and lifts weights."
        },
        {
            "id": 146,
            "phrase": "have carnal knowledge of someone",
            "definition": "Euph. to have had sex with someone. (Formal or jocular.) _ She had never before had carnal knowledge of a man."
        },
        {
            "id": 147,
            "phrase": "have cause to do something",
            "definition": "to have a justifiable reason to do something. Do you have cause to think that Mary took your money? _ He had no cause to yell at me like that."
        },
        {
            "id": 148,
            "phrase": "have clean hands",
            "definition": "to be guiltless. (As if a guilty person would have dirty or bloody hands.) _ Don’t look at me. I have clean hands.  The police took him in, but let him go after questioning because he had clean hands."
        },
        {
            "id": 149,
            "phrase": "have come a long way",
            "definition": "to have traveled a long distance.  You’ve come a long way. You must be tired and hungry.  I’ve come a long way. Please let me rest."
        },
        {
            "id": 150,
            "phrase": "have confidence in someone",
            "definition": "to trust someone; to know that someone will be true. I have confidence in you, and I know you will do well.  Randy tends not to have confidence in anyone."
        },
        {
            "id": 151,
            "phrase": "have designs on someone or something",
            "definition": "to have plans to exploit or somehow take advantage of someone or something.  Mrs. Brown has designs on my apple tree. I think she’s going to cut off the part that hangs over her fence.  Mary has designs on Bill. I think she’ll try to date him."
        },
        {
            "id": 152,
            "phrase": "have dibs on something",
            "definition": "to reserve something for oneself; to claim something for oneself. (Often said by children.) _ I have dibs on the last piece of cake.  John has dibs on the last piece again. It isn’t fair."
        },
        {
            "id": 153,
            "phrase": "have doubts about someone or something",
            "definition": "to have questions or suspicions about someone or something. I have doubts about Alice and whether she can do it. We have no doubts about the usefulness of this project."
        },
        {
            "id": 154,
            "phrase": "have egg on one’s face",
            "definition": "to be embarrassed by something one has done. (As if one went out in public with a dirty face.) _ I was completely wrong, and now I have egg on my face.  She’s really got egg on her face!"
        },
        {
            "id": 155,
            "phrase": "have eyes in the back of one’s head",
            "definition": "to seem to be able to sense what is going on behind or outside of one’s field of vision. My teacher seems to have eyes in the back of her head.  My teacher doesn’t need to have eyes in the back of his head. He watches us very carefully."
        },
        {
            "id": 156,
            "phrase": "have faith in someone",
            "definition": "to believe someone; to trust someone to do or be what is claimed.  I have faith in you. I know you will try your best.  We have faith in you and know you can do the job well."
        },
        {
            "id": 157,
            "phrase": "have feelings about someone or something",
            "definition": "to have preferences or notions about someone or something. (Usually in the negative.) _ I don’t have any feelings about Jeff. You can choose him if you want.  I have no feelings about this matter. Do what you want."
        },
        {
            "id": 158,
            "phrase": "have feet of clay",
            "definition": "[for a strong person] to have a defect of character.  All human beings have feet of clay. No one is perfect.  Sally was popular and successful. She was nearly fifty before she learned that she, too, had feet of clay."
        },
        {
            "id": 159,
            "phrase": "have fun",
            "definition": "to experience enjoyment.  Please forget your problems and have fun."
        },
        {
            "id": 160,
            "phrase": "have (got) a glow on",
            "definition": "to be intoxicated; to be tipsy. (Fixed order.) _ Since you already have a glow on, I guess you won’t want another drink. Jed had a glow on and was acting silly."
        },
        {
            "id": 161,
            "phrase": "have growing pains",
            "definition": "1. Fig. [for a child] to have pains— which are attributed to growth—in the muscles and joints.  The doctor said that all Mary had were growing pains and that nothing was really wrong.  Not everyone has growing pains. 2. Fig. [for an organization] to have difficulties in its early stages of growth.  The banker apologized for losing my check and said the bank was having growing pains.  The new administration was having terrible growing pains."
        },
        {
            "id": 162,
            "phrase": "have had enough",
            "definition": "to have had as much of something as is needed or will be tolerated.  Stop yelling at me. I’ve had enough.  No more potatoes, please. I’ve had enough.  I’m leaving you, Bill. I’ve had enough!"
        },
        {
            "id": 163,
            "phrase": "have had it (up to here)",
            "definition": "to have reached the end of one’s endurance or tolerance. (When used with up to here, can be accompanied by a gesture, such as the hand held at the neck.) _ Okay, I’ve had it. You kids go to bed this instant.  We’ve all had it up to here with you, John. Get out!"
        },
        {
            "id": 164,
            "phrase": "have had its day",
            "definition": "to be no longer useful or successful.  Streetcars have had their day in most American cities.  Some people think that the fountain pen has had its day, but others prefer it to other kinds of pens."
        },
        {
            "id": 165,
            "phrase": "have (high) hopes of something",
            "definition": "to be expecting something. I have hopes of getting there early. We have high hopes that John and Mary will have a girl."
        },
        {
            "id": 166,
            "phrase": "Have I got something for you!",
            "definition": "Inf. I have something really exciting for you! (Said earnestly, before saying or showing something surprising or exciting.) _ Have I got something for you! Wait’ll you hear about it! _ Have I got something for you! You’re gonna love it."
        },
        {
            "id": 167,
            "phrase": "Have I made myself clear?",
            "definition": "Do you understand exactly what I am telling you? (Indicates anger or dominance.) _ I don’t intend to warn you again. Have I made myself clear? _ I do not want you to hang around with Tim ever again! Have I made myself clear?"
        },
        {
            "id": 168,
            "phrase": "have intimate relations with someone",
            "definition": "Euph. to have sex with someone.  I understand that Jim once had intimate relations with Sarah. Rumor has it that she has had intimate relations with someone other than her husband."
        },
        {
            "id": 169,
            "phrase": "have it (all) over someone or something (in something)",
            "definition": "to be much better than someone or something.  This cake has it all over that one.  My car has it all over yours."
        },
        {
            "id": 170,
            "phrase": "have it both ways",
            "definition": "to have both of two incompatible things. John wants the security of marriage and the freedom of being single. He wants to have it both ways.  John thinks he can have it both ways—the wisdom of old age and the vigor of youth."
        },
        {
            "id": 171,
            "phrase": "have it in for someone",
            "definition": "to be mad at someone; to wish to harm someone.  Jane seems to have it in for Jerry. I don’t know why.  Max has it in for his old girlfriend since she broke up with him."
        },
        {
            "id": 172,
            "phrase": "have it in one to do something",
            "definition": "to have the motivation or inspiration to do something.  She just doesn’t have it in her to go back home. I wanted to help out, but I just didn’t have it in me."
        },
        {
            "id": 173,
            "phrase": "Have it your way.",
            "definition": "It will be done your way.; You will get your way. (Usually shows irritation on the part of the speaker.) _ Tom: I would like to do this room in blue. Sue: I prefer yellow. I really do. Tom: Okay. Have it your way.  Jane: Let’s get a pie. Apple would be good. Bob: No, if we are going to buy a whole pie, I want a cherry pie, not apple. Jane: Oh, have it your way!"
        },
        {
            "id": 174,
            "phrase": "have just one oar in the water",
            "definition": "Rur. to not be thinking clearly. Tom has some crazy plan for opening his own restaurant. If you ask me, he has just one oar in the water. She has just one oar in the water if she thinks Bill is going to pay any attention to her."
        },
        {
            "id": 175,
            "phrase": "have kittens",
            "definition": "to get extremely upset. My mother pretty near had kittens when she found out I got fired.  Calm down. Don’t have kittens."
        },
        {
            "id": 176,
            "phrase": "have more luck than sense",
            "definition": "to be lucky but not intelligent.  Jane went driving out into Death Valley without any water. She survived—she has more luck than sense.  Tom: I like to drive ninety miles an hour on the freeway. Nobody’s ever caught me. Mary: You have more luck than sense."
        },
        {
            "id": 177,
            "phrase": "have more than one string to one’s fiddle",
            "definition": "Rur. to have many talents.  Joe has more than one string to his fiddle. He’s a good painter, and he also cooks and fixes cars.  This job involves a lot of different duties. We’ll need to hire someone who has more than one string to his fiddle."
        },
        {
            "id": 178,
            "phrase": "(have) never had it so good",
            "definition": "have never had so much good fortune.  No, I’m not complaining. I’ve never had it so good.  Mary is pleased with her new job. She’s never had it so good."
        },
        {
            "id": 179,
            "phrase": "have no business doing something",
            "definition": "to be wrong to do something; to be extremely unwise to do something.  You have no business bursting in on me like that! _You have no business spending money like that!"
        },
        {
            "id": 180,
            "phrase": "have no staying power",
            "definition": "to lack endurance; not to be able to last.  Sally can swim fast for a short distance, but she has no staying power. That horse can start fairly fast, but it has no staying power."
        },
        {
            "id": 181,
            "phrase": "have no truck with something",
            "definition": "Rur. to have nothing to do with something.  After the way Mary treated me, I’ll have no truck with her.  We only show good, wholesome movies at this theater. We have no truck with most of that Hollywood trash."
        },
        {
            "id": 182,
            "phrase": "have none of something",
            "definition": "to tolerate or endure no amount of something.  I’ll have none of your talk about quitting school.  We’ll have none of your gossip.  I wish to have none of the sweet potatoes, please."
        },
        {
            "id": 183,
            "phrase": "have nothing on someone",
            "definition": "1. to lack the evidence necessary to place a charge against someone.  The police had nothing on Bob, so they let him loose.  You’ve got nothing on me! Let me go! 2. to have an advantage over someone.  Roger has nothing on me when it comes to basketball."
        },
        {
            "id": 184,
            "phrase": "have nothing on someone or something",
            "definition": "to have no information about someone or something.  The dictionary had nothing on the word I looked up.  The librarian said that the library has nothing on the topic of my paper."
        },
        {
            "id": 185,
            "phrase": "have one foot in the grave",
            "definition": "to be almost dead.  I was so sick, I felt as if I had one foot in the grave.  Poor old Uncle Herman has one foot in the grave."
        },
        {
            "id": 186,
            "phrase": "have one in the oven",
            "definition": "to be pregnant with a child.  She’s got three kids now and one in the oven."
        },
        {
            "id": 187,
            "phrase": "have one’s back to the wall",
            "definition": "to be in a defensive position.  He’ll have to give in. He has his back to the wall.  How can I bargain when I’ve got my back to the wall?"
        },
        {
            "id": 188,
            "phrase": "have one’s brain on a leash",
            "definition": "Sl. to be drunk. Max had his brain on a leash before he even got to the party.  Some guy who had his brain on a leash ran his car off the road."
        },
        {
            "id": 189,
            "phrase": "have one’s finger in too many pies",
            "definition": "to be involved in too many things; to have too many tasks going to be able to do any of them well.  I’m too busy. I have my finger in too many pies.  She never gets anything done because she has her finger in too many pies."
        },
        {
            "id": 190,
            "phrase": "have one’s hand in something",
            "definition": "to exercise control over something; to play an identifiable role in doing something.  She always has to have her hand in everything.  I want to have my hand in the arrangement."
        },
        {
            "id": 191,
            "phrase": "have one’s hands full (with someone or something)",
            "definition": "to be busy or totally occupied with someone or something. I have my hands full with my three children. You have your hands full with managing the store."
        },
        {
            "id": 192,
            "phrase": "have one’s hands tied",
            "definition": "to be prevented from doing something. (As if one’s hands were made immobile.) _ I can’t help you. I was told not to, so I have my hands tied.  John can’t help. He has his hands tied by his boss."
        },
        {
            "id": 193,
            "phrase": "have one’s head in the clouds",
            "definition": "to be unaware of what is going on from fantasies or daydreams. “Bob, do you have your head in the clouds?” asked the teacher. She walks around all day with her head in the clouds. She must be in love."
        },
        {
            "id": 194,
            "phrase": "have one’s heart (dead) set against something",
            "definition": "to be totally against something; to be opposed to something.  Jane has her heart dead set against going to Australia.  John has his heart set against going to college."
        },
        {
            "id": 195,
            "phrase": "have one’s heart go out to someone",
            "definition": "to have compassion for someone.  I can’t have my heart go out to everyone.  To give generously to charity shows that one’s heart goes out to those who are suffering."
        },
        {
            "id": 196,
            "phrase": "have one’s heart in one’s mouth",
            "definition": "to feel strongly emotional about someone or something.  I had my heart in my mouth when I heard the national anthem."
        },
        {
            "id": 197,
            "phrase": "have one’s heart in the right place",
            "definition": "to have good intentions, even if there are bad results.  I don’t always do what is right, but my heart is in the right place.  Good old Tom. His gifts are always tacky, but his heart’s in the right place."
        },
        {
            "id": 198,
            "phrase": "have one’s heart set on something",
            "definition": "to be desiring and expecting something.  Jane has her heart set on going to London.  Bob will be disappointed. He had his heart set on going to college this year."
        },
        {
            "id": 199,
            "phrase": "have one’s heart stand still",
            "definition": "an expression said when one’s heart (figuratively) stops beating because one is shocked or is feeling strong emotions.  I had my heart stand still once when I was overcome with joy.  Lovers— at least the ones in love songs—usually say their hearts stood still."
        },
        {
            "id": 200,
            "phrase": "have one’s luck run out",
            "definition": "for one’s good luck to stop; for one’s good fortune to come to an end. I had my luck run out when I was in South America. I nearly starved.  I hate to have my luck run out just when I need it."
        },
        {
            "id": 201,
            "phrase": "have one’s name inscribed in the book of life",
            "definition": "Euph. to die.  He was a beloved father, brother, and friend, and he has his name inscribed in the book of life.  By the time she was twenty, her parents, brothers, and sister had all had their names inscribed in the book of life."
        },
        {
            "id": 202,
            "phrase": "have one’s nose in a book",
            "definition": "to be reading a book; to read books all the time. Bob has his nose in a book every time I see him. His nose is always in a book. He never gets any exercise."
        },
        {
            "id": 203,
            "phrase": "have one’s nose in the air",
            "definition": "to be conceited or aloof. Mary always seems to have her nose in the air.  I wonder if she knows that she has her nose in the air."
        },
        {
            "id": 204,
            "phrase": "have one’s way with someone",
            "definition": "Euph. to have sexual relations with someone, possibly with that person being reluctant.  He invited her up to his apartment, hoping to have his way with her.  Now that you have had your way with me, do I mean nothing to you?"
        },
        {
            "id": 205,
            "phrase": "have one’s wires crossed",
            "definition": "to have one’s mental processes in disarray; to be confused. You don’t know what you are talking about. You’ve really got your wires crossed!s _ Joan got her wires crossed about who arrived first. It was Bob, not Gary."
        },
        {
            "id": 206,
            "phrase": "have one’s words stick in one’s throat",
            "definition": "to be so overcome by emotion that one can hardly speak.  I sometimes have my words stick in my throat.  John said that he never had his words stick in his throat."
        },
        {
            "id": 207,
            "phrase": "have one’s work cut out for one",
            "definition": "to have a large and difficult task prepared for one. They sure have their work cut out for them, and it’s going to be hard.  There is a lot for Bob to do. He has his work cut out for him."
        },
        {
            "id": 208,
            "phrase": "have pity on someone or an animal",
            "definition": "to have compassion toward someone or an animal. Please! Have pity on us. Let us come in!"
        },
        {
            "id": 209,
            "phrase": "have pull with someone",
            "definition": "to have influence with someone. (Also with some, much, lots, etc.) _ Let’s ask Ann to help us. She has pull with the mayor.  Do you know anyone who has some pull with the bank president? I need a loan."
        },
        {
            "id": 210,
            "phrase": "have recourse to something",
            "definition": "to be able to use something for help; to be able to fall back on something.  You will always have recourse to the money your grandfather left you.  You will not have recourse to that money until you are over 21 years of age."
        },
        {
            "id": 211,
            "phrase": "have relations with someone",
            "definition": "Euph. to have sexual relations with someone. While engaged to Mary, he was having relations with at least two other women. She was having relations with one of her employees, which was strictly against policy."
        },
        {
            "id": 212,
            "phrase": "have rocks in one’s head",
            "definition": "to be silly or crazy. John is a real nut. He has rocks in his head.  I don’t have rocks in my head—I’m just different."
        },
        {
            "id": 213,
            "phrase": "have seen better days",
            "definition": "Euph. to be in bad condition.  My old car has seen better days, but at least it’s still running.  She’s seen better days, it’s true, but she’s still lots of fun."
        },
        {
            "id": 214,
            "phrase": "have (some) bearing on something",
            "definition": "to have relevance to something. (Note the use of no and any in the negative.) _I know something that has some bearing on the issue you are discussing.  This has no bearing on anything that will happen today.  This doesn’t have any bearing on all that.  What bearing does John’s decision have on the situation?"
        },
        {
            "id": 215,
            "phrase": "have (some) time to kill",
            "definition": "to have extra time; to have a period of time with nothing to do. Whenever you have some time to kill, call me up and we’ll chat."
        },
        {
            "id": 216,
            "phrase": "have someone around (for something)",
            "definition": "to have someone come for a visit, tea, dinner, etc.  We really should have the Wilsons around for an evening of bridge. Yes, let’s have them around."
        },
        {
            "id": 217,
            "phrase": "have someone back",
            "definition": "to invite someone for a return visit.  We would love to have you back sometime.  We want to have you back the next time you are in town."
        },
        {
            "id": 218,
            "phrase": "have someone by something",
            "definition": "to hold onto someone by something.  She had me by the shoulder and I couldn’t get away.  Timmy had Billy by the collar and was punching him on the shoulder."
        },
        {
            "id": 219,
            "phrase": "have someone dead to rights",
            "definition": "to have caught someone red-handed; to have irrefutable evidence about someone’s misdeed.  We have you dead to rights on this one. The cops had him dead to rights with damning testimony of two eyewitnesses."
        },
        {
            "id": 220,
            "phrase": "have someone down",
            "definition": "to have someone for a visit to a place that is on a lower level or in the south. (Fixed order.) _ Why don’t we have Roger down for the weekend? _ They had us down to their place in Florida."
        },
        {
            "id": 221,
            "phrase": "have someone for breakfast",
            "definition": "to defeat someone with ease.  Careful, she’ll have you for breakfast if you’re not prepared to debate her.  I’m afraid they had our team for breakfast again."
        },
        {
            "id": 222,
            "phrase": "have someone in one’s corner",
            "definition": "to have someone supporting one’s position or goals. (Originally from boxing.) _As long as I have Mr. Howe in my corner, I feel confident about what I have to say."
        },
        {
            "id": 223,
            "phrase": "have someone in one’s pocket",
            "definition": "to have complete control over someone.  Don’t worry about the mayor. She’ll cooperate. I’ve got her in my pocket. John will do just what I tell him. I’ve got him and his brother in my pocket."
        },
        {
            "id": 224,
            "phrase": "have someone on the string",
            "definition": "to have someone waiting for a decision.  Sally has John on the string. He has asked her to marry him, but she hasn’t replied yet.  Yes, it sounds like she has him on the string."
        },
        {
            "id": 225,
            "phrase": "have someone or something cornered",
            "definition": "to have someone or something trapped as in a corner.  We had the wild cat cornered, but it jumped over the wall and got away."
        },
        {
            "id": 226,
            "phrase": "have someone or something in mind",
            "definition": "to be thinking of someone or something as a candidate for something.  Did you have anyone in mind for the job? _ I have something in mind for the living-room carpeting.  He probably had himself in mind when he spoke about the need for new blood."
        },
        {
            "id": 227,
            "phrase": "have someone or something in one’s hands",
            "definition": "to hold someone or something in one’s hands. (Have can be replaced with leave or put.) _ I have the tools you need in my hands, ready to give them to you when you need them."
        },
        {
            "id": 228,
            "phrase": "have someone or something in one’s sights",
            "definition": "to have one’s gun aimed at someone or something.  The sniper had the soldier in his sights.  I had the deer in my sights. I fired."
        },
        {
            "id": 229,
            "phrase": "have someone or something in tow",
            "definition": "to lead, pull, or tow someone or something around.  Mrs. Smith has her son by the hand and in tow.  That car has a boat in tow."
        },
        {
            "id": 230,
            "phrase": "have someone or something on one’s hands",
            "definition": "to be burdened with someone or something. (Have can be replaced with leave.) _I run a record store. I sometimes have a large number of unwanted records on my hands.  Please don’t leave the children on my hands."
        },
        {
            "id": 231,
            "phrase": "have someone or something (well) in hand",
            "definition": "to have someone or something under control.  I have the child well in hand now. She won’t cause you any more trouble.  We have everything in hand. Don’t worry."
        },
        {
            "id": 232,
            "phrase": "have someone over (for something)",
            "definition": "to invite someone to come to one’s home, for a meal, party, visit, cards, the evening, etc. (Fixed order.) _ We will have you over for dinner some day.  We will have you over soon."
        },
        {
            "id": 233,
            "phrase": "have someone’s best interest(s) at heart",
            "definition": "to make decisions based on someone’s best interests.  I know she was only doing what would benefit her, but she said she had my best interests at heart."
        },
        {
            "id": 234,
            "phrase": "have someone’s blood on one’s hands",
            "definition": "to have the blood of some other person on one’s hands. He fell and got a terrible cut and now I have his blood on my hands as well as my shirt."
        },
        {
            "id": 235,
            "phrase": "have someone’s eye",
            "definition": "[for someone] to establish and hold eye contact with someone; to attract someone’s attention.  When Tom at last had her eye, he smiled at her.  Once she had my eye, she began motioning toward the exit."
        },
        {
            "id": 236,
            "phrase": "have someone’s hide",
            "definition": "to punish someone severely.  The sheriff swore he’d have the outlaw’s hide.  You lousy no-good so-and-so! I’ll have your hide!"
        },
        {
            "id": 237,
            "phrase": "have something against someone or something",
            "definition": "to have a reason to dislike someone or something. (Note the replacement for something in the negative in the example.) _Do you have something against me? _ I have nothing against chocolate ice cream."
        },
        {
            "id": 238,
            "phrase": "have something cinched",
            "definition": "Inf. to have something settled; to have the results of some act assured.  Don’t worry. I’ve got it cinched.  You just think you’ve got it cinched."
        },
        {
            "id": 239,
            "phrase": "have something coming (to one)",
            "definition": "to deserve punishment (for something). Bill broke a window, so he has a spanking coming to him.  That’s it, Bill. Now you’ve got it coming!"
        },
        {
            "id": 240,
            "phrase": "have something down to a T",
            "definition": "to have something mastered.  I can do it. I have it down to a T."
        },
        {
            "id": 241,
            "phrase": "have something hanging over one’s head",
            "definition": "to have something bothering or worrying one; to have a deadline worrying one.  I keep worrying about my old car breaking down. I hate to have something like that hanging over my head.  I have a history paper that is hanging over my head."
        },
        {
            "id": 242,
            "phrase": "have something hung up and salted",
            "definition": "Rur. to know everything about something. (Often used ironically, as in the second example.) _ The historian sure had Louisiana history hung up and salted.  Jim’s sixteen years old, and he thinks he has the opposite sex hung up and salted."
        },
        {
            "id": 243,
            "phrase": "have something in common (with someone or something)",
            "definition": "[for groups of people or things] to resemble one another in specific ways.  Bill and Bob both have red hair. They have that in common with each other. Bob and Mary have a lot in common. I can see why they like each other."
        },
        {
            "id": 244,
            "phrase": "have something in hand",
            "definition": " Fig. to have something under control.  I thought I had my destiny in hand, but then fate played a trick on me.  Don’t worry about me. I have everything in hand."
        },
        {
            "id": 245,
            "phrase": "have something in stock",
            "definition": "to have merchandise available and ready for sale. Do you have extra large sizes in stock? _ Of course, we have all sizes and colors in stock."
        },
        {
            "id": 246,
            "phrase": "have something in store (for someone)",
            "definition": "to have something planned for one’s future.  Tom has a large inheritance in store for him when his uncle dies.  I wish I had something like that in store."
        },
        {
            "id": 247,
            "phrase": "have something made",
            "definition": "to hire someone to make something.  Isn’t it a lovely coat? I had to have it made because I couldn’t find one I liked in a store. We had the cake made at the bakery. Our oven isn’t big enough for a cake that size."
        },
        {
            "id": 248,
            "phrase": "have something on file",
            "definition": "to have a written record of something in storage.  I’m sure I have your letter on file. I’ll check again. We have your application on file somewhere."
        },
        {
            "id": 249,
            "phrase": "have something on one(‘s person)",
            "definition": "to carry something about with one. Do you have any money on your person? _ I don’t have any business cards on me."
        }
    ]
}