{
    "dictionary": [
        {
            "id": 0,
            "phrase": "raise someone or something to the surface (of something)",
            "definition": "to bring someone or something up to the surface of a body of water.  The pull of the inf latable life vest raised Tom to the surface of the water.  The divers were able to raise the sunken ship to the surface."
        },
        {
            "id": 1,
            "phrase": "raise someone or something up†",
            "definition": "to lift someone or something up. The aides raised the patient up while the nurse spread clean linen beneath him.  Jane raised up the lid."
        },
        {
            "id": 2,
            "phrase": "raise someone to something",
            "definition": "to promote or advance someone to a higher rank.  The boss raised her to vice president after one year.  I hope she raises me to head clerk."
        },
        {
            "id": 3,
            "phrase": "raise something with someone",
            "definition": "to bring up a matter with someone.  I will raise that question with Mary when she comes in.  Please raise the question with the boss."
        },
        {
            "id": 4,
            "phrase": "raise the bar",
            "definition": "to make a task a little more difficult. (As with raising the bar in high jumping or pole vaulting.) _ Just as I was getting accustomed to my job, the manager raised the bar and I had to perform even better."
        },
        {
            "id": 5,
            "phrase": "raise the devil (with someone)",
            "definition": "to severely chastise someone or a group.  The coach came in and raised the devil with Sally for her error in the first quarter of the game.  I’m going to raise the devil with him!"
        },
        {
            "id": 6,
            "phrase": "raise the dickens (with someone or something)",
            "definition": "to act in some extreme manner; to make trouble; to behave wildly; to be very angry.  John was out all night raising the dickens. That cheap gas I bought really raised the dickens with my car’s engine."
        },
        {
            "id": 7,
            "phrase": "raise up",
            "definition": "to lift oneself up; to get up or begin to get up.  She raised up and then fell back onto her bed. She was too weak to get up.  I could not raise up enough to see out the window."
        },
        {
            "id": 8,
            "phrase": "raised in a barn",
            "definition": "brought up to behave like a barnyard animal; having crude behavior.  Close the door behind you! Were you raised in a barn? _ Don’t wipe your nose on your sleeve. Were you raised in a barn?"
        },
        {
            "id": 9,
            "phrase": "rake something around†",
            "definition": "to spread something around with a rake. She raked the leaves around, spreading them over the f lower beds as natural fertilizer. I need to rake around the soil and stir it up."
        },
        {
            "id": 10,
            "phrase": "rake something in†",
            "definition": "to draw or pull something inward with a rake.  Jane is raking in the leaves into a big pile."
        },
        {
            "id": 11,
            "phrase": "rake something off†",
            "definition": "to steal or embezzle a portion of a payment or an account.  They claimed that no one was raking anything off and that the money was only mislaid.  The county treasurer was caught raking off some of the tax money. "
        },
        {
            "id": 12,
            "phrase": "rake something up†",
            "definition": "to gather and clean up something with a rake. Would you please rake these leaves up before it rains? _ Please rake up the leaves."
        },
        {
            "id": 13,
            "phrase": "rake through something",
            "definition": "[for someone] to rummage through something, as if with a rake.  She quickly raked through the mass of loose papers, looking for the right one.  I will have to rake through everything in this drawer to find a red pencil."
        },
        {
            "id": 14,
            "phrase": "rally around someone or something",
            "definition": "to unite or assemble in support of someone or something.  All the other workers rallied around Fred in his fight with management.  They rallied around the principle that Fred stood for."
        },
        {
            "id": 15,
            "phrase": "rally to someone or something",
            "definition": "to unite in support of someone or something.  The students rallied to Betty, their elected president.  We all rallied to the cause."
        },
        {
            "id": 16,
            "phrase": "ralph something up†",
            "definition": "Sl. to vomit something. (Teens and collegiate.) _ The doctor gave him some stuff that made him ralph it up.  He ralphed up his dinner."
        },
        {
            "id": 17,
            "phrase": "ram into someone or something",
            "definition": "to crash into someone or something.  Mary accidentally rammed into a fence as she rode along.  The car rammed into the tree and was totally wrecked."
        },
        {
            "id": 18,
            "phrase": "ram something down†",
            "definition": "to pack something down by pounding, as with a ram.  The worker used a pole to ram the earth down and pack it tight. The worker rammed down the earth."
        },
        {
            "id": 19,
            "phrase": "ram something through (something)",
            "definition": "1. to force something through something. He rammed his fist through the window, cutting himself in the process.  Harry put the brick up to the window glass and rammed it through. Next time he would remember his key. 2. to force something through a deliberative body, usually not allowing due consideration.  They rammed the bill through the city council.  The President was unable to ram the measure through Congress."
        },
        {
            "id": 20,
            "phrase": "ram through something",
            "definition": "to crash or pound through something.  The car rammed through the back of the garage.  I was afraid that the truck would ram through the fence."
        },
        {
            "id": 21,
            "phrase": "ramble on",
            "definition": "1. to wander about aimlessly. (As with a traveler or a winding path.) _ The road rambled on through mile after mile of wilderness. 2. [for a structure] to spread out over a large area, perhaps in a random way. This old house rambles on, way back into the woods."
        },
        {
            "id": 22,
            "phrase": "ramble on (about someone or something)",
            "definition": "[for someone] to talk endlessly and aimlessly about someone or something. (Based on ramble on.) _I wish you wouldn’t ramble on about your first husband all the time.  Must you ramble on so?"
        },
        {
            "id": 23,
            "phrase": "range from something to something",
            "definition": "to vary from one thing to another.  The winter weather ranges from bad to terrible in this part of the north. The appraisals of the property ranged from high to low."
        },
        {
            "id": 24,
            "phrase": "range over something",
            "definition": "to cover an area; to travel about in one area.  The buffalo ranged over vast areas of prairie, grazing and breeding.  These animals range over a very large territory."
        },
        {
            "id": 25,
            "phrase": "rank above someone",
            "definition": "to outrank someone; to rank higher than someone.  I think that I rank above you, so I will sit by the window.  The boss ranks above everyone and demands that everyone recognize the fact."
        },
        {
            "id": 26,
            "phrase": "rank among something",
            "definition": "to be included in a particular group.  In my opinion, Kelly ranks among the very best.  Tom ranks among the most widely known of the contemporary writers."
        },
        {
            "id": 27,
            "phrase": "rank and file",
            "definition": "regular soldiers, not the officers.  I think there is low morale among the rank and file, sir.  The rank and file usually do exactly as they are told."
        },
        {
            "id": 28,
            "phrase": "rank as something",
            "definition": "to have a particular rank; to serve in a particular rank.  She ranks as a fine pianist in my book.  Don ranks as the top economist of the day."
        },
        {
            "id": 29,
            "phrase": "rank on someone",
            "definition": "Sl. to attack someone verbally; to gossip about someone.  Please stop ranking on my family! _ Tom keeps ranking on Jennifer, and she is really mad about it."
        },
        {
            "id": 30,
            "phrase": "rank someone among something",
            "definition": "to judge someone to be essentially equal to a specific group of people.  I don’t rank Kelly among the best drivers in the world. Our committee ranked Fred among the best of the current applicants."
        },
        {
            "id": 31,
            "phrase": "rank someone or something as something",
            "definition": "to assign a particular rank to someone or something. I have to rank Sally as number one. She’s the best. Mary ranked the chocolate as the best she had ever eaten."
        },
        {
            "id": 32,
            "phrase": "rank someone (out†)",
            "definition": "1. Sl. to annoy someone. He really ranks me out. What a pest! 2. Sl. to chastise someone.  She ranked him out for being a coward.  I ranked out the whole gang, but good!"
        },
        {
            "id": 33,
            "phrase": "rank someone with someone",
            "definition": "to judge someone to be equal with someone.  Would you rank Tom with Donna? _ Fred ranked himself with Tom when it came to diving."
        },
        {
            "id": 34,
            "phrase": "rank with someone or something",
            "definition": "to be equal to someone or something. Do you think Sarah ranks with Albert? _No one ranks with Albert.  The food at that restaurant ranks with that of the best places in New York."
        },
        {
            "id": 35,
            "phrase": "rant against someone or something",
            "definition": "to rave and yell against someone or something.  She spent most of the morning ranting against her mother-in-law.  Leonard spent the entire morning ranting against the government."
        },
        {
            "id": 36,
            "phrase": "rant and rave (about someone or something)",
            "definition": "to shout angrily and wildly about someone or something.  Barbara rants and raves when her children don’t obey her.  Bob rants and raves about anything that displeases him."
        },
        {
            "id": 37,
            "phrase": "rant (at someone) about someone or something",
            "definition": "to talk in a loud, violent way, about someone or something.  Anne ranted about the bad service she had received at the store.  On the bus, someone was ranting at me about the end of the world."
        },
        {
            "id": 38,
            "phrase": "rant at someone or something",
            "definition": "to rave and yell at someone or something.  Stop ranting at me! _ The boss would never rant at the office staff."
        },
        {
            "id": 39,
            "phrase": "rap something out† (on something)",
            "definition": "to tap out the rhythm of something on something.  Try to rap the rhythm out on the table.  He rapped out the rhythm on the table."
        },
        {
            "id": 40,
            "phrase": "rap with someone",
            "definition": "Sl. to have a chat with someone or a group of people. (Old.) _Come in, sit down, and rap with me for a while. Let’s get together and rap with one another sometime."
        },
        {
            "id": 41,
            "phrase": "rarin’ to go",
            "definition": "extremely keen to act or do something. Jane can’t wait to start her job. She’s rarin’ to go. Mary is rarin’ to go and can’t wait for her university term to start."
        },
        {
            "id": 42,
            "phrase": "rasp something out†",
            "definition": "to carve or smooth something out with a rasp.  You should use this tool to rasp the inside of the bowl out. Use sandpaper to make the inside smoother.  Rasp out the inside carefully."
        },
        {
            "id": 43,
            "phrase": "rat around",
            "definition": "Sl. to waste time loafing around; to kick around. (Collegiate.) _I didn’t do anything but rat around all summer.  If kids don’t have jobs, they just rat around."
        },
        {
            "id": 44,
            "phrase": "rat on someone",
            "definition": "Inf. to report someone’s bad behavior to someone in authority; to tattle on someone.  John ratted on me, and I got in trouble.  If he rats on me, I’ll hit him!"
        },
        {
            "id": 45,
            "phrase": "rat out",
            "definition": "Sl. to quit; to fink out (on someone or something).  It’s too late to rat out.  He tried to rat out at the last minute."
        },
        {
            "id": 46,
            "phrase": "rat race",
            "definition": "a fierce struggle for success, especially in one’s career or business.  Bob got tired of the rat race. He’s retired and gone to the country.  The money market is a rat race, and many people who work in it get out quickly because of the stress."
        },
        {
            "id": 47,
            "phrase": "rate someone or something above someone or something else",
            "definition": "to judge someone to rank higher than someone else; to judge something to rank higher than something else.  Do you rate Alice above Valerie? _I rate chocolate ice cream above vanilla."
        },
        {
            "id": 48,
            "phrase": "rate someone or something among something",
            "definition": "to judge someone or something to be essentially equal to something.  I rate Polly among the best of this year’s class.  We rate these contestants among the best ever."
        },
        {
            "id": 49,
            "phrase": "rate someone or something as something",
            "definition": "to assign a particular rating to someone or something.  I rate her as a number four.  The judge rated my cake as second place."
        },
        {
            "id": 50,
            "phrase": "rate someone or something below someone or something else",
            "definition": "to judge someone to rank lower than someone else; to judge something to rank lower than something else.  I have to rate Carol below Donna in this regard. We all rate plain chocolate ice cream below rocky road ice cream."
        },
        {
            "id": 51,
            "phrase": "rate someone or something with someone or something else",
            "definition": "to judge someone or something to be equal to someone or something else.  I rate Fred with Don. They are equally good.  Vanilla is very nice, but I don’t rate it with chocolate ice cream."
        },
        {
            "id": 52,
            "phrase": "rate something at something",
            "definition": "to assign a particular level of rating to something.  I rate this brand at about a B-.  The broker rated this stock at a buy."
        },
        {
            "id": 53,
            "phrase": "rate with someone",
            "definition": "to be in someone’s favor; to be thought of highly by someone. Ann is great. She really rates with me.  She doesn’t rate with me at all."
        },
        {
            "id": 54,
            "phrase": "ration something out† (among someone)",
            "definition": "to give people limited shares of something, attempting to make it last as long as possible.  The captain rationed the water out among all the crew, trying to make it last as long as possible.  Jane rationed out the cookies among the kids."
        },
        {
            "id": 55,
            "phrase": "rattle around in something",
            "definition": "to make a rattling noise inside something.  What is rattling around in this package? _There is something rattling around in my glove compartment."
        },
        {
            "id": 56,
            "phrase": "rattle away",
            "definition": "to chatter endlessly and aimlessly.  The two old men sat there and rattled away at one another.  Tom rattled away at Jane for a few minutes and then left the house."
        },
        {
            "id": 57,
            "phrase": "rattle on (about someone or something)",
            "definition": "to talk endlessly about someone or something. Martin talked incessantly. He would rattle on about any topic whenever he could trap an unfortunate listener."
        },
        {
            "id": 58,
            "phrase": "raunch someone out†",
            "definition": "Sl. to disgust someone. These dirty socks absolutely raunch me out! _ Sam and Beavis enjoy raunching out everyone in the room."
        },
        {
            "id": 59,
            "phrase": "rave about someone or something",
            "definition": "1. to rage in anger about someone or something.  Gale was raving about Sarah and what she did.  Sarah raved and raved about Gale’s insufferable rudeness. 2. to sing the praises of someone or something.  Even the harshest critic raved about Larry’s stage success.  Everyone was raving about your excellent performance."
        },
        {
            "id": 60,
            "phrase": "rave over someone or something",
            "definition": "to recite praises for someone or something. The students were just raving over the new professor.  Donald raved over the cake I baked. But he’ll eat anything."
        },
        {
            "id": 61,
            "phrase": "ravished with delight",
            "definition": "happy or delighted; overcome with happiness or delight.  Mary was ravished with delight by the dozen roses. My parents were ravished with delight when I graduated from college."
        },
        {
            "id": 62,
            "phrase": "*a raw deal",
            "definition": "an instance of unfair or bad treatment. (*Typically: get ~; have ~; give someone ~.) _ Mary got a raw deal on her traffic ticket. She was innocent, but she had to pay a big fine. I bought a used TV that worked for two days and then quit. I sure got a raw deal.  You sure had a raw deal."
        },
        {
            "id": 63,
            "phrase": "raw recruit",
            "definition": "a new, inexperienced, or fresh recruit, such as someone just entering the army, navy, police, etc. These boys are nothing but raw recruits. They’ve never seen a gun up close!"
        },
        {
            "id": 64,
            "phrase": "raze something to the ground",
            "definition": "to tear down something, usually a building, to ground level.  The council decided to raze the old city hall to the ground.  This building is to be razed to the ground."
        },
        {
            "id": 65,
            "phrase": "reach a compromise",
            "definition": "to achieve a compromise; to negotiate an agreement.  After many hours of discussion, we finally reached a compromise.  We were unable to reach a compromise and quit trying."
        },
        {
            "id": 66,
            "phrase": "reach a conclusion",
            "definition": "to complete discussion and decide an issue. It took three days of talks to reach a conclusion.  When we reach a conclusion, we will notify you of the results."
        },
        {
            "id": 67,
            "phrase": "reach an impasse",
            "definition": "to progress to the point that a barrier stops further progress.  When negotiations with management reached an impasse, the union went on strike.  The discussion reached an impasse and no one was able to propose a compromise."
        },
        {
            "id": 68,
            "phrase": "reach back (in)to something",
            "definition": "to extend back into a particular period in time.  This policy reaches back into the last century. Our way of making fine candies reaches back to the recipes used by the founder of the company."
        },
        {
            "id": 69,
            "phrase": "reach down",
            "definition": "to extend downward.  The stems of the plant reached down almost to the f loor. The drapes don’t quite reach down to the f loor."
        },
        {
            "id": 70,
            "phrase": "reach for someone or something",
            "definition": "to extend one’s grasp to someone or something.  I reached for my father, but he wasn’t there.  I reached for a pen, but I only had a pencil."
        },
        {
            "id": 71,
            "phrase": "reach in(to something)",
            "definition": "to stick one’s hand into something to grasp something.  Bob reached into the cookie jar and found it empty.  Bob went to the cookie jar and reached in."
        },
        {
            "id": 72,
            "phrase": "reach out",
            "definition": "to extend one’s grasp outward.  He reached out, but there was no one to take hold of. I reached out and grabbed onto the first thing I could get hold of."
        },
        {
            "id": 73,
            "phrase": "reach out into something",
            "definition": "to extend one’s grasp out into something, such as the darkness. Laura reached out into the darkness, looking for the light switch.  Jane reached out into the unlit room, hoping to find a lamp or even a candle."
        },
        {
            "id": 74,
            "phrase": "reach out to someone",
            "definition": "1. Fig. to offer someone a helping hand.  You reached out to me just when I needed help the most.  I reach out to other people in trouble because I would want someone to do that for me. 2. Fig. to seek someone’s help and support.  When I reached out to Don for help, he turned me down. Jane reached out to her friends for the help and support that she needed."
        },
        {
            "id": 75,
            "phrase": "reach someone",
            "definition": "to travel up to or as far as someone. I ran until I reached her just in time to save her from going over the cliff."
        },
        {
            "id": 76,
            "phrase": "reach something down†",
            "definition": "Inf. to hand something down.  Please reach the hammer down to me.  Would you reach down the hammer to Jane?"
        },
        {
            "id": 77,
            "phrase": "reach something up to someone",
            "definition": "Inf. to hand something up to someone.  I reached the hammer up to Jack, who was fixing a loose shingle on the roof.  Please reach this cold drink up to your brother."
        },
        {
            "id": 78,
            "phrase": "reach to something",
            "definition": "to extend all the way to something.  Our property reaches to the bank of the river. The grounds reach all the way to the banks of the river."
        },
        {
            "id": 79,
            "phrase": "reach toward someone or something",
            "definition": "to aim one’s reach to someone or something. Sam reached toward Walter and took hold of his shoulder.  He reached toward the apple but withdrew his hand when he saw it was rotten."
        },
        {
            "id": 80,
            "phrase": "react against someone or something",
            "definition": "to respond negatively to someone or something. Why did she react against me so strongly? _There is no need to react against the plan with such force."
        },
        {
            "id": 81,
            "phrase": "react to someone or something",
            "definition": "to act in response to someone or something.  You made some very good points. I would like to take some time to react to you.  How did Mary react to the news?"
        },
        {
            "id": 82,
            "phrase": "read about someone or something",
            "definition": "to read information concerning someone or something. Did you read about John in the newspaper? _ I read about bonds, and learned a lot about finance."
        },
        {
            "id": 83,
            "phrase": "read between the lines",
            "definition": "to infer something (from something else); to try to understand what is meant by something that is not written explicitly or openly. After listening to what she said, if you read between the lines, you can begin to see what she really means.  Don’t believe everything you read literally. Learn to read between the lines."
        },
        {
            "id": 84,
            "phrase": "read for something",
            "definition": "to read, looking especially for something, such as errors, clarity, etc.  Please read this manuscript for spelling and grammar errors.  Read this book for entertainment and nothing more."
        },
        {
            "id": 85,
            "phrase": "read from something",
            "definition": "to read [aloud] from something in particular.  I will now read from a book of poetry that I like very much. I like that poem very much. What are you reading from?"
        },
        {
            "id": 86,
            "phrase": "read it and weep",
            "definition": "read the bad news; hear the bad news.  I’m sorry to bring you the bad news. Read it and weep."
        },
        {
            "id": 87,
            "phrase": "read of someone or something (somewhere)",
            "definition": "to read news about someone or something in something.  I think I have read of you in the papers. Mary read of the job opening in the newspaper."
        },
        {
            "id": 88,
            "phrase": "read on",
            "definition": "to continue to read.  Please read on. Don’t stop.  She read on until she had come to the end of the story."
        },
        {
            "id": 89,
            "phrase": "read one one’s rights",
            "definition": "to make the required statement of legal rights to a person who has been arrested. All right, read this guy his rights and book him on a charge of theft.  You have to read them their rights before questioning them."
        },
        {
            "id": 90,
            "phrase": "read oneself to sleep",
            "definition": "to read something in preparation for falling asleep.  I need a really dull book so I can read myself to sleep. That’s the kind of book I use to read myself to sleep."
        },
        {
            "id": 91,
            "phrase": "read someone like a book",
            "definition": "to understand someone very well.  I’ve got John figured out. I can read him like a book. Of course I understand you. I read you like a book."
        },
        {
            "id": 92,
            "phrase": "read someone or something as something",
            "definition": "to interpret someone or something as something.  I read you as a quiet guy who wants to settle down and have kids.  Mary read the problem as one that did not require a lot of understanding."
        },
        {
            "id": 93,
            "phrase": "read someone out† (for something)",
            "definition": "to chastise someone verbally for doing something wrong. The coach read the player out for making a silly error. She really read out the lazy players."
        },
        {
            "id": 94,
            "phrase": "read someone out of something",
            "definition": "to expel someone from an organization, such as a political party.  Because of her statement, they read her out of the party.  The officers tried to read me out of the society, but they didn’t succeed."
        },
        {
            "id": 95,
            "phrase": "read someone’s lips",
            "definition": "to manage to understand speech by watching and interpreting the movements of the speaker’s lips.  I couldn’t hear her but I could read her lips."
        },
        {
            "id": 96,
            "phrase": "read someone’s mind",
            "definition": "to guess what someone is thinking. You’ll have to tell me what you want. I can’t read your mind, you know. If I could read your mind, I’d know what you expect of me."
        },
        {
            "id": 97,
            "phrase": "read (someone) something out of something",
            "definition": "to read something [aloud] from something. He read us a story out of the book.  Mary read the story out of the magazine."
        },
        {
            "id": 98,
            "phrase": "read someone the riot act",
            "definition": "to give someone a severe scolding.  The manager read me the riot act for coming in late. The teacher read the students the riot act for their failure to do their assignments."
        },
        {
            "id": 99,
            "phrase": "read something back† (to someone)",
            "definition": "to read back some information to the person who has just given it.  Yes, I have written the telephone number down. Let me read it back to you to make sure I have it right. Please read back the letter to me."
        },
        {
            "id": 100,
            "phrase": "read something in something",
            "definition": "to read something in particular in a some publication or document.  I read an interesting article about moose in today’s newspaper. Did you read that in today’s newspaper?"
        },
        {
            "id": 101,
            "phrase": "read something into something",
            "definition": "to attach or attribute a new or different meaning to something; to presume inferences as one reads something.  This statement means exactly what it says. Don’t try to read anything else into it.  Am I reading too much into your comments?"
        },
        {
            "id": 102,
            "phrase": "read something off†",
            "definition": "to read aloud from a list.  Nick read the list of the names off, and I wasn’t on the list. Jane read off the names."
        },
        {
            "id": 103,
            "phrase": "read something out†",
            "definition": "to read something aloud.  Please read it out so everyone can hear you. Read out the names loudly."
        },
        {
            "id": 104,
            "phrase": "read something over†",
            "definition": "to read something. When you have a chance, read this over.  Also, read over this report."
        },
        {
            "id": 105,
            "phrase": "read something through†",
            "definition": "to read all of something. Take this home and read it through.  Read through this report and see if you can find any errors."
        },
        {
            "id": 106,
            "phrase": "read (something) to someone",
            "definition": "to read something aloud to someone.  Please read a story to me.  Grandpa read to Timmy all afternoon."
        },
        {
            "id": 107,
            "phrase": "read the handwriting on the wall",
            "definition": "to anticipate what is going to happen by observing small hints and clues. writing on the wall.) _ I know I am going to be fired. I can read the handwriting on the wall.  Can’t you read the handwriting on the wall? Can’t you see what they are planning?"
        },
        {
            "id": 108,
            "phrase": "read up (on someone or something)",
            "definition": "to find and read some information about someone or something.  Please go to the library and read up on George Washington.  I don’t know anything about that. I guess I need to read up."
        },
        {
            "id": 109,
            "phrase": "readjust to someone or something",
            "definition": "to make a new adjustment to someone or something. Please make an attempt to readjust your work schedule for the next two weeks.  I don’t think I can readjust to this climate."
        },
        {
            "id": 110,
            "phrase": "*ready (to do something)",
            "definition": "prepared to do something. (*Typically: be ~; get ~.) _ Get ready to jump! _ It’s time to get ready to go to work."
        },
        {
            "id": 111,
            "phrase": "ready, willing, and able",
            "definition": "Cliché eager or at least willing [to do something]. If you need someone to help you move furniture, I’m ready, willing, and able. Fred is ready, willing, and able to do anything you ask him."
        },
        {
            "id": 112,
            "phrase": "a (real) go-getter",
            "definition": "an active, energetic, and aggressive person. Mary is very aggressive in business. A real go-getter."
        },
        {
            "id": 113,
            "phrase": "the real McCoy",
            "definition": "an authentic thing or person. Of course it’s authentic. It’s the real McCoy."
        },
        {
            "id": 114,
            "phrase": "the real thing",
            "definition": "something that is genuine and not an imitation.  I don’t want frozen yogurt, I want the real thing! Yes, ice cream! _She hates plastic that looks like wood. She wants the real thing."
        },
        {
            "id": 115,
            "phrase": "the reality of the situation",
            "definition": "the truth or actuality of the situation; the way the situation really is.  The reality of the situation is that we must act right now.  Let’s face the reality of the situation and go out and get jobs so we can pay our bills."
        },
        {
            "id": 116,
            "phrase": "realize one’s potential",
            "definition": "to fulfill one’s potential; to do as well as one possibly can.  I hope I can get a good education so I can realize my potential."
        },
        {
            "id": 117,
            "phrase": "realize something from something",
            "definition": "1. to perceive something from some kind of evidence.  I just now realized something from what you’ve been saying.  Tom realized how wrong he had been from what Mary told him. 2. to reap a profit by selling an asset that has increased in value.  He realized a large profit from the sale of the house.  We hoped to realize a lot of money from the sale of stock."
        },
        {
            "id": 118,
            "phrase": "ream someone out†",
            "definition": "Sl. to scold someone severely.  The teacher really reamed him out. The coach reamed out the whole team."
        },
        {
            "id": 119,
            "phrase": "ream something out†",
            "definition": "to widen or clean an interior cavity or channel by scraping, grinding, or drilling.  Ream the opening out so the flow will be faster.  We had to ream out the pipes so the fuel would f low to the engine."
        },
        {
            "id": 120,
            "phrase": "reap something from something",
            "definition": "to harvest something from something. We reaped a fine harvest from our cornfields this year. They will reap nothing from their flooded fields."
        },
        {
            "id": 121,
            "phrase": "reappoint someone as something",
            "definition": "to select or appoint someone to serve again in the same office.  Are they going to reappoint Alan as the chairman again? _Alan was reappointed as the head of the committee."
        },
        {
            "id": 122,
            "phrase": "rear back",
            "definition": "[for a horse] to pull back and up onto its hind legs in an effort to move backwards rapidly or throw a rider.  The animal reared back in terror.  The horse reared back and almost threw its rider."
        },
        {
            "id": 123,
            "phrase": "rear its ugly head",
            "definition": "[for something unpleasant] to appear or become obvious after lying hidden.  Jealousy reared its ugly head and destroyed their marriage.  The question of money always rears its ugly head in matters of business."
        },
        {
            "id": 124,
            "phrase": "rear up",
            "definition": "[for a horse] to lean back on its hind legs and raise its front legs, assuming a threatening posture or avoiding something on the ground such as a snake.  The horse reared up suddenly, throwing the rider onto the ground.  When the horse reared up, I almost fell off."
        },
        {
            "id": 125,
            "phrase": "reason against something",
            "definition": "to argue against something, using reason.  I can hardly be expected to reason against a silly argument like that! _ I reasoned against it, but they paid no attention to me."
        },
        {
            "id": 126,
            "phrase": "reason something out†",
            "definition": "to figure something out; to plan a reasonable course of action.  Now let’s be calm and try to reason this out.  Let us reason out our difficulties."
        },
        {
            "id": 127,
            "phrase": "reason with someone",
            "definition": "to discuss something with someone, seeking a reasonable solution to a problem.  Try to reason with Jill. If she won’t listen, forget her.  You cannot reason with someone who is so narrow-minded."
        },
        {
            "id": 128,
            "phrase": "reassign someone to something",
            "definition": "to change someone’s assignment to something else. I will reassign Jill to a different department.  I was reassigned to the accounting department."
        },
        {
            "id": 129,
            "phrase": "reassure someone about something",
            "definition": "to give someone confidence about something.  Nancy reassured Betty about her promotion. Betty was reassured about her promotion."
        },
        {
            "id": 130,
            "phrase": "reassure someone of something",
            "definition": "to promise or guarantee someone something.  Kelly reassured her friend of her support in the election.  Please reassure Tom of our continued support."
        },
        {
            "id": 131,
            "phrase": "rebel against someone or something",
            "definition": "to resist and revolt against someone or something. Barbara rebelled against the teachers at the school. Most young people have to rebel against authority for a while."
        },
        {
            "id": 132,
            "phrase": "rebel at someone or something",
            "definition": "to resist and defy someone or something.  It is natural for teenagers to rebel at their parents.  I feel as if I have to rebel at all these rules."
        },
        {
            "id": 133,
            "phrase": "rebound from something",
            "definition": "to bounce back from something.  The ball rebounded from the wall and hit Randy hard on the elbow. When the ball rebounded from the backboard, it bounced onto the court and Tom tripped on it."
        },
        {
            "id": 134,
            "phrase": "rebuke someone for something",
            "definition": "to reprimand someone for something.  There is no need to rebuke me for a simple mistake like that. Sally was rebuked for overspending her budget."
        },
        {
            "id": 135,
            "phrase": "recall someone from something",
            "definition": "to call someone back from something or some place.  The president recalled our ambassador from the war-torn country.  I was recalled from retirement to help out at the office."
        },
        {
            "id": 136,
            "phrase": "recall someone or something from something",
            "definition": "to remember someone or something from some event or some place.  I recall someone by that name from my days at the university.  Mary recalled the appropriate fact from her history studies."
        },
        {
            "id": 137,
            "phrase": "recall something to mind",
            "definition": "to cause [someone] to remember something.  The events of the day recall similar days in the past to mind. This book recalls a similar book published some years ago to mind."
        },
        {
            "id": 138,
            "phrase": "recall something to someone",
            "definition": "to bring something to the mind of someone.  Your comments recall another event to me—something that happened years ago.  What you just said recalled an old saying to me."
        },
        {
            "id": 139,
            "phrase": "recast something in something",
            "definition": "to rebuild or redevelop something in a different form. She recast the sentence in the negative, hoping to make it less blunt.  I will recast my request in different language."
        },
        {
            "id": 140,
            "phrase": "recede from something",
            "definition": "to pull back from something.  The river receded from its banks during the dry season.  I think that my hair is receding from my forehead."
        },
        {
            "id": 141,
            "phrase": "receive someone as someone or something",
            "definition": "to welcome and accept someone as someone or something.  The king received the ambassador as an honored guest.  They said they would receive their former guest as a welcome visitor."
        },
        {
            "id": 142,
            "phrase": "receive someone into something",
            "definition": "to welcome someone into something, some place, or some organization.  Everyone received the new member into the club with eager congratulations.  We received them into our homes and fed them well."
        },
        {
            "id": 143,
            "phrase": "receive someone or something back",
            "definition": "to get someone or something back. Martha received her husband back after his escapade.  I sent a letter off with the wrong postage and received it back two weeks later."
        },
        {
            "id": 144,
            "phrase": "receive something from some place",
            "definition": "to get and accept something from some place.  I just received a letter from Budapest! _ Mary received a package from Japan."
        },
        {
            "id": 145,
            "phrase": "receive something from someone",
            "definition": "to get and accept something from someone.  Tony received a sweater from his grandfather for his birthday.  Who did you receive this from?"
        },
        {
            "id": 146,
            "phrase": "reckon someone as someone or something",
            "definition": "to perceive someone as someone or something.  I reckoned her as a more thoughtful individual than she turned out to be.  Mary reckoned Scott as a constant irritation, and she was right on the button."
        },
        {
            "id": 147,
            "phrase": "reckon someone or something among something",
            "definition": "to judge someone or something to belong among a select group.  I reckon Donna among the best tennis pros in the country. We reckon this automobile among the most advanced in the world."
        },
        {
            "id": 148,
            "phrase": "reckon with someone or something",
            "definition": "to deal with someone or something; to cope with someone or something.  I have to reckon with the troublesome Mr. Johnson this afternoon. Mary knew just exactly how she had to reckon with the bill collector."
        },
        {
            "id": 149,
            "phrase": "reckon without someone",
            "definition": "to fail to think about someone.  He thought he’d get away with his crime, but he reckoned without the FBI agents. He had thought he was gone for sure, but he had reckoned without the paramedics."
        },
        {
            "id": 150,
            "phrase": "reclaim someone or something from someone or something",
            "definition": "to bring someone or something back from someone or something.  The mother reclaimed Sally from her father, who had abducted her contrary to the divorce decree.  Mary reclaimed the book from her brother’s desk."
        },
        {
            "id": 151,
            "phrase": "recognize someone as someone or something",
            "definition": "to accept and acknowledge someone to be someone; to accept and acknowledge something to be something.  Mary didn’t recognize the lawyer as her legal representative.  Lizzy didn’t recognize the car as her car."
        },
        {
            "id": 152,
            "phrase": "recognize someone or something by something",
            "definition": "to know someone or something by some distinguishing sign. You will be able to recognize me by my long mustache.  Mary recognized her car by the ribbon tied to the antenna."
        },
        {
            "id": 153,
            "phrase": "recognize someone or something for something",
            "definition": "1. to identify someone or something as something.  I recognized the deal for a scam as soon as I heard about it.  Anyone could recognize Max for a common thief. 2. to show appreciation to someone or something for something.  The organization recognized Laura for her excellent contributions to the philanthropy committee.  The officers recognized the committee for its outstanding efforts."
        },
        {
            "id": 154,
            "phrase": "recoil from someone or something",
            "definition": "to draw back from someone or something. I recoiled from Sally when she told me what she had done.  I recoiled from the horror and slammed the door."
        },
        {
            "id": 155,
            "phrase": "recommend someone as something",
            "definition": "to suggest someone as something.  Could you recommend Frank as a good carpenter? _I can recommend Jane Smith as a good artist."
        },
        {
            "id": 156,
            "phrase": "recommend someone for something",
            "definition": "to suggest someone for something.  I would be very glad to recommend you for promotion.  She recommended herself as the best choice."
        },
        {
            "id": 157,
            "phrase": "recommend someone or something to someone",
            "definition": "to suggest that someone choose someone or something.  I would like to recommend Sally to you as a good prospect for membership on the committee.  Could you recommend a good mechanic to me?"
        },
        {
            "id": 158,
            "phrase": "recompense someone for something",
            "definition": "to (re)pay someone for something.  I am required to recompense Mrs. Wilson for her broken window.  Can I recompense you for your expenses?"
        },
        {
            "id": 159,
            "phrase": "reconcile oneself to something",
            "definition": "to grow to feel comfortable with an undesirable or challenging situation.  John reconciled himself to living alone.  Anne reconciled herself to having to wear glasses."
        },
        {
            "id": 160,
            "phrase": "reconcile something with something",
            "definition": "to bring something into harmony, accord, or balance with something.  The accountants were not able to reconcile the expense claims with the receipts that had been turned in.  I can’t reconcile your story with those of the other witnesses."
        },
        {
            "id": 161,
            "phrase": "reconstruct something from something",
            "definition": "1. to rebuild something from something. I was not able to reconstruct the puzzle from the pieces that were left on the f loor. Can you reconstruct the damaged part of the house from these materials? 2. to recall and restate a story or the details of an event from something. Can you reconstruct the story from the fragments you have just heard? _ I cannot reconstruct the chain of events from memory."
        },
        {
            "id": 162,
            "phrase": "record something from something",
            "definition": "to make an audio or video recording of something from some source.  Listen to this. I recorded it from a radio broadcast.  From what TV show did you record this?"
        },
        {
            "id": 163,
            "phrase": "record something in something",
            "definition": "to enter a record of something into something. I will record your appointment in my notebook.  Jane recorded the memo in her computer."
        },
        {
            "id": 164,
            "phrase": "record something on something",
            "definition": "to make a record of something on the surface of something.  Nancy recorded the appointment on the calendar that served as a blotter on the top of her desk.  Please record this on your calendar."
        },
        {
            "id": 165,
            "phrase": "recount something to someone",
            "definition": "to tell something to someone; to narrate a series of events, in order.  Carl recounted the events of the day to his wife.  The strange events were recounted by a number of people."
        },
        {
            "id": 166,
            "phrase": "recoup something from someone or something",
            "definition": "to salvage something from someone or something.  I hope I can recoup my expenses from the company this week.  Mary intended to recoup her money from the investment."
        },
        {
            "id": 167,
            "phrase": "recover from someone or something",
            "definition": "to get over an experience with someone or something.  My great-uncle just left, and it will take a day or two to recover from him.  I hope I recover from his visit soon."
        },
        {
            "id": 168,
            "phrase": "recover from something",
            "definition": "to recuperate from a disease.  I hope I recover from this cough soon. She recovered from her cold soon enough to go on the trip."
        },
        {
            "id": 169,
            "phrase": "recover something from someone or something",
            "definition": "to retrieve or salvage something from someone, something, or some place.  The police recovered my purse from the thief who had taken it.  Mary recovered her deposit from the failed bank."
        },
        {
            "id": 170,
            "phrase": "recruit someone for something",
            "definition": "to seek and engage someone for something. Harry had to recruit a few people for the new jobs that opened up. We recruited three more people for the project."
        },
        {
            "id": 171,
            "phrase": "recruit someone from something",
            "definition": "to convince someone to leave something and join one’s own group.  Phyllis recruited a new work team from the company she used to work for.  We recruited a number of people from private industry."
        },
        {
            "id": 172,
            "phrase": "recruit someone into something",
            "definition": "to seek out and induct someone into something.  The recruitment office tried to recruit ten people a week into the army.  The army recruited almost no one during the month of December."
        },
        {
            "id": 173,
            "phrase": "recuperate from something",
            "definition": "to recover from something; to be cured or to heal after something.  I hope that you recuperate from your illness soon.  Has she recuperated from her surgery yet?"
        },
        {
            "id": 174,
            "phrase": "a red herring",
            "definition": "a piece of information or suggestion introduced to draw attention away from the real facts of a situation. (A red herring is a type of strong-smelling smoked fish that was once drawn across the trail of a scent to mislead hunting dogs and put them off the scent.) _ The detectives were following a red herring, but they’re on the right track now.  The mystery novel has a couple of red herrings that keep readers off guard."
        },
        {
            "id": 175,
            "phrase": "red in the face",
            "definition": "embarrassed.  After we found Ann hiding in the closet, she became red in the face.  The speaker kept making errors and became red in the face."
        },
        {
            "id": 176,
            "phrase": "red ink",
            "definition": "debt; indebtedness as shown in red ink on a financial statement.  There is too much red ink in my financial statement.  Too much red ink and the company will collapse."
        },
        {
            "id": 177,
            "phrase": "red tape",
            "definition": "over-strict attention to the wording and details of rules and regulations, especially by government workers. (From the color of the tape used by government departments in England to tie up bundles of documents.) _Because of red tape, Frank took weeks to get a visa. Red tape prevented Jack’s wife from joining him abroad."
        },
        {
            "id": 178,
            "phrase": "*the red-carpet treatment",
            "definition": "very special treatment; royal treatment. (*Typically: get ~; have ~; give someone ~.) _ I love to go to fancy stores where I get the red-carpet treatment.  The queen expects to get the redcarpet treatment wherever she goes."
        },
        {
            "id": 179,
            "phrase": "rededicate oneself or something to someone or something",
            "definition": "to reaffirm the dedication of oneself or something to someone or something.  I must ask you to rededicate yourself to our high purposes.  They rededicated their church to God."
        },
        {
            "id": 180,
            "phrase": "a red-letter day",
            "definition": "an important or significant day. (From the practice of printing holidays in red on the calendar.) _ Today was a red-letter day in our history.  It was a red-letter day for our club."
        },
        {
            "id": 181,
            "phrase": "redound on someone",
            "definition": "to have an effect on someone. The hot weather has redounded on all of us in a bad way. The problems created by your mistake have redounded on the entire company."
        },
        {
            "id": 182,
            "phrase": "reduce someone to silence",
            "definition": "to cause someone to be silent. The rebuke reduced him to silence—at last. Mary was reduced to silence by Jane’s comments."
        },
        {
            "id": 183,
            "phrase": "reduce someone to tears",
            "definition": "to cause a person to cry through insults, frustration, and belittling.  He scolded her so much that she was reduced to tears by the end of the meeting."
        },
        {
            "id": 184,
            "phrase": "reduce something by something",
            "definition": "to diminish something by a certain amount. I have to reduce your allowance by two dollars per week until you pay me back for the broken window.  I will reduce the bill by a few dollars."
        },
        {
            "id": 185,
            "phrase": "reduce something from something to something",
            "definition": "to diminish something from one degree to a lower degree. I will reduce the fine from two hundred dollars to one hundred dollars.  Mary reduced her demands from a large sum to a smaller one."
        },
        {
            "id": 186,
            "phrase": "reduced to doing something",
            "definition": "brought into a certain humble condition or state. The poor man was reduced to begging for food."
        },
        {
            "id": 187,
            "phrase": "A reed before the wind lives on, while mighty oaks do fall.",
            "definition": "Prov. An insignificant, flexible person is more likely not to get hurt in a crisis than a prominent or rigid person.  Our office has new managers now; I plan to be as inconspicuous as possible while they reorganize everyone. A reed before the wind lives on, while mighty oaks do fall."
        },
        {
            "id": 188,
            "phrase": "reef a sail in†",
            "definition": "to reduce the area of a ship’s sail, by folding the sail. The first mate ordered the sailors to reef the sails in.  They had to reef in the sails."
        },
        {
            "id": 189,
            "phrase": "reek of something",
            "definition": "to have the stench or smell of something.  This whole house reeks of onions! What did you cook? _ She reeks of a very strong perfume. She must have spilled it on herself."
        },
        {
            "id": 190,
            "phrase": "reek with something",
            "definition": "to stink with some smell. This place reeks with some horrible odor.  Jane reeks with too much perfume."
        },
        {
            "id": 191,
            "phrase": "reel back (from something)",
            "definition": "to fall or stagger backwards, as from a blow.  The boxer reeled back from the blow, stunned.  Another blow to the midsection and he reeled back and fell."
        },
        {
            "id": 192,
            "phrase": "reel something in†",
            "definition": "to bring in something, such as a fish, by winding up the line on a reel. With great effort, she reeled the huge fish in.  Hurry and reel in the fish!"
        },
        {
            "id": 193,
            "phrase": "reel under something",
            "definition": "to stagger under the weight of something. Tony reeled under the weight of the books.  She knew she would reel under the heavy load."
        },
        {
            "id": 194,
            "phrase": "refer someone back to someone or something",
            "definition": "to suggest that someone go back to someone or something, such as the source.  I referred the client back to the lawyer she had originally consulted.  Tom referred the customer back to the manufacturer who had made the shoddy product."
        },
        {
            "id": 195,
            "phrase": "refer someone to someone or something",
            "definition": "to direct someone to someone or something; to send someone to someone or something.  The front office referred me to you, and you are now referring me to someone else! _ They should have referred you to the personnel department."
        },
        {
            "id": 196,
            "phrase": "refer to someone or something",
            "definition": "to mention someone or something. Are you referring to me when you speak about a kind and helpful person? _ I was referring to the personnel department."
        },
        {
            "id": 197,
            "phrase": "refill a prescription",
            "definition": "sell a second or subsequent set of doses of a medicine upon a doctor’s orders.  The pharmacy refused to refill my prescription because it has expired.  If you want the drugstore to refill your prescription, just give them the prescription number over the telephone."
        },
        {
            "id": 198,
            "phrase": "reflect (back) (up)on someone or something",
            "definition": "to remember or think about someone or something. (Upon is formal and less commonly used than on.) _ When I ref lect back on the years I spent with my parents, I think I had a good childhood. I like to ref lect on my great-grandmother."
        },
        {
            "id": 199,
            "phrase": "reflect credit (up)on someone or something",
            "definition": "[for some act] to bring credit to someone or something. (Upon is formal and less commonly used than on.) _Your efforts really ref lect credit upon you.  Mary’s success really ref lected credit on the quality of her education."
        },
        {
            "id": 200,
            "phrase": "reflected in something",
            "definition": "[of something] mirrored in something, such as a mirror, water, ice, etc.  His image was ref lected in the mirror, giving him a good view of his sunburn.  When the hermit’s image was ref lected in the pool, he was amazed."
        },
        {
            "id": 201,
            "phrase": "refrain from something",
            "definition": "to hold back from doing something; to choose not to do something as planned. I wish you would refrain from shouting. Please refrain from hollering."
        },
        {
            "id": 202,
            "phrase": "refresh someone with something",
            "definition": "to renew or revive someone with something. Here, let me refresh you with a cool glass of lemonade.  After the game, Wally will probably refresh himself with a bottle of iced tea."
        },
        {
            "id": 203,
            "phrase": "refresh something with something",
            "definition": "to restore or brighten up something.  I think we can refresh this drab old room with a coat of fresh paint.  The old house was refreshed with new siding and some landscaping."
        },
        {
            "id": 204,
            "phrase": "refund something to someone",
            "definition": "to return payment for something to someone.  I insist that you refund the money to me at once.  Her money was refunded to her by the store as soon as she asked for it."
        },
        {
            "id": 205,
            "phrase": "refuse something to someone",
            "definition": "to deny someone permission to receive or use something.  You wouldn’t refuse water to me, would you? _ Nothing at all was refused to the new employee."
        },
        {
            "id": 206,
            "phrase": "refuse to do something",
            "definition": "to reject doing something; to reject a request to do something. I absolutely refuse to go there! _ We all refused to break the law."
        },
        {
            "id": 207,
            "phrase": "regain one’s composure",
            "definition": "Cliché to become calm and composed after being angry or agitated.  I found it difficult to regain my composure after the argument.  Here, sit down and relax so that you can regain your composure."
        },
        {
            "id": 208,
            "phrase": "regain one’s feet",
            "definition": "to stand up again after falling or stumbling. I fell on the ice and almost couldn’t regain my feet.  I helped my uncle regain his feet as he tried to get up from the f loor."
        },
        {
            "id": 209,
            "phrase": "regain something from someone or something",
            "definition": "to take back possession of one’s property or right from someone or something.  I intend to regain my money from Herb.  The finance company regained the car from the delinquent buyer."
        },
        {
            "id": 210,
            "phrase": "regale someone with something",
            "definition": "to present a great deal of something, such as lavish entertainment or fine food, to someone.  They regaled their guests with food and music well into the night. The committee was regaled with tales of wrongdoing by the government."
        },
        {
            "id": 211,
            "phrase": "regard someone or something as someone or something",
            "definition": "to look upon someone or something as someone or something; to consider someone or something to be someone or something.  I have always regarded you as my friend.  The cult members regarded the stone idol as their dead leader."
        },
        {
            "id": 212,
            "phrase": "regard someone or something with something",
            "definition": "to look upon someone or something with a certain attitude or with certain expectations.  The child regarded the teacher with a questioning expression. The kitten regarded the fishbowl with great curiosity."
        },
        {
            "id": 213,
            "phrase": "regardless of something",
            "definition": "without considering something; at any rate; whatever is done; whatever option is chosen.  Regardless of what you say, I’m still going to the club tonight.  I still have to pay the bill, regardless of the facts."
        },
        {
            "id": 214,
            "phrase": "register for something",
            "definition": "to sign up to participate in something. Have you registered for the class yet? _She is registered for the same classes as I am."
        },
        {
            "id": 215,
            "phrase": "register in something",
            "definition": "to enter one’s name on a list for something; to sign oneself up to belong to something.  Are you going to register in the pie-eating contest? _We registered in the drawing for a new car."
        },
        {
            "id": 216,
            "phrase": "register on something",
            "definition": "[for an effect] to show on something, such as someone’s face. Recognition registered on her face when she saw the photograph of Walter. The total of the votes registered on the large scoreboard at the front of the hall."
        },
        {
            "id": 217,
            "phrase": "register someone as something",
            "definition": "to record someone’s name on a list of a category of people. I will register you as an independent voter.  I am registered as a qualified financial advisor."
        },
        {
            "id": 218,
            "phrase": "register someone for something",
            "definition": "to sign someone up to participate in something.  Would you please register me for the workshop when you sign up? _ Excuse me. I have to go register myself for the contest."
        },
        {
            "id": 219,
            "phrase": "register someone in something",
            "definition": "1. to enter someone’s name on a list in something.  I will register you in the competition. 2. to sign someone up to belong to something.  I registered my cousin in the club."
        },
        {
            "id": 220,
            "phrase": "register something with someone or something",
            "definition": "to record the existence of something with someone or something.  Did you register your new stereo with the manufacturer? _ If you bring any packages into this store, please register them with the manager."
        },
        {
            "id": 221,
            "phrase": "register with someone",
            "definition": "to sign up with someone.  You will have to register with the lady at the front desk.  I registered with the attendant when I came in."
        },
        {
            "id": 222,
            "phrase": "regress to something",
            "definition": "to go back to an earlier, probably simpler, state; to go back to a more primitive state.  Bob claimed that Gerald’s behavior was regressing to that of a three-year-old.  I tend to regress to my college ways when I am out with the guys."
        },
        {
            "id": 223,
            "phrase": "*regular as clockwork",
            "definition": "Cliché very regular; completely predictable. (*Also: as ~.) _George goes down to the bus stop at 7:45 every morning, as regular as clockwork.  You can always depend on Nancy to complain about the office for fifteen minutes every afternoon, regular as clockwork."
        },
        {
            "id": 224,
            "phrase": "a regular fixture",
            "definition": "someone who is found so frequently in a place as to be considered a fixture of, or part of the place.  The manager attached himself to the luncheon club and became a regular fixture there."
        },
        {
            "id": 225,
            "phrase": "a regular guy",
            "definition": "a normal and dependable guy.  Don’t worry about Tom. He’s a regular guy. He won’t give you any trouble."
        },
        {
            "id": 226,
            "phrase": "rehearse for something",
            "definition": "to practice for something.  We will rehearse for the graduation exercises on Saturday morning.  We rehearsed for the play all weekend."
        },
        {
            "id": 227,
            "phrase": "reign over someone or something",
            "definition": "to rule over someone or something.  The king reigned over his subjects for over thirty years. The queen reigned over the country for a long time."
        },
        {
            "id": 228,
            "phrase": "reimburse someone for something",
            "definition": "to repay someone for making a purchase, such as a business expense.  I will reimburse you for whatever it cost you.  The treasurer reimbursed himself for his expenses."
        },
        {
            "id": 229,
            "phrase": "reimburse something to someone",
            "definition": "to repay money to someone, such as a business expense.  I will reimburse the money to you. Don’t worry. The full cost was reimbursed to me."
        },
        {
            "id": 230,
            "phrase": "rein back on someone or something",
            "definition": "to control or diminish the intensity of someone or something.  The manager was urged to rein back on her assigning overtime.  She reined back on expenses and demanded that others do likewise."
        },
        {
            "id": 231,
            "phrase": "rein someone or something in†",
            "definition": "to bring someone or something under control; to slow down someone or something.  Fred is getting out of hand. The boss undertook to rein him in a bit.  The boss is trying to rein in Jane’s enthusiasm."
        },
        {
            "id": 232,
            "phrase": "rein something up†",
            "definition": "to bring something, usually a horse, to a stop. She reined her horse up and stopped for a chat.  Rein up your horse and stop for a while."
        },
        {
            "id": 233,
            "phrase": "rein up",
            "definition": "[for a horse rider] to stop. The equestrian reined up and dismounted. We all reined up and waited for the cars to pass by."
        },
        {
            "id": 234,
            "phrase": "reinforce someone or something with something",
            "definition": "to strengthen someone or something with something. The general reinforced his troops with volunteers fresh from basic training.  I had to reinforce the garage roof with new boards."
        },
        {
            "id": 235,
            "phrase": "reinstate someone as something",
            "definition": "to put someone back as a certain officeholder. The city council agreed to reinstate Mr. Wilson as alderman. Fred was reinstated as the court clerk."
        },
        {
            "id": 236,
            "phrase": "reinstate someone in something",
            "definition": "to put someone back into a certain office or position. If you will pay your dues, we will reinstate you in the organization. Fred was reinstated in office."
        },
        {
            "id": 237,
            "phrase": "reinvent the wheel",
            "definition": "to make unnecessary or redundant preparations.  You don’t need to reinvent the wheel. Read up on what others have done.  I don’t have to reinvent the wheel, but I will be cautious before I act."
        },
        {
            "id": 238,
            "phrase": "reissue something to someone",
            "definition": "to release or distribute to someone something that has been distributed before. I plan to reissue the check to you next week. The check was reissued to Mary the very next day."
        },
        {
            "id": 239,
            "phrase": "reject someone or something out of hand",
            "definition": "to reject someone or something without any thought or study.  Fred is so contrary that they rejected him out of hand when his name came up for a committee position."
        },
        {
            "id": 240,
            "phrase": "rejoice at something",
            "definition": "to celebrate or revel about something. Everyone rejoiced at the lucky events that had saved them.  We all rejoiced at the outcome of the election."
        },
        {
            "id": 241,
            "phrase": "rejoice in someone or something",
            "definition": "to take great joy at someone or something.  I am in love and I rejoice in my beloved! _ Roger rejoices in a good night’s sleep."
        },
        {
            "id": 242,
            "phrase": "rejoice over something",
            "definition": "to celebrate because of something.  Everyone rejoiced over their good fortune.  What happened to us next was nothing to rejoice over."
        },
        {
            "id": 243,
            "phrase": "relapse into something",
            "definition": "to experience a return to a worse condition. Valerie relapsed into a coma in the afternoon.  Mary relapsed into her depression after a brief period of normalcy."
        },
        {
            "id": 244,
            "phrase": "relate something to someone",
            "definition": "to tell something to someone; to narrate something to someone.  Very slowly, she related the events of the past week to her parents.  I have an interesting story to relate to you."
        },
        {
            "id": 245,
            "phrase": "relate something to something",
            "definition": "to associate something to something. I relate this particular problem to the failure of the company to provide proper training.  This point is related to what I just told you."
        },
        {
            "id": 246,
            "phrase": "relate to someone or something",
            "definition": "to understand, accept, or feel kinship with someone or something.  He relates to people well.  I really don’t relate to your thinking at all."
        },
        {
            "id": 247,
            "phrase": "*related to someone",
            "definition": "connected through blood kinship or through marriage to someone. (*Typically: be ~; become ~.) _ I wonder if he is related to you, because he looks a little like you.  I am not related to anyone here."
        },
        {
            "id": 248,
            "phrase": "relative to someone or something",
            "definition": "1. concerning someone or something.  I have something to say relative to Bill.  Do you have any information relative to the situation in South America? 2. in proportion to someone or something.  My happiness is relative to yours.  I can spend an amount of money relative to the amount of money I earn."
        },
        {
            "id": 249,
            "phrase": "relax into something",
            "definition": "1. to sit or lie down in something, relaxing. I want to go home and relax into my easy chair.  I relaxed into the reclining chair and was asleep in a few moments. 2. [for something that is tense] to assume a more relaxed shape or condition.  His cramped muscle finally relaxed into a soft mass of tissue. As her tight neck relaxed into softness, her face brightened."
        }
    ]
}