{
    "dictionary": [
        {
            "id": 0,
            "phrase": "discourse (up)on someone or something",
            "definition": "to lecture about someone or something. (Upon is formal and less commonly used than on.) _I would like to discourse upon this matter awhile. The committee chose to discourse on Tom and his latest fiasco rather than deal with the budgetary problems it faces."
        },
        {
            "id": 1,
            "phrase": "Discretion is the better part of valor.",
            "definition": "Prov. It is good to be brave, but it is also good to be careful.; If you are careful, you will not get into situations that require you to be brave.  Son: Can I go hang gliding with my friends? Father: No. Son: But they’ll say I’m chicken if I don’t go! Father: Discretion is the better part of valor, and I’d rather have them call you chicken than risk your life."
        },
        {
            "id": 2,
            "phrase": "discriminate against someone or something",
            "definition": "to single out a type of person or thing for special negative treatment or denial of equal treatment; to act in a prejudicial manner against someone or something.  This law discriminates against short people.  You discriminate against people in wheelchairs."
        },
        {
            "id": 3,
            "phrase": "discriminate between someone and someone else or something and something else",
            "definition": "to distinguish between people or between things.  I find it hard these days to discriminate between my friends and my enemies.  Can you discriminate between this shade of pink and that one?"
        },
        {
            "id": 4,
            "phrase": "discuss someone or something with someone",
            "definition": "to talk about someone or something with someone.  I need to discuss Mickey with you. We need to discuss compensation with the boss."
        },
        {
            "id": 5,
            "phrase": "the disease to please",
            "definition": "an obsessive need to please people. I, like so many, am aff licted with the disease to please. I am just too nice for my own good."
        },
        {
            "id": 6,
            "phrase": "disembark from something",
            "definition": "to get off a ship, plane, or train. We disembark from the ship in Manaus. At what time do we expect to disembark from the plane?"
        },
        {
            "id": 7,
            "phrase": "disengage (oneself) from someone or something",
            "definition": "to detach oneself from someone or something; to untangle oneself from someone or something.  I wanted to disengage myself from the person I was talking to and go home. We disengaged from the argument."
        },
        {
            "id": 8,
            "phrase": "disengage something from something",
            "definition": "to detach something from something.  Sally disengaged the locking mechanism from the cupboard door and peeked in.  The coupling was disengaged from the boxcar, and the car separated and rolled away."
        },
        {
            "id": 9,
            "phrase": "disentangle someone or something from someone or something",
            "definition": "to untangle someone or something from someone or something.  I helped disentangle Tony from the coils of ropes he had stumbled into. They worked feverishly to disentangle the dolphin from the net. He disentangled himself from the net."
        },
        {
            "id": 10,
            "phrase": "disguise someone in something",
            "definition": "to conceal someone’s identity in a costume or makeup.  We disguised her in men’s clothing and got her across the border. She disguised herself in a clown suit."
        },
        {
            "id": 11,
            "phrase": "disguise someone or something as someone or something",
            "definition": "to dress or make someone up to appear to be someone or something. We disguised the child as a witch. We disguised Gerald as a pumpkin."
        },
        {
            "id": 12,
            "phrase": "*disgusted at someone or something",
            "definition": "severely disappointed at someone or something. (*Typically: be ~; get ~; grow ~.) _ We were disgusted at her incessant lying.  Sam was disgusted at her."
        },
        {
            "id": 13,
            "phrase": "*disgusted with someone or something",
            "definition": "severely disappointed over someone or something. (*Typically: be ~; get ~; grow ~.) _ I am totally disgusted with Ellen.  We are all disgusted with the fall in the company’s profits."
        },
        {
            "id": 14,
            "phrase": "dish on someone",
            "definition": "Sl. to gossip about or slander someone.  Stop dishing on her. She never hurt you! _ They spent an hour dishing on Wally."
        },
        {
            "id": 15,
            "phrase": "dish something out†",
            "definition": "to serve up food to people.  I’ll dish it out, and you take it to the table.  Careful how you dish out the mashed potatoes. There may not be enough."
        },
        {
            "id": 16,
            "phrase": "dish the dirt",
            "definition": "Sl. to spread gossip; to gossip.  Let’s sit down, have a drink, and dish the dirt.  David goes down to the tavern to dish the dirt."
        },
        {
            "id": 17,
            "phrase": "disinclined to do something",
            "definition": "unwilling to do something. I am disinclined to allow you to leave class early. They were disinclined to allow us to enter the country."
        },
        {
            "id": 18,
            "phrase": "dislodge someone or something from someone or something",
            "definition": "to loosen and remove someone or something from someone or something.  We were unable to dislodge her from office. Gene was able to dislodge the bone from his throat."
        },
        {
            "id": 19,
            "phrase": "dismiss someone (from something) (for something)",
            "definition": "to discharge someone from employment for some reason; to fire someone from a job for some cause. We will have to dismiss him from employment for absenteeism. She was dismissed from the bank for making many errors in one month."
        },
        {
            "id": 20,
            "phrase": "dismiss something as something",
            "definition": "to put something out of one’s mind or ignore something as something. (The second something can be a noun or an adjective.) _ I dismissed the whole idea as foolishness.  It was not possible to dismiss the whole matter as a one-time happening.  Molly dismissed the whole event as accidental."
        },
        {
            "id": 21,
            "phrase": "dismount from something",
            "definition": "to get down from something, such as a horse, bicycle, etc.  She dismounted from her horse and f led into the house.  Please dismount from the bicycle and wheel it into the shed."
        },
        {
            "id": 22,
            "phrase": "dispatch someone from some place",
            "definition": "to send someone from some place.  I dispatched a messenger from here over an hour ago.  A telegram will be dispatched from my office first thing in the morning."
        },
        {
            "id": 23,
            "phrase": "dispatch someone or something to someone or something",
            "definition": "to send someone or something to someone, something, or some place.  I will dispatch a new copy of the damaged book to you immediately.  Gene will dispatch a messenger to you."
        },
        {
            "id": 24,
            "phrase": "dispense something (to someone) (from something)",
            "definition": "to distribute something to someone from something or some place.  The nurse dispensed aspirin to everyone from a large bottle. The nurse dispensed aspirin from a large bottle to anyone who asked for it."
        },
        {
            "id": 25,
            "phrase": "dispense with someone or something",
            "definition": "to get rid of someone or something; to brush someone or something aside.  I think we will dispense with that subject for the rest of the day. We will have to dispense with the expensive gifts this year."
        },
        {
            "id": 26,
            "phrase": "display something to someone",
            "definition": "to show something to someone.  The peacock displayed his tail feathers to the other birds.  Would you please display the artwork to the committee?"
        },
        {
            "id": 27,
            "phrase": "dispose of someone",
            "definition": "Sl. to kill someone.  Max suggested that he would dispose of Lefty if Lefty continued to be a pest.  The boss ordered Max to dispose of Lefty."
        },
        {
            "id": 28,
            "phrase": "dispose of someone or something",
            "definition": "to get rid of someone or something.  How can I dispose of this bothersome customer? _ Where shall I dispose of this wastepaper?"
        },
        {
            "id": 29,
            "phrase": "dispossess someone of something",
            "definition": "to separate someone from a possession.  Do you intend to dispossess us of our home? _They were dispossessed of the only possessions they had."
        },
        {
            "id": 30,
            "phrase": "dispute something with someone",
            "definition": "to argue with someone about something, such as an amount of money. The customer disputed the amount of the check with the waiter.  Please don’t feel like you have to dispute every bill with the supplier."
        },
        {
            "id": 31,
            "phrase": "dis(s) (on) someone",
            "definition": "Sl. to belittle someone; to show disrespect for someone. (From either a nonstandard transitive verb disrespect or from dismiss [as insignificant]. Dis is also a slang transitive verb.) _Gary is such a complainer. All he does is diss on people.  Please stop dissing my little sister. She didn’t do any of those things."
        },
        {
            "id": 32,
            "phrase": "*dissatisfied with someone or something",
            "definition": "unhappy with someone or something. (*Typically: be ~; grow ~.) _We are quite dissatisfied with the service provided by the dealer.  I am not dissatisfied with you."
        },
        {
            "id": 33,
            "phrase": "dissent from something",
            "definition": "to disagree with something. We have chosen to dissent from the decision the rest of you made. Fred dissented from almost everything that everyone else agreed on."
        },
        {
            "id": 34,
            "phrase": "dissociate oneself from someone or something",
            "definition": "to break one’s association or relationship with someone or something.  They decided to dissociate themselves from our organization.  I was forced to dissociate myself from her.  We advised her to dissociate herself from the gang."
        },
        {
            "id": 35,
            "phrase": "dissolve in something",
            "definition": "[for a substance] to break down in a liquid and disperse in the liquid. (Compare this with dissolve into something.) _ Salt will dissolve in warm water.  This material will not dissolve in oil."
        },
        {
            "id": 36,
            "phrase": "dissolve into something",
            "definition": "[for a substance to change from a solid state into another state; [for a substance] to melt or liquefy something. (Compare this with dissolve in something.) _In a hot pan, the sugar dissolved into syrup."
        },
        {
            "id": 37,
            "phrase": "dissolve something in something",
            "definition": "to cause a substance to break down in a liquid and disperse in the liquid.  First, dissolve the salt in some warm water.  Dissolve this medicine in water."
        },
        {
            "id": 38,
            "phrase": "dissolve something into something",
            "definition": "to cause a film or television picture to fade away into some other picture.  The director dissolved the picture into the next scene.  At this point, the opening scene should be dissolved into a side shot of the exterior."
        },
        {
            "id": 39,
            "phrase": "dissuade someone from something",
            "definition": "to discourage someone from (doing) something.  I hope to dissuade her from getting married until she graduates. I could not dissuade him from his plan."
        },
        {
            "id": 40,
            "phrase": "Distance lends enchantment (to the view).",
            "definition": "Prov. Things that are far away from you appear better than they really are.  Jill: High school was the happiest time of my life. Jane: But that was fifteen years ago. I think distance lends enchantment to the view."
        },
        {
            "id": 41,
            "phrase": "distance oneself from someone or something",
            "definition": "to separate oneself physically from someone or something.  She wanted to distance herself from the fighting in the corridor.  I distanced myself from her from then on."
        },
        {
            "id": 42,
            "phrase": "distill something from something",
            "definition": "to derive product from something by heating and condensation.  They distilled the lighter components from the raw oil. The alcohol was distilled from fermented grain."
        },
        {
            "id": 43,
            "phrase": "distinguish between someone or something and someone or something else",
            "definition": "1. to perceive the difference between different people and things, in any combination.  Can’t you distinguish between Tom and your real enemies? _ He can’t distinguish between a good used car and that wreck over there! 2. to create or emphasize the difference between people and things, in any combination.  Try to distinguish between the figure in the foreground and the f lowers in the background in your painting.  I used red to distinguish between the new part and the old."
        },
        {
            "id": 44,
            "phrase": "distinguish oneself among someone",
            "definition": "to make oneself stand out from other people because of one’s achievements.  I hope someday to distinguish myself among my peers.  He distinguished himself among his classmates by his many talents."
        },
        {
            "id": 45,
            "phrase": "distinguish someone or something from someone or something else",
            "definition": "1. to tell the difference between different people and things, in any combination. I cannot distinguish Billy from Bobby.  She could not distinguish basil from oregano. 2. to delineate or emphasize the boundary between people and things, in any combination.  I cannot distinguish the blue scarf from the sky in the background. We could not distinguish the leaves of the bushes from the leaves of the trees as we moved farther away."
        },
        {
            "id": 46,
            "phrase": "distract someone from something",
            "definition": "to turn or divert someone’s attention from something.  I hate to distract you from your work, but I have some important news.  You haven’t distracted me from anything."
        },
        {
            "id": 47,
            "phrase": "distribute something (all) around",
            "definition": "to give shares of something to people.  I distributed many gifts all around to everyone.  We distributed the drinks around."
        },
        {
            "id": 48,
            "phrase": "distribute something among someone or something",
            "definition": "to give out shares of something to three or more people.  We must distribute the money among the various charities.  The food was distributed among the people who showed up."
        },
        {
            "id": 49,
            "phrase": "distribute something between someone",
            "definition": "to give out shares of something to two people. He distributed the remaining cake between Dave and Don.  Please distribute the magazines between the two boys."
        },
        {
            "id": 50,
            "phrase": "distribute something over something",
            "definition": "to spread something over something or over an area. Distribute the icing over the entire cake.  Walter distributed the sand over the icy spots."
        },
        {
            "id": 51,
            "phrase": "distribute something to someone",
            "definition": "to give out something to someone.  Can you distribute this clothing to the needy people who live around here? _ I will distribute the ice cream to the party guests."
        },
        {
            "id": 52,
            "phrase": "dive in(to something)",
            "definition": "to plunge into something; to jump into something headfirst.  Don’t dive into that water! It’s too shallow.  David walked to the edge of the pool and dived in."
        },
        {
            "id": 53,
            "phrase": "dive off ((of ) something)",
            "definition": "to jump off something headfirst. (Of is usually retained before pronouns.) _ Rachel dived off of the rock into the river.  She dived off the high diving board."
        },
        {
            "id": 54,
            "phrase": "diverge from something",
            "definition": "to move in a different direction from something. Her line of thinking diverged from generally accepted thought on this point.  The driveway diverges from the main road beyond the fence, straight ahead."
        },
        {
            "id": 55,
            "phrase": "diverge to something",
            "definition": "to turn to a particular direction.  A narrow road diverged to the left.  A narrower channel diverged to the left of the island."
        },
        {
            "id": 56,
            "phrase": "divert someone or something from someone or something",
            "definition": "to turn someone or something aside or away from someone or something.  We could not divert his attention from his mother. I could not divert the woman from her interest in the book."
        },
        {
            "id": 57,
            "phrase": "divert someone or something to someone or something",
            "definition": "to channel or redirect someone or something to someone or something.  The farmers diverted the stream to a different channel.  The guards diverted the museum visitors to the great hall."
        },
        {
            "id": 58,
            "phrase": "divert something into something",
            "definition": "1. to channel something into something.  We will have to divert the runoff water into the culvert.  Let’s divert this stream into the ditch. 2. Euph. to steal something and keep it some place.  He diverted the funds into a secret bank account. She diverted her clients’ stock dividends into her own investment portfolio."
        },
        {
            "id": 59,
            "phrase": "divert something onto something",
            "definition": "to channel something onto the surface of something.  Temporarily, they diverted the southbound traffic onto the side streets."
        },
        {
            "id": 60,
            "phrase": "divest someone or something of something",
            "definition": "to take something away from someone or something.  The judge divested the company of its foreign holding. The court divested her of her stocks."
        },
        {
            "id": 61,
            "phrase": "divide and conquer",
            "definition": "to cause the enemy to divide and separate into two or more factions, and then move in to conquer all of them. Mary thought she could divide and conquer the board of directors, but they had survived such tactics many times, and her efforts failed.  Sam led his men to divide and conquer the enemy platoon, and his strategy succeeded."
        },
        {
            "id": 62,
            "phrase": "divide by something",
            "definition": "to perform mathematical division by a particular number. Can you divide by sixteens? _Add this figure to the next column and divide by twenty."
        },
        {
            "id": 63,
            "phrase": "divide someone against someone or something",
            "definition": "to cause people to separate into two groups, one of which opposes someone or something.  The issue divided the children against their parents.  The argument divided the president against the board of directors."
        },
        {
            "id": 64,
            "phrase": "divide something between people or things",
            "definition": "to give shares of something to specific people or groups. (In a strict sense, only between two entities. Informally, between two or more.) _ I will have to divide the toys between the two children.  He divided the tasks between the day crew and the night crew."
        },
        {
            "id": 65,
            "phrase": "divide something by something",
            "definition": "to perform mathematical division on something, using a particular number. Now, divide this sum by the figure in column seven.  Can you divide 1,400 by 59?"
        },
        {
            "id": 66,
            "phrase": "divide something (off†) (from something or animals)",
            "definition": "1. to separate something from something else.  Let’s divide the chickens off from the ducks and put the chickens in the shed.  We divided off the chickens from the ducks. 2. to separate something from something else, using a partition. We divided the sleeping area off from the rest of the room.  A curtain was used to divide off a sleeping area."
        },
        {
            "id": 67,
            "phrase": "divide something with someone",
            "definition": "to share something with someone.  I will divide a piece of cake with you.  They refused to divide the ice cream with us."
        },
        {
            "id": 68,
            "phrase": "divided between something",
            "definition": "separated into different categories.  The applicants for the job seemed to be divided between the overqualified and the underqualified.  The dogs were divided evenly between terriers and poodles."
        },
        {
            "id": 69,
            "phrase": "divided on someone or something",
            "definition": "having differing opinions about someone or something.  Our opinions are divided on what is going to happen.  We were divided on Ann. Some of us wanted to choose her; some did not."
        },
        {
            "id": 70,
            "phrase": "divorce oneself from something",
            "definition": "to separate oneself from something, such as an idea, policy, philosophy, etc. She was not able to divorce herself from long-held prejudice.  You should divorce yourself from those limiting ideas."
        },
        {
            "id": 71,
            "phrase": "divulge something to someone",
            "definition": "to reveal something to someone.  Promise that you will not divulge any of this to anyone.  She refused to divulge their names to us."
        },
        {
            "id": 72,
            "phrase": "do a double take",
            "definition": "to react with surprise; to have to look twice to make sure that one really saw correctly.  When the boy led a goat into the park, everyone did a double take.  When the nurse saw that the man had six toes, she did a double take."
        },
        {
            "id": 73,
            "phrase": "do a fade",
            "definition": "Sl. to leave; to sneak away.  Richard did a fade when he saw heard the police siren.  It’s time for me to do a fade."
        },
        {
            "id": 74,
            "phrase": "do a job on someone or something",
            "definition": "1. Euph. to defecate on someone or something. (Note the variation in the second example.) _ The puppy did a job on the living-room carpet.  It’s supposed to do its job on the newspapers in the basement. 2. Sl. to damage someone or something; to mess up someone or something.  The robbers really did a job on the bank guard. They beat him when they robbed the bank.  The puppy did a job on my shoes. They are all chewed to pieces."
        },
        {
            "id": 75,
            "phrase": "do a land-office business",
            "definition": "to do a large amount of buying or selling in a short period of time.  The icecream shop always does a land-office business on a hot day. The tax collector’s office did a land-office business on the day that taxes were due."
        },
        {
            "id": 76,
            "phrase": "do a number on someone or something",
            "definition": "Sl. to damage or harm someone or something.  The teacher did a number on the whole class by giving them a pop quiz. Tom did a number on Mary when he went out with Ann."
        },
        {
            "id": 77,
            "phrase": "do a slow burn",
            "definition": "to be quietly angry.  I did a slow burn while I was waiting in line for a refund."
        },
        {
            "id": 78,
            "phrase": "do a snow job on someone",
            "definition": "Sl. to deceive or confuse someone. (As if to blind someone with snow.) _Don’t try to do a snow job on me. I know all the tricks. She thought she did a snow job on the teacher, but it backfired."
        },
        {
            "id": 79,
            "phrase": "do a takeoff on someone or something",
            "definition": "to perform a parody on someone or something.  The comedian did a takeoff on the president, and everyone thought it was terribly funny."
        },
        {
            "id": 80,
            "phrase": "Do as I say, not as I do.",
            "definition": "Prov. Take my advice, even though I am acting contrary to it. (Sometimes used as an apology for behaving hypocritically.) _ Jill: Why are you walking on the grass when I told you not to? Jane: But you’re walking on the grass. Jill: Do as I say, not as I do."
        },
        {
            "id": 81,
            "phrase": "do away with oneself",
            "definition": "Euph. to commit suicide.  The doctor was afraid that Betty would do away with herself.  I wouldn’t think of doing away with myself."
        },
        {
            "id": 82,
            "phrase": "do away with someone or an animal",
            "definition": "Euph. to kill someone or an animal.  The crooks did away with the witness.  I was there, too. I hope they don’t try to do away with me."
        },
        {
            "id": 83,
            "phrase": "do away with something",
            "definition": "to get rid of something.  This chemical will do away with the stain in your sink.  The time has come to do away with that old building."
        },
        {
            "id": 84,
            "phrase": "do business with someone",
            "definition": "to trade or bargain with someone; to conduct commerce with someone.  You sound reasonable. I think I can do business with you.  I am sure we can do business with one another."
        },
        {
            "id": 85,
            "phrase": "do for someone",
            "definition": "1. to provide for someone; to take care of or serve someone.  Do you expect me to stay home and do for you for the rest of my life? _I can’t do for all of them! 2. to suffice for someone; to be sufficient for someone. Will this amount of sweet potatoes do for you? _Yes, this will do for me fine. 3. See also done for."
        },
        {
            "id": 86,
            "phrase": "do for something",
            "definition": "to serve as something; to substitute as something.  I think that this stone will do nicely for a doorstop.  This stick will just not do for a stirring spoon."
        },
        {
            "id": 87,
            "phrase": "(Do) have some more.",
            "definition": "a polite invitation to take more of something, usually food or drink.  Bill: Wow, Mrs. Franklin, this scampi is great! Sally: Thank you, Bill. Do have some more.  Jane: What a lovely, light cake. Mary: Oh, have some more. Otherwise the boys will just wolf it down."
        },
        {
            "id": 88,
            "phrase": "Do I make myself (perfectly) clear?",
            "definition": "Do you understand exactly what I mean? (Very stern.) _Mother: You’re going to sit right here and finish that homework. Do I make myself perfectly clear? Child: Yes, ma’am.  Sue: No, the answer is no! Do I make myself clear?"
        },
        {
            "id": 89,
            "phrase": "do justice to something",
            "definition": "1. Fig. to do something well; to represent or portray something accurately. Sally did justice to our side in the contract negotiations.  This photograph doesn’t do justice to the beauty of the mountains. 2. Fig. to eat or drink a great deal.  Bill always does justice to the turkey on Thanksgiving.  The party didn’t do justice to the roast pig. There were nearly ten pounds left over."
        },
        {
            "id": 90,
            "phrase": "Do not wash your dirty linen in public.",
            "definition": "Prov. Do not talk about your private family problems in public.  Grandson: How are we going to make Dad stop drinking? Grandmother: Hush! Don’t wash your dirty linen in public."
        },
        {
            "id": 91,
            "phrase": "do one’s business",
            "definition": "Euph. to defecate or urinate.  Do you need to do your business before we get in the car? _ The cat did her business on the sofa again."
        },
        {
            "id": 92,
            "phrase": "do one’s duty",
            "definition": "1. to do one’s job; to do what is expected of one.  Please don’t thank me. I’m just doing my duty.  Soldiers who fight in wars are doing their duty. 2. Euph. to defecate or urinate. We’re not leaving this restroom until you do your duty.  She did her duty in the potty, just like a big girl!"
        },
        {
            "id": 93,
            "phrase": "do one’s (level) best",
            "definition": "to do something as well as one can.  Just do your level best. That’s all we can ask of you.  Tom isn’t doing his best. We may have to replace him."
        },
        {
            "id": 94,
            "phrase": "do one’s (own) thing",
            "definition": "to do what one wants; to do what pleases oneself no matter what others think. She’s going to start doing her own thing for a change. I’ve always done my thing, and I don’t see any reason to change to your view now."
        },
        {
            "id": 95,
            "phrase": "do one’s utmost (to do something)",
            "definition": "to make one’s best effort at doing something. We will do our utmost to make the guests to feel welcome."
        },
        {
            "id": 96,
            "phrase": "do oneself proud",
            "definition": "to have done a very fine job.  That’s super! You’ve done yourself proud! _ I feel like I’ve done myself proud by earning high honors."
        },
        {
            "id": 97,
            "phrase": "do or die",
            "definition": "trying as hard as one can.  I was determined to get there—do or die.  (Used as an attributive) He has the obsessive do-or-die attitude."
        },
        {
            "id": 98,
            "phrase": "do’s and don’ts",
            "definition": "the rules; the things that should be done and those that should not be done.  I must admit that a lot of do’s and don’ts at this company are hard for me to understand. Better learn the do’s and don’ts immediately."
        },
        {
            "id": 99,
            "phrase": "Do sit down.",
            "definition": "Don’t stand on ceremony.; Please sit down. (A polite phrase encouraging people to resume their seats after rising for an introduction or out of deference.) _ Tom rose when Mary approached the table, but she said graciously, “Do sit down. I just wanted to thank you again for the lovely gift.” _ Tom: Hello, Bill. Bill (rising): Hi, Tom. Tom (standing): Do sit down. I just wanted to say hello."
        },
        {
            "id": 100,
            "phrase": "do some fine coin",
            "definition": "Sl. to make a large sum of money.  When I get my big break, I’m going to do some fine coin.  Richard did some fine coin on that last housepainting job."
        },
        {
            "id": 101,
            "phrase": "do somehow by someone",
            "definition": "to treat someone in a particular manner. (Do not confuse this with a passive construction. The someone is not the actor but the object.) _ Tom did all right by Ann when he brought her red roses. I did badly by Tom. I fired him without good reason."
        },
        {
            "id": 102,
            "phrase": "do somehow for someone",
            "definition": "to benefit or harm someone in some degree.  This jacket does fine for me. I don’t need a different one.  This meal does okay for me. I’m satisfied."
        },
        {
            "id": 103,
            "phrase": "do someone a kindness",
            "definition": "to do a kind deed for a person. My neighbor did me a kindness when he cut my grass.  I am always happy to have the opportunity of doing someone a kindness."
        },
        {
            "id": 104,
            "phrase": "do someone damage",
            "definition": "to harm someone, physically or otherwise.  I hope she doesn’t plan to do me damage.  They did us damage by telling the whole story to the newspapers."
        },
        {
            "id": 105,
            "phrase": "do someone dirt(y)",
            "definition": "Rur. to do something bad or dishonest to someone.  He sure did his wife dirty, leaving her like that.  She did me dirt when we divided up the things mother left us."
        },
        {
            "id": 106,
            "phrase": "do someone good",
            "definition": "to benefit someone.  A nice hot bath really does me good.  A few years in the army would do you good."
        },
        {
            "id": 107,
            "phrase": "do someone or something up†",
            "definition": "to make someone or something attractive; to decorate or ornament someone or something. Sally did Jane up for the party. Would you do up this present for Jane? It’s her birthday."
        },
        {
            "id": 108,
            "phrase": "do someone out of something",
            "definition": "to swindle something away from someone; to defraud someone of a right or of property. Are you trying to do me out of what’s mine? _Max tried to do her out of everything she had.  I did myself out of a week’s vacation by quitting when I did."
        },
        {
            "id": 109,
            "phrase": "do someone proud",
            "definition": "to make someone proud.  Bill’s kids sure did him proud at the boat race.  Mary resolved she would do her friends proud."
        },
        {
            "id": 110,
            "phrase": "do someone’s bidding",
            "definition": "to do what is requested.  The servant grumbled but did his employer’s bidding.  Am I expected to do your bidding whenever you ask?"
        },
        {
            "id": 111,
            "phrase": "do someone’s heart good",
            "definition": "to make someone feel good emotionally.  It does my heart good to hear you two are back together. When she sent me a get-well card, it really did my heart good."
        },
        {
            "id": 112,
            "phrase": "do something about someone or something",
            "definition": "to manage or deal with someone or something.  Can you please do something about Bob? He is too noisy.  We were not able to do anything about the excessive rent increase."
        },
        {
            "id": 113,
            "phrase": "do something by hand",
            "definition": "to do something with one’s hands rather than with a machine.  The calculator was broken so I had to do the calculations by hand. All this tiny stitching was done by hand. Machines cannot do this kind of work."
        },
        {
            "id": 114,
            "phrase": "do something the hard way",
            "definition": "to accomplish something in the most difficult manner, rather than by an easier way.  I made it to this job the hard way. I came up through the ranks.  She did it the hard way. She had no help from her parents."
        },
        {
            "id": 115,
            "phrase": "do something to excess",
            "definition": "to do too much of something; to consume too much of something.  Anne often drinks to excess at parties.  John smokes to excess when he works."
        },
        {
            "id": 116,
            "phrase": "do something up†",
            "definition": "1. to fasten, zip, hook, or button some item of clothing.  Would you do my buttons up in back? _Please do up my buttons. 2. to wrap up something, such as a package, gift, etc.  I have to do this present up before the party guests get here. Do up the presents quickly. They are coming up the walk. 3. to arrange, fix, repair, cook, clean, etc., something. I have to do the kitchen up before the guests get here.  Do up the kitchen now, please."
        },
        {
            "id": 117,
            "phrase": "do something up brown",
            "definition": "to do something just right or with great effect. (Fixed order.) _Whenever they put on a party, they do it up brown.  He was determined to cause a scandal, and he really did it up brown."
        },
        {
            "id": 118,
            "phrase": "do something with a vengeance",
            "definition": "to do something with vigor; to do something energetically as if one were angry.  Bob is building that fence with a vengeance.  Mary is really weeding her garden with a vengeance."
        },
        {
            "id": 119,
            "phrase": "do something with someone or something",
            "definition": "to use someone or something in some way.  Can you do something with this bracket, or shall I throw it away? _ We can’t do anything with the new secretary. Find us another."
        },
        {
            "id": 120,
            "phrase": "Do tell.",
            "definition": "a response to one of a series of statements by another person. (The expression can indicate disinterest. Each word has equal stress. See also You don’t say.) _ Bill: The Amazon basin is about ten times the size of France. Mary: Do tell."
        },
        {
            "id": 121,
            "phrase": "do the dishes",
            "definition": "to wash the dishes; to wash and dry the dishes, knives, forks, glasses, etc., after a meal. Bill, you cannot go out and play until you’ve done the dishes. Why am I always the one who has to do the dishes?"
        },
        {
            "id": 122,
            "phrase": "do the honors",
            "definition": "to act as host or hostess and serve one’s guests by pouring drinks, slicing meat, making (drinking) toasts, etc.  All the guests were seated, and a huge juicy turkey sat on the table. Jane turned to her husband and said, “Bob, will you do the honors?” Bob smiled and began slicing thick slices of meat from the turkey. The mayor stood up and addressed the people who were still eating their salads. “I’m delighted to do the honors this evening and propose a toast to your friend and mine, Bill Jones. Bill, good luck and best wishes in your new job in Washington.”"
        },
        {
            "id": 123,
            "phrase": "do the trick",
            "definition": "to do exactly what is needed.  This new paint scraper really does the trick.  Is this envelope large enough to do the trick?"
        },
        {
            "id": 124,
            "phrase": "do time",
            "definition": "Sl. to serve a sentence in prison; to serve a specific amount of time in prison.  Lefty had done time on a number of occasions.  You’d better talk and talk fast if you don’t want to do time."
        },
        {
            "id": 125,
            "phrase": "Do we have to go through all that again?",
            "definition": "Do we have to discuss that matter again? (Compare this with Let’s not go through all that again.) _ Bill: Now, I still have more to say about what happened last night. Sally: Do we have to go through all that again? _Sally: I can’t get over the way you treated me at our own dinner table. Fred: I was irritated at something else. I said I was sorry. Do we have to go through all that again?"
        },
        {
            "id": 126,
            "phrase": "Do what?",
            "definition": "What did you say?; You want me to do what? _ Charlie: My mama’s coming to visit, so I want you to cook a fancy dinner. Mary: Do what? _A: Let’s perambulate. B: Do what? A: Let’s take a walk."
        },
        {
            "id": 127,
            "phrase": "do with someone or something",
            "definition": "to do as well as possible with someone or something; to make do with someone or something.  I will just have to do with the car I now have.  Can she do with just one chair for a while?"
        },
        {
            "id": 128,
            "phrase": "do without (someone or something)",
            "definition": "to manage or get along without someone or something that is needed or expected.  I guess I will have to do without dinner.  Yes, you’ll do without."
        },
        {
            "id": 129,
            "phrase": "Do you expect me to believe that?",
            "definition": "That is so unbelievable that you do not expect me to believe it, do you? (Said with impatience or strong doubt. Compare this with You can’t expect me to believe that.) _ Bill: I’m going to quit my job and open a restaurant. Mary: That’s silly. Do you expect me to believe that? _ Mary: Wow! I just got selected to be an astronaut! Sally: Do you expect me to believe that? Mary: Here’s the letter! Now do you believe me?"
        },
        {
            "id": 130,
            "phrase": "Do you follow?",
            "definition": "Do you understand what I am saying?; Do you understand my explanation? _ Mary: Keep to the right past the fork in the road, then turn right at the crossroads. Do you follow? Jane: No. Run it by me again."
        },
        {
            "id": 131,
            "phrase": "(Do you) get my drift?",
            "definition": "Do you understand what I mean?; Do you understand what I am getting at? _Father: I want you to settle down and start studying. Get my drift? Bob: Sure, Pop. Whatever you say.  Mary: Get out of my way and stop following me around. Do you get my drift? John: I guess so."
        },
        {
            "id": 132,
            "phrase": "(Do you) get the picture?",
            "definition": "Do you understand the situation?; Do you know what this means you have to do? _ Bill: I want to get this project wrapped up before midnight. Do you get the picture? Tom: I’m afraid I do. Bill: Well, then, get to work.  Fred: I want you to straighten up and get moving. Get the picture? Bill: I got it."
        },
        {
            "id": 133,
            "phrase": "(Do) you hear?",
            "definition": "Rur. Do you hear and understand what I said? _ John: I want you to clean up this room this instant! Do you hear? Sue: Okay. I’ll get right on it.  Bob: Come over here, Sue. I want to show you something, you hear? Sue: Sure. What is it?"
        },
        {
            "id": 134,
            "phrase": "Do you mind?",
            "definition": "1. You are intruding on my space!; You are offending me! (Impatient or incensed. Essentially, “Do you mind stopping what you are doing?”) _ The lady behind her in line kept pushing against her every time the line moved. Finally, Sue turned and said sternly, “Do you mind?” _ All through the first part of the movie, two people in the row behind John kept up a running conversation. Finally, John rose and turned, leaned over into their faces, and shouted, “Do you mind?” 2. Do you object to what I am about to do? _ Mary had her hand on the lovely silver cake knife that would carry the very last piece of cake to her plate. She looked at Tom, who stood next to her, eyeing the cake. “Do you mind?” she asked coyly.  “Do you mind?” asked John as he bumped Sally and ran through the door."
        },
        {
            "id": 135,
            "phrase": "(Do you) mind if...?",
            "definition": "a polite way of seeking someone’s permission or agreement.  Mary: Do you mind if I sit here? Jane: No, help yourself. Tom: Mind if I smoke? Bill: I certainly do. Tom: Then I’ll go outside."
        },
        {
            "id": 136,
            "phrase": "Do you read me?",
            "definition": "1. Fig. an expression used by someone communicating by radio, asking if the hearer understands the transmission clearly. Controller: This is Aurora Center, do you read me? Pilot: Yes, I read you loud and clear.  Controller: Left two degrees. Do you read me? Pilot: Roger, Sir, G’day. 2. Fig. Do you understand what I am telling you? (Said sternly, as when giving an instruction, and used in general conversation, not in radio communication.) _ Mary: I want you to pull yourself together and go out and get a job. Do you read me? Bill: Sure. Anything you say.  Mother: Get this place picked up immediately. Do you read me? Child: Yes, ma’am."
        },
        {
            "id": 137,
            "phrase": "(Do) you want to step outside?",
            "definition": "an expression inviting someone to go outdoors to settle an argument by fighting. John: Drop dead! Bob: All right, I’ve had enough out of you. You want to step outside? _ Bill: So you’re mad at me! What else is new? You’ve been building up to this for a long time. Bob: Do you want to step outside and settle this once and for all? Bill: Why not?"
        },
        {
            "id": 138,
            "phrase": "dock someone or something for something",
            "definition": "to subtract money from someone or someone’s account for payment of a debt or as punishment; to withhold money from someone’s pay in payment of a debt or for recompense.  I will have to dock you for any breakage you cause.  I was docked for being absent for half a day."
        },
        {
            "id": 139,
            "phrase": "dock (something) at some place",
            "definition": "to bring a boat or ship to a dock.  Let’s dock our boat at the left side of the pier.  We docked at the marina overnight."
        },
        {
            "id": 140,
            "phrase": "dock something from something",
            "definition": "to withhold money from an amount due to someone. I will have to dock this from your paycheck.  The boss docked ten dollars from my monthly pay."
        },
        {
            "id": 141,
            "phrase": "Doctor Livingstone, I presume?",
            "definition": "Jocular You are who I think you are, are you not? _ Oh, there you are. Doctor Livingstone, I presume?"
        },
        {
            "id": 142,
            "phrase": "doctor ’s orders",
            "definition": "something that one is strongly advised to do as ordered or as if ordered by a doctor.  I have to spend a month in Arizona. Doctor’s orders. I’m doing this on doctor’s orders, but I don’t like it."
        },
        {
            "id": 143,
            "phrase": "doctor someone up†",
            "definition": "to give someone medical treatment, especially first aid.  Give me a minute to doctor Fred up, and then we can continue our walk.  I’ll doctor up Fred with a bandage; you can go on ahead."
        },
        {
            "id": 144,
            "phrase": "dodder along",
            "definition": "to walk along unsteadily, as in old age.  Both of the elderly ladies doddered along very slowly. We dodder along because we can’t go any faster."
        },
        {
            "id": 145,
            "phrase": "dodge behind something",
            "definition": "to duck behind something; to move quickly and evasively behind something.  She dodged behind a tree to hide from Mark.  The turkey dodged behind a tree to elude the hunter."
        },
        {
            "id": 146,
            "phrase": "Does it work for you?",
            "definition": "Is this all right with you?; Do you agree? (Can be answered by (It) works for me.) _ Bill: I’ll be there at noon. Does it work for you? Bob: Works for me. Mary: We’re having dinner at eight. Does it work for you? Jane: Sounds just fine."
        },
        {
            "id": 147,
            "phrase": "doesn’t care who knows it",
            "definition": "doesn’t try to conceal something. (Also with don’t. Don’t used with all persons is folksy.) _ Jane dyes her hair, and she doesn’t care who knows it.  Yeah, my old man’s in jail. I don’t care who knows it!"
        },
        {
            "id": 148,
            "phrase": "doesn’t know beans (about something)",
            "definition": "does not know anything. (Also with don’t. Don’t used with all persons is folksy.) _ Bill doesn’t know beans about car engines.  Don’t ask your daddy for advice about child rearing. He doesn’t know beans."
        },
        {
            "id": 149,
            "phrase": "dog and pony show",
            "definition": "a display, demonstration, or exhibition of something—such as something one is selling. (As in a circus act where trained dogs leap onto and off of trained ponies.) _ Gary went into his standard dog and pony show, trying to sell us on an upgrade to our software.  Don’t you get tired of running through the same old dog and pony show at every trade show?"
        },
        {
            "id": 150,
            "phrase": "The dog ate my homework.",
            "definition": "a poor excuse for something that someone has failed to do on time. (From an excuse a student might give for failing to turn in homework on time. Occurs in many variations.) _ The dog ate my homework, so I have nothing to turn in.  (Used as an attributive.) Bob was late with his report and had nothing but his typical dog-ate-my-homework excuses."
        },
        {
            "id": 151,
            "phrase": "dog days",
            "definition": "the hottest days of summer, usually during July and August. (Named for Sirius, the ‘dog star.’) _Bill spent the dog days lying out in his hammock. I hate doing yard work in the dog days."
        },
        {
            "id": 152,
            "phrase": "Dog does not eat dog.",
            "definition": "Prov. One disreputable person will not harm other disreputable people.  Ellen: My lawyer did such a bad job that I want to hire another lawyer to sue him. Jane: You’ll never find a lawyer to take on that job. Dog does not eat dog."
        },
        {
            "id": 153,
            "phrase": "dog in the manger",
            "definition": "one who unreasonably prevents other people from doing or having what one does not wish them to do or have. (From one of Aesop’s fables in which a dog—which cannot eat hay—lay in the hayrack [manger] and prevented the other animals from eating the hay.) _ Jane is a real dog in the manger. She cannot drive, but she will not lend anyone her car.  If Martin were not such a dog in the manger, he would let his brother have that dinner jacket he never wears."
        },
        {
            "id": 154,
            "phrase": "Dog my cats!",
            "definition": "Rur.My goodness!; What do you know! (An exclamation of surprise.) _ Dog my cats! Somebody painted my house green! _ Well, dog my cats—it hasn’t rained once all month!"
        },
        {
            "id": 155,
            "phrase": "dog-eat-dog",
            "definition": "a situation in which one has to act ruthlessly in order to survive or succeed; ruthless competition.  It is dog-eat-dog in the world of business these days.  Universities are not quiet peaceful places. It’s dog-eat-dog to get a promotion."
        },
        {
            "id": 156,
            "phrase": "dog-faced liar",
            "definition": "Rur. a terrible liar. Suzy said Jimmy was a dog-faced liar.  If Joe says that, he’s a dog-faced liar."
        },
        {
            "id": 157,
            "phrase": "a doggy bag",
            "definition": "a bag or other container used to carry uneaten food home from a restaurant. (As if it is for the dog.) _I can’t eat all of this. Can I have a doggy bag, please?"
        },
        {
            "id": 158,
            "phrase": "dole something out† (to someone)",
            "definition": "to distribute something to someone.  The cook doled the oatmeal out to each camper who held out a bowl.  Please dole out the candy bars, one to a customer.  She doled it out fairly."
        },
        {
            "id": 159,
            "phrase": "doll someone up†",
            "definition": "to dress someone up in fancy clothes.  She dolled her children up for church each Sunday.  She dolls up all her kids once a week."
        },
        {
            "id": 160,
            "phrase": "dollar for dollar",
            "definition": "considering the amount of money involved; considering the cost or value. (Often seen in advertising.) _ Dollar for dollar, you cannot buy a better car.  Dollar for dollar, this laundry detergent washes cleaner and brighter than any other product on the market."
        },
        {
            "id": 161,
            "phrase": "done and gone",
            "definition": "Rur. gone. She’s not here. She’s done and gone.  Jed was done and gone before dawn."
        },
        {
            "id": 162,
            "phrase": "a done deal",
            "definition": "a completed deal; something that is settled.  It’s too late. It’s a done deal.  The sale of the property is a done deal. There is nothing that can be done now."
        },
        {
            "id": 163,
            "phrase": "done for",
            "definition": "finished; dead.  I’m afraid that animal hit by the car is done for.  The goldfish looked as if it was either done for or sunning its tummy."
        },
        {
            "id": 164,
            "phrase": "*done in",
            "definition": "exhausted. (*Typically: be ~; get ~.) _ I’m really done in! I think I’ll go to bed.  After all that lifting, Gerald was done in and breathing hard."
        },
        {
            "id": 165,
            "phrase": "done ’n’ did",
            "definition": "Rur. already did.  Tom: Guess I better take the garbage out. Bill: No need. I done ’n’ did it. Mary done ’n’ did the chores for you."
        },
        {
            "id": 166,
            "phrase": "done over",
            "definition": "Sl. beat; outscored. The other team was done over, and they showed it in their lackluster play."
        },
        {
            "id": 167,
            "phrase": "done to a T",
            "definition": "cooked just right. Yummy! This meat is done to a T.  I like it done to a T, not too done and not too raw."
        },
        {
            "id": 168,
            "phrase": "done to a turn",
            "definition": "1. well-cooked; nicely cooked.  The entire meal was done to a turn.  The turkey was done to a turn. 2. Inf. beaten. When Wilbur’s opponent was done to a turn, Wilbur was declared the winner."
        },
        {
            "id": 169,
            "phrase": "done told you",
            "definition": "Rur. have already told you something.  I done told you not to touch that pan, and you went and did it anyhow. Sally done told you to leave that dog alone."
        },
        {
            "id": 170,
            "phrase": "done with someone or something",
            "definition": "finished with someone or something. Mary is done with Bill. She has found another boyfriend.  I can’t wait until I’m done with school forever.  I agree. I’ll be glad when we are done with all these exams."
        },
        {
            "id": 171,
            "phrase": "don’t amount to a bucket of spit",
            "definition": "Rur. is not worth anything.  Joe’s a shiftless cuss. He don’t amount to a bucket of spit.  All your pretty promises don’t amount to a bucket of spit."
        },
        {
            "id": 172,
            "phrase": "Don’t ask.",
            "definition": "It is so bad, I do not wish to be reminded or talk about it, so do not ask about it. John: How was your class reunion? Alice: Oh, heavens! Don’t ask.  Tom: What was your calculus final exam like? Mary: Don’t ask."
        },
        {
            "id": 173,
            "phrase": "Don’t be gone (too) long.",
            "definition": "Good-bye. Hurry back here. Tom: I’ve got to go to the drugstore to get some medicine. Sue: Don’t be gone too long. Tom: I’ll be right back. “Don’t be gone long,” said Bill’s uncle. “It’s about time to eat.”"
        },
        {
            "id": 174,
            "phrase": "Don’t be too sure.",
            "definition": "I think you are wrong, so do not sound so certain.; You may be wrong. (Compare this with Don’t speak too soon.) _ Bill: I think I’ve finally saved up enough money to retire. John: Don’t be too sure. Inf lation can ruin your savings."
        },
        {
            "id": 175,
            "phrase": "Don’t bite off more than you can chew.",
            "definition": "Prov. Do not commit yourself to doing more than you can actually do.  I don’t think you ought to take dance lessons three times a week; you’re already working two jobs. Don’t bite off more than you can chew."
        },
        {
            "id": 176,
            "phrase": "Don’t bother.",
            "definition": "Please don’t do it. It is not necessary, and it is too much trouble.  Mary: Should I make some dinner for you? Bill: No, don’t bother; it’s late. Sue: Do you want me to save this spoonful of mashed potatoes? Jane: No, don’t bother. It isn’t worth it. Sue: I hate to waste it."
        },
        {
            "id": 177,
            "phrase": "Don’t bother me!",
            "definition": "Go away!; Leave me alone! _ Tom: Hey, Bill! Bill: Don’t bother me! I’m busy. Can’t you see? _ “Don’t bother me! Leave me alone!” the child shouted at the dog."
        },
        {
            "id": 178,
            "phrase": "Don’t breathe a word of this to anyone.",
            "definition": "This is a secret or secret gossip. Do not tell it to anyone. (Breathing a word is fig. for whispering.) _ Bill: Have you heard about Mary and her friends? Sally: No. Tell me! Tell me! Bill: Well, they all went secretly to Mexico for the weekend. Now, don’t breathe a word of this to anyone."
        },
        {
            "id": 179,
            "phrase": "Don’t call us, we’ll call you.",
            "definition": "Cliché a formulaic expression said to applicants who have just interviewed or auditioned for a job or part.  Thank you, Eddie Evans. Don’t call us, we’ll call you.  Stupendous, Gloria, just stupendous. What glamour and radiance! Don’t call us, we’ll call you."
        },
        {
            "id": 180,
            "phrase": "Don’t count your chickens before they are hatched.",
            "definition": "Prov. Cliché Do not act as though something has turned out favorably for you until it has really turned out that way.  Jill: When I get my raise, I’ll use the extra money to go on vacation. Jane: But you don’t know for sure that you’re going to get a raise. Don’t count your chickens before they are hatched."
        },
        {
            "id": 181,
            "phrase": "Don’t cry before you are hurt.",
            "definition": "Prov. Do not be upset about a bad thing that might happen; only be upset when something bad really does happen.  Fred: What am I going to do? There’s a possibility that my job will be eliminated! Jane: Don’t cry before you are hurt. They haven’t eliminated you yet."
        },
        {
            "id": 182,
            "phrase": "Don’t do anything I wouldn’t do.",
            "definition": "an expression said when two friends are parting.  Bill: See you next month, Tom. Tom: Yeah, man. Don’t do anything I wouldn’t do."
        },
        {
            "id": 183,
            "phrase": "Don’t even look like something!",
            "definition": "Do not even appear to be doing something! (The something can be thinking about something or actually doing something.) _ Mary: Are you thinking about taking that last piece of cake? Bob: Of course not. Mary: Well, don’t even look like you’re doing it! _John: You weren’t going to try to sneak into the theater, were you? Bob: No. John: Well, don’t even look like it, if you know what’s good for you."
        },
        {
            "id": 184,
            "phrase": "Don’t even think about (doing) it.",
            "definition": "Do not do it, and do not even think about doing it.  John reached into his jacket for his wallet. The cop, thinking John was about to draw a gun, said, “Don’t even think about it.”"
        },
        {
            "id": 185,
            "phrase": "Don’t even think about it (happening).",
            "definition": "Do not think about something like that happening, as the mere thought of it is so bad. (Compare this with Don’t even think about (doing) it.) _Mary: Oh, those cars almost crashed! How horrible! Fred: Don’t even think about it.  Sally: If the stock market crashes, we’ll lose everything we have. Sue: Don’t even think about it!"
        },
        {
            "id": 186,
            "phrase": "Don’t get your bowels in an uproar!",
            "definition": "Do not get so excited! _Bill: What have you done to my car? Where’s the bumper? The side window is cracked! Bob: Calm down! Don’t get your bowels in an uproar!"
        },
        {
            "id": 187,
            "phrase": "don’t give a continental",
            "definition": "Rur. does not care at all. (Also with doesn’t. Don’t used with all persons is folksy.) _ I don’t give a continental if I never see him again.  Mary’s kids can do whatever they want. She doesn’t give a continental."
        },
        {
            "id": 188,
            "phrase": "don’t give a hoot (in hell’s hollow)",
            "definition": "Rur. to not care one bit. (Also with doesn’t. Don’t used with all persons is folksy.) _Mary: Joe left town. Are you sorry to see him go? Tom: No! I don’t give a hoot in hell’s hollow. She’s a devilmay- care young woman, doesn’t give a hoot about anything."
        },
        {
            "id": 189,
            "phrase": "Don’t give me any of your lip!",
            "definition": "Don’t talk back! _ Do as I tell you and don’t give me any of your lip!"
        },
        {
            "id": 190,
            "phrase": "Don’t give up!",
            "definition": "Do not stop trying!; Keep trying! _ John: Get in there and give it another try. Don’t give up! Bill: Okay. Okay. But it’s hopeless.  Jane: I asked the boss for a raise, but he said no. Tom: Don’t give up. Try again later."
        },
        {
            "id": 191,
            "phrase": "Don’t give up the ship!",
            "definition": "Do not give up yet!; Do not yield the entire enterprise! (Fixed order. Alludes to the words on a flag made by Captain Oliver Hazard Perry in the Battle of Lake Erie during the War of 1812.) _ Bill: I’m having a devil of a time with calculus. I think I want to drop the course. Sally: Keep trying. Don’t give up the ship! _ Bill: Every time we get enough money saved up to make a down payment on a house, the price of houses skyrockets. I’m about ready to stop trying. Sue: We’ll manage. Don’t give up the ship!"
        },
        {
            "id": 192,
            "phrase": "Don’t give up without a fight!",
            "definition": "Do not yield easily.; Keep struggling and you may win.; Do not give up too soon. (Also with don’t. Don’t used with all persons is folksy.) _ Sue: She says no every time I ask her for a raise. Mary: Well, don’t give up without a fight. Keep after her."
        },
        {
            "id": 193,
            "phrase": "Don’t have a cow!",
            "definition": "Calm down!; Don’t get so excited! (Made famous in the television show, The Simpsons.) _ Chill out, man! Don’t have a cow! _ Aw, don’t have a cow, Dad!"
        },
        {
            "id": 194,
            "phrase": "don’t have a pot to piss in (or a window to throw it out of )",
            "definition": "doesn’t have anything of value; very poor. (Use with caution.) _When Ed was a young man, he didn’t have a pot to piss in.  Jane’s folks don’t have a pot to piss in or a window to throw it out of."
        },
        {
            "id": 195,
            "phrase": "Don’t hold your breath.",
            "definition": "Do not stop breathing waiting for something to happen that won’t happen. (Meaning that it will take longer for it to happen than you can possibly hold your breath.) _ Tom: The front yard is such a mess. Bob: Bill’s supposed to rake the leaves. Tom: Don’t hold your breath. He never does his share of the work.  Sally: Someone said that gasoline prices would go down. Bob: Oh, yeah? Don’t hold your breath."
        },
        {
            "id": 196,
            "phrase": "Don’t I know it!",
            "definition": "I know that very well! _ Mary: Goodness gracious! It’s hot today. Bob: Don’t I know it! _ Sue: You seem to be putting on a little weight. John: Don’t I know it!"
        },
        {
            "id": 197,
            "phrase": "Don’t I know you from somewhere?",
            "definition": "a way of striking up a conversation with a stranger, as at a party or other gathering. Bill: Don’t I know you from somewhere? Mary: I don’t think so. Where did you go to school? _Henry: Don’t I know you from somewhere? Alice: No, and let’s keep it that way."
        },
        {
            "id": 198,
            "phrase": "Don’t knock it.",
            "definition": "Don’t criticize it.  You don’t want any okra? Don’t knock it."
        },
        {
            "id": 199,
            "phrase": "don’t know whether to eat it or rub it on",
            "definition": "Rur. do not know what to do with something. (Used to describe a kind of food one does not recognize or that looks unusual.) (Also with doesn’t. Don’t used with all persons is folksy.) _ That sure was a fancy dessert Mary served. I didn’t know whether to eat it or rub it on.  What kind of sauce is this? I don’t know whether to eat it or rub it on!"
        },
        {
            "id": 200,
            "phrase": "Don’t let someone or something get you down.",
            "definition": "Do not allow yourself to be overcome or disappointed by someone or something. Don’t let their constant teasing get you down.  Don’t let Tom get you down. He’s not always unpleasant."
        },
        {
            "id": 201,
            "phrase": "Don’t let the bastards wear you down.",
            "definition": "Don’t let those people get the best of you. (Exercise caution with bastard.) _ Bill: The place I work at is really rough. Everybody is rude and jealous of each other. Tom: Don’t let the bastards wear you down.  Jane: I have to go down to the county clerk’s office and figure out what this silly bureaucratic letter means. Sue: You might call them on the phone. In any case, don’t let the bastards wear you down."
        },
        {
            "id": 202,
            "phrase": "Don’t look a gift horse in the mouth.",
            "definition": "Prov. Do not look for defects in a gift.  Jill: I wonder why Grandma gave me this table. Maybe it has one leg shorter than the others. Jane: Don’t look a gift horse in the mouth. Mike: This letter says I just won a trip to Hawaii. I bet there’s some kind of catch. Keith: Don’t look a gift horse in the mouth."
        },
        {
            "id": 203,
            "phrase": "Don’t make me laugh!",
            "definition": "That is a stupid suggestion! _ You a judge? Don’t make me laugh! _Don’t make me laugh. Tom could never do that."
        },
        {
            "id": 204,
            "phrase": "Don’t make two bites of a cherry.",
            "definition": "Prov. Do not leave a simple job half-done. Tom: I washed the dishes and left them in the rack. I’ll put them away tomorrow. Mary: Oh, come on. Don’t make two bites of a cherry."
        },
        {
            "id": 205,
            "phrase": "Don’t mention it.",
            "definition": "You are welcome and your thanks are not necessary.  A: Thank you so much! B: Don’t mention it."
        },
        {
            "id": 206,
            "phrase": "Don’t mind me.",
            "definition": "Don’t pay any attention to me.; Just ignore me. (Sometimes sarcastic.) _ Bill and Jane were watching television when Jane’s mother walked through the room, grabbing the newspaper on the way. “Don’t mind me,” she said."
        },
        {
            "id": 207,
            "phrase": "Don’t push (me)!",
            "definition": "I can move on my own, so don’t shove me! _ I can’t move any faster than this. Don’t push me!"
        },
        {
            "id": 208,
            "phrase": "Don’t put all your eggs in one basket.",
            "definition": "Prov. Do not risk everything on one undertaking.  Keep your day job while you pursue your acting career at night, just in case the acting doesn’t go so well. You know—don’t put all your eggs in one basket."
        },
        {
            "id": 209,
            "phrase": "Don’t put off for tomorrow what you can do today.",
            "definition": "Prov. Do not procrastinate. Father: Take out the garbage. Child: I’ll do it in the morning. Father: It only takes a minute. Don’t put off for tomorrow what you can do today."
        },
        {
            "id": 210,
            "phrase": "Don’t put the cart before the horse.",
            "definition": "Prov. Do not do things in the wrong order. (This can imply that the person you are addressing is impatient.) _ Tune the guitar first, then play it. Don’t put the cart before the horse."
        },
        {
            "id": 211,
            "phrase": "Don’t rush me!",
            "definition": "Don’t try to hurry me! _ Bill: Hurry up! Make up your mind! Bob: Don’t rush me! Bill: I want to get out of here before midnight. Bill: The waiter wants to take your order. What do you want? Jane: Don’t rush me! I can’t make up my mind. Waiter: I’ll come back in a minute."
        },
        {
            "id": 212,
            "phrase": "Don’t say it!",
            "definition": "I don’t want to hear it!; I know, so you don’t have to say it.  John (joking): What is that huge pile of stuff on your head? Bill: Don’t say it! I know I need a haircut."
        },
        {
            "id": 213,
            "phrase": "Don’t speak too soon.",
            "definition": "I think you may be wrong. Don’t speak before you know the facts. (Compare this with Don’t be too sure.) _ Bill: It looks like it’ll be a nice day. Mary: Don’t speak too soon. I just felt a raindrop.  Tom: It looks like we made it home without any problems. Bill: Don’t speak too soon, there’s a cop behind us in the driveway."
        },
        {
            "id": 214,
            "phrase": "Don’t spend it all in one place.",
            "definition": "Prov. a phrase said after giving someone some money, especially a small amount of money. Fred: Dad, can I have a dollar? Father: Sure. Here. Don’t spend it all in one place. “Here’s a quarter, kid,” said Tom, f lipping Fred a quarter. “Don’t spend it all in one place.”"
        },
        {
            "id": 215,
            "phrase": "Don’t stand on ceremony.",
            "definition": "Do not wait for a formal invitation.; Please be at ease and make yourself at home. (Some people read this as “Don’t remain standing because of ceremony,” and others read it “Don’t be totally obedient to the requirements of ceremony.”) _ Come in, Tom. Don’t stand on ceremony. Get yourself a drink and something to eat and introduce yourself to everyone.”"
        },
        {
            "id": 216,
            "phrase": "Don’t start (on me)!",
            "definition": "Do not complain! _Yes, I know it’s a mess. Don’t start! _ Don’t start on me, I’m sorting it out."
        },
        {
            "id": 217,
            "phrase": "Don’t stay away so long.",
            "definition": "Rur. Please visit more often. (Said upon the arrival or departure of a guest.) _ John: Hi, Bill! Long time no see. Don’t stay away so long! Bill: Thanks, John. Good to see you.  Mary: I had a nice time. Thanks for inviting me. Sally: Good to see you, Mary. Next time, don’t stay away so long."
        },
        {
            "id": 218,
            "phrase": "Don’t sweat it!",
            "definition": "Inf. Don’t worry about it! _ No problem. Don’t sweat it! _ Don’t sweat it! We’ll take care of it."
        },
        {
            "id": 219,
            "phrase": "Don’t take any wooden nickels.",
            "definition": "Prov. Be careful and do not let anyone cheat you. (Often used as a jocular way of saying good-bye.) _ Tom: So long. Bill: Don’t take any wooden nickels.  Good luck in college. Don’t take any wooden nickels."
        },
        {
            "id": 220,
            "phrase": "Don’t teach your grandmother to suck eggs.",
            "definition": "Prov. Do not try to instruct someone who is more experienced than you. (Extremely casual; potentially rude.) _Bob told the seasoned guitar player that she was holding the guitar incorrectly. “Don’t teach your grandmother to suck eggs,” she replied."
        },
        {
            "id": 221,
            "phrase": "Don’t tell a soul.",
            "definition": "Please do not tell anyone this gossip.  Bill: Is your brother getting married? Sally: Yes, but don’t tell a soul. It’s a secret. Mary: Can you keep a secret? John: Sure. Mary: Don’t tell a soul, but Tom is in jail."
        },
        {
            "id": 222,
            "phrase": "Don’t tell me what to do!",
            "definition": "Do not give me orders.  Sue: Next, you should get a haircut, then get some new clothes. You really need to fix yourself up. Sally: Don’t tell me what to do! Maybe I like me the way I am!"
        },
        {
            "id": 223,
            "phrase": "Don’t throw the baby out with the bathwater.",
            "definition": "Prov. Do not discard something valuable in your eagerness to get rid of some useless thing associated with it.  Jill: As long as I’m selling all the books Grandpa had, I might as well sell the bookcases, too. Jane: Don’t throw the baby out with the bathwater. You can use the bookcases for something else."
        },
        {
            "id": 224,
            "phrase": "Don’t touch that dial!",
            "definition": "Do not change your radio or television dial, but continue to listen to this station. (From broadcasts in the days when tuning was done with a dial.) _Don’t touch that dial. Stay tuned for The Adventures of Blondie."
        },
        {
            "id": 225,
            "phrase": "Don’t waste my time.",
            "definition": "Do not take up my valuable time with a poor presentation.; Do not waste my time trying to get me to do something. Bob: I’d like to show you our new line of industrial-strength vacuum cleaners. Bill: Beat it! Don’t waste my time. “Don’t waste my time!” said the manager when Jane made her fourth appeal for a raise."
        },
        {
            "id": 226,
            "phrase": "Don’t waste your breath.",
            "definition": "You will not get a positive response to what you have to say, so don’t even say it.; Talking will get you nowhere.  Alice: I’ll go in there and try to convince her otherwise. Fred: Don’t waste your breath. I already tried it.  Sally: No, I won’t agree! Don’t waste your breath. Bill: Aw, come on. At least hear me out."
        },
        {
            "id": 227,
            "phrase": "Don’t waste your time.",
            "definition": "You will not get anywhere with it, so don’t waste time trying.  Mary: Should I ask Tom if he wants to go to the convention, or is he still in a bad mood? Sally: Don’t waste your time. Mary: Bad mood, huh? _ Jane: I’m having trouble fixing this doorknob. Mary: Don’t waste your time. I’ve ordered a new one."
        },
        {
            "id": 228,
            "phrase": "Don’t work too hard.",
            "definition": "an expression said at the end of a conversation after or in place of good-bye.  Mary: Bye, Tom. Tom: Bye, Mary. Don’t work too hard."
        },
        {
            "id": 229,
            "phrase": "Don’t worry (about a thing).",
            "definition": "Do not become anxious about something.; Everything will be all right.  “Don’t worry, Fred,” comforted Bill, “everything will be all right.” _Bill: I think I left the car windows open. Sue: Don’t worry, I closed them.  “Don’t worry about a thing,” the tax collector had said. “We’ll take care of everything.” Or was it “We’ll take everything?”"
        },
        {
            "id": 230,
            "phrase": "Don’t worry your (pretty little) head about it.",
            "definition": "Rur. Do not worry about it. (Said condescendingly, and can cause offense.) _ Mary: How are you going to get another job if you don’t start looking for one? Tom: Now don’t worry your pretty little head about it. Just leave it to me.  Tom: What are we going to do if we can’t find an apartment? Sally: Don’t worry your head about it. We’ll find one, one way or another."
        },
        {
            "id": 231,
            "phrase": "Don’t you know it!",
            "definition": "You can be absolutely sure about that!; You’re exactly right, and I agree with you. (This is not a question.) _ Alice: Man, is it hot! Fred: Don’t you know it! _ Bob: This is the best cake I have ever eaten. The cook is the best in the world! Bill: Don’t you know it!"
        },
        {
            "id": 232,
            "phrase": "Don’t you wish!",
            "definition": "Don’t you wish that what you have just said were really true? _ Mary: I’m going to get a job that lets me travel a lot. Sally: Don’t you wish! _Sally: Sorry you lost the chess game. It was close, but your opponent was topnotch. Bob: Next time, I’ll do it! I’ll win the next round. Sally: Don’t you wish!"
        },
        {
            "id": 233,
            "phrase": "doom someone or something to something",
            "definition": "to destine someone or something to something unpleasant.  The judgment doomed her to a life in prison.  Your insistence on including that rigid clause doomed the contract to failure."
        },
        {
            "id": 234,
            "phrase": "doomed to something",
            "definition": "condemned to something; facing something as a future or as a consequence [of something]. The project was doomed to failure from the start. I am doomed to a life of hard work and low pay."
        },
        {
            "id": 235,
            "phrase": "A door must be either shut or open.",
            "definition": "Prov. If you have only two alternatives, you must choose one or the other; you cannot have both.  Either you’re going to marry that girl, or you’re not. A door must be either shut or open."
        },
        {
            "id": 236,
            "phrase": "doors open up (to someone)",
            "definition": "opportunities become available to someone.  After Ann made a few inquiries, doors began to open up to me.  An agent helps. After I got one, all sorts of doors opened up."
        },
        {
            "id": 237,
            "phrase": "door-to-door",
            "definition": "having to do with movement from one door to another or from one house to another. John is a door-to-door salesman.  We spent two weeks making a door-to-door survey."
        },
        {
            "id": 238,
            "phrase": "dope someone or an animal up†",
            "definition": "to give drugs to someone or an animal.  Her parents doped her up with medicine so she would sleep through the night.  It’s dangerous to dope up a child night after night.  The trainer got caught doping the horse up."
        },
        {
            "id": 239,
            "phrase": "dope something out†",
            "definition": "1. Sl. to figure something out.  He spent a lot of time trying to dope the assignment out so he could understand it. It’s hard to dope out a physics assignment after midnight. 2. Sl. to explain something carefully.  He doped it all out to them very carefully so that no one would be confused.  He doped out the information slowly and patiently."
        },
        {
            "id": 240,
            "phrase": "dork off",
            "definition": "Sl. to waste time; to goof off.  Stop dorking off and get busy.  The whole class was dorking off and the teacher got furious."
        },
        {
            "id": 241,
            "phrase": "dose someone or an animal with something",
            "definition": "to give medicine to someone or an animal. You should dose the child with a little nonaspirin painkiller.  She dosed the horse with a mild tranquilizer."
        },
        {
            "id": 242,
            "phrase": "doss down (for some time)",
            "definition": "Sl. to lie down to sleep for a period of time. Chuck dossed down for a few hours before the evening performance.  It’s midnight: time to doss down."
        },
        {
            "id": 243,
            "phrase": "dot something with something",
            "definition": "to put little bits or dots of something on something.  She dotted her face with red marks to make it look as if she had measles. The chef dotted the cake with blobs of buttery icing."
        },
        {
            "id": 244,
            "phrase": "dote (up)on someone or something",
            "definition": "to adore or spoil someone or something; to like very much. (Upon is formal and less commonly used than on.) _ His aunt simply dotes upon him.  Mary dotes on vanilla ice cream."
        },
        {
            "id": 245,
            "phrase": "double as someone or something",
            "definition": "[for someone] to serve in two capacities. The chairman will have to double as CEO until we find a new one. This table doubles as a desk during busy times."
        },
        {
            "id": 246,
            "phrase": "double back (on someone or something)",
            "definition": "[for a person or animal] to reverse motion, moving toward (rather than away from) someone or something. (Refers primarily to a person or animal that is being pursued by someone or a group.) _The deer doubled back on the hunter. The robber doubled back on the police, and they lost track of him.  I doubled back on my own trail."
        },
        {
            "id": 247,
            "phrase": "double Dutch",
            "definition": "1. language or speech that is difficult or impossible to understand.  This book on English grammar is written in double Dutch. I can’t understand a word.  Try to find a lecturer who speaks slowly, not one who speaks double Dutch. 2. a game of jumping rope using two ropes swung simultaneously in opposite directions. The girls were playing double Dutch in the schoolyard."
        },
        {
            "id": 248,
            "phrase": "double in brass (as something)",
            "definition": "to serve in two capacities. (Alludes to a musician who could play the brass instruments as well as other instruments.) _ Wally was our bookkeeper and doubled in brass as a clerk."
        },
        {
            "id": 249,
            "phrase": "double over",
            "definition": "[for a person] to bend at the waist.  Suddenly, he doubled over and collapsed.  The people in the audience doubled over with laughter."
        }
    ]
}