{
    "dictionary": [
        {
            "id": 0,
            "phrase": "*day one",
            "definition": "the very beginning; the very first day. (*Typically: from ~; since ~.) _ You haven’t done anything right since day one! You’re fired! _ She was unhappy with her new car from day one."
        },
        {
            "id": 1,
            "phrase": "a day person",
            "definition": "a person who prefers to be active during the daytime. (Compare this with a night person.) _I am strictly a day person. Have to be in bed early."
        },
        {
            "id": 2,
            "phrase": "daydream about someone or something",
            "definition": "to have daytime fantasies about someone or something.  Poor Alice is always daydreaming about Albert.  John is daydreaming about running away to Tahiti."
        },
        {
            "id": 3,
            "phrase": "daylight robbery",
            "definition": "the practice of blatantly or grossly overcharging. It’s daylight robbery to charge that amount of money for a hotel room! _ The cost of renting a car at that place is daylight robbery."
        },
        {
            "id": 4,
            "phrase": "day-tripper",
            "definition": "a tourist who makes excursions lasting just one day.  At about 4:00 p.m. the day-trippers start thinning out.  Being a day-tripper is hard on your feet sometimes."
        },
        {
            "id": 5,
            "phrase": "dead ahead",
            "definition": "straight ahead; directly ahead.  Look out! There is a cow in the road dead ahead.  The farmer said that the town we were looking for was dead ahead."
        },
        {
            "id": 6,
            "phrase": "dead and buried",
            "definition": "dead and interred, and soon to be forgotten.  Now that Uncle Bill is dead and buried, we can read his will."
        },
        {
            "id": 7,
            "phrase": "dead and gone",
            "definition": "[of a person] long dead.  Old Gert’s been dead and gone for quite a spell.  When I’m dead and gone, I hope folks remember me at my best."
        },
        {
            "id": 8,
            "phrase": "dead broke",
            "definition": "completely broke; without any money. I’m dead broke—not a nickel to my name.  I’ve been dead broke for a month now."
        },
        {
            "id": 9,
            "phrase": "a dead cat on the line",
            "definition": "Rur. [for something to be] wrong.  I’m afraid there’s a dead cat on the line over at Martha’s place. I haven’t heard from them for days. Bill has a kind of sixth sense. He can tell a dead cat on the line before anybody knows there’s something wrong."
        },
        {
            "id": 10,
            "phrase": "dead center",
            "definition": "at the exact center of something.  The arrow hit the target dead center.  When you put the f lowers on the table, put them dead center."
        },
        {
            "id": 11,
            "phrase": "dead certain",
            "definition": "very sure. (Dead means absolutely.) _ I’m dead certain that horse will win. I bet two hundred on it myself.  I didn’t believe the rumor at first, but Bill’s dead certain that it’s true."
        },
        {
            "id": 12,
            "phrase": "dead drunk",
            "definition": "very intoxicated; totally inebriated.  They were both dead drunk. They could only lie there and snore.  Marty stumbled off the bar stood dead drunk."
        },
        {
            "id": 13,
            "phrase": "a dead duck",
            "definition": "someone or something that is certain to die or fail.  If I fail that test, I’m a dead duck.  When the outlaw drew his pistol, the sheriff knew he was a dead duck."
        },
        {
            "id": 14,
            "phrase": "dead easy",
            "definition": "very easy.  This whole job is dead easy.  It was so dead easy, Frank did it with one hand."
        },
        {
            "id": 15,
            "phrase": "dead from the neck up",
            "definition": "1. Fig. stupid. (With a “dead” head.) _ She acts like she is dead from the neck up. 2. Fig. no longer open to new ideas.  Everyone on the board of directors is dead from the neck up."
        },
        {
            "id": 16,
            "phrase": "a dead giveaway",
            "definition": "something that reveals a fact or an intention completely. The car in the driveway was a dead giveaway that someone was at home."
        },
        {
            "id": 17,
            "phrase": "dead in someone’s or an animal’s tracks",
            "definition": "exactly where someone or something is at the moment; at this instant. (This does not usually have anything to do with death. The phrase is often used with stop.) _ Her unkind words stopped me dead in my tracks.  When I heard the rattlesnake, I stopped dead in my tracks."
        },
        {
            "id": 18,
            "phrase": "dead in the water",
            "definition": "stalled; immobile. (Originally nautical.) _ This whole company is dead in the water.  The project is out of funds and dead in the water for the time being."
        },
        {
            "id": 19,
            "phrase": "dead letter",
            "definition": "1. a piece of mail that is returned to the post office as both undeliverable and unreturnable.  At the end of the year, the post office usually has bushels of dead letters.  Some of the dead letters are opened to see if there is an address inside. 2. an issue, law, or matter that is no longer important or that no longer has force or power.  His point about the need for education reform is a dead letter. It is being done now.  This point of law is a dead letter since the last Supreme Court ruling on this matter."
        },
        {
            "id": 20,
            "phrase": "a dead loss",
            "definition": "a total loss.  My investment was a dead loss.  This car is a dead loss after the accident."
        },
        {
            "id": 21,
            "phrase": "dead meat",
            "definition": "dead; as good as dead. (Usually an exaggeration.) _ If you don’t do exactly as I say, you are dead meat!"
        },
        {
            "id": 22,
            "phrase": "Dead men tell no tales.",
            "definition": "Prov. Dead people will not betray any secrets.  The club members liked to hold their secret meetings in a graveyard, since dead men tell no tales. Gangster: Mugsy is going to tell the police that we robbed the bank. How can we stop him? Henchman: Dead men tell no tales."
        },
        {
            "id": 23,
            "phrase": "dead on",
            "definition": "exactly right; on target.  That’s a good observation, Tiffany. You are dead on.  Your criticism is dead on!"
        },
        {
            "id": 24,
            "phrase": "*a (dead) ringer (for someone)",
            "definition": "very closely similar in appearance to someone else. (*Typically: be ~; look like ~.) _ You are sure a dead ringer for my brother.  Isn’t he a ringer for Chuck?"
        },
        {
            "id": 25,
            "phrase": "dead serious",
            "definition": "absolutely serious; not joking. Tom: You’re funning me. Bill: No, I’m dead serious. Mary has threatened divorce a hundred times, but this time she says she’s dead serious."
        },
        {
            "id": 26,
            "phrase": "dead set against someone or something",
            "definition": "totally opposed to someone or something.  I’m dead set against the new tax proposal.  Everyone is dead set against the mayor."
        },
        {
            "id": 27,
            "phrase": "dead to the world",
            "definition": "1. sound asleep. After all that exercise, he’s dead to the world.  He’s dead to the world, and I can’t rouse him. 2. intoxicated.  Six beers and he was dead to the world.  By midnight almost everybody at the party was dead to the world."
        },
        {
            "id": 28,
            "phrase": "dead wrong",
            "definition": "completely wrong.  I’m sorry. I was dead wrong. I didn’t have the facts straight."
        },
        {
            "id": 29,
            "phrase": "deaden something with something",
            "definition": "to dull or anesthetize pain with something. The doctor deadened the area with an injection before she began to stitch.  I will deaden the pain with a local anesthetic."
        },
        {
            "id": 30,
            "phrase": "deadly dull",
            "definition": "very dull.  The lecture was deadly dull, and I went to sleep.  Her story was really deadly dull. I am sorry I was awake for part of it."
        },
        {
            "id": 31,
            "phrase": "deaf and dumb",
            "definition": "unable to hear or speak. (Used without any intended malice, but no longer considered polite. Sometimes euphemized as “hearing and speech impaired.”) _ Fred objected to being called deaf and dumb.  Aunt Clara—she was deaf and dumb, you know—lived to be over 100."
        },
        {
            "id": 32,
            "phrase": "*deaf as a post",
            "definition": "deaf. (*Also: as ~.) _ When my cousin was a teenager, she played her drum set without ear protection, and she was as deaf as a post by the age of twentyfive.  Mark can’t hear you even if you shout; he’s deaf as a post."
        },
        {
            "id": 33,
            "phrase": "deal in something",
            "definition": "to buy and sell something.  My uncle is a stockbroker. He deals in stocks and bonds.  My aunt deals in antiques."
        },
        {
            "id": 34,
            "phrase": "deal something out†",
            "definition": "to pass something out piece by piece, giving everyone equal shares.  The manager dealt the proposals out, giving each person an equal number to read.  I’ll deal out some more proposals."
        },
        {
            "id": 35,
            "phrase": "deal with someone",
            "definition": "Sl. to kill someone.  “Spike, you deal with that cop,” said the crime boss.  The agent planned how best to deal with the rebel leader without getting caught."
        },
        {
            "id": 36,
            "phrase": "deal with someone or something",
            "definition": "to manage someone or something.  This is not a big problem. I think I can deal with it.  I am sure I can deal with Jill."
        },
        {
            "id": 37,
            "phrase": "dear departed",
            "definition": "Euph. a dead person, as referred to at a funeral. Let’s take a moment to meditate on the life of the dear departed. dedicate a Dear John letter a letter a woman writes to her boyfriend telling him that she does not love him anymore.  Bert got a Dear John letter today from Sally. He was devastated."
        },
        {
            "id": 38,
            "phrase": "Dear me!",
            "definition": "an expression of mild dismay or regret.  Sue: Dear me, is this all there is? Mary: There’s more in the kitchen.  “Oh, dear me!” fretted John, “I’m late again.”"
        },
        {
            "id": 39,
            "phrase": "Death is the great leveler.",
            "definition": "Prov. Death makes everyone equal, because it does not spare anyone, not even the wealthy, famous, or talented. (Also the cliché: the great leveler, death.) _ The wealthy tycoon lived as though he were exempt from every law, but death is the great leveler and came to him the same as to everyone else.  We hoped that the brilliant pianist would entertain us with her music for many decades, but death, the great leveler, did not spare her."
        },
        {
            "id": 40,
            "phrase": "death on something",
            "definition": "1. Fig. very harmful; very effective in acting against someone or something.  This road is terribly bumpy. It’s death on tires.  The sergeant is death on lazy soldiers. 2. Fig. accurate or deadly at doing something requiring skill or great effort.  John is death on curve balls. He’s our best pitcher.  The boxing champ is really death on those fast punches."
        },
        {
            "id": 41,
            "phrase": "debate on something",
            "definition": "to hold a long and disciplined discussion on a particular subject.  We can debate on this all night if you think we will settle anything in the end.  Are they still debating on the question?"
        },
        {
            "id": 42,
            "phrase": "debate (with someone) about something",
            "definition": "1. to enter into a long and disciplined discussion on a particular subject with someone.  Our team debated with the other team about the chances for world peace. The candidates debate about taxes tomorrow.  We will debate with them about health care. 2. Fig. to argue with someone about something. I do not intend to debate with you about that matter.  Tom did not agree to debate about it."
        },
        {
            "id": 43,
            "phrase": "debit something against someone or something",
            "definition": "to record a charge for something against someone’s account or against a particular category of an account.  I will have to debit this against your account.  The clerk debited the charge against you."
        },
        {
            "id": 44,
            "phrase": "debit something to someone or something",
            "definition": "to make a charge for something to someone or something.  To whose account can we debit this charge? _ Let’s debit it to Jane."
        },
        {
            "id": 45,
            "phrase": "debit something with something",
            "definition": "to charge something for something.  They debited Fred’s account with the whole expense. The bank debited my checking account with the cost of the new checks."
        },
        {
            "id": 46,
            "phrase": "deceive someone into something",
            "definition": "to trick someone into doing something. She deceived me into giving her my car keys.  You can’t deceive me into doing what I don’t want to do."
        },
        {
            "id": 47,
            "phrase": "deceive someone with something",
            "definition": "to cheat someone with something or with deceptive words. You cannot deceive me with your promises.  You are just deceiving yourself with fancy talk."
        },
        {
            "id": 48,
            "phrase": "decide against someone or something",
            "definition": "to rule against someone or something; to make a judgment against someone or something. We decided against Tom and chose Larry instead.  Jane decided against the supplier."
        },
        {
            "id": 49,
            "phrase": "decide for someone or something",
            "definition": "to rule in favor of someone or something; to make a judgment for someone or something.  The jury decided for the plaintiff.  The judge decided for me."
        },
        {
            "id": 50,
            "phrase": "decide in favor of someone or something",
            "definition": "to determine that someone or something is the winner. The judge decided in favor of the defendant.  I decided in favor of the red one."
        },
        {
            "id": 51,
            "phrase": "decide (up)on someone or something",
            "definition": "to choose someone or something; to make a judgment about some aspect of someone or something. (Upon is formal and less commonly used than on.) _ Will you please hurry up and decide upon someone to vote for? _ I decided on chocolate."
        },
        {
            "id": 52,
            "phrase": "declare (oneself) against someone or something",
            "definition": "to state one’s opposition to someone or something publicly.  I must declare myself against the amendment.  The politician declared himself against whatever the voters were already against."
        },
        {
            "id": 53,
            "phrase": "declare (oneself) for someone or something",
            "definition": "to state one’s support of someone or something.  Susan declared herself for Mary’s candidacy.  I have not yet declared for any particular policy.  Todd declared himself for the candidacy of Mary Brown for mayor."
        },
        {
            "id": 54,
            "phrase": "decorate someone for something",
            "definition": "to award someone a medal or ribbon for doing something important or brave. The town decorated her for her heroic act. She was decorated for her heroism."
        },
        {
            "id": 55,
            "phrase": "decorate something with something",
            "definition": "to adorn or ornament something with something. I will decorate the cake with roses made of sugar. Can I decorate your car with streamers for the parade?"
        },
        {
            "id": 56,
            "phrase": "dedicate someone or something to someone or something",
            "definition": "1. to reserve someone or something for the use of someone or something. The manager dedicated new assistants to the exclusive use of the legal department.  The committee dedicated a corner in the library to books on agri- culture. 2. to pledge someone or something to someone, something, a deity, or religious purposes.  The elders dedicated the building to the glory of God.  He dedicated himself to the prosecution of justice."
        },
        {
            "id": 57,
            "phrase": "deduce something from something",
            "definition": "to infer or conclude something from a set of facts. Can I deduce a bit of anger from your remarks? _ I deduce nothing from everything I have heard today."
        },
        {
            "id": 58,
            "phrase": "deduct something from something else",
            "definition": "to subtract an amount from another amount.  Are you going to deduct this from your income taxes? _ Mr. Wilson deducted the discount from the bill."
        },
        {
            "id": 59,
            "phrase": "deed something (over) to someone",
            "definition": "to grant something, such as land, to someone; to transfer legal title to something to someone.  Grudgingly, he deeded the land over to Walter.  He deeded the property to his niece."
        },
        {
            "id": 60,
            "phrase": "deep-six someone or something",
            "definition": "Sl. to get rid of someone or something; to dispose of someone or something. (Refers originally to burying someone or something six feet deep, the standard depth of a grave.) _ Take this horrible food out and deep-six it.  That guy is a pain. Deep-six him so the cops will never find him."
        },
        {
            "id": 61,
            "phrase": "deface something with something",
            "definition": "to mutilate or spoil the appearance of something with something.  Someone defaced the wall with spray paint. Please don’t deface the facilities."
        },
        {
            "id": 62,
            "phrase": "default on something",
            "definition": "to fail to act in some way regarding something, such as failing to make a payment, thereby losing one’s right to the thing in question. You are not going to default on your loan, are you? _ She defaulted on her mortgage payments and lost the house."
        },
        {
            "id": 63,
            "phrase": "defect from something",
            "definition": "to run away from something; to forsake something.  Thousands of soldiers defected from the army.  Roger would never think of defecting from the armed services."
        },
        {
            "id": 64,
            "phrase": "defect to something",
            "definition": "to forsake one group and take up with another.  Will he defect to the other side? _ David defected to a small East European country."
        },
        {
            "id": 65,
            "phrase": "defend someone or something against someone or something",
            "definition": "1. to stand against an attack; to provide a defense against attack. Don’t worry, I will defend you against any muggers. We defended ourselves against the attack. The army defended the town against the enemy soldiers. 2. to advocate the cause of someone or something against someone or something else.  The lawyer defended her against the plaintiff.  She defended the company against the suit."
        },
        {
            "id": 66,
            "phrase": "defend someone with something",
            "definition": "to repel danger from someone with something.  Here, defend yourself with this club.  Mary defended herself with karate."
        },
        {
            "id": 67,
            "phrase": "defer to someone or something (on something)",
            "definition": "to yield to someone or something on some question or point. I will defer to Mary on that question.  She would not defer to the committee on anything."
        },
        {
            "id": 68,
            "phrase": "define something as something",
            "definition": "to label something as being something.  I define that kind of behavior as just plain rude! _ We have to define that comment as careless and unthinking."
        },
        {
            "id": 69,
            "phrase": "deflect something away from someone or something",
            "definition": "to divert someone or something away from someone or something; to cause someone or something to veer away from someone or something.  The press secretary def lected the reporter’s questions from the candidate. The emergency def lected the boss’s attention away from my mistake."
        },
        {
            "id": 70,
            "phrase": "defraud someone out of something",
            "definition": "to cheat someone out of something.  The crooked contractor defrauded the town out of a fortune.  The clerk defrauded the employer out of a great deal of money."
        },
        {
            "id": 71,
            "phrase": "degenerate into something",
            "definition": "to decay into something; to break down into something.  The peace rally degenerated into a riot. I was afraid that the party would degenerate into a drinking contest."
        },
        {
            "id": 72,
            "phrase": "deign to do something",
            "definition": "to lower oneself to do something. She will never deign to join in with us. I expect that he will not deign to have dinner with us."
        },
        {
            "id": 73,
            "phrase": "delegate someone to something",
            "definition": "to appoint someone to something; to appoint someone to be something. I will delegate Jane to be our representative.  Donna was delegated to attend the conference."
        },
        {
            "id": 74,
            "phrase": "delegate something to someone",
            "definition": "to assign a task to someone; to appoint someone to do a specific task. I will have to delegate this job to Sam, who knows how to do these things.  The job was delegated to Sally."
        },
        {
            "id": 75,
            "phrase": "delete something from something",
            "definition": "to remove something from something; to cross something out from something.  Will you please delete this paragraph from the contract? _ The line was deleted from the sales agreement."
        },
        {
            "id": 76,
            "phrase": "deliberate over someone or something",
            "definition": "to discuss and argue about someone or something.  We will deliberate over this question tomorrow.  We have been deliberating over Karen long enough."
        },
        {
            "id": 77,
            "phrase": "delight in someone or something",
            "definition": "to take great pleasure in someone or something.  I delight in your interest in my work.  We all delight in James. What a fine boy!"
        },
        {
            "id": 78,
            "phrase": "delight someone by something",
            "definition": "to please someone with something; to please someone by doing something.  You delighted me by agreeing to join us.  I was delighted by your proposal."
        },
        {
            "id": 79,
            "phrase": "delight someone with something",
            "definition": "to please someone with something, such as a gift. We delighted Alice with a gift of money.  She was delighted with the gift."
        },
        {
            "id": 80,
            "phrase": "deliver someone from someone or something",
            "definition": "to save or rescue someone from someone or something.  The hero deport delivered the children from a fiery death.  Thank you for delivering me from a very boring meeting by calling me to the telephone."
        },
        {
            "id": 81,
            "phrase": "deliver someone of something",
            "definition": "to free someone from some burden or problem; to liberate someone from some confinement.  He was looking for someone to deliver him of his burdensome responsibility.  He was delivered of his burden."
        },
        {
            "id": 82,
            "phrase": "deliver someone or something to someone or something",
            "definition": "to transfer someone or something to someone or something; to yield over someone or something to someone or something.  When will you deliver the deed to me? _ I will deliver the deed to you when I have your check."
        },
        {
            "id": 83,
            "phrase": "deliver something up† to someone",
            "definition": "to render or yield something to someone. Will you please deliver the documents up to Jane? _ Will you please deliver up the documents to Jane?"
        },
        {
            "id": 84,
            "phrase": "delude someone into something",
            "definition": "to fool someone into thinking something.  You can’t delude me into believing you.  Todd deluded himself into believing he was back at home."
        },
        {
            "id": 85,
            "phrase": "delude someone with something",
            "definition": "to fool or trick someone with something.  She deluded us with her clever talk.  Don’t delude yourself with false hopes."
        },
        {
            "id": 86,
            "phrase": "deluge someone or something with something",
            "definition": "to flood someone or something with water or something similar.  The swollen river broke the dam and deluged the town with billions of gallons of water."
        },
        {
            "id": 87,
            "phrase": "delve into something",
            "definition": "to examine or study something carefully; to enter into the examination or study of something. He delved into the solution of the problem facing him.  I am just now delving into a study of the Trojan War."
        },
        {
            "id": 88,
            "phrase": "demonstrate against someone or something",
            "definition": "to make a public show against someone or something.  The citizens demonstrated against the new policies. A number of protestors demonstrated against the mayor."
        },
        {
            "id": 89,
            "phrase": "demonstrate for someone or something",
            "definition": "to make a public show in favor of someone or something.  We will all demonstrate for Walter’s candidacy.  A number of supporters demonstrated for the mayor."
        },
        {
            "id": 90,
            "phrase": "demonstrate something to someone",
            "definition": "to show someone how something works.  Would you please demonstrate this DVD player to me? I may want to buy it.  The new products were demonstrated to the board of directors in advance."
        },
        {
            "id": 91,
            "phrase": "demur at something",
            "definition": "to dispute something; to challenge something.  I fear I must demur at your suggestion that I am aloof and condescending. Alice demurred at the suggestion that she was late."
        },
        {
            "id": 92,
            "phrase": "a den of iniquity",
            "definition": "a place filled with criminal activity or wickedness. The town was a den of iniquity and vice was everywhere.  Police raided the gambling house, calling it a den of iniquity."
        },
        {
            "id": 93,
            "phrase": "denounce someone as something",
            "definition": "to criticize someone as something; to publicly call someone something bad.  The mayor denounced her opponent as a crook. Anne was denounced as a cheater."
        },
        {
            "id": 94,
            "phrase": "denounce someone for something",
            "definition": "to criticize someone publicly for doing something. The candidate denounced the governor for raising taxes.  Donna denounced the mayor for incompetence."
        },
        {
            "id": 95,
            "phrase": "dent something up†",
            "definition": "to mar or make depressions in something. I don’t want to dent my car up. It’s still new. He dented up my new bike!"
        },
        {
            "id": 96,
            "phrase": "denude someone or something of something",
            "definition": "to strip something from someone or something.  The prison guards denuded the new prisoner of his garments.  The wind denuded the trees of their leaves."
        },
        {
            "id": 97,
            "phrase": "deny someone or something to someone",
            "definition": "to prevent someone from having someone or something.  Would you deny her children to her after all these long months? _ I would not deny food to a starving man."
        },
        {
            "id": 98,
            "phrase": "depart for some place",
            "definition": "to leave for some place. When shall we depart for the airport? _ When do we depart for St. Petersburg?"
        },
        {
            "id": 99,
            "phrase": "depart from some place",
            "definition": "to leave from some place or something; to set out from some place or something.  When will you depart from here? _ We departed from Moscow on time."
        },
        {
            "id": 100,
            "phrase": "depart this life",
            "definition": "Euph. to die.  He departed this life on April 20th, 1973.  She departed peacefully, in her sleep."
        },
        {
            "id": 101,
            "phrase": "depend (up)on someone or something",
            "definition": "to rely upon someone or something. (Upon is formal and less commonly used than on.) _ Can I depend on you to do this right? _ You can depend upon me for help."
        },
        {
            "id": 102,
            "phrase": "depict someone as something",
            "definition": "to show someone as something; to make someone appear to be something. He did report the fire, but it is going too far to depict him as a hero. The artist depicted himself as a much younger man than he really was."
        },
        {
            "id": 103,
            "phrase": "deplete something of something",
            "definition": "to use up all of a certain thing that something has. They will deplete the soil of its nutrients by planting the same crop over and over."
        },
        {
            "id": 104,
            "phrase": "deport someone (from some place) (to some other place)",
            "definition": "to expel or exile someone from one place to another, usually back to their prior country of residence.  The government deported Jane from this country to her homeland.  They deported Tom to Brazil from this country."
        },
        {
            "id": 105,
            "phrase": "deposit something in(to) something",
            "definition": "to put something into something.  Please deposit your chewing gum into the wastebasket. You should deposit your money in the bank."
        },
        {
            "id": 106,
            "phrase": "deprive someone of something",
            "definition": "to take something away from someone.  If you don’t behave, I will deprive you of your driving rights.  They deprived themselves of a good time by pouting."
        },
        {
            "id": 107,
            "phrase": "deputize someone as something",
            "definition": "to assign someone the temporary power to act in some official capacity.  The sheriff deputized Chuck as an aid during the uprising.  Chuck was deputized as an officer of the law."
        },
        {
            "id": 108,
            "phrase": "derive from something",
            "definition": "to come from something; to evolve from something. (Usually in reference to a word and its etymological history.) _This word derives from an ancient Celtic word.  What does the English word skirt derive from?"
        },
        {
            "id": 109,
            "phrase": "derive something from someone or something",
            "definition": "to draw or abstract something from someone or something.  She derives a lot of spiritual support from her religion.  She derives her patience from her mother."
        },
        {
            "id": 110,
            "phrase": "derive something from something",
            "definition": "to show how something is descended from something else. Is it possible to derive this word from Greek? _ Is this word derived from Latin?"
        },
        {
            "id": 111,
            "phrase": "descend from someone or some group",
            "definition": "[for a living creature] to come from a particular set of ancestors.  I descend from a large family of Dutch traders.  Wally is descended from Daniel Boone."
        },
        {
            "id": 112,
            "phrase": "descend from something",
            "definition": "to move down from something.  The bird descended from the top of the tree to a lower branch.  Take care when you descend from the ladder."
        },
        {
            "id": 113,
            "phrase": "descend into something",
            "definition": "to go down into something.  The butler descended into the cellar for another bottle of wine.  Fred descended into the canyon on an organized tour."
        },
        {
            "id": 114,
            "phrase": "descend to something",
            "definition": "to go down to something.  I must descend to the lower level to greet the guests.  Gerald descended to the front door to see who was there."
        },
        {
            "id": 115,
            "phrase": "descend (up)on someone or something",
            "definition": "[for something] to come down or fall upon someone or something.  Flakes of f luffy snow descended upon the gentle slopes."
        },
        {
            "id": 116,
            "phrase": "describe someone or something as something",
            "definition": "to describe or portray a person or a thing as something or as being in some particular state.  Would you describe her as a woman of average height? _ We described the building as a collection of contemporary architectural clichés."
        },
        {
            "id": 117,
            "phrase": "describe someone or something to someone",
            "definition": "to characterize or portray a particular person or thing to someone. Will you describe her to me, please? _ Please describe yourself to me so I will know you."
        },
        {
            "id": 118,
            "phrase": "desensitize someone to something",
            "definition": "to make someone less sensitive to something. The doctor wanted to desensitize the allergic child to pollen.  I took injections to desensitize me to house dust."
        },
        {
            "id": 119,
            "phrase": "Desert and reward seldom keep company.",
            "definition": "Prov. If you deserve a reward, you are not necessarily going to get it.  Jill: I worked so hard on that project, and Fred is taking all the credit for it. Jane: You know how it goes; desert and reward seldom keep company."
        },
        {
            "id": 120,
            "phrase": "desert someone or something for someone or something else",
            "definition": "to leave someone for someone else; to leave something or some place for some other thing or place.  She deserted her husband for another man.  Many retirees have deserted northern states for the warmer climates of the South."
        },
        {
            "id": 121,
            "phrase": "desert someone or something to someone or something",
            "definition": "to abandon someone or something to someone or something; to let someone or something have someone or something.  Who deserted this child to her horrible fate? _ Sam deserted his land to the horde of grubby prospectors."
        },
        {
            "id": 122,
            "phrase": "deserve better from someone or something",
            "definition": "to merit better treatment from someone.  We deserve better from someone who is supposed to be our friend.  I deserve better from Bill."
        },
        {
            "id": 123,
            "phrase": "deserve credit for something",
            "definition": "[for someone] to be owed recognition for doing something.  He certainly deserves credit for the work he did on the project."
        },
        {
            "id": 124,
            "phrase": "design something for someone",
            "definition": "to conceive of something for someone; to draw up plans of something for someone.  Ann designed a new kitchen for us.  Would you design a book cover for me?"
        },
        {
            "id": 125,
            "phrase": "design something for something",
            "definition": "to conceive of something that is to be part of something else; to draw up plans for something that is to be part of something else. The engineers designed a cure for the rattling problem.  Bob, the computer programmer, designed a fix for the bug in the program.  She designed a system of shelving for the library."
        },
        {
            "id": 126,
            "phrase": "designate someone or something as something",
            "definition": "to choose or name someone or something as something. Alice will designate Andrew as our representative.  She designated herself as the head of the committee."
        },
        {
            "id": 127,
            "phrase": "Desires are nourished by delays.",
            "definition": "Prov. The longer you have to wait for something you want, the more eager you will be to get it.  The longer I had to postpone my trip to San Francisco, the more eagerly I wanted to go. Desires are nourished by delays."
        },
        {
            "id": 128,
            "phrase": "desist from something",
            "definition": "to stop doing something.  You must desist from further attempts to contact your wife.  I wish you would desist from calling me Willie."
        },
        {
            "id": 129,
            "phrase": "despair of something",
            "definition": "to give up all hope of something.  Do not despair of his returning; I think we will see him again.  I despair of ever seeing her again."
        },
        {
            "id": 130,
            "phrase": "Desperate diseases must have desperate remedies.",
            "definition": "Prov. If you have a seemingly insurmountable problem, you must do things you ordinarily would not do in order to solve it.  Fred: All my employees have been surly and morose for months. How can I improve their morale? Alan: Why not give everyone a raise? Fred: That’s a pretty extreme suggestion. Alan: Yes, but desperate diseases must have desperate remedies."
        },
        {
            "id": 131,
            "phrase": "despise someone for something",
            "definition": "to hate someone for something or for doing something. I just despise him for running away! _She despised herself for her dishonest actions."
        },
        {
            "id": 132,
            "phrase": "despoil something of something",
            "definition": "to make something, such as a town, tomb, or building, lose value by stealing from it; to rob something of something.  The vandals despoiled the castle of much of its furnishings.  The land was despoiled of its fertility by overplanting."
        },
        {
            "id": 133,
            "phrase": "destine someone for something",
            "definition": "to determine that someone should receive or achieve something in the future.  Her many talents destined her for a distinguished career.  Larry’s intelligence destined him for big things."
        },
        {
            "id": 134,
            "phrase": "destined for something",
            "definition": "predetermined to achieve or become something.  I know I am destined for a job that is better than this.  We are destined for death in the long run."
        },
        {
            "id": 135,
            "phrase": "detach someone or something from someone or something",
            "definition": "to separate or disconnect someone or something from someone or something. The high command detached Wallace from his platoon.  The technician detached the sensors from Harry’s chest."
        },
        {
            "id": 136,
            "phrase": "detail someone for something",
            "definition": "to choose someone to do a particular task. (Originally military.) _Sam detailed Private Bailey for guard duty.  Donna was detailed for some extra work."
        },
        {
            "id": 137,
            "phrase": "detail someone to someone or something",
            "definition": "to assign someone to someone or a group. (Military.) _ I will detail Private Bailey to that job.  The general detailed a lieutenant to the platoon that was going to the front."
        },
        {
            "id": 138,
            "phrase": "detect something in something",
            "definition": "to recognize or identify something in something.  Can you detect the anger in her voice? _ I detect a bit of sarcasm in your comments."
        },
        {
            "id": 139,
            "phrase": "deter someone or something from something",
            "definition": "to prevent or discourage someone or a group from doing something.  We can’t seem to deter them from leaving. They were not deterred from their foolish ways."
        },
        {
            "id": 140,
            "phrase": "detract from someone or something",
            "definition": "to lessen or diminish someone or something.  The large pieces of furniture detracted from the lovely design in the carpet. Alice’s quiet demeanor did not detract from her grace and beauty."
        },
        {
            "id": 141,
            "phrase": "deviate from something",
            "definition": "to wander away from something, such as a path, road, etc.; to vary from the normal procedure. Please do not deviate from the path. You will crush the wildf lowers. I will not deviate one inch from the route you have prescribed.  They did not deviate from her instructions."
        },
        {
            "id": 142,
            "phrase": "*the devil",
            "definition": "a severe scolding. (*Typically: get ~; catch ~; give someone ~.) _ Bill is always getting the devil about something. I’m late. If I don’t get home soon, I’ll catch the devil!"
        },
        {
            "id": 143,
            "phrase": "The devil finds work for idle hands to do.",
            "definition": "Prov. If you do not have useful work to do, you will be tempted to do frivolous or harmful things to get rid of your boredom.  Knowing that the devil finds work for idle hands to do, Elizabeth always made sure that her children had plenty of chores to keep them occupied."
        },
        {
            "id": 144,
            "phrase": "The devil is not so black as he is painted.",
            "definition": "Prov. No one is as bad as people say he is. (Implies that people are saying too many bad things about someone.) _ I can’t believe that actress is as coldhearted as the gossip columns say she is. The devil is not so black as he is painted."
        },
        {
            "id": 145,
            "phrase": "The devil looks after his own.",
            "definition": "Prov. Evil people are often prosperous or well taken care of. (Implies that they must be getting their prosperity from the devil, since they are not earning it by being good and deserving.) _ Jane: I don’t understand why the corner store is still in business. They cheat everybody! Alan: Well, the devil looks after his own."
        },
        {
            "id": 146,
            "phrase": "The devil’s children have the devil’s luck.",
            "definition": "Prov. Evil people often seem to have good luck. The police thought they had trapped the murderer, but he escaped. The devil’s children have the devil’s luck."
        },
        {
            "id": 147,
            "phrase": "devil someone or an animal for something",
            "definition": "to bother or harass someone or an animal for something.  The child kept deviling her mother for an ice-cream cone.  The kittens continued to devil the mother cat for their dinner."
        },
        {
            "id": 148,
            "phrase": "devolve (up)on someone or something",
            "definition": "[for something, such as a task] to be passed on to someone or a group. (Upon is formal and less commonly used than on.) _This job, I am afraid, devolves upon you and you alone.  The task of repairing the damage devolved on Diane."
        },
        {
            "id": 149,
            "phrase": "devote oneself to someone or something",
            "definition": "to dedicate or give oneself over to someone or something.  Do you agree to devote yourself to this task? _ She devoted herself to raising her children."
        },
        {
            "id": 150,
            "phrase": "devote someone or something to someone or something",
            "definition": "to dedicate someone or something to the use or benefit of someone or something.  I will devote a few of my people to your project.  Sarah devoted all of her time to Roger."
        },
        {
            "id": 151,
            "phrase": "dialogue with someone",
            "definition": "to talk with someone.  I look forward to dialoguing with you tomorrow.  The supervisor sets aside time to dialogue with each and every person in the department once a week."
        },
        {
            "id": 152,
            "phrase": "a diamond in the rough",
            "definition": "a person who has good qualities despite a rough exterior; a person with great potential.  Sam looks a little scruffy, but he’s a diamond in the rough.  He’s a diamond in the rough—a little hard to take at times, but very smart and helpful."
        },
        {
            "id": 153,
            "phrase": "dibs on something",
            "definition": "a claim on something.  I’ve got dibs on the yellow one! _ Dibs on the front seat!"
        },
        {
            "id": 154,
            "phrase": "dictate (something) to someone",
            "definition": "1. to speak out words to someone who writes them down; to speak words into a recording device to be written down later by someone.  Walter dictated a letter to his secretary.  Please come in so I can dictate to you. 2. to lay out or spell out the exact terms of something to someone; to act as a dictator. You can’t dictate the rules to us.  Please don’t dictate to me."
        },
        {
            "id": 155,
            "phrase": "did everything he could ’cept eat us",
            "definition": "Rur. acted very hostilely. When it came time to pass sentence on the criminal, the judge did everything he could ’cept eat him."
        },
        {
            "id": 156,
            "phrase": "diddle someone out of something",
            "definition": "to cheat someone into giving up something.  The boys diddled the old man out of a few bucks.  He was diddled out of his last dime."
        },
        {
            "id": 157,
            "phrase": "diddle something out of someone",
            "definition": "Sl. to get something from someone by deception. We diddled about forty bucks out of the old lady who runs the candy shop.  They diddled Larry’s last dime out of him."
        },
        {
            "id": 158,
            "phrase": "diddle with something",
            "definition": "to play with something; to toy with something.  Here, don’t diddle with that watch.  Stop diddling with your nose, Jimmy!"
        },
        {
            "id": 159,
            "phrase": "didn’t care too hard",
            "definition": "Rur. didn’t mind.  Dad said he didn’t care too hard if I took the dog out with me.  If you don’t care too hard, I’ll shut this window."
        },
        {
            "id": 160,
            "phrase": "didn’t exchange more than three words with someone",
            "definition": "to say hardly anything to someone. (The number may vary.) _ I know Tom was there, but I am sure that I didn’t exchange more than three words with him before he left.  We hardly exchanged more than two words the whole evening.  Sally and Liz didn’t have enough time to exchange more than five words."
        },
        {
            "id": 161,
            "phrase": "didn’t invent gunpowder",
            "definition": "Rur. did not do anything terribly important.  He may be the class president, but he didn’t invent gunpowder.  What’s all this fuss about a movie star? She didn’t invent gunpowder!"
        },
        {
            "id": 162,
            "phrase": "die a natural death",
            "definition": "[for someone] to die by disease or old age rather than by violence or foul play.  I hope to live to 100 and die a natural death. The police say she didn’t die a natural death, and they are investigating."
        },
        {
            "id": 163,
            "phrase": "die away",
            "definition": "to fade away.  The sound of the waterfall finally died away. When the applause died away, the tenor sang an encore."
        },
        {
            "id": 164,
            "phrase": "die back",
            "definition": "[for vegetation] to die back to the stems or roots.  The hedge died back in the winter but regenerated leaves in the spring.  This kind of grass dies back every year."
        },
        {
            "id": 165,
            "phrase": "die behind the wheel",
            "definition": "to die in an automobile accident in a car that one is driving.  Poor Fred died behind the wheel in a horrible collision."
        },
        {
            "id": 166,
            "phrase": "die by one’s own hand",
            "definition": "Euph. to commit suicide. Jane: I just heard that Bill died. I didn’t know he was sick. Dan: He wasn’t sick. He died by his own hand.  She died at the age of fifty, by her own hand."
        },
        {
            "id": 167,
            "phrase": "die by something",
            "definition": "to perish by a particular cause or device. (Often refers to execution as a death sentence.) _He died by electrocution.  She was condemned to die by hanging."
        },
        {
            "id": 168,
            "phrase": "die down",
            "definition": "to fade to almost nothing; to decrease gradually. The fire died down and went out. As the applause died down, a child came on stage with an armload of roses for the singer."
        },
        {
            "id": 169,
            "phrase": "die for someone or something",
            "definition": "to perish for the benefit or glory of someone or something.  He said he was willing to die for his country.  She would die for her child if necessary."
        },
        {
            "id": 170,
            "phrase": "die in something",
            "definition": "to perish in a particular calamity or accident. They both died in an automobile accident. Wally did not want to die in the war."
        },
        {
            "id": 171,
            "phrase": "The die is cast.",
            "definition": "Prov. A process is past the point of no return. (The die is one of a pair of dice. The cast means thrown. This phrase [in Latin] was said by Julius Caesar when he crossed the Rubicon with his legions, starting a civil war.) _ After that speech favoring reform of the education system, the die is cast. This is now a campaign issue.  The die is cast. There is no turning back on this point."
        },
        {
            "id": 172,
            "phrase": "die laughing",
            "definition": "to meet one’s death laughing—in good spirits, revenge, or irony.  Sally is such an optimist that she’ll probably die laughing.  Bob tried to poison his rich aunt, who then died laughing because she had taken Bob out of her will."
        },
        {
            "id": 173,
            "phrase": "die of a broken heart",
            "definition": "to die of emotional distress. I was not surprised to hear of her death. They say she died of a broken heart.  In the movie, the heroine appeared to die of a broken heart, but the audience knew she was poisoned."
        },
        {
            "id": 174,
            "phrase": "die of boredom",
            "definition": "to be very bored.  No one has ever really died of boredom. We sat there and listened politely, even though we almost died of boredom."
        },
        {
            "id": 175,
            "phrase": "die of throat trouble",
            "definition": "Sl. to be hanged. (Old.) _He died of throat trouble after the posse caught up with him. The cattle rustler died of throat trouble."
        },
        {
            "id": 176,
            "phrase": "die off",
            "definition": "[for a living thing] to perish one by one until there are no more. Most of the larger lizards died off eons ago.  It would be really bad if all the owls died off.  The cucumber blossoms all died off."
        },
        {
            "id": 177,
            "phrase": "die on someone",
            "definition": "[for a patient] to die under the care of someone. Get that medicine over here fast, or this guy’s gonna die on me.  Come on, mister, don’t die on me!"
        },
        {
            "id": 178,
            "phrase": "die out",
            "definition": "[for a species or family] to perish totally because of the failure to produce offspring. I am the last one in the family, so I guess our line will die out with me.  The owls might die out if you ruin their nesting area."
        },
        {
            "id": 179,
            "phrase": "differ from something",
            "definition": "[for something] to be different from something else. No, this one differs from the one you saw because it has a bigger handle.  How does this one differ from that one?"
        },
        {
            "id": 180,
            "phrase": "differ in something",
            "definition": "[for people or things] to be different in a specific way or in specific ways.  They differ only in the color of their eyes and the size of their shoes. They differ in size and shape."
        },
        {
            "id": 181,
            "phrase": "*different as night and day",
            "definition": "Cliché completely different. (*Also: as ~.) _Although Bobby and Billy are twins, they are as different as night and day.  Birds and bats appear to be similar, but they are different as night and day."
        },
        {
            "id": 182,
            "phrase": "Different strokes for different folks.",
            "definition": "Prov. Different people like different things.; Different people live in different ways.  My neighbor spends all his free time working in his garden. I would never want to do that, but different strokes for different folks."
        },
        {
            "id": 183,
            "phrase": "differentiate between someone or something and someone or something else",
            "definition": "1. to recognize the difference between people or things in any combination. (Usually refers to two entities.) _ In your painting, I cannot differentiate between the costume of the figure in front and the f lowers in the background.  Can’t you differentiate between Billy and his brother? _ I can’t differentiate between a donkey and a burro. 2. to establish or create the difference between people or things.  Why don’t you paint in some highlights to differentiate between the figure in the foreground and the f lowers in the background?"
        },
        {
            "id": 184,
            "phrase": "differentiate someone or something from someone or something else",
            "definition": "1. to recognize the difference between people and things; to tell the difference between people and things.  How do you differentiate this one from that one? _ Can you differentiate Bill from Bob? 2. to make people and things different.  I will differentiate this one from that one by painting this one red. The twins’ mother used different-colored clothing to differentiate Bill from Bob."
        },
        {
            "id": 185,
            "phrase": "The difficult is done at once; the impossible takes a little longer.",
            "definition": "Prov. Tasks that are only difficult are done immediately, harder tasks take longer. (Describes a very competent group or person.) _ The secretary in our office is extremely capable. She has a little sign on her desk that says, “The difficult is done at once; the impossible takes a little longer.” In her case, it’s not a joke."
        },
        {
            "id": 186,
            "phrase": "diffuse something through something else",
            "definition": "to distribute or scatter something through something else.  The chemical process diffused the purple color through the liquid.  Let us try to diffuse the medication through the bloodstream as rapidly as possible."
        },
        {
            "id": 187,
            "phrase": "diffuse through something",
            "definition": "to spread or scatter through something. The smell diffused through the office through the ventilating system. The dye diffused through the water rapidly."
        },
        {
            "id": 188,
            "phrase": "dig at someone or something",
            "definition": "to poke or jab at someone or something.  Don’t dig at me all the time. My side is getting sore where you jabbed me.  Stop digging at the wall! Look at the hole you’ve made!"
        },
        {
            "id": 189,
            "phrase": "dig for something",
            "definition": "to excavate to find something that is buried. They are digging along the river bank for a special kind of clay.  I want to dig for gold in Alaska."
        },
        {
            "id": 190,
            "phrase": "dig in(to something)",
            "definition": "to use a shovel to penetrate a mass of something.  He dug into the soft soil and made a hole for the roots of the bush.  He grabbed a shovel and dug in where he thought the tree ought to go."
        },
        {
            "id": 191,
            "phrase": "dig one’s heels in†",
            "definition": "to refuse to alter one’s course of action or opinions; to be obstinate or determined.  The student dug her heels in and refused to obey the instructions.  I’m digging in my heels. I’m not going back."
        },
        {
            "id": 192,
            "phrase": "dig one’s own grave",
            "definition": "to be responsible for one’s own downfall or ruin.  If you try to cheat the bank, you will be digging your own grave.  Those politicians have dug their own grave with their new tax bill. They won’t be reelected."
        },
        {
            "id": 193,
            "phrase": "dig out (of something)",
            "definition": "to channel or excavate one’s way out of something.  The miner had to dig out of the cave-in.  They were too exhausted to dig out."
        },
        {
            "id": 194,
            "phrase": "dig some dirt up† (on someone)",
            "definition": "to find out something bad about someone. If you don’t stop trying to dig some dirt up on me, I’ll get a lawyer and sue you. The citizens’ group dug up some dirt on the mayor and used it against her at election time."
        },
        {
            "id": 195,
            "phrase": "dig someone or something in something",
            "definition": "to poke someone or something in something, such as the ribs, the side, the cheek, etc. He dug Wally in the ribs as he finished telling the joke.  Jed dug the cow in its side with a stick, trying to make it move into the barn."
        },
        {
            "id": 196,
            "phrase": "dig someone or something up†",
            "definition": "to go to great effort to find someone or something. (There is an implication that the thing or person dug up is not the most desirable, but is all that could be found.) _ Mary dug a date up for the dance next Friday.  I dug up a recipe for roast pork with pineapple.  I dug up a carpenter who doesn’t charge very much."
        },
        {
            "id": 197,
            "phrase": "dig something out†",
            "definition": "to work hard to locate something and bring it forth.  They dug the contract out of the file cabinet.  I dug out an old dress and wore it to the Fifties party."
        },
        {
            "id": 198,
            "phrase": "Dig up!",
            "definition": "Sl. Listen carefully! _John: All right, you guys! Dig up! You’re going to hear this one time and one time only! _ Bill: Dig up! I’m only going to say this once. Bob: What was that? Bill: I said listen!"
        },
        {
            "id": 199,
            "phrase": "dig up one’s tomahawk",
            "definition": "Rur. to get angry. (A jocular reversal of bury the tomahawk. Fixed order.) _ When Joe saw the mess we made, he dug up his tomahawk and went looking for us."
        },
        {
            "id": 200,
            "phrase": "digress from something",
            "definition": "[for a speaker or writer] to stray from the subject. I am going to digress from my prepared text.  You will pardon me if I digress from my point a little."
        },
        {
            "id": 201,
            "phrase": "dilate on something",
            "definition": "to speak or write in great detail on some subject. I am sure you do not wish me to dilate further on this matter.  If you do not see my point, I would be pleased to dilate on this matter further."
        },
        {
            "id": 202,
            "phrase": "Diligence is the mother of good luck.",
            "definition": "Prov. If you work carefully and constantly, you will be far more likely to be successful, as if luck had come your way.  Mimi: I’ll never get work as an actress; I always have such bad luck at auditions. Jane: Keep working at it. Diligence is the mother of good luck."
        },
        {
            "id": 203,
            "phrase": "dilly-dally (around) with someone or something",
            "definition": "to waste time frivolously with someone or something. Stop dillydallying around with your friends. He is always dilly-dallying around with his work."
        },
        {
            "id": 204,
            "phrase": "dim down",
            "definition": "[for the lights] to go dim. The lights dimmed down for a few seconds. Open the stage curtain when the house lights dim down."
        },
        {
            "id": 205,
            "phrase": "dim out",
            "definition": "[for a light] to grow dim and go out altogether.  The lights dimmed out twice during the storm.  I was afraid that the lights would dim out completely."
        },
        {
            "id": 206,
            "phrase": "dim something down†",
            "definition": "to make lights dim; to use a dimmer to make the lights dimmer. Why don’t you dim the lights down and put on some music? _Let me dim down the lights and put on some music."
        },
        {
            "id": 207,
            "phrase": "dim something up†",
            "definition": "to use a dimmer to make the lights brighter. (Theatrical. A dimmer is a rheostat, variable transformer, or something similar. The expression, a seeming contradiction, is the opposite of dim something down.) _ As the curtain rose, the electrician dimmed the lights up on a beautiful scene.  You dimmed up the lights too fast."
        },
        {
            "id": 208,
            "phrase": "a dime a dozen",
            "definition": "abundant; cheap and common.  People who can write good books are not a dime a dozen.  Romantic movies are a dime a dozen."
        },
        {
            "id": 209,
            "phrase": "dine at some place",
            "definition": "to eat at a place. We really like to dine at the small cafe on the corner.  I hope we can dine at a fine restaurant for our anniversary."
        },
        {
            "id": 210,
            "phrase": "dine in",
            "definition": "to eat at home rather than at a restaurant. I think we will dine in tonight.  I am tired of dining in. Let’s go out."
        },
        {
            "id": 211,
            "phrase": "dine off something",
            "definition": "to make a meal of something; to make many meals of something. Do you think we can dine off the leg of lamb for more than one meal? _ I hope we dine off the turkey only one more time."
        },
        {
            "id": 212,
            "phrase": "dine on something",
            "definition": "to eat something.  We are dining on roast beef tonight.  What will we be dining on tonight?"
        },
        {
            "id": 213,
            "phrase": "dinged out",
            "definition": "Sl. intoxicated. Gary is dinged out and can’t drive."
        },
        {
            "id": 214,
            "phrase": "dink someone off†",
            "definition": "Sl. to make someone angry. Whatever you do, don’t dink her off! _ Why did you have to start out your speech by dinking off the entire audience?"
        },
        {
            "id": 215,
            "phrase": "Dinner is served.",
            "definition": "It is time to eat dinner. Please come to the table. (As if announced by a butler; often jocular.) _ Sue: Dinner is served. Mary (aside): Aren’t we fancy tonight? _ “Dinner is served,” said Bob, rather formally for a barbecue."
        },
        {
            "id": 216,
            "phrase": "dip into one’s savings",
            "definition": "to take out part of the money one has been saving.  I had to dip into my savings in order to pay for my vacation. I went to the bank and dipped into savings. There wasn’t much left."
        },
        {
            "id": 217,
            "phrase": "dip in(to something)",
            "definition": "1. to reach into a liquid.  I dipped into the dishwater, looking for the missing spoon. I dipped in and there it was. 2. to reach into a substance, usually to remove some of the substance.  I dipped into the sour cream with a potato chip and brought out an enormous glob. He grabbed the jar of peanut butter and dipped in. 3. [for something] to sink or lower into a liquid.  The oars dipped into the water and came out again.  The lower branches sagged down to the water and dipped in."
        },
        {
            "id": 218,
            "phrase": "dip to something",
            "definition": "to decline to a lower level quickly or briefly.  The temperature dipped into the lower twenties overnight.  The stock market dipped to a very low level during the day Friday."
        },
        {
            "id": 219,
            "phrase": "direct someone’s attention to someone or something",
            "definition": "to focus someone’s regard or concern on someone or something; to cause someone to notice someone or something. May I direct your attention to the young man in the purple costume? _The announcer directed our attention to the magician who was coming on stage."
        },
        {
            "id": 220,
            "phrase": "direct something against someone or something",
            "definition": "to aim a critical remark or a weapon at someone or something. (Very close to direct something at someone or something.) _ We directed the guns against the occupied village. Ted said he had directed his remark against Judy."
        },
        {
            "id": 221,
            "phrase": "direct something at someone or something",
            "definition": "to aim something at someone or something. (Very close to direct something against someone or something.) _ Are you directing your remarks at me? _ Please direct the hose at the bushes."
        },
        {
            "id": 222,
            "phrase": "direct something to someone",
            "definition": "to address, designate, or send something to someone. Shall I direct the inquiries to you? _Please direct all the mail to the secretary when it is delivered."
        },
        {
            "id": 223,
            "phrase": "direct something to(ward) someone or something",
            "definition": "to send, throw, push, or aim something at someone or something.  Tom directed the ball toward Harry.  Should I direct this inquiry to Alice?"
        },
        {
            "id": 224,
            "phrase": "dirt cheap",
            "definition": "extremely cheap.  Buy some more of those plums. They’re dirt cheap.  In Italy, the peaches are dirt cheap."
        },
        {
            "id": 225,
            "phrase": "dirty crack",
            "definition": "a rude remark.  Who made that dirty crack? _ Another dirty crack like that and I’ll leave."
        },
        {
            "id": 226,
            "phrase": "dirty deal",
            "definition": "an unfair deal.  That was a dirty deal. I feel cheated.  I got a dirty deal at that shop, and I won’t go back."
        },
        {
            "id": 227,
            "phrase": "dirty dog",
            "definition": "a low and sneaky person. That dirty dog tried to cheat in the card game!"
        },
        {
            "id": 228,
            "phrase": "*a dirty look",
            "definition": "an angry face or a frown. (*Typically: get ~; give someone ~.) _ Anne gave me a dirty look.  I got a dirty look from the teacher when I cracked a joke in class."
        },
        {
            "id": 229,
            "phrase": "dirty old man",
            "definition": "a lecherous old man. (Usually jocular.) _ Jimmy, what you call f lirting will make some girls call you a dirty old man! _What a terrible joke. You are a dirty old man!"
        },
        {
            "id": 230,
            "phrase": "dirty something up†",
            "definition": "Rur. to get something dirty.  Those pants are brand-new! Don’t dirty them up! _ Don’t dirty up your brand-new pants!"
        },
        {
            "id": 231,
            "phrase": "a dirty word",
            "definition": "1. a swearword; an obscene or blasphemous word; a four-letter word. You are not allowed to use dirty words in your school essays.  My aunt is offended by the use of dirty words. 2. something that is disliked or disapproved of. Since Tom broke off his engagement, his name is a dirty word in the village.  Socialism is a dirty word in that house."
        },
        {
            "id": 232,
            "phrase": "dirty work",
            "definition": "1. Fig. unpleasant or uninteresting work.  My boss does all the traveling. I get all the dirty work to do. She’s tired of doing all the dirty work at the office. 2. Fig. dishonest or underhanded actions; treachery. She knew there was some dirty work going on when she saw her opponents whispering together.  The company seems respectable enough, but there’s a lot of dirty work that goes on."
        },
        {
            "id": 233,
            "phrase": "disabuse someone of something",
            "definition": "to rid someone of an incorrect idea.  Please allow me to disabuse you of that assumption.  Please disabuse yourself of the notion that you are perfect."
        },
        {
            "id": 234,
            "phrase": "disagree with someone",
            "definition": "[for food or drink] to upset someone’s stomach. Milk always disagrees with me. Onions disagree with my husband, so he never eats them."
        },
        {
            "id": 235,
            "phrase": "disappear from something",
            "definition": "to vanish from something or some place, especially from sight, view, or the face of the earth; to have been taken away from something.  Jack disappeared all of a sudden last week, as if from the face of the earth.  The car pulled away and disappeared from sight down the road."
        },
        {
            "id": 236,
            "phrase": "disappoint someone with someone or something",
            "definition": "to displease someone with someone or something.  I hope I haven’t disappointed you with the modest size of the donation.  I disappointed myself with my performance."
        },
        {
            "id": 237,
            "phrase": "disapprove of someone or something",
            "definition": "to object to someone or something.  I disapprove of her choice for maid of honor.  Do you disapprove of me?"
        },
        {
            "id": 238,
            "phrase": "a disaster of epic proportions",
            "definition": "Cliché a very large disaster. (Often jocular.) _ The earthquake was responsible for a disaster of epic proportions. Your late arrival caused a disaster of epic proportions."
        },
        {
            "id": 239,
            "phrase": "disbar someone from something",
            "definition": "to take the right to practice law away from a lawyer.  The state board disbarred Todd from practicing law in his own state. Sally was also disbarred from practicing law."
        },
        {
            "id": 240,
            "phrase": "discern between someone or something and someone or something",
            "definition": "to detect the difference between people and things.  I cannot discern between the dark trees and the dark sky behind them.  I cannot discern between the person and the background."
        },
        {
            "id": 241,
            "phrase": "discern someone or something from something else",
            "definition": "to detect the difference between someone or something and something else.  I can hardly discern Tom from the busy background in this picture. I can’t discern anything from that cluttered scene."
        },
        {
            "id": 242,
            "phrase": "discern something from someone or something",
            "definition": "to learn or determine something from someone or something. We discerned a lot from the eyewitnesses. We discerned a lot from our discussions with the past president."
        },
        {
            "id": 243,
            "phrase": "discharge someone from something",
            "definition": "1. to fire someone from a job.  The manager discharged Walter from his position with the bank.  Walter was discharged from his job. 2. to permit a person to leave a place, such as a hospital or the armed service.  They discharged her from the hospital today.  She was well enough to be discharged from the hospital."
        },
        {
            "id": 244,
            "phrase": "discharge something from something",
            "definition": "to fire a round from a gun. I discharged two bullets from the gun accidentally.  Randy discharged about twenty rounds from his automatic rif le."
        },
        {
            "id": 245,
            "phrase": "discharge something into something",
            "definition": "to let something out of something into something else.  She discharged some nitrogen from the tank into the laboratory by accident.  The technician discharged oxygen into the atmosphere."
        },
        {
            "id": 246,
            "phrase": "discipline someone for something",
            "definition": "to punish or chastise someone for doing something.  I will have to discipline you for fighting.  Mary was disciplined for taking part in the fiasco."
        },
        {
            "id": 247,
            "phrase": "disclose something to someone",
            "definition": "to tell or reveal something to someone.  Tony refused to disclose the location of the papers to me.  Please disclose the names to me at once."
        },
        {
            "id": 248,
            "phrase": "disconnect someone or something from someone or something",
            "definition": "to break the connection between things or people.  The telephone operator disconnected Larry from his caller. He disconnected himself from the cords of his parachute."
        },
        {
            "id": 249,
            "phrase": "discourage someone from something",
            "definition": "to dissuade someone from doing something. I hope I can discourage Tom from leaving.  I do not want to discourage you from further experimentation."
        }
    ]
}