{
    "dictionary": [
        {
            "id": 0,
            "phrase": "compare someone or something to someone or something",
            "definition": "to liken people or things to other people or things; to say that some people or things have the same qualities as other people or things. (See the comment at compare someone or something with someone or something.) _ I can only compare him to a cuddly teddy bear. He compared himself to one of the knights of the round table."
        },
        {
            "id": 1,
            "phrase": "compare someone or something with someone or something",
            "definition": "to consider the sameness or difference of sets of things or people. (This phrase is very close in meaning to compare someone or something to someone or something, but for some connotes stronger contrast.) _Let’s compare the virtues of savings accounts with investing in bonds.  When I compare Roger with Tom, I find very few similarities.  Please compare Tom with Bill on their unemployment records."
        },
        {
            "id": 2,
            "phrase": "compartmentalize something into something",
            "definition": "to segment or divide something into smaller things; to assign the parts of something into categories. We will have to compartmentalize this large area into a number of smaller offices.  His brain seems to be compartmentalized into a number of different centers."
        },
        {
            "id": 3,
            "phrase": "compel someone to do something",
            "definition": "to force someone to do something; to drive someone to so something. You can’t compel me to do that.  She compelled herself to try, even though she was ill."
        },
        {
            "id": 4,
            "phrase": "compensate for something",
            "definition": "to counterbalance or counteract something; to make up for something.  Your present kindness will not compensate for your previous rudeness."
        },
        {
            "id": 5,
            "phrase": "compensate someone for something",
            "definition": "to pay someone [back] money for something.  Don’t worry. I will compensate you for your loss.  Let us compensate you for your expenses."
        },
        {
            "id": 6,
            "phrase": "compete against someone",
            "definition": "to contend against someone; to play against someone in a game or contest.  I don’t see how I can compete against all of them.  She refused to compete against her own brothers."
        },
        {
            "id": 7,
            "phrase": "compete against something",
            "definition": "to struggle against something; to seem to be in a contest with something. It was hard to be heard. I was competing against the noise of construction.  Please stop talking. I do not wish to compete against the audience when I lecture."
        },
        {
            "id": 8,
            "phrase": "compete for someone or something",
            "definition": "to contend against or contest [someone] for someone or something; to struggle for someone or something [against a competitor]. They are competing for a lovely prize.  Ed and Roger are competing for Alice’s attention."
        },
        {
            "id": 9,
            "phrase": "compete in something",
            "definition": "to enter into a competition.  I do not want to compete in that contest.  Ann looked forward to competing in the race."
        },
        {
            "id": 10,
            "phrase": "compete with someone or something",
            "definition": "to contend against someone, something, or a group; to play in a competition against someone, something, or a group.  I can’t compete with all this noise.  We always compete closely with our crosstown rivals, Adams High School."
        },
        {
            "id": 11,
            "phrase": "compile something from something",
            "definition": "to make up something from something; to collect and consolidate something from something.  She compiled a book of poetry from verses written by her friends.  Lynn compiled a picture book from family photographs going back almost a century."
        },
        {
            "id": 12,
            "phrase": "complain about someone or something",
            "definition": "to protest someone or something; to grouch about someone or something.  Oh, stop complaining about the weather.  You are always complaining about me."
        },
        {
            "id": 13,
            "phrase": "complain of something",
            "definition": "to moan and suffer from a disease; to report the symptoms of a disease or health condition.  Kenneth complained of a headache and general weakness.  The patient was complaining of a headache."
        },
        {
            "id": 14,
            "phrase": "complain to someone",
            "definition": "to grouch or protest to someone.  Don’t complain to me.  I will complain to the manager."
        },
        {
            "id": 15,
            "phrase": "compliment someone on something",
            "definition": "to say something nice to someone about something connected to that person.  I was pleased with Alice’s work and complimented her on it.  They complimented me on my new tie."
        },
        {
            "id": 16,
            "phrase": "comply with something",
            "definition": "to conform to something; to obey guidelines or regulations; to agree to something. I hope you decide to comply with our rules.  I am happy to comply with your request."
        },
        {
            "id": 17,
            "phrase": "comport oneself with some manner",
            "definition": "to behave in a certain manner. I hope you are able to comport yourself with better behavior next time. The old man was able to comport himself with dignity."
        },
        {
            "id": 18,
            "phrase": "composed of something",
            "definition": "assembled or made out of something.  This cloth is composed of a number of different kinds of fibers. The committee is composed of people from every department."
        },
        {
            "id": 19,
            "phrase": "compound something with something",
            "definition": "to unite some substance with another; to mix something with something else. Can this unpleasant medicine be compounded with something to make it palatable?"
        },
        {
            "id": 20,
            "phrase": "compress something into something",
            "definition": "1. to squeeze or press something into something, such as a mold or container. We compressed the tomatoes into the jar. I cannot compress any more clothing into the suitcase. 2. to form something into a shape by applying pressure.  He compressed the mass of paper into a tight ball.  The clay was compressed into the shape of a brick upon the application of pressure to the mold."
        },
        {
            "id": 21,
            "phrase": "comprised of someone or something",
            "definition": "made up of someone or something. (The use of of after comprise is regarded as bad grammar by some.) _ The committee was comprised of representatives from all areas.  The dessert was comprised of a number of different delicious substances."
        },
        {
            "id": 22,
            "phrase": "compute something at something",
            "definition": "to calculate the total of something to be a certain figure.  I compute the total at nearly three thousand dollars.  The tax department computed the penalty at an enormous amount."
        },
        {
            "id": 23,
            "phrase": "con someone into something",
            "definition": "to deceive someone into doing something.  The dishonest contractor conned her into buying a new furnace even when her old one was fine.  You are just conning yourself into believing your plan will work."
        },
        {
            "id": 24,
            "phrase": "con someone out of something",
            "definition": "to trick someone out of money or something of value. Anne conned her little sister out of her allowance. Dave conned me out of my autographed baseball."
        },
        {
            "id": 25,
            "phrase": "conceal someone or something from someone or something",
            "definition": "to hide someone or something from someone or something.  Are you trying to conceal something from me? _ I cannot conceal Roger from the police. We could not conceal the present from mom."
        },
        {
            "id": 26,
            "phrase": "concede something to someone or something",
            "definition": "to yield something to someone or a group; to grant something to someone or something.  At midnight, Ronald conceded the election to his opponent."
        },
        {
            "id": 27,
            "phrase": "concede to someone or something",
            "definition": "to yield to someone or a group; to give in to someone or a group. In the end we conceded to the demands of the petition.  I will not concede to you."
        },
        {
            "id": 28,
            "phrase": "*conceited as a barber’s cat",
            "definition": "Rur. very conceited; vain. (*Also: as ~.) _ Ever since he won that award, he’s been as conceited as a barber’s cat."
        },
        {
            "id": 29,
            "phrase": "conceive of someone or something",
            "definition": "to think of or invent the notion of someone or something.  Who on earth ever conceived of doing this? _ Edison conceived of many very useful things that we now use every day."
        },
        {
            "id": 30,
            "phrase": "conceive of someone or something as someone or something",
            "definition": "to think of someone as being someone else; to think of something as being something else.  I can’t conceive of you as a pilot.  I can conceive of this grassy spot as a very interesting setting for a cottage."
        },
        {
            "id": 31,
            "phrase": "concentrate at some place",
            "definition": "to gather thickly at a place.  The moths concentrated at the window at night, attracted by the light.  All the thirsty children concentrated at the water fountain."
        },
        {
            "id": 32,
            "phrase": "concentrate someone or something at something",
            "definition": "to cause people or things to gather at a place; to cause people or things to convene or converge at a place.  You shouldn’t concentrate all the guards at one entrance.  The general concentrated all the big guns at the entrance to the valley."
        },
        {
            "id": 33,
            "phrase": "concentrate something on someone or something",
            "definition": "to focus something on someone or something; to center on someone or something.  Let’s try to concentrate our efforts on finishing this job today.  She concentrated her attention on Lynn."
        },
        {
            "id": 34,
            "phrase": "concentrate (up)on someone or something",
            "definition": "to focus one’s thinking on someone or something; to think intensely about someone or something. (Upon is formal and less commonly used than on.) _ Please concentrate upon Jeff. He is the one we should discuss.  Try to concentrate on your work more."
        },
        {
            "id": 35,
            "phrase": "concern someone in something",
            "definition": "to bring someone into some matter; to engage someone in something; to occupy someone with something.  Don’t concern Dave in our party planning. He doesn’t know anything about entertaining.  The wrong committee was concerned in this from the very beginning."
        },
        {
            "id": 36,
            "phrase": "concern someone with someone or something",
            "definition": "to busy someone with someone or something; to worry someone with thoughts of someone or something. I hope Jennifer does not concern herself with this matter.  Try to concern him with something other than his work."
        },
        {
            "id": 37,
            "phrase": "condemn someone as something",
            "definition": "to blame or judge someone as being something bad. The team condemned Larry as a traitor.  Max was condemned as a common thief."
        },
        {
            "id": 38,
            "phrase": "condemn someone for something",
            "definition": "to blame or judge someone for something or for having done something.  I really can’t condemn her for doing it. I would have done the same too. Don’t condemn yourself for the accident. It was no one’s fault."
        },
        {
            "id": 39,
            "phrase": "condemn someone to something",
            "definition": "[for a judge] to sentence someone to something; to relegate someone to a particular punishment. By confessing, he condemned himself to many years in prison.  I don’t want to condemn you to a life of unpleasantness."
        },
        {
            "id": 40,
            "phrase": "condense something (in)to something",
            "definition": "to compress or reduce something to something; to shrink or abridge something into a smaller version. Condense this into half its original volume.  You should condense this novel to a short story."
        },
        {
            "id": 41,
            "phrase": "condescend to do something",
            "definition": "to agree to do something that is humbling or belittling.  I will not condescend to respond to that remark.  “Will you condescend to join us for dinner?” teased Bob."
        },
        {
            "id": 42,
            "phrase": "condescend to someone",
            "definition": "to talk down to someone; to treat people as if they were below oneself; to patronize someone.  Please do not condescend to me.  There is no need to condescend to the children. They are just small, not stupid."
        },
        {
            "id": 43,
            "phrase": "condition someone or something to something",
            "definition": "1. to train or adapt someone or an animal to do something. I conditioned the dog to beg for a treat. Over the years, he had conditioned himself to run for hours at a stretch. 2. to train or adapt someone or an animal to something. We could never condition the cat to the finer points of domestication.  I conditioned myself to the extreme cold."
        },
        {
            "id": 44,
            "phrase": "conduct someone away (from someone or something)",
            "definition": "to lead someone away from someone or something.  The usher conducted the gentleman away from the front of the auditorium.  Can you conduct Fred away from the area? _ Please conduct him away."
        },
        {
            "id": 45,
            "phrase": "confederate with someone or something",
            "definition": "to organize, join, or unite with someone or a group.  A number of states confederated with one another and formed a loose association.  I confederated with the neighbors and we filed a joint complaint."
        },
        {
            "id": 46,
            "phrase": "confer something (up)on someone",
            "definition": "to grant something, such as an academic degree, to someone, usually in a ceremony. (Upon is more formal than on.) _ The university conferred an honorary degree upon her.  They conferred degrees on 300 graduates this year."
        },
        {
            "id": 47,
            "phrase": "confess to something",
            "definition": "to admit having done something.  He will not confess to the crime.  In the end, Max confessed to it."
        },
        {
            "id": 48,
            "phrase": "confide in someone",
            "definition": "to trust someone with one’s secrets or personal matters. Sally always confided in her sister Ann.  She didn’t feel that she could confide in her mother."
        },
        {
            "id": 49,
            "phrase": "confine someone or an animal to something",
            "definition": "to limit someone or an animal to a particular place; to imprison someone or an animal in a particular place. Would you please confine the dog to the basement? _ She confined herself to the small room for over a year because of her fear of crowds."
        },
        {
            "id": 50,
            "phrase": "confine someone or an animal within something",
            "definition": "to contain someone or an animal within something.  We were unable to confine the dog within the yard. Could you confine all your car-repair mess within the garage?"
        },
        {
            "id": 51,
            "phrase": "confine something to someone or something",
            "definition": "to limit something or the doing of something to a person or a thing.  Please try to confine your comments to John. Can we confine tonight’s discussion to the agenda?"
        },
        {
            "id": 52,
            "phrase": "confirm someone in something",
            "definition": "to perform a religious rite that ties one more closely to one’s religion.  They confirmed her in the church this morning."
        },
        {
            "id": 53,
            "phrase": "confiscate something from someone or something",
            "definition": "to seize or impound something from someone or a group.  The police confiscated all the stolen property from the suspect’s garage.  The dean confiscated the beer from the dormitory."
        },
        {
            "id": 54,
            "phrase": "conflict with something",
            "definition": "to clash with something. (Does not refer to fighting.) _ This date conf licts with my doctor’s appointment.  As far as I can tell, the date you suggest does not conf lict with anything."
        },
        {
            "id": 55,
            "phrase": "conform to something",
            "definition": "to agree with or behave within guidelines or regulations.  I hope that your policies will conform to our guidelines. Does my casual dress conform to your regulations?"
        },
        {
            "id": 56,
            "phrase": "conform with something",
            "definition": "to match or agree with a model, plan, or set of specifications. (Compare this with conform to something.) _ Does this part conform with the specifications? _ This one conforms with them quite well."
        },
        {
            "id": 57,
            "phrase": "confront someone with something",
            "definition": "to face someone with incriminating evidence, charges of wrongdoing, or criticism.  The angry husband confronted his wife with the evidence of her financial irresponsibility. The police confronted Wilson with the witness’s statement."
        },
        {
            "id": 58,
            "phrase": "confuse someone about something",
            "definition": "to cause someone to be puzzled or bewildered about something.  She confused me about the time of the concert.  I wish you wouldn’t confuse me about those things."
        },
        {
            "id": 59,
            "phrase": "confuse someone or an animal with something",
            "definition": "to use something to bewilder or confuse someone or an animal. You have confused me with your clever talk. You confused the dog with your orders."
        },
        {
            "id": 60,
            "phrase": "congratulate someone (up)on something",
            "definition": "to compliment or wish happiness to someone because of something. (Upon is formal and less commonly used than on.) _ I want to congratulate you on your recent success.  I congratulate you on your new job! conspire conjecture on something to speculate on or guess about something. I will not even conjecture on the outcome.  Dave conjectured on what might happen next."
        },
        {
            "id": 61,
            "phrase": "conjure someone or something up†",
            "definition": "to make someone or something appear, seemingly by the use of magic.  The magician conjured seven white doves up.  Then an old wizard conjured up a horse."
        },
        {
            "id": 62,
            "phrase": "connect (up) to something",
            "definition": "to attach to something; to attach or link something to some electrical device or electrical signal.  When we finish the house, we will connect up to the utilities. We have to connect to the Internet ourselves."
        },
        {
            "id": 63,
            "phrase": "connect (up) with someone or something",
            "definition": "1. to form an association with someone or a group. (The up is informal.) _ Let’s connect up with some other people and form an organization through which we can express our views.  We need to connect with like-minded people that can help us with our problems. 2. to meet with someone or a group; to communicate with someone or a group, especially over the telephone.  I tried to connect up with Bob over the phone, but I could never reach him.  We could not connect with the council to discuss these matters."
        },
        {
            "id": 64,
            "phrase": "connect (with someone)",
            "definition": "to meet someone; to talk to someone on the telephone.  Let’s try to connect on this matter tomorrow. We finally connected and discussed the matter fully over dinner."
        },
        {
            "id": 65,
            "phrase": "connect (with the ball)",
            "definition": "[for a batter] to hit a baseball.  Wally connected for a double.  He swung, but didn’t connect with the ball."
        },
        {
            "id": 66,
            "phrase": "Consarn it!",
            "definition": "Rur. Damn it! (A mild oath.) _ Consarn it! I can’t find my keys. That’s the second batch of muffins I’ve burned today, consarn it!"
        },
        {
            "id": 67,
            "phrase": "Conscience does make cowards of us all.",
            "definition": "Prov. People sometimes fear to do what they want or what they believe is necessary because they think it is wrong. (From Shakespeare’s play, Hamlet.) _ Alan: I really want to go to the ball game with you guys this afternoon, but it just doesn’t seem right to skip work to do it. Fred: Conscience does make cowards of us all, right, Alan?"
        },
        {
            "id": 68,
            "phrase": "conscript someone into something",
            "definition": "to call someone into military service; to draft someone.  The war-torn country was even conscripting children into the army.  Fred was conscripted into the army."
        },
        {
            "id": 69,
            "phrase": "consecrate someone or something to God",
            "definition": "to pledge someone to the service of God; to dedicate something to the glory or service of God. They consecrated the new church building to the glory of God."
        },
        {
            "id": 70,
            "phrase": "consent to something",
            "definition": "to agree to permit something to happen.  I will not consent to your marriage.  There is no need for you to consent to anything."
        },
        {
            "id": 71,
            "phrase": "consider someone (as) something",
            "definition": "to think of a person as a particular type of person. I don’t consider you as a possible candidate.  I consider myself an excellent cook."
        },
        {
            "id": 72,
            "phrase": "consider someone for something",
            "definition": "to think about offering someone a job, office, or other responsibility.  Would you consider David for the job? _ I could not possibly consider you for the position."
        },
        {
            "id": 73,
            "phrase": "consign something to someone or something",
            "definition": "1. to entrust something to someone, something, or some place.  We consigned all the toughest assignments to our top employees.  What shipping company should we consign these boxes to? 2. to assign something for shipment to a place.  Bill consigned this batch to Denver."
        },
        {
            "id": 74,
            "phrase": "consist of someone or something",
            "definition": "to include people or things; to be made up of people or things.  This bread consists of f lour, water, sugar, oil, and yeast.  The U.S. Senate consists of two elected officials from each state."
        },
        {
            "id": 75,
            "phrase": "console someone on something",
            "definition": "to comfort someone about something.  I want to console you on your recent loss.  They consoled Fred on the continuing difficulties he was having."
        },
        {
            "id": 76,
            "phrase": "console someone with something",
            "definition": "to use something to comfort someone. We consoled her with a sympathy card and f lowers.  He sat down and consoled himself with a beer or two."
        },
        {
            "id": 77,
            "phrase": "consort with someone",
            "definition": "1. to associate with someone. It is said that she consorts with thieves.  No one worth anything would consort with Max. 2. Euph. to have sex with someone. Over the years it is rumored that she consorted with numerous young men."
        },
        {
            "id": 78,
            "phrase": "*conspicuous by one’s absence",
            "definition": "Cliché noticeably absent (from an event). (*Typically: be ~; made ~.) _ How could the bride’s father miss the wedding? He was certainly conspicuous by his absence."
        },
        {
            "id": 79,
            "phrase": "constrain someone from doing something",
            "definition": "to prevent someone from doing something; to hold someone back from doing something.  I hope this doesn’t constrain you from trying out for the play.  His handicap did not constrain him from finishing the race."
        },
        {
            "id": 80,
            "phrase": "construe something as something",
            "definition": "to interpret something to mean something.  Please do not construe this as criticism.  We mistakenly construed her comments as positive."
        },
        {
            "id": 81,
            "phrase": "consult (with) someone (about someone or something)",
            "definition": "to ask someone about someone or something.  Please consult with me about all your plans.  You should consult the architect about your needs.  Please consult with me first."
        },
        {
            "id": 82,
            "phrase": "*contact with someone",
            "definition": "a link to someone resulting in communication. (*Typically: be in ~; have ~; make ~.) _I have had no contact with Bill since he left town.  Tom made contact with a known criminal last month."
        },
        {
            "id": 83,
            "phrase": "contaminate someone or something with something",
            "definition": "to get someone or something dirty with something; to pollute someone or something with something.  Something in the hospital contaminated the patient with a serious infection.  The campers learned not to contaminate the outdoors with anything they carried in."
        },
        {
            "id": 84,
            "phrase": "contend against someone or something",
            "definition": "to fight or compete against someone or something. Do we have to contend against all this criticism? _ Ed refuses to have to contend against Eric."
        },
        {
            "id": 85,
            "phrase": "contend with a problem",
            "definition": "to put up with a difficulty; to struggle with the problems caused by someone or something.  I cannot contend with your temper anymore.  I wish we did not have to contend with this changeable weather."
        },
        {
            "id": 86,
            "phrase": "content oneself with someone or something",
            "definition": "to be satisfied with (usually less of ) someone or something.  You will just have to learn to content yourself with fewer nice vacations now that you have kids entering college."
        },
        {
            "id": 87,
            "phrase": "A contented mind is a perpetual feast.",
            "definition": "Prov. If you are mentally at peace, you will always feel that you have enough of everything, and will not have to strive to get more. Jill: Lillian doesn’t make very much money, but she seems to be happy all the time. I wonder how she manages that? Jane: A contented mind is a perpetual feast."
        },
        {
            "id": 88,
            "phrase": "continue by doing something",
            "definition": "to keep going by starting to do something else or the next step.  You are doing very well in this piano lesson. Please continue by playing the other sonata.  After the interruption, Wally continued by explaining his position on the trade negotiations."
        },
        {
            "id": 89,
            "phrase": "continue with something",
            "definition": "to keep doing whatever was being done before.  Oh, please continue with your discussion.  Do you mind if I continue with my knitting as we talk?"
        },
        {
            "id": 90,
            "phrase": "contract something out†",
            "definition": "to make an agreement with someone to do a specific amount of work. (Rather than doing it oneself or in one’s own place of business.) _I will contract this out and have it done by consultants.  I contracted out this kind of job the last time."
        },
        {
            "id": 91,
            "phrase": "a contradiction in terms",
            "definition": "a statement containing a seeming contradiction.  A wealthy pauper is a contradiction in terms.  A straight-talking politician may seem to be a contradiction in terms."
        },
        {
            "id": 92,
            "phrase": "contrary to something",
            "definition": "in spite of something that seems to suggest otherwise; regardless of something else.  Contrary to what you might think, I am neat and tidy.  Contrary to public opinion, my uncle is well and healthy."
        },
        {
            "id": 93,
            "phrase": "contrast with someone or something",
            "definition": "1. to be different from someone or something. Bill’s cheery attitude really contrasts with the gloom of his twin brother, Bob. This stiped tie really contrasts with that polka-dot shirt. 2. [for a color or pattern, etc.] to show a marked difference with or complement another. The black one contrasts nicely with the white one."
        },
        {
            "id": 94,
            "phrase": "contribute something (to someone) (for someone or something)",
            "definition": "to donate something to someone for the benefit of someone or something. I hope you will contribute at least a dollar to Mary for Tom’s birthday present. Will you contribute a dollar for Tom to Mary when she comes around? _ Can you contribute a dollar for the gift?"
        },
        {
            "id": 95,
            "phrase": "contribute to something",
            "definition": "1. to donate something to some cause.  Please contribute to the fund for the needy. 2. to add to or exacerbate something.  The dry weather contributed to the failure of the crops."
        },
        {
            "id": 96,
            "phrase": "*control over someone or something",
            "definition": "the power to direct or manage someone or something. (*Typically: get ~; have ~; give someone ~.) _ I have no control over Mary. I can’t stop her from running away. Who gave you control over what goes on in this house?"
        },
        {
            "id": 97,
            "phrase": "convalesce from something",
            "definition": "to recuperate from a disease, operation, or injury.  I spent three weeks in bed convalescing from the f lu.  Donna needed some time to convalesce from her surgery."
        },
        {
            "id": 98,
            "phrase": "converge (up)on someone or something",
            "definition": "to gather near or around someone or something. (Upon is formal and less commonly used than on.) _ Everyone converged on the wounded sailor.  The shoppers converged on the store as it opened for the big sale."
        },
        {
            "id": 99,
            "phrase": "convert someone or something (from something) ((in)to something)",
            "definition": "to change someone or something from something into something else.  Can we convert you from a meat eater into a vegetarian? _Would you be willing to convert your oil furnace to a gas one?"
        },
        {
            "id": 100,
            "phrase": "convey something (from someone or something) (to someone or something)",
            "definition": "to carry or transport something from someone or something to someone, something, or some place. I conveyed the box from the table to the basement.  Please convey every good wish from those of us in the Midwest to those on the East Coast.  Would you convey my blessings to the newlyweds?"
        },
        {
            "id": 101,
            "phrase": "convict someone of something",
            "definition": "to pronounce someone guilty of something.  In the end, they convicted her of theft.  The police wanted to convict Max of the crime."
        },
        {
            "id": 102,
            "phrase": "convince someone of something",
            "definition": "to persuade someone that something is true.  You will never convince me of what you say.  I will probably convince myself of the need to find a better job."
        },
        {
            "id": 103,
            "phrase": "convulse someone with something",
            "definition": "to cause someone to quake or jerk because of pain or emotion. (Can be physical or figurative; see examples.) _ He convulsed with abdominal pain from something he ate. The audience was convulsed with laughter."
        },
        {
            "id": 104,
            "phrase": "cook someone’s goose",
            "definition": "to damage or ruin someone.  I cooked my own goose by not showing up on time.  Sally cooked Bob’s goose for treating her the way he did."
        },
        {
            "id": 105,
            "phrase": "cook (something) out†",
            "definition": "to cook food out of doors.  Shall we cook out some chicken tonight? _ Yes, let’s cook out."
        },
        {
            "id": 106,
            "phrase": "cook something to perfection",
            "definition": "to cook something perfectly.  John cooked my steak to perfection.  The entire dinner was cooked to perfection!"
        },
        {
            "id": 107,
            "phrase": "cook something up†",
            "definition": "to prepare a batch of some kind of food by cooking.  Fred cooked a batch of beans up for the ranch hands.  He cooked up some food for dinner."
        },
        {
            "id": 108,
            "phrase": "cook something up† (with someone)",
            "definition": "to arrange or plan to do something with someone. (The something is usually the word something. See also cook something up.) _ I tried to cook something up with Karen for Tuesday. I want to cook up something with John.  Let’s see if we can cook something up."
        },
        {
            "id": 109,
            "phrase": "cooked up",
            "definition": "contrived. (This is hyphenated before a nominal.) _ The whole thing seems so cooked up.  What a cooked-up story! Of course, you don’t believe it."
        },
        {
            "id": 110,
            "phrase": "cooking with gas",
            "definition": "doing [something] exactly right.  That’s great! Now you’re cooking with gas! _I knew she was finally cooking with gas when she answered all the questions correctly."
        },
        {
            "id": 111,
            "phrase": "*cool as a cucumber",
            "definition": "extremely calm; imperturbable. (*Also: as ~.) _ Joan felt nervous, but she acted as cool as a cucumber.  The politician kept cool as a cucumber throughout the interview with the aggressive journalist."
        },
        {
            "id": 112,
            "phrase": "cool, calm, and collected",
            "definition": "Cliché [of a person] very calm and poised.  James did very well in his TV appearances. He stayed cool, calm, and collected.  The bad news didn’t seem to distress Jane at all. She remained cool, calm, and collected."
        },
        {
            "id": 113,
            "phrase": "Cool it!",
            "definition": "Inf. Calm down!; Take it easy! _ Don’t get mad, Bob. Cool it! _ Cool it, you guys! No fighting around here."
        },
        {
            "id": 114,
            "phrase": "cool one’s heels",
            "definition": "to wait (for someone); to wait for something to happen.  I spent an hour cooling my heels in the waiting room while the doctor saw other patients.  All right, if you can’t behave properly, just sit down here and cool your heels until I call you."
        },
        {
            "id": 115,
            "phrase": "cool someone out†",
            "definition": "Sl. to calm someone; to appease someone.  Cool yourselves out, you people. We gotta be sensible.  The manager appeared and tried to cool out everybody, but that was a waste of time."
        },
        {
            "id": 116,
            "phrase": "cooled out",
            "definition": "Sl. calm; unabashed.  Ted is a really cooled out kind of guy.  When she’s cooled out, she’s great."
        },
        {
            "id": 117,
            "phrase": "cooler heads prevail",
            "definition": "the ideas or influence of less emotional people prevail. (Used of a tense situation.) _ One hopes that cooler heads will prevail and soon everything will calm down."
        },
        {
            "id": 118,
            "phrase": "coop someone or something up†",
            "definition": "to confine someone or something in a small place.  Don’t coop me up. I can’t stand small places. We had to coop up the dogs for a while."
        },
        {
            "id": 119,
            "phrase": "co-opt someone into something",
            "definition": "to convince someone of a differing view to adopt one’s position or philosophy.  They tried to co-opt the students into rioting. There is no point in trying to co-opt them into it. They are too clever."
        },
        {
            "id": 120,
            "phrase": "coordinate something with something",
            "definition": "1. to make something harmonize with something else. I want to coordinate my hat with my shoes.  Is this tie coordinated with my jacket? 2. to synchronize something with something else.  Let us coordinate our actions in this matter.  I think we should coordinate our departure times with that of Fred."
        },
        {
            "id": 121,
            "phrase": "cop a packet",
            "definition": "to become badly injured; to be wounded severely. (Originally military.) _My uncle copped a packet in Normandy.  If you want to cop a packet or worse, just stand up in that shallow trench, son."
        },
        {
            "id": 122,
            "phrase": "cop a plea",
            "definition": "to plead guilty to a lesser charge to avoid a more serious charge or lessen time of imprisonment.  He copped a plea and got off with only two months in the slammer."
        },
        {
            "id": 123,
            "phrase": "cop a squat",
            "definition": "Sl. to sit down.  Hey, man! Come in and cop a squat here next to me. Cop a squat and crack a tube."
        },
        {
            "id": 124,
            "phrase": "cop an attitude",
            "definition": "Sl. to take a negative or opposite attitude about something.  My teenage son copped an attitude when I asked why he seemed to be sneaking around."
        },
        {
            "id": 125,
            "phrase": "cop onto something",
            "definition": "Sl. to understand or become aware of something.  I think I’m copping onto the significance of this at last.  Try to cop onto what I’m saying, Otto."
        },
        {
            "id": 126,
            "phrase": "cop out (on someone)",
            "definition": "Sl. to break one’s promise to someone. Come on! Don’t cop out on me! _ You promised me you would do it! Don’t cop out now!"
        },
        {
            "id": 127,
            "phrase": "cop something from someone or something",
            "definition": "Sl. to steal or swipe something from someone or something.  Some thug copped my watch from me.  Max copped food from a number of stores."
        },
        {
            "id": 128,
            "phrase": "cope with someone or something",
            "definition": "to endure someone or something; to manage to deal with someone or something.  I don’t think I can cope with any more trouble.  I can’t cope with your being late for work anymore."
        },
        {
            "id": 129,
            "phrase": "copulate with someone",
            "definition": "[for someone] to have sexual intercourse with someone.  He said he wanted to copulate with whom?"
        },
        {
            "id": 130,
            "phrase": "copy something down† (from someone or something)",
            "definition": "to copy onto paper what someone says; to copy onto paper what one reads. Please copy this down from Tony. Ted copied down the directions from the invitation.  Jane copied the recipe down from the cookbook."
        },
        {
            "id": 131,
            "phrase": "copy something out† (by hand)",
            "definition": "to copy something in handwriting. I have to copy this out again. I lost the first copy.  Please copy out this article for me."
        },
        {
            "id": 132,
            "phrase": "cordon something off†",
            "definition": "to mark off an area where people should not go with a rope, tape, ribbon, etc.  The police cordoned the scene of the crime off, and we could not even get close.  They cordoned off the area."
        },
        {
            "id": 133,
            "phrase": "cork high and bottle deep",
            "definition": "Rur. very drunk.  By the time the party was over, he was cork high and bottle deep."
        },
        {
            "id": 134,
            "phrase": "cork something up†",
            "definition": "to close and seal a bottle with a cork.  I think we should cork this up and save it for later.  Cork up the bottle for later."
        },
        {
            "id": 135,
            "phrase": "corral someone or something",
            "definition": "to herd someone or something into a corral or other enclosed space.  It took the cowboys two hours to corral the mustangs.  The nursery school teacher herded the kids off the playground and corraled them in the classroom."
        },
        {
            "id": 136,
            "phrase": "correlate something with something",
            "definition": "to match or equate something with something else.  Can you correlate her comment with what she said yesterday? _ The scientist could not correlate the new data with his hypothesis."
        },
        {
            "id": 137,
            "phrase": "correlate with something",
            "definition": "to match or equate with something.  This does not correlate with your earlier story.  What she said yesterday does not correlate with what she is saying today."
        },
        {
            "id": 138,
            "phrase": "correspond to something",
            "definition": "to match up with something; to harmonize with something. This pin on this part corresponds to the receptacle on the other part it fits into."
        },
        {
            "id": 139,
            "phrase": "correspond with someone (about someone or something) correspond (with someone) about someone or something",
            "definition": "to write letters back and forth with someone about someone or something.  I will have to correspond with the manager about that.  I corresponded about this with my brother.  I corresponded with my brother for over a year.  We corresponded about Fred."
        },
        {
            "id": 140,
            "phrase": "cost something out†",
            "definition": "to figure out the total cost of some set of costs or a complex purchase of goods or services.  Give me a minute to cost this out, and I will have an estimate for you.  Do you have time to cost out these specifications this week?"
        },
        {
            "id": 141,
            "phrase": "cotton (on)to someone or something",
            "definition": "Rur. to begin to like or agree to someone or something quickly.  She began to cotton to Fred, despite his country ways.  She cottoned onto Jane’s way of thinking."
        },
        {
            "id": 142,
            "phrase": "cotton up to someone",
            "definition": "Rur. to try to make friends with someone; to flatter or fawn on someone in hopes of favorable treatment.  James set out to cotton up to the parents of his friends.  Just watch her cotton up to the teacher!"
        },
        {
            "id": 143,
            "phrase": "a couch potato",
            "definition": "a lazy individual, addicted to televisionwatching. All he ever does is watch TV; he’s become a real couch potato.  Couch potatoes can tend to become very fat and unhealthy, you know."
        },
        {
            "id": 144,
            "phrase": "couch something in something",
            "definition": "to express something in carefully chosen or deceptive words. He tended to couch his explanations in arcane vocabulary. She couched her words in an overly polite manner."
        },
        {
            "id": 145,
            "phrase": "cough one’s head off",
            "definition": "to cough long and hard.  I had the f lu. I nearly coughed my head off for two days."
        },
        {
            "id": 146,
            "phrase": "cough something out†",
            "definition": "to say something while coughing.  He coughed the words out, but no one could understand him.  He coughed out the name of his assailant."
        },
        {
            "id": 147,
            "phrase": "cough something up†",
            "definition": "1. to get something out of the body by coughing. She coughed some matter up and took some more medicine.  She coughed up phlegm all night. 2. Euph. to vomit something. The dog coughed the rabbit up.  The dog coughed up the food it had eaten. 3. Sl. to produce or present something, such as an amount of money.  You will cough the money up, won’t you? _ You had better cough up what you owe me, if you know what’s good for you."
        },
        {
            "id": 148,
            "phrase": "could do with someone or something",
            "definition": "to want or need someone or something; to benefit from someone or something.  I could do with a nice cool drink right now.  I could do with some help on this project."
        },
        {
            "id": 149,
            "phrase": "could fight a circle-saw (and it a-runnin’)",
            "definition": "Rur. eager to fight.  He was so mad he could fight a circle-saw and it a-runnin’.  She’s a good watchdog. She could fight a circle-saw."
        },
        {
            "id": 150,
            "phrase": "Could I be excused?",
            "definition": "Would you give me permission to leave?; Would you give me permission to leave the table? (Also used with can or may in place of could.) _ Bill: I’m finished, Mom. Could I be excused? Mother: Yes, of course, when you use good manners like that."
        },
        {
            "id": 151,
            "phrase": "(Could I) buy you a drink?",
            "definition": "Could I purchase a drink for you? (An offer by one person—usually in a bar—to buy a drink for another. Then the two will drink together. Also used with can or may in place of could.) _ When Sally and Mary met at the agreed time in the hotel bar, Sally said to Mary, “Could I buy you a drink?”"
        },
        {
            "id": 152,
            "phrase": "Could I call you?",
            "definition": "1. I am too busy to talk to you now. Do you mind if I telephone you later on? (Usually in a business context. Also used with can in place of could. May is too polite here.) _ Sally: I can’t talk to you right now. Could I call you? Tom: Sure, no problem.  Bill: I’ve got to run. Sorry. Can I call you? Bob: No, I’m leaving town. I’ll try to get in touch next week. 2. Do you mind if I call you and ask for another date sometime?; Do you mind if I call you sometime (in order to further our relationship)? (Usually in a romantic context. Also used with can or may in place of could.) _ Mary: I had a marvelous time, Bob. Bob: Me, too. Can I call you? Mary: Sure.  Bob: I had a marvelous time, Mary. May I call you? Mary: Maybe in a week or two. I have a very busy week ahead. I’ll call you, in fact."
        },
        {
            "id": 153,
            "phrase": "Could I come in?",
            "definition": "Do you mind if I enter? (A polite request. Also used with can or may in place of could.) _ Tom (standing in the doorway): Hello, I’m with the Internal Revenue Service. Could I come in? _ Bill: Hi, Tom. What are you doing here? Tom: Could I come in? I have to talk to you. Bill: Sure. Come on in."
        },
        {
            "id": 154,
            "phrase": "Could I get by, please?",
            "definition": "Would you please allow me space to pass by? (Also used with can or may in place of could. May is almost too polite.) _ Poor Bill, trapped at the back of the elevator behind a huge man, kept saying, “Could I get by, please?” _ “Can I get by, please?” Jane said, squeezing between passengers on the crowded bus."
        },
        {
            "id": 155,
            "phrase": "(Could I) get you something (to drink)?",
            "definition": "an expression offering a drink, usually an alcoholic drink. (Compare this with (Could I) buy you a drink? Also used with can or may in place of could.) _ Bill: Hi, Alice! Come on in! Can I get you something to drink? Alice: Just a little soda, if you don’t mind.  Waiter: Get you something to drink? John: No, thanks. I’ll just order dinner now."
        },
        {
            "id": 156,
            "phrase": "(Could I) give you a lift?",
            "definition": "Can I offer you a ride to some place? (Also used with can or may in place of could.) _ Bill stopped his car at the side of the road where Tom stood. “Can I give you a lift?” asked Bill.  John: Well, I’ve got to leave. Alice: Me, too. John: Give you a lift? Alice: Sure. Thanks."
        },
        {
            "id": 157,
            "phrase": "Could I have someone call you?",
            "definition": "Could I take a message so your call can be returned? (A question asked by someone who answers the telephone when the person the caller is seeking is not available. The someone can be a person’s name or a pronoun, or even the word someone. Also used with can or may in place of could.) _ Tom: Bill’s not here now. Could I have him call you? Bob: Yeah. Ask him to leave a message on my machine. Tom: Sure.  “Could I have her call you?” asked Mrs. Wilson’s secretary."
        },
        {
            "id": 158,
            "phrase": "couldn’t be happier",
            "definition": "totally happy. They both couldn’t be happier since they got married."
        },
        {
            "id": 159,
            "phrase": "could(n’t) care less",
            "definition": "[one is] unable to care at all; it does not matter at all.  John couldn’t care less whether he goes to the party or not.  I could care less if I live or die."
        },
        {
            "id": 160,
            "phrase": "couldn’t hit a bull in the ass with a bass fiddle",
            "definition": "Rur. unable to aim; very clumsy. (Jocular. Use with caution.) _ Tom: Is Jane a good shot? Charlie: She couldn’t hit a bull in the ass with a bass fiddle."
        },
        {
            "id": 161,
            "phrase": "couldn’t pour water out of a boot (if there was instructions on the heel)",
            "definition": "Rur. stupid.  I won’t say Jim is dumb, but he couldn’t pour water out of a boot.  Jane couldn’t pour water out of a boot if there was instructions on the heel—and she’s the smartest one in her family!"
        },
        {
            "id": 162,
            "phrase": "Councils of war never fight.",
            "definition": "Prov. A group of people charged with crucial decisions often cannot act decisively.  We tried to convince the boss not to form a committee, but to decide himself. We knew that councils of war never fight."
        },
        {
            "id": 163,
            "phrase": "counsel someone about something",
            "definition": "to give advice to someone about something.  Will you counsel George about which tires to buy?"
        },
        {
            "id": 164,
            "phrase": "counsel someone against something",
            "definition": "to advise someone against doing something.  The lawyer counseled her against suing the government.  I was counseled against going for a walk alone at night."
        },
        {
            "id": 165,
            "phrase": "count against someone",
            "definition": "[for something] to be held against someone; [for something] to weigh against someone.  I hope this mistake doesn’t count against me. Don’t worry, it won’t count against you at all."
        },
        {
            "id": 166,
            "phrase": "count down",
            "definition": "to count backwards to an event that will start when zero is reached.  The project manager was counting down—getting ready for the launch of the rocket.  I can still hear the captain counting down: “Five, four, three, two, one, zero, blast off!”"
        },
        {
            "id": 167,
            "phrase": "count for something",
            "definition": "to be valid for something; to be worth something.  Doesn’t all my work count for anything? _ Your positive attitude counts for a lot as far as I’m concerned."
        },
        {
            "id": 168,
            "phrase": "count from something (up) to something",
            "definition": "to say or list the numbers from one number to some other number.  Now, count from 100 up to 300 by threes.  Timmy can count from 1 to 40."
        },
        {
            "id": 169,
            "phrase": "count off",
            "definition": "[for a series of people, one by one] to say aloud the next number in a fixed sequence.  The soldiers counted off by threes. The sergeant told them to count off."
        },
        {
            "id": 170,
            "phrase": "count on someone or something",
            "definition": "to rely on someone or something; to depend on someone or something.  We can count on Bill to get the job done.  Can I count on this car to start every morning of the year?"
        },
        {
            "id": 171,
            "phrase": "count one’s chickens before they hatch",
            "definition": "to plan how to utilize good results of something before those results have occurred. (The same as Don’t count your chickens before they are hatched.) _ You may be disappointed if you count your chickens before they hatch."
        },
        {
            "id": 172,
            "phrase": "count someone among something",
            "definition": "to consider someone as a particular type of person or part of a particular group.  I count her among my closest friends.  Rachel counted herself among the luckiest people alive."
        },
        {
            "id": 173,
            "phrase": "count someone or something as something",
            "definition": "to consider someone to be a particular type of person.  I count Todd as one of the possible candidates. I count this entry as a definite prizewinner."
        },
        {
            "id": 174,
            "phrase": "count someone or something off†",
            "definition": "to count people or things, to see if they are all there.  Let’s count them off to see who’s missing.  Count off each person, one by one.  I counted each one off."
        },
        {
            "id": 175,
            "phrase": "count someone or something up†",
            "definition": "to count things or people to see how many there are.  Let’s count them up and see how many we have. I counted all the guests up, and there are too many to seat.  Please count up all these books and tell me how many there are."
        },
        {
            "id": 176,
            "phrase": "count someone out (for something)",
            "definition": "to exclude someone from something.  Please count me out for the party next Saturday. I have other plans. You should count the whole family out. We are going to the beach for the weekend."
        },
        {
            "id": 177,
            "phrase": "count something against someone",
            "definition": "to regard something in a negative way against someone.  I’m afraid we must count this against you as an unexcused absence.  Don’t count that last strike against the batter."
        },
        {
            "id": 178,
            "phrase": "count something as something",
            "definition": "to treat or think of something as being a certain thing.  I count this as a win.  Did you count that one as a fair ball?"
        },
        {
            "id": 179,
            "phrase": "count something in†",
            "definition": "to include something in a count of something.  Did you count the tall ones in? _ Did you count in the tall ones in the corner?"
        },
        {
            "id": 180,
            "phrase": "count something out†",
            "definition": "1. to disregard something; to eliminate a possibility.  We’ll have to count out the possibility of his being elected.  Never count it out. It can always happen. 2. to give out things, counting them one by one.  She counted the cookies out, one by one.  She counted out the cookies to each child."
        },
        {
            "id": 181,
            "phrase": "count up to something",
            "definition": "1. to say or list the numbers from zero on up to a certain number.  Can you count up to a million? _ I can count up to any number you name, and I will do it if you will stay around to listen. 2. to equal a specified total; to add up to something.  That counts up to a lot. The money we earned today counts up to just enough to pay for the electricity we used today."
        },
        {
            "id": 182,
            "phrase": "count (up)on someone or something",
            "definition": "to rely on someone or something. (Upon is formal and less commonly used than on.) _Can I count upon you to do the job? _You can count on me."
        },
        {
            "id": 183,
            "phrase": "count with someone",
            "definition": "to be important to someone.  Your cooperation really counts with me.  All my efforts do not count with her."
        },
        {
            "id": 184,
            "phrase": "counter someone or something with something",
            "definition": "to refute someone or something with something.  She countered our evidence with an eyewitness. I countered Nancy with a better argument."
        },
        {
            "id": 185,
            "phrase": "counter with something",
            "definition": "to say something in refutation of something; to strike back with something.  Aren’t you going to counter with an argument? _ He countered with a punch in the jaw."
        },
        {
            "id": 186,
            "phrase": "a country mile",
            "definition": "Rur. a great distance. The batter knocked that ball a country mile.  I had to walk a country mile to the next gas station."
        },
        {
            "id": 187,
            "phrase": "a couple of",
            "definition": "two; two or three; a few; some; not many.  Bill grabbed a couple of beers from the refrigerator. I hung a couple of pictures on the wall."
        },
        {
            "id": 188,
            "phrase": "couple someone with someone",
            "definition": "to join one person with another to make a pair. I coupled Todd with Amy for the dinner party."
        },
        {
            "id": 189,
            "phrase": "couple something together",
            "definition": "to attach two parts of something together.  Couple these two cars together and put them on track seven.  You have to couple the ends of the two hoses together before you turn on the water."
        },
        {
            "id": 190,
            "phrase": "couple something with something",
            "definition": "to join one thing with another to make a pair. We coupled the budget issue with the staffing issue for our agenda."
        },
        {
            "id": 191,
            "phrase": "couple up (with someone)",
            "definition": "[for one person] to join another person to form a pair.  I decided to couple up with Larry.  Larry and I coupled up with each other.  By midnight, they all had coupled up and were dancing."
        },
        {
            "id": 192,
            "phrase": "couple with someone",
            "definition": "Euph. to have sexual intercourse with someone.  They coupled with each other in a night of passion."
        },
        {
            "id": 193,
            "phrase": "couple with something",
            "definition": "to connect or join to something.  This railroad car will couple with the engine.  These cars did not couple with the others properly, and there was almost an accident."
        },
        {
            "id": 194,
            "phrase": "course of action",
            "definition": "the procedures or sequence of actions that someone will follow to accomplish a goal.  I plan to follow a course of action that will produce the best results.  The board planned a course of action that would reduce costs and eliminate employees."
        },
        {
            "id": 195,
            "phrase": "The course of true love never did run smooth.",
            "definition": "Prov. People in love with each other often have to overcome difficulties in order to be together. (From Shakespeare’s play, A Midsummer Night’s Dream.) _ Jill: What am I going to do? My boyfriend’s job is transferring him to Texas, and I have to stay here. Jane: The course of true love never did run smooth."
        },
        {
            "id": 196,
            "phrase": "course through something",
            "definition": "to run, race, or flow rapidly through something.  I believe, sometimes, that ice water courses through your veins. No, perfectly red blood courses through them."
        },
        {
            "id": 197,
            "phrase": "cover a lot of ground",
            "definition": "to travel over a great distance; to investigate a wide expanse of land.  The prospectors covered a lot of ground, looking for gold.  My car can cover a lot of ground in one day."
        },
        {
            "id": 198,
            "phrase": "cover for someone",
            "definition": "1. to make excuses for someone; to conceal someone’s errors. If I miss class, please cover for me.  If you’re late, I’ll cover for you. 2. to handle someone else’s work. Dr. Johnson’s partner agreed to cover for him during his vacation."
        },
        {
            "id": 199,
            "phrase": "cover someone in something",
            "definition": "to place something over someone or something to serve as clothing or concealment.  The designer had covered her in see-through fabric that was very revealing."
        },
        {
            "id": 200,
            "phrase": "cover someone or something against something",
            "definition": "1. to cover someone or something as protection against something.  You should cover your ears against the cold.  I covered little Jimmy against the night’s drafts.  I covered myself against the driving rain. 2. Rur. [for an insurer] to provide insurance on someone or something against some peril.  The insurance policy covered us against losses.  This policy covers your car against theft."
        },
        {
            "id": 201,
            "phrase": "cover someone or something for something",
            "definition": "[for an insurer] to provide protection to someone or something for a particular price.  One company will cover the car for about a thousand dollars.  This policy covers you for a few dollars a week."
        },
        {
            "id": 202,
            "phrase": "cover someone or something up†",
            "definition": "to place something on someone or something for protection or concealment.  Cover the pie up, so Terry won’t see it.  Cover up Jimmy so he doesn’t get cold."
        },
        {
            "id": 203,
            "phrase": "cover someone’s tracks (up)†",
            "definition": "to conceal one’s trail; to conceal one’s past activities.  She was able to cover her tracks up so that they couldn’t pin the charges on her.  It’s easy to cover up your tracks when the investigators botch their job.  The robber failed to cover his tracks."
        },
        {
            "id": 204,
            "phrase": "cover something up†",
            "definition": "to place some sort of cover on something.  Please cover up that mess with a cloth.  Cover it up."
        },
        {
            "id": 205,
            "phrase": "cover the territory",
            "definition": "to travel or deal with a specific large area. The sales manager was responsible for all of the eastern states and personally covered the territory twice each year."
        },
        {
            "id": 206,
            "phrase": "cover the waterfront",
            "definition": "to deal with every detail concerning a specific topic.  Her talk really covered the waterfront. By the time she finished, I knew much more than I wanted to know."
        },
        {
            "id": 207,
            "phrase": "cover (up) for someone",
            "definition": "to conceal someone’s wrongdoing by lying or concealing the evidence of wrongdoing.  Are you covering up for the person who committed the crime? _ I wouldn’t cover for anyone."
        },
        {
            "id": 208,
            "phrase": "cow paste",
            "definition": "Rur. butter.  Would you kindly pass the cow paste?"
        },
        {
            "id": 209,
            "phrase": "cow someone into something",
            "definition": "to intimidate someone into doing something through the use of guilt or shame. You can’t cow me into doing it. Those tricks don’t work on me.  You can cow Wally into almost anything."
        },
        {
            "id": 210,
            "phrase": "Cowards die many times before their death(s).",
            "definition": "Prov. Cowards are often afraid that they are going to die, so that they often feel what it is like to die, while brave people only feel the fear of death when they are really about to die. (From Shakespeare’s play, Julius Caesar.) _ Every time Nina went out alone, she was always afraid. Cowards die many times before their deaths."
        },
        {
            "id": 211,
            "phrase": "cower (away) from someone or something",
            "definition": "to pull away from someone or something in fear. The coyote cowered away from the fire."
        },
        {
            "id": 212,
            "phrase": "cower from something",
            "definition": "to draw back from the fear of something.  The wolves cowered from the f lames.  Some excited hyenas cowered from the lions as they passed by."
        },
        {
            "id": 213,
            "phrase": "cozy up (to someone)",
            "definition": "to snuggle up to someone as if to get warm.  The children cozied up to their mother. They cozied up to each other."
        },
        {
            "id": 214,
            "phrase": "crack a book",
            "definition": "to open a book to study. (Usually used with a negative.) _ I never cracked a book and still passed the course.  Sally didn’t crack a book all semester."
        },
        {
            "id": 215,
            "phrase": "crack a bottle open†",
            "definition": "to open a bottle of liquor.  Let’s crack open a bottle and celebrate.  He cracked a bottle open and poured a little for everyone to try."
        },
        {
            "id": 216,
            "phrase": "crack a joke",
            "definition": "to tell a joke.  She’s never serious. She’s always cracking jokes.  Every time Tom cracked a joke, his buddies broke up laughing."
        },
        {
            "id": 217,
            "phrase": "crack a smile",
            "definition": "to grin; to smile. I was tellin’ my best jokes, but Jim never cracked a smile.  She looked surprised, and then cracked a big, beautiful smile."
        },
        {
            "id": 218,
            "phrase": "crack down (on someone or something)",
            "definition": "to put limits on someone or something; to become strict about enforcing rules about someone or something.  The police cracked down on the street gangs.  They cracked down once last year too."
        },
        {
            "id": 219,
            "phrase": "crack open",
            "definition": "[for something brittle] to break or split open.  The egg cracked open and a chick worked its way out.  The side of the mountain cracked open and molten lava flowed out."
        },
        {
            "id": 220,
            "phrase": "crack some suds",
            "definition": "Sl. to drink some beer.  Let’s go out tonight and crack some suds.  The guys wanted to watch the game and crack some suds."
        },
        {
            "id": 221,
            "phrase": "crack someone or something up†",
            "definition": "to damage someone or something.  Who cracked my car up? _ Who cracked up my car? Who was driving? _ The accident cracked him up a little."
        },
        {
            "id": 222,
            "phrase": "crack someone up†",
            "definition": "to make someone laugh very hard; to make someone break out laughing.  You and your jokes really crack me up.  That comedian really knows how to crack up an audience."
        },
        {
            "id": 223,
            "phrase": "crack something up†",
            "definition": "to crash something; to destroy something (in an accident).  The driver cracked the car up in an accident.  The pilot cracked up the plane."
        },
        {
            "id": 224,
            "phrase": "crack something (wide) open",
            "definition": "to crack or split something.  An incredible eruption cracked the volcano wide open."
        },
        {
            "id": 225,
            "phrase": "crack under the strain",
            "definition": "to have a mental or emotional collapse because of continued work or stress. He worked 80-hour weeks for a month and finally cracked under the strain."
        },
        {
            "id": 226,
            "phrase": "crack up",
            "definition": "1. to have a wreck.  The plane cracked up and killed two of the passengers. Whose car cracked up on the expressway? 2. to break out in laughter. The whole audience cracked up.  I knew I would crack up during the love scene. 3. Sl. to have a mental or emotional breakdown.  The poor guy cracked up. It was too much for him.  You would crack up, too, if you had been through all he went through. 4. an accident; a wreck. (Usually crack-up.) _ There was a terrible crack-up on the expressway.  There were four cars in the crack-up."
        },
        {
            "id": 227,
            "phrase": "cracked",
            "definition": "solved; understood. (*Typically: get something ~; have something ~.) _ I’ve got the mystery cracked! _ After I get it cracked, the rest’ll be easy."
        },
        {
            "id": 228,
            "phrase": "cram someone or something with someone or something",
            "definition": "to fill someone or something by stuffing with someone or something.  You won’t be happy till you cram all of us with cake and ice cream.  He crammed his drawer with his socks."
        },
        {
            "id": 229,
            "phrase": "cramp someone’s style",
            "definition": "to limit someone in some way. I hope this doesn’t cramp your style, but could you please not hum while you work? _To ask Bob to keep regular hours would really be cramping his style."
        },
        {
            "id": 230,
            "phrase": "crank someone up†",
            "definition": "to motivate; to get someone started.  See if you can crank up your brother and get him going on time today.  Some mornings, I can’t crank myself up enough to get to work on time."
        },
        {
            "id": 231,
            "phrase": "crank something out†",
            "definition": "to produce something quickly or carelessly; to make something in a casual and mechanical way. John can crank a lot of work out in a single day.  The automated production line could really crank out parts, but the quality was shoddy."
        },
        {
            "id": 232,
            "phrase": "crank something up†",
            "definition": "1. to get a machine or a process started. (Alludes to turning the starting crank of an early automobile.) _ Please crank the machinery so the workers can start working. Let’s crank up the drill and make a few holes here in the wall. 2. to increase the volume of an electronic device. He cranked it up a little more and CRACK, there went both speakers! _Kelly cranked up his stereo until we were nearly deafened."
        },
        {
            "id": 233,
            "phrase": "crap out",
            "definition": "Sl. to die.  Max almost crapped out from the beating he took. The old dog just crapped out. What shall we do?"
        },
        {
            "id": 234,
            "phrase": "crap out (of something)",
            "definition": "to lose on a roll of the dice in a dice game called craps and leave the game and the other players.  Wally crapped out of the game early in the evening."
        },
        {
            "id": 235,
            "phrase": "crap out (of something) (on someone)",
            "definition": "1. Sl. to withdraw from doing something with someone, unexpectedly, perhaps because of fear or cowardice. Are you going to crap out of this game on me? 2. Sl. to quit doing something with someone or withdraw because of exhaustion. Don’t crap out of this on me! Pull yourself together! _ Don’t crap out on me!"
        },
        {
            "id": 236,
            "phrase": "crash and burn",
            "definition": "[for a plane or car] to crash and burst into flames.  The small plane crashed and burned just after it took off."
        },
        {
            "id": 237,
            "phrase": "crash around",
            "definition": "to move around in a noisy way _ Stop crashing around. I’m trying to study. The people upstairs were crashing around and I couldn’t get any sleep."
        },
        {
            "id": 238,
            "phrase": "a crash course in something",
            "definition": "a short and intense training course in something.  I took a crash course in ballroom dancing so we wouldn’t look stupid on the dance f loor."
        },
        {
            "id": 239,
            "phrase": "crash into someone or something",
            "definition": "to bump or ram into someone or something accidentally or roughly. The student crashed into the door when it opened suddenly.  The car crashed into a bus."
        },
        {
            "id": 240,
            "phrase": "crash out (of some place)",
            "definition": "to break out of some place, such as a prison. Max and Lefty crashed out of the state prison last week, but they were captured.  They crashed out at midnight."
        },
        {
            "id": 241,
            "phrase": "crash something together",
            "definition": "to bring things together with great force, making a loud noise.  Fred crashed the cymbals together and the sound could have wakened the dead.  Don’t crash those pans together. It drives me crazy."
        },
        {
            "id": 242,
            "phrase": "crash through something",
            "definition": "to break through something forcefully.  The cows crashed right through the fence."
        },
        {
            "id": 243,
            "phrase": "crash to the floor",
            "definition": "to fall onto the floor and make a crashing sound.  The tray of dishes crashed to the f loor.  Everything crashed to the f loor and was broken."
        },
        {
            "id": 244,
            "phrase": "crash together",
            "definition": "to ram or move together with great force.  The two cars crashed together, making a loud noise.  The ships crashed together, opening a gaping hole in the side of one of them."
        },
        {
            "id": 245,
            "phrase": "crash with someone",
            "definition": "Sl. to spend the night at someone’s place.  I don’t need a hotel room. I can crash with Tom.  There is no room for you to crash with me."
        },
        {
            "id": 246,
            "phrase": "crave to do something",
            "definition": "Rur. to want to do something eagerly.  I don’t crave to ride the roller coaster, thank you.  The kids have been craving to see that movie for weeks."
        },
        {
            "id": 247,
            "phrase": "crawl back to someone",
            "definition": "to go back to someone humbly, perhaps asking for forgiveness.  I knew you would come crawling back to me! _ I wouldn’t crawl back to him for all the tea in China."
        },
        {
            "id": 248,
            "phrase": "crawl in(to something)",
            "definition": "to enter a place crawling or creeping. The cat crawled into the room and meowed.  The baby crawled in and tried to stand up."
        },
        {
            "id": 249,
            "phrase": "crawl out",
            "definition": "to get out by crawling. The bears finally woke up and crawled out.  In the cave, I injured my leg and I had to crawl out."
        }
    ]
}