{
    "dictionary": [
        {
            "id": 0,
            "phrase": "dummy up",
            "definition": "Sl. to refuse to talk.  Jill dummied up when they got her into the station. John dummied up right away when the police arrived."
        },
        {
            "id": 1,
            "phrase": "dump something on someone",
            "definition": "to pour out one’s troubles to someone. She dumped all her grief on her friend, Sally. I wish you wouldn’t dump all your problems on me."
        },
        {
            "id": 2,
            "phrase": "dumped on",
            "definition": "1. snowed on.  The entire Midwest was dumped on with about ten inches of snow.  Our town really got dumped on last night. 2. Sl. maligned; abused. I really feel dumped on by all the bad reviews in the press.  The jerk who designed this stupid congested stairway hasn’t been dumped on enough."
        },
        {
            "id": 3,
            "phrase": "dun someone for something",
            "definition": "to harass someone to pay a bill or deliver something.  If you don’t pay the bill, they will dun you for it day and night.  My job is to dun people for payment of their bills."
        },
        {
            "id": 4,
            "phrase": "dust someone off†",
            "definition": "Sl. to punch or beat someone.  We dusted them off one by one.  We had to dust off all those big guys."
        },
        {
            "id": 5,
            "phrase": "dust someone or something off†",
            "definition": "to wipe or brush the dust off someone or something.  Dust this vase off and put it on the shelf.  Please dust off this vase."
        },
        {
            "id": 6,
            "phrase": "dust someone’s pants",
            "definition": "Sl. to spank someone, usually a child.  My dad will dust my pants if he hears about this.  I’m too old for somebody to dust my pants."
        },
        {
            "id": 7,
            "phrase": "dust something out†",
            "definition": "to brush the dust out of something. Dust this cabinet out and put the china back in. Please dust out this cabinet."
        },
        {
            "id": 8,
            "phrase": "Dutch auction",
            "definition": "an auction or sale that starts off with a high asking price that is then reduced until a buyer is found. (Viewed by some as insulting to the Dutch.) _ Dutch auctions are rare—most auctioneers start with a lower price than they hope to obtain. My real estate agent advised me to ask a reasonable price for my house rather than get involved with a Dutch auction."
        },
        {
            "id": 9,
            "phrase": "Dutch courage",
            "definition": "unusual or artificial courage arising from the influence of alcohol. (Viewed by some as insulting to the Dutch.) _ It was Dutch courage that made the football fan attack the policeman.  It will take a bit of Dutch courage to make an after-dinner speech."
        },
        {
            "id": 10,
            "phrase": "Dutch treat",
            "definition": "a social occasion where one pays for oneself. (Viewed by some as insulting to the Dutch.) _ “It’s nice of you to ask me out to dinner,” she said, “but could we make it a Dutch treat?” _ The office outing is always a Dutch treat."
        },
        {
            "id": 11,
            "phrase": "Dutch uncle",
            "definition": "a man who gives frank and direct advice to someone. (In the way an uncle might, but not a real relative.) _ I would not have to lecture you like a Dutch uncle if you were not so extravagant. He acts more like a Dutch uncle than a husband. He’s forever telling her what to do in public."
        },
        {
            "id": 12,
            "phrase": "duty bound (to do something)",
            "definition": "forced by a sense of duty and honor to do something. Good evening, madam. I’m duty bound to inform you that we have arrested your husband.  No one made me say that. I was duty bound."
        },
        {
            "id": 13,
            "phrase": "dwell (up)on someone or something",
            "definition": "to remain on the [important] subject of someone or something for a long time. (Upon is formal and less commonly used than on.) _ I can’t dwell upon this subject anymore.  There is no need to dwell on Sarah further."
        },
        {
            "id": 14,
            "phrase": "dwell (up)on something",
            "definition": "to live on something, such as the planet Earth. (Upon is more formal than on.) _This is the largest turtle that dwells upon the earth.  Many creatures dwell on this earth."
        },
        {
            "id": 15,
            "phrase": "dyed-in-the-wool",
            "definition": "[of someone] permanent or extreme.  My uncle was a dyed-in-the-wool farmer. He wouldn’t change for anything.  Sally is a dyed-in-the-wool socialist."
        },
        {
            "id": 16,
            "phrase": "dying to do something",
            "definition": "very eager to do something.  I’m just dying to go sailing in your new boat. After a long hot day like this one, I’m just dying for a cool drink."
        },
        {
            "id": 17,
            "phrase": "dying to know (something)",
            "definition": "very eager to know something.  I’m just dying to know how your weekend went."
        },
        {
            "id": 18,
            "phrase": "eager beaver",
            "definition": "someone who is very enthusiastic; someone who works very hard.  New volunteers are always eager beavers. The young assistant gets to work very early. She’s a real eager beaver."
        },
        {
            "id": 19,
            "phrase": "eagle eye",
            "definition": "acute eyesight; an intently watchful eye. (From the sharp eyesight of the eagle.) _The students wrote their essays under the eagle eye of the headmaster. The umpire kept his eagle eye on the tennis match."
        },
        {
            "id": 20,
            "phrase": "*an earful",
            "definition": "a great amount of discussion, criticism, gossip, or complaint. (*Typically: get ~; have ~; give someone ~.) _ She was really mad about something, and I sure got an earful.  Sue was standing around the corner while Jim and Mary were arguing and got an earful."
        },
        {
            "id": 21,
            "phrase": "early bird",
            "definition": "1. Fig. a person who gets up early.  I never miss sunrise. I’m an early bird.  The early birds were up at dawn and ready for breakfast. 2. Fig. a person who arrives early.  The early birds get the best seats.  There were some early birds who arrived before the party was set to start. 3. Fig. having to do with early arrival. (Usually hyphenated.) _Early-bird arrivals will be given a free cup of coffee.  The early-bird special this week is a free sixpack of iced tea for the first 100 visitors."
        },
        {
            "id": 22,
            "phrase": "The early bird catches the worm.",
            "definition": "Prov. If you wake up and get to work early, you will succeed. (Sometimes used to remark that someone is awake and working surprisingly early, as in the first example.) _ Fred: What are you doing in the office at 7:30 a.m.? Jane: The early bird catches the worm.  I didn’t expect to see you studying at the library at this hour of the morning. The early bird catches the worm, huh?"
        },
        {
            "id": 23,
            "phrase": "early on",
            "definition": "early; at an early stage. We recognized the problem early on, but we waited too long to do something about it.  This doesn’t surprise me. I knew about it early on."
        },
        {
            "id": 24,
            "phrase": "Early to bed and early to rise, makes a man healthy, wealthy, and wise.",
            "definition": "Prov. Going to bed early and waking up early is good for success.  Grandmother: I don’t think it’s good for you to be staying out so late, dear. Early to bed and early to rise— Grandson: Makes a man healthy, wealthy, and wise. Yeah, Grandma, I know. Host: Don’t leave so soon! The party’s just beginning. Guest: It’s past my bedtime, I’m afraid. Host: Early to bed, early to rise, huh?"
        },
        {
            "id": 25,
            "phrase": "earmark something for someone or something",
            "definition": "to reserve something for someone or something.  Tom earmarked the best of the steaks for his special guests.  I have earmarked this chair for the family room."
        },
        {
            "id": 26,
            "phrase": "earn one’s keep",
            "definition": "to help out with chores in return for food and a place to live; to earn one’s pay by doing what is expected.  I earn my keep at college by shoveling snow in the winter.  Tom hardly earns his keep around here. He should be fired."
        },
        {
            "id": 27,
            "phrase": "earn one’s spurs",
            "definition": "to prove oneself.  After that rodeo, all the cowboys agreed that Sally had earned her spurs.  He felt that he had earned his spurs when he received his Ph.D."
        },
        {
            "id": 28,
            "phrase": "ease away (from someone or something)",
            "definition": "to pull away from someone or something slowly and carefully.  The great ship eased away from the pier. The ship eased away slowly."
        },
        {
            "id": 29,
            "phrase": "ease back (on something)",
            "definition": "to move something back slowly and carefully. (Usually refers to a throttle or some other control on an airplane or other vehicle.) _Ann eased back on the throttle and slowed down.  Please ease back on the volume control a little. You will deafen us."
        },
        {
            "id": 30,
            "phrase": "ease off",
            "definition": "[for something] to diminish.  The rain began to ease off.  The storm seems to have eased off a little."
        },
        {
            "id": 31,
            "phrase": "ease off (from someone or something)",
            "definition": "to move away from someone or something, slowly and carefully.  Ease off carefully from the deer, so you don’t frighten it.  Ease off quietly."
        },
        {
            "id": 32,
            "phrase": "ease (on) out (of something)",
            "definition": "to continue moving out of something, slowly and carefully. I was able to ease on out of the parking space, but only with difficulty.  I looked both ways and eased on out."
        },
        {
            "id": 33,
            "phrase": "ease someone (on) out (of something)",
            "definition": "to help someone continue to get out of something.  We helped ease her on out of the car. With care, we eased her on out.  After taking a look around, Tom eased himself out of the opening."
        },
        {
            "id": 34,
            "phrase": "ease someone or something along",
            "definition": "to help someone or something to move along, very carefully.  Just ease the piano along little by little.  She eased the shy child along."
        },
        {
            "id": 35,
            "phrase": "ease someone or something down† (from something)",
            "definition": "to bring someone or something downward from something gently.  The rescuers eased the injured hiker down from the mountain.  They eased down the hiker carefully."
        },
        {
            "id": 36,
            "phrase": "easier said than done",
            "definition": "Cliché said of a task that is easier to talk about than to do.  Yes, we must find a cure for cancer, but it’s easier said than done.  Finding a good job is easier said than done."
        },
        {
            "id": 37,
            "phrase": "East is East and West is West (and never the twain shall meet).",
            "definition": "Prov. Two things are so different that they can never come together or agree. (From Rudyard Kipling’s poem, “The Ballad of East and West.”) _ I had hoped that Andrew and I could be friends in spite of our political differences. But, in our case, I’m afraid that East is East and West is West."
        },
        {
            "id": 38,
            "phrase": "easy come, easy go",
            "definition": "Cliché said to explain the loss of something that required only a small amount of effort to acquire in the first place.  Ann found twenty dollars in the morning and spent it foolishly at noon. “Easy come, easy go,” she said. John spends his money as fast as he can earn it. With John it’s easy come, easy go."
        },
        {
            "id": 39,
            "phrase": "Easy does it.",
            "definition": "1. Move slowly and carefully.  Bill (holding one end of a large crate): It’s really tight in this doorway. Bob (holding the other end): Easy does it. Take your time.  Nurse (holding Sue’s arm): Easy does it. These first few steps are the hardest. Sue: I didn’t know I was so weak. 2. Calm down.; Don’t lose your temper.  John: I’m so mad I could scream. Bob: Easy does it, John. No need to get so worked up.  Sue (frantic): Where is my camera? My passport is gone too! Fred: Easy does it, Sue. I think you have someone else’s purse."
        },
        {
            "id": 40,
            "phrase": "easy pickings",
            "definition": "[of things] easy to get or steal; [of people] easy to get or persuade.  The pickpockets found lots of easy pickings at the state fair."
        },
        {
            "id": 41,
            "phrase": "Easy, there!",
            "definition": "Calm down! _ “Easy, there!” said Arizona Slim, patting his horse’s neck. Easy, there! Before you start yellin’, tell me what you’re yellin’ about."
        },
        {
            "id": 42,
            "phrase": "easy to come by",
            "definition": "easily found; easily purchased; readily available. Please be careful with that phonograph record. It was not easy to come by. A good dictionary is very easy to come by."
        },
        {
            "id": 43,
            "phrase": "eat (away) at someone",
            "definition": "[for a problem] to trouble someone constantly.  The nasty situation at work began to eat away at me.  Nagging worries ate at me day and night."
        },
        {
            "id": 44,
            "phrase": "eat (away) at something",
            "definition": "to erode something.  The acid ate away at the metal f loor. Fingers have a mild acid that eats at the metal of the door handle."
        },
        {
            "id": 45,
            "phrase": "eat crow",
            "definition": "1. Fig. to display total humility, especially when shown to be wrong.  Well, it looks like I was wrong, and I’m going to have to eat crow.  I’ll be eating crow if I’m not shown to be right. 2. Fig. to be shamed; to admit that one was wrong.  When it became clear that they had arrested the wrong person, the police had to eat crow.  Mary talked to Joe as if he was an uneducated idiot, till she found out he was a college professor. That made her eat crow."
        },
        {
            "id": 46,
            "phrase": "Eat, drink, and be merry, for tomorrow we die.",
            "definition": "Prov. Enjoy yourself whenever you can, because you may die soon. (“Eat, drink, and be merry” by itself is simply a way of encouraging people to enjoy themselves.) _ Fred: No cake for me, thank you. I’m on a diet. Jane: But, Fred, this is a birthday party. Eat, drink, and be merry. Natasha encouraged all her guests to eat, drink, and be merry, for tomorrow we die."
        },
        {
            "id": 47,
            "phrase": "eat humble pie",
            "definition": "to act very humble when one is shown to be wrong.  I think I’m right, but if I’m wrong, I’ll eat humble pie.  You think you’re so smart. I hope you have to eat humble pie."
        },
        {
            "id": 48,
            "phrase": "eat in",
            "definition": "to eat a meal at home.  I really don’t want to eat in tonight.  Let’s eat in. I’m tired."
        },
        {
            "id": 49,
            "phrase": "eat in(to something)",
            "definition": "to erode into something; to etch something. The acidic water ate into the rocks on the shore.  The acid ate in and weakened the structure."
        },
        {
            "id": 50,
            "phrase": "eat like a bird",
            "definition": "to eat only small amounts of food; to peck at one’s food.  Jane is very slim because she eats like a bird.  Bill is trying to lose weight by eating like a bird."
        },
        {
            "id": 51,
            "phrase": "eat like a horse",
            "definition": "to eat large amounts of food.  No wonder he’s so fat. He eats like a horse.  John works like a horse and eats like a horse, so he never gets fat."
        },
        {
            "id": 52,
            "phrase": "Eat my shorts!",
            "definition": "Sl. Leave me alone!; Nonsense!; Drop dead! _You’re nuts! Eat my shorts! _You think I’m going to clean up after you? Eat my shorts!"
        },
        {
            "id": 53,
            "phrase": "eat one’s fill",
            "definition": "to eat as much as one can hold; to eat as much as one wants. Please eat your fill. There’s plenty for everyone."
        },
        {
            "id": 54,
            "phrase": "eat one’s hat",
            "definition": "a phrase telling the kind of thing that one would do if a very unlikely event really happens.  If we get there on time, I’ll eat my hat. I’ll eat my hat if you get a raise.  He said he’d eat his hat if she got elected."
        },
        {
            "id": 55,
            "phrase": "eat one’s heart out",
            "definition": "1. Fig. to grieve; to be sorrowful. (Fixed order.) _She has been eating her heart out over that jerk ever since he ran away with Sally.  Don’t eat your heart out. You really didn’t like him that much, did you? 2. Fig. to suffer from envy or jealousy. (Usually a command.) _ Yeah, the reward money is all mine. Eat your heart out! _ Eat your heart out! I won it fair and square."
        },
        {
            "id": 56,
            "phrase": "eat one’s words",
            "definition": "to have to take back one’s statements; to confess that one’s predictions were wrong.  You shouldn’t say that to me. I’ll make you eat your words.  John was wrong about the election and had to eat his words."
        },
        {
            "id": 57,
            "phrase": "eat out",
            "definition": "to eat a meal away from home, as at a restaurant.  I just love to eat out every now and then.  Let’s eat out tonight. I’m tired."
        },
        {
            "id": 58,
            "phrase": "eat out of someone’s hand",
            "definition": "to do exactly as someone says; to grovel to someone.  I’ve got her eating out of my hand. She’ll do anything I ask.  He will be eating out of your hand before you are finished with him."
        },
        {
            "id": 59,
            "phrase": "eat someone’s lunch",
            "definition": "Sl. to best someone; to defeat, outwit, or win against someone. (Like a school bully taking away children’s lunches and eating them.) _ The upstart ABC Computer Company is eating IBM’s lunch."
        },
        {
            "id": 60,
            "phrase": "eat someone’s salt",
            "definition": "Rur. to be someone’s guest.  The least you can do when you’re eating someone’s salt is to help them out around the house.  That good-for-nothing Jim was f lirting with Bill’s wife at the same time he was eating Bill’s salt."
        },
        {
            "id": 61,
            "phrase": "eat someone up†",
            "definition": "to consume the flesh of someone.  The big bad wolf said he was going to eat you up! _ The bear ate up the fish."
        },
        {
            "id": 62,
            "phrase": "eat something away†",
            "definition": "to erode something; to consume something bit by bit.  The acid ate the finish away.  It ate away the finish."
        },
        {
            "id": 63,
            "phrase": "eat something out†",
            "definition": "1. to eat some kind of meal or a particular food away from home, as at a restaurant. We eat fish out, but we don’t cook it at home.  We may eat out a meal or two, but certainly not every meal. 2. [for something or an animal] to consume the inside of something.  The ants ate the inside of the pumpkin out.  The ants ate out the pumpkin."
        },
        {
            "id": 64,
            "phrase": "eat (something) out of something",
            "definition": "to eat food directly from a container, such as a bag, box, can, etc.  You shouldn’t eat out of the can.  Maria was eating potato chips right out of the bag."
        },
        {
            "id": 65,
            "phrase": "eat through (something)",
            "definition": "to erode all the way through something.  The acid ate through the countertop and ruined everything in the drawers below.  The vinegar ate through the top of the pickle jar."
        },
        {
            "id": 66,
            "phrase": "Eat to live, not live to eat.",
            "definition": "Prov. Do not be gluttonous.; Eating should not be your favorite activity, but something you do to maintain your health.  “Eat to live, not live to eat,” was the doctor’s advice to Gene, who was dangerously overweight."
        },
        {
            "id": 67,
            "phrase": "Eat up!",
            "definition": "to eat everything; to eat eagerly. (Usually a command to begin eating. Compare this with Drink up!.) _ Come on, let’s eat up and get going.  Eat up, you guys, and get back to work!"
        },
        {
            "id": 68,
            "phrase": "eat(en) up with something",
            "definition": "consumed with something, such as jealously.  Jed was so eaten up with hatred that he couldn’t see straight. Effie was eaten up with jealously."
        },
        {
            "id": 69,
            "phrase": "eavesdrop on someone",
            "definition": "to listen in on people having a private conversation.  I saw her eavesdropping on them.  Please don’t eavesdrop on me."
        },
        {
            "id": 70,
            "phrase": "eavesdrop on something",
            "definition": "to listen in on a private conversation.  She was eavesdropping on their conversation.  Maria was eavesdropping on the telephone call."
        },
        {
            "id": 71,
            "phrase": "ebb and flow",
            "definition": "to decrease and then increase, as with tides; a decrease followed by an increase, as with tides.  The fortunes of the major political parties tend to ebb and flow over time.  The ebb and flow of democracy through history is a fascinating subject."
        },
        {
            "id": 72,
            "phrase": "ebb away",
            "definition": "to recede; to subside; to flow back.  His life ebbed away little by little. As the sunlight ebbed away, the sky took on a grayish color."
        },
        {
            "id": 73,
            "phrase": "echo back to something",
            "definition": "[for something] to recall something similar in the past. This idea echoes back to the end of the last century, when people thought this way."
        },
        {
            "id": 74,
            "phrase": "echo with something",
            "definition": "[for a large space] to resound with the echoing sounds of a loud noise.  The cathedral echoed with the sounds of the organ.  The valley echoed with the sound of horses’ hooves."
        },
        {
            "id": 75,
            "phrase": "economical with the truth",
            "definition": "Euph. untruthful.  The mayor was known to be economical with the truth. I discovered that my boss had been economical with the truth when she said that the company was making money."
        },
        {
            "id": 76,
            "phrase": "economize on something",
            "definition": "to save money by cutting the cost of something. We will have to economize on our food budget.  We can only economize on a few things."
        },
        {
            "id": 77,
            "phrase": "edge away (from someone or something)",
            "definition": "to move cautiously away from someone or something.  We edged away from the dirty man in the ragged clothes.  As others saw the gun, they edged away."
        },
        {
            "id": 78,
            "phrase": "edge by (someone or something)",
            "definition": "to move carefully past someone or something. Try to edge by the portly gentleman carefully. He is very grumpy about being bumped.  Edge by as carefully as you can."
        },
        {
            "id": 79,
            "phrase": "edge (one’s way) across (something)",
            "definition": "to make one’s way across something carefully.  The hikers edged their way across the narrow ledge.  Now, edge your way across and don’t look down."
        },
        {
            "id": 80,
            "phrase": "edge (one’s way) around something",
            "definition": "to make one’s way around something carefully. I edged my way around the table, trying not to disturb anyone.  Sam edged around the perimeter of the room."
        },
        {
            "id": 81,
            "phrase": "edge someone out of something",
            "definition": "to pressure someone gradually to leave something; to put gradual pressure on someone to retire from a job. We grasped the child’s hand and edged her out of the stable without frightening the horses. The board tried to edge him out of the job by limiting his staff and budget."
        },
        {
            "id": 82,
            "phrase": "edge something with something",
            "definition": "to put an edging or border of something onto something. The tailor edged the hem with lace, making the skirt appear longer.  The hem was edged with lace."
        },
        {
            "id": 83,
            "phrase": "educate someone for something",
            "definition": "to train someone for something or to do something.  I wasn’t educated for doing this kind of thing.  He had spent many years educating himself for just this kind of job."
        },
        {
            "id": 84,
            "phrase": "educate someone in something",
            "definition": "to train someone about something; to school someone in something.  Her parents educated her in the ways of the old country. She had educated herself in the ways of big business."
        },
        {
            "id": 85,
            "phrase": "egg someone on",
            "definition": "to encourage, urge, or dare someone to continue doing something, usually something unwise.  John wouldn’t have done the dangerous experiment if his brother hadn’t egged him on.  The two boys kept throwing stones because the other children were egging them on."
        },
        {
            "id": 86,
            "phrase": "eighty-six something",
            "definition": "Sl. to throw something away.  Let’s eighty-six this stew and go out and get some decent pizza."
        },
        {
            "id": 87,
            "phrase": "*(either) feast or famine",
            "definition": "either too much (of something) or not enough (of something). (*Typically: be ~; have ~.) _ This month is very dry, and last month it rained almost every day. Our weather is either feast or famine.  Sometimes we are busy, and sometimes we have nothing to do. It’s feast or famine."
        },
        {
            "id": 88,
            "phrase": "eject someone from some place",
            "definition": "to use force to make someone leave a place; to throw someone out of some place.  The management ejected Sam from the theater.  He was ejected from the theater."
        },
        {
            "id": 89,
            "phrase": "eke something out†",
            "definition": "to extend something; to add to something.  He worked at two jobs in order to eke his income out.  He managed to eke out a living."
        },
        {
            "id": 90,
            "phrase": "elaborate on someone or something",
            "definition": "to give additional details about someone or something.  Would you care to elaborate on that? _ I want to know more about Kelly. Could you elaborate on her?"
        },
        {
            "id": 91,
            "phrase": "elbow grease",
            "definition": "hard scrubbing.  Tom: What did you use to get your car so shiny? Mary: Just regular wax and some elbow grease. Joe put a lot of elbow grease into cleaning the kitchen."
        },
        {
            "id": 92,
            "phrase": "elbow (one’s way) through (something)",
            "definition": "to push or drive oneself through something, such as a crowd, perhaps using one’s elbows or arms to move people out of the way. She elbowed her way through the crowd. Jerry elbowed through the people gathered at the door."
        },
        {
            "id": 93,
            "phrase": "elbow someone aside†",
            "definition": "to push someone aside with one’s elbow or arm.  She elbowed the other woman aside and there was almost a fight. The rude woman elbowed aside all the other people."
        },
        {
            "id": 94,
            "phrase": "elect someone (as) something",
            "definition": "to select someone to be something by ballot.  We elected her as our representative.  She was elected as our president."
        },
        {
            "id": 95,
            "phrase": "elect someone to something",
            "definition": "to select someone to be a member of something by ballot; to select someone to be an officer in something by ballot.  We elected you to office, so do your job.  Tom was elected to the congress."
        },
        {
            "id": 96,
            "phrase": "elevate someone or something to something",
            "definition": "to raise the status of someone to something; to promote someone to something higher, such as a job, a better status, etc. The success elevated her to a new rank and higher pay.  The boss’s attention elevated the policy question to the highest priority. She sought to elevate herself to some sort of social goddess."
        },
        {
            "id": 97,
            "phrase": "eleventh-hour decision",
            "definition": "a decision made very late in a process, or at the last possible moment.  Eleventhhour decisions are seldom satisfactory.  The president’s eleventh-hour decision was made in a great hurry, but it turned out to be correct."
        },
        {
            "id": 98,
            "phrase": "elicit something from someone",
            "definition": "to obtain information from someone.  I hoped to elicit a statement from the mayor, but I could not reach her. Larry was not able to elicit anything new from Jane."
        },
        {
            "id": 99,
            "phrase": "eliminate someone or something from something",
            "definition": "to remove someone or something from something.  We had to eliminate Jeff from the list. The cook eliminated veal from the menu. She sought to eliminate herself from consideration."
        },
        {
            "id": 100,
            "phrase": "elope with someone",
            "definition": "to sneak away with someone and get married without much ceremony.  Sally eloped with Tom, and everyone was surprised.  I don’t want to elope with Juan. I want a church wedding."
        },
        {
            "id": 101,
            "phrase": "emanate from someone or something",
            "definition": "to arise from or come out of someone or something. A strange smell emanated from the basement.  Some kind of eerie light emanated from the eyes of the statue."
        },
        {
            "id": 102,
            "phrase": "emancipate someone from someone or something",
            "definition": "to free someone from someone or something.  The president emancipated the slaves from their bondage.  The planter emancipated Fred from slavery long before the law was written."
        },
        {
            "id": 103,
            "phrase": "embark for some place",
            "definition": "to leave for some place, usually in a ship or an airplane.  We are embarking for Denver tomorrow morning. Maria is embarking for Honolulu in just a few minutes."
        },
        {
            "id": 104,
            "phrase": "embark on something",
            "definition": "to begin a journey by boarding a ship, airplane, etc.  They embarked on their journey from San Juan."
        },
        {
            "id": 105,
            "phrase": "embarrass someone about someone or something",
            "definition": "to make someone feel bad or ashamed about someone or something. Please don’t embarrass me by mentioning my mistake again.  There is no need to embarrass her about her unfortunate sister."
        },
        {
            "id": 106,
            "phrase": "embarrass someone into doing something",
            "definition": "to shame someone into doing something.  They tried to embarrass me into doing it, but I resisted.  Juan tried to embarrass Fred into going home early."
        },
        {
            "id": 107,
            "phrase": "embarrass someone with something",
            "definition": "to use something to make someone feel bad or ashamed. Please don’t embarrass me with that old story again.  Maria embarrassed Henry with a reminder of what had happened."
        },
        {
            "id": 108,
            "phrase": "embed someone or something in something",
            "definition": "to insert someone or something in something.  The team of oxen embedded their legs in the muddy river bottom.  Laura embedded sequins in the candles and turned them into clever gifts."
        },
        {
            "id": 109,
            "phrase": "embed something in something",
            "definition": "to stick something into something.  The mugger only embedded his knife in the cloth of the victim’s coat.  A ring was embedded in the bread dough by accident."
        },
        {
            "id": 110,
            "phrase": "embellish something with something",
            "definition": "to ornament something with something.  He embellished the painting with too many little decorations.  The room has been embellished with too many baroque sconces."
        },
        {
            "id": 111,
            "phrase": "embezzle something from someone or something",
            "definition": "to steal something from someone or a group.  They caught her embezzling funds from the bank. Jerry’s business partner embezzled a large sum from their checking account."
        },
        {
            "id": 112,
            "phrase": "emblazon something on(to) something",
            "definition": "1. to decorate something with something.  The workers emblazoned wild decorations on the door.  They emblazoned their name on the side of the building. 2. to put some writing or symbols that proclaim something onto something. The knight emblazoned his crest onto his shield.  The craftsman emblazoned the knight’s crest on his shield."
        },
        {
            "id": 113,
            "phrase": "emblazon something with something",
            "definition": "to decorate something with writing or symbols.  They emblazoned the wall with pictures of past triumphs. His shield was emblazoned with the family crest."
        },
        {
            "id": 114,
            "phrase": "embody something in something",
            "definition": "to actualize something in something; to make something represent something else in actuality.  I tried to embody both good and evil in my painting.  A strong sense of morality is embodied in her writing."
        },
        {
            "id": 115,
            "phrase": "embroil someone in something",
            "definition": "to entangle someone in something; to get someone involved in something.  Please do not embroil me in your squabbles. I wish I could keep from embroiling myself in this kind of mess."
        },
        {
            "id": 116,
            "phrase": "emerge (from something) (as something)",
            "definition": "to come out of something as something.  The caterpillar would emerge as a butterf ly in a short time.  A new man emerged from prison."
        },
        {
            "id": 117,
            "phrase": "emigrate (from some place) (to some place)",
            "definition": "to move away from a foreign land to a new land. My family emigrated from England to this country over two centuries ago. They emigrated to this country from England."
        },
        {
            "id": 118,
            "phrase": "emit something (from something) (into something)",
            "definition": "to discharge something from something into something else.  The snake emitted poison from its fangs into the cup the man held.  It emitted venom into the cup from its fangs."
        },
        {
            "id": 119,
            "phrase": "empathize with someone or something",
            "definition": "to have an understanding about the way someone feels; to feel emotional pain with someone.  I can really empathize with what you must be going through. I’ve been through the same thing.  I empathize with people who have the same family problems that I have."
        },
        {
            "id": 120,
            "phrase": "employ someone as something",
            "definition": "to pay someone to work in some capacity.  I employed Fred as a personal secretary for about three months.  Can you employ me as a stock clerk?"
        },
        {
            "id": 121,
            "phrase": "employ someone for something",
            "definition": "to hire someone for a particular purpose.  I employ him for special chores around the factory.  Kelly employed Walter for emergency repairs on the night shift."
        },
        {
            "id": 122,
            "phrase": "employ someone in something",
            "definition": "to pay someone to work in a particular type of work.  I employ Tom in machine maintenance.  Laura is employed in accounting."
        },
        {
            "id": 123,
            "phrase": "empower someone to do something",
            "definition": "to authorize someone to do something; to grant someone the power to do something. I will empower you to collect the dues of the members.  The prime minister empowered a special office to oversee tax collection."
        },
        {
            "id": 124,
            "phrase": "emptier than a banker’s heart",
            "definition": "Rur. completely empty. My wallet was emptier than a banker’s heart. His pockets were emptier than a banker’s heart."
        },
        {
            "id": 125,
            "phrase": "empty into something",
            "definition": "[for a river, stream, or man-made conduit] to pour its contents into something. The Amazon River empties into the Atlantic Ocean.  The drainage pipe empties into the river."
        },
        {
            "id": 126,
            "phrase": "An empty sack cannot stand upright.",
            "definition": "Prov. A poor or hungry person cannot function properly.  Sit down and have something to eat before you go back to work. An empty sack can’t stand upright."
        },
        {
            "id": 127,
            "phrase": "empty someone out†",
            "definition": "to cause someone to empty the bowels, stomach, or bladder. This medication will empty you out. This stuff could empty out an army! _He fasted for two days to empty himself out."
        },
        {
            "id": 128,
            "phrase": "empty something out†",
            "definition": "to remove or pour all of the contents from something. Please empty this drawer out and clean it.  She emptied out the aquarium and cleaned it well."
        },
        {
            "id": 129,
            "phrase": "Empty vessels make the most sound.",
            "definition": "Prov. Foolish people make the most noise.  I suspect Amy is not very smart. She chatters constantly, and as they say, empty vessels make the most sound."
        },
        {
            "id": 130,
            "phrase": "enable someone to do something",
            "definition": "to make it possible for someone to do something.  This money will enable me to open my own business.  My uncle enabled me to open my own candy shop."
        },
        {
            "id": 131,
            "phrase": "*enamored of someone or something",
            "definition": "to feel love for someone or something. (Often an exaggeration. *Typically: be ~; become ~.) _ She is hopelessly enamored of Tom.  Tom is enamored of chocolate ice cream."
        },
        {
            "id": 132,
            "phrase": "encase someone or something in something",
            "definition": "to contain someone or something in something. We encased her broken leg in a splint and raced to the hospital.  Sammy encased the butterf ly in a glass display box."
        },
        {
            "id": 133,
            "phrase": "enchant someone with something",
            "definition": "to bewitch someone or something with a magic spell. The children were enchanted with a spell that made them forget."
        },
        {
            "id": 134,
            "phrase": "enclose someone or something (with)in something",
            "definition": "to contain someone, something, or some space inside of something.  The police enclosed the people in a safe area while the accident was being cleaned up.  The farmer enclosed the pig within a new pen."
        },
        {
            "id": 135,
            "phrase": "encompass someone or something (with)in something",
            "definition": "to surround or include someone or something within the domain or span of something.  We encompassed the group within our administrative area.  They could not encompass our neighborhood in the new school district."
        },
        {
            "id": 136,
            "phrase": "encourage someone in something",
            "definition": "to give support to someone about something in particular. We want to encourage her in her musical career.  Ted encouraged me in my efforts to become a baseball player."
        },
        {
            "id": 137,
            "phrase": "encourage someone to do something",
            "definition": "to inspire or stimulate someone to do something; to give someone the courage to do something. We encouraged her to develop her musical talents. He encouraged himself to study hard so he could make it into medical school."
        },
        {
            "id": 138,
            "phrase": "encroach (up)on someone or something",
            "definition": "to infringe or trespass on someone or something; to move into the space belonging to someone or something. (Upon is formal and less commonly used than on.) _ I did not mean to encroach upon your property.  I need lots of space. Don’t encroach on me."
        },
        {
            "id": 139,
            "phrase": "encumber someone or something with someone or something",
            "definition": "to burden someone or something with someone or something.  Please do not try to encumber me with your debts.  She encumbered the marriage with a number of children from a previous marriage. She encumbered herself with the weight of both children and her purse."
        },
        {
            "id": 140,
            "phrase": "*an end in itself",
            "definition": "existing for its own sake; existing for no clear purpose. (*Typically: be ~; become ~.) _ For Bob, art is an end in itself. He doesn’t hope to make any money from it.  Learning is an end in itself. Knowledge does not have to have a practical application."
        },
        {
            "id": 141,
            "phrase": "end in something",
            "definition": "[for something, such as a play, film, opera, etc.] to end in a particular way.  The opera ended in a lengthy duet before the death of the heroine.  The party ended in a champagne toast."
        },
        {
            "id": 142,
            "phrase": "end it (all)",
            "definition": "Euph. to kill oneself.  He had been depressed for months. He decided to end it all.  I’m no good to anybody. I’m going to end it. Don’t try to talk me out of it."
        },
        {
            "id": 143,
            "phrase": "The end justifies the means.",
            "definition": "Prov. You can use bad or immoral methods as long as you accomplish something good by using them. (Not everyone agrees with this idea.) _ Lucy got money for the orphanage by embezzling it from the firm where she worked. “The end justifies the means,” she told herself.  The politician clearly believed that the end justifies the means, since he used all kinds of nefarious means to get elected."
        },
        {
            "id": 144,
            "phrase": "End of story.",
            "definition": "Inf. That completes the story, and I will say no more.  I did it because I wanted to. End of story."
        },
        {
            "id": 145,
            "phrase": "the end of the ball game",
            "definition": "the end of some process; the end of life.  Well, the car broke down. I guess that’s the end of the ball game. It looked like the end of the ball game as we sped too fast around the curve."
        },
        {
            "id": 146,
            "phrase": "end something up†",
            "definition": "to terminate something; to bring something to an end. He ended his vacation up by going to the beach.  She ended up her speech with a poem."
        },
        {
            "id": 147,
            "phrase": "end up",
            "definition": "to come to an end.  When will all this end up? _ I think that the party will have to end up about midnight."
        },
        {
            "id": 148,
            "phrase": "end up (as) (something)",
            "definition": "to become something at the end of everything.  I always knew I would end up as a doctor.  If I don’t get a job, I will end up a beggar."
        },
        {
            "id": 149,
            "phrase": "end up at something",
            "definition": "to be at something or some place at the end.  The plane ended up at Denver airport because of a storm in Colorado Springs. We ended up at home for the evening because the car broke down."
        },
        {
            "id": 150,
            "phrase": "end up (somehow)",
            "definition": "to end something at a particular place, in a particular state, or by having to do something.  I ended up having to pay for everyone’s dinner.  After paying for dinner, I ended up broke.  We all ended up at my house.  After playing in the rain, we all ended up with colds."
        },
        {
            "id": 151,
            "phrase": "end up with someone or something",
            "definition": "to finish with the possession of someone or something or in the company of someone or something.  Careful or you will end up with Johnny for the weekend.  Do you want to end up with the bill? _I thought my date was with Sally, but I ended up with her twin sister."
        },
        {
            "id": 152,
            "phrase": "end with something",
            "definition": "to make something the final element, just before the end.  We will end with the singing of the school song.  The concert ended with a vigorous march."
        },
        {
            "id": 153,
            "phrase": "endear someone to someone or something",
            "definition": "to cause someone to be cherished by someone else or a group.  Her good humor endears her to all of us.  Sally endears herself to everyone because she is so funny.  She failed to endear herself to her husband’s parents."
        },
        {
            "id": 154,
            "phrase": "endeavor to do something",
            "definition": "to try to do something.  Whenever I endeavor to console her, she breaks down again.  Maria endeavored to comfort Henry."
        },
        {
            "id": 155,
            "phrase": "endow someone or something with something",
            "definition": "1. to give something to someone or something.  We endowed her with the courage she needed to do the job. Gerald endowed the proceedings with a distinctive atmosphere. 2. to provide someone or something with a large sum of money that will provide income.  I will endow my alma mater with some of my fortune.  The family endowed a chair in the humanities at the university."
        },
        {
            "id": 156,
            "phrase": "enfold someone in something",
            "definition": "to wrap or contain someone in something.  He enfolded the tiny baby in a soft blanket.  Sarah enfolded herself in the silk sheets and giggled with glee."
        },
        {
            "id": 157,
            "phrase": "enforce something on someone",
            "definition": "to make a law effective with regard to someone.  I can’t enforce this on her if I don’t enforce it on you.  This law can’t be enforced on anyone."
        },
        {
            "id": 158,
            "phrase": "engage in small talk",
            "definition": "to talk only about minor matters rather than important matters or personal matters.  All the people at the party were engaging in small talk. They chatted about the weather and otherwise engaged in small talk."
        },
        {
            "id": 159,
            "phrase": "engage someone as something",
            "definition": "to hire someone to serve as something.  Yes, I engaged her as a secretary just last month.  Will you engage me as a general troubleshooter?"
        },
        {
            "id": 160,
            "phrase": "engage someone or something in something",
            "definition": "1. to make someone or a group busy doing something.  She knew how to engage the boys in useful activity. The den mother engaged the scouts in a woodworking project. 2. to draw someone or something into something.  The enemy sought to engage our troops in battle but failed.  I tried to engage Gerald in conversation."
        },
        {
            "id": 161,
            "phrase": "engage someone to someone",
            "definition": "to betroth someone to someone.  Her parents engaged her to the man she ended up marrying.  She engaged herself to some guy she met at a singles bar."
        },
        {
            "id": 162,
            "phrase": "engrave something into something",
            "definition": "to cut symbols into something. She engraves a lovely design into the soap that she puts out for guests.  Todd engraved his initials into the bark of the tree."
        },
        {
            "id": 163,
            "phrase": "engrave something on(to) something",
            "definition": "to cut symbols into the surface of something. She engraved her initials onto the side of the tree.  Ted engraved her name on the bracelet."
        },
        {
            "id": 164,
            "phrase": "engrave something (up)on something",
            "definition": "to cut letters or a design into the surface of something; to engrave something on(to) something.  Todd engraved his initials into the bark of the tree. Their names were engraved onto each of their wedding rings. He asked them to engrave his initials upon the back of his watch. He engraved his name on the desktop."
        },
        {
            "id": 165,
            "phrase": "engrave something with something",
            "definition": "1. to carve something, such as letters, into something.  He engraved the soft pewter with an old motto.  Can you engrave my watch with a date? 2. to carve on something, using some tool or device. The worker engraved the watch with a sharp stylus.  Can I engrave this bracelet with this tool? Is it sharp enough?"
        },
        {
            "id": 166,
            "phrase": "engross someone in something",
            "definition": "to occupy someone’s time or thinking with something.  You can’t expect me to engross Tom in my work.  We were all engrossed in what the speaker had to say."
        },
        {
            "id": 167,
            "phrase": "engulf someone or something in something",
            "definition": "[for the fog, a flood, or waves] to swallow up someone or something.  The fog engulfed the small town in heavy mist. The waves engulfed the small boat in thousands of gallons of water."
        },
        {
            "id": 168,
            "phrase": "enjoin someone or something from something",
            "definition": "[for a court] to order someone or something not to do something.  The judge enjoined her from further action in this matter.  The company was enjoined from further dumping of waste."
        },
        {
            "id": 169,
            "phrase": "enjoin someone to do something",
            "definition": "to order someone to do something.  We sought to enjoin her to remain in office.  Sally wants to enjoin the committee to finish its work on time."
        },
        {
            "id": 170,
            "phrase": "Enjoy your meal.",
            "definition": "an expression used by food servers after the food has been served.  The waiter set the plates on the table, smiled, and said, “Enjoy your meal.” _ Waiter: Here’s your dinner. Jane: Oh, this lobster looks lovely! Tom: My steak looks just perfect. Waiter: Enjoy your meal."
        },
        {
            "id": 171,
            "phrase": "enlist (oneself) for something",
            "definition": "to sign up for something; to enroll for something. Sam wouldn’t enlist for service.  Todd enlisted himself for the army last week."
        },
        {
            "id": 172,
            "phrase": "enlist (oneself) in something",
            "definition": "to join something; to join the armed services.  She decided not to enlist herself in the air force.  Bill enlisted in the army."
        },
        {
            "id": 173,
            "phrase": "enlist someone for something",
            "definition": "to enroll someone for something; to seek help for something from someone.  I enlisted all of them for the understudy parts. Can I enlist you for the committee?"
        },
        {
            "id": 174,
            "phrase": "enlist someone in something",
            "definition": "to recruit someone into something; to recruit someone into the armed services. They tried to enlist me in the army, but I decided against it.  David enlisted his brother in an organization that gave assistance to peasants in South America."
        },
        {
            "id": 175,
            "phrase": "enmesh someone or something in something",
            "definition": "to entangle someone or a group in something.  Don’t enmesh yourself in these ropes and chains.  I didn’t mean to enmesh you in this net. I should have kept it out of the way.  Jane enmeshed herself in the net that had been set out to dry."
        },
        {
            "id": 176,
            "phrase": "enough and some to spare",
            "definition": "plenty.  Would you like some more pie? We’ve got enough and some to spare.  Mary: Can I borrow a cup of milk? Tom: Don’t worry about borrowing. Take it. I have enough and some to spare."
        },
        {
            "id": 177,
            "phrase": "Enough is as good as a feast.",
            "definition": "Prov. You do not need more than enough of anything.  We don’t have much of a surplus of food for dinner tonight, but enough is as good as a feast.  Jane: I wish I could offer you more lavish hospitality. Jane: Don’t be silly. Enough is as good as a feast."
        },
        {
            "id": 178,
            "phrase": "Enough is enough.",
            "definition": "Prov. That is enough, and there should be no more.; Stop! _Stop asking for money! Enough is enough! _ I’ve heard all the complaining from you that I can take. Enough is enough!"
        },
        {
            "id": 179,
            "phrase": "enough (something) to go (a)round",
            "definition": "enough to serve a need; enough to serve all who have a need.  There’s not enough coffee to go around.  Will there be enough chocolates to go around?"
        },
        {
            "id": 180,
            "phrase": "enough to keep body and soul together",
            "definition": "very little; only enough to survive. (Usually refers to money.) _ When he worked for the library, Marshall only made enough to keep body and soul together.  Maria’s savings were just enough to keep body and soul together while she looked for another job."
        },
        {
            "id": 181,
            "phrase": "enrich someone or something with something",
            "definition": "to improve or enhance someone or something with something. You might want to enrich this soup with a little milk or cream.  The teacher enriched her students with field trips and films."
        },
        {
            "id": 182,
            "phrase": "enroll (someone) for something",
            "definition": "to sign someone up for something; to allow someone to join something.  I intend to enroll myself for physics next year. Todd enrolled himself for a refresher course in algebra."
        },
        {
            "id": 183,
            "phrase": "enroll (someone) in something",
            "definition": "to sign someone up to be in something.  They enrolled me in calculus against my wishes. I want to enroll myself in the history class offered at the latest hour."
        },
        {
            "id": 184,
            "phrase": "ensconce oneself in something",
            "definition": "to establish oneself in something; to settle oneself into something; to place oneself firmly into something.  He ensconced himself in the most comfortable chair.  Sally ensconced herself in the huge throne and pretended she was a queen."
        },
        {
            "id": 185,
            "phrase": "enshrine something in something",
            "definition": "to honor someone or something by placement in a shrine.  Bill enshrined his grandfather’s watch in a glass dome."
        },
        {
            "id": 186,
            "phrase": "ensnare someone or something in something",
            "definition": "to capture someone or something in something.  Dave ensnared the rabbit in his trap.  Henry ensnared himself in the trap they had laid for deer."
        },
        {
            "id": 187,
            "phrase": "ensue from something",
            "definition": "to result from someone or something.  What ensued from the change in policy was not anticipated at all.  A very serious problem ensued from the events of the day."
        },
        {
            "id": 188,
            "phrase": "entangle someone or something with something",
            "definition": "to get someone or something tangled up with something.  He sought to entangle the pursuing mugger with a mass of ropes and boards.  Sam entangled the rabid dog with a net and got away. He entangled himself with the ropes on the deck."
        },
        {
            "id": 189,
            "phrase": "enter in something",
            "definition": "to enroll as a participant in something, such as a contest, competition, etc.  She was not ready to enter in the competition.  I can’t enter in that contest. I’m not prepared."
        },
        {
            "id": 190,
            "phrase": "enter into something",
            "definition": "to get into something.  She entered into the house and immediately went to work.  As the people entered into the cathedral, they became quiet."
        },
        {
            "id": 191,
            "phrase": "enter one’s mind",
            "definition": "[for an idea or memory] to come into one’s consciousness; to be thought of.  Leave you behind? The thought never even entered my mind. A very interesting idea just entered my mind. What if I ran for Congress?"
        },
        {
            "id": 192,
            "phrase": "enter someone or something in(to) something",
            "definition": "to enroll someone or something in something; to make someone or something a competitor in something.  I will enter you into the contest whether you like it or not.  The trainer entered his fastest horse in the race."
        },
        {
            "id": 193,
            "phrase": "enter the lists",
            "definition": "to begin to take part in a contest or argument.  He had decided not to stand for Parliament, but entered the lists at the last minute.  The family disagreement had almost been resolved when the grandfather entered the lists."
        },
        {
            "id": 194,
            "phrase": "enter (up)on something",
            "definition": "1. to come in at a particular point as marked by something.  We entered the theater upon the most delicate point of the story. We entered on the tail end of a live scene. 2. to begin something. Todd entered upon a new phase of his life.  He entered on the management of a new project."
        },
        {
            "id": 195,
            "phrase": "entertain someone with something",
            "definition": "to provide something for amusement or refreshment to someone. Will you try to entertain the children with a game or two, please? _ She entertained herself with the puzzle."
        },
        {
            "id": 196,
            "phrase": "enthrall someone with something",
            "definition": "to charm or captivate someone with something.  They enthralled us with the beauty of their singing.  The children enthralled us with their rustic dances."
        },
        {
            "id": 197,
            "phrase": "entice someone or an animal into doing something",
            "definition": "to lure or cajole someone or an animal into doing something. We finally enticed him into running for office. Donna enticed the cat into coming down from the tree."
        },
        {
            "id": 198,
            "phrase": "entice someone or an animal into something",
            "definition": "to lure someone or an animal into something.  Can I entice you into the house for some cold lemonade? _We were able to entice the squirrel into the box with nuts."
        },
        {
            "id": 199,
            "phrase": "entice someone or an animal with something",
            "definition": "to lure someone or an animal with something. We tried to entice him with a description of the cake, but he was not interested in coming. If the cat won’t come in, try enticing it with a bit of fish."
        },
        {
            "id": 200,
            "phrase": "entitle someone to do something",
            "definition": "[for something] to qualify someone to do something. This ticket entitles you to go in and take a seat.  Does this paper entitle me to get a discount?"
        },
        {
            "id": 201,
            "phrase": "entomb someone or an animal in something",
            "definition": "to imprison someone or an animal in a tomblike enclosure.  Please don’t entomb me in that huge, cold office.  Unknowingly, when they closed the door, they had entombed a tiny mouse in the church."
        },
        {
            "id": 202,
            "phrase": "entrap someone (in something) (with something)",
            "definition": "to use something to deceive someone into involvement in something. The investigators entrapped Max into breaking the law with promises to buy the goods he stole.  They entrapped Max into breaking the law."
        },
        {
            "id": 203,
            "phrase": "entreat someone to do something",
            "definition": "to beg someone to do something. They entreated us to come back as soon as we could.  I entreat you to think it over again."
        },
        {
            "id": 204,
            "phrase": "entrust someone or something to someone",
            "definition": "to place someone or something into the protection of someone.  Can I entrust Johnny to you while I shop? _I entrusted my share of the money to Fred until I returned to town."
        },
        {
            "id": 205,
            "phrase": "entrust someone with someone or something",
            "definition": "to trust someone to provide protection and care for someone or something.  Can I entrust you with Johnny while I go in and vote? _ I entrusted Fred with my share of the money until I returned. I would not even entrust myself with the care of this priceless vase!"
        },
        {
            "id": 206,
            "phrase": "entwine around someone or something",
            "definition": "to weave or wind around someone or something.  The snake entwined around the limb of the tree.  The huge python entwined around the horrified farmer."
        },
        {
            "id": 207,
            "phrase": "entwine something around someone or something",
            "definition": "to weave or wind something around someone or something.  They entwined their arms around each other.  Jack entwined the garland of f lowers around Jill."
        },
        {
            "id": 208,
            "phrase": "enunciate something to someone",
            "definition": "to say something to someone very clearly and distinctly.  Now, enunciate it to everyone, because they probably did not understand you the first time.  I will enunciate it to you one more time, slowly."
        },
        {
            "id": 209,
            "phrase": "envelop someone or something in someone or something",
            "definition": "to wrap someone or something in someone or something.  The fog enveloped us in its grasp. Mountains of fog rolled in and enveloped the house in dense vapor."
        },
        {
            "id": 210,
            "phrase": "envisage someone or something as someone or something",
            "definition": "to imagine or visualize someone or something as someone or something.  I envisaged you as a more graceful person than you are.  We envisaged the living room as sort of a gathering place for the entire family."
        },
        {
            "id": 211,
            "phrase": "envy someone for someone or something",
            "definition": "to regard one with jealousy or resentment because of someone or something one has.  I envy you for your lovely car.  We all envy you for your beautiful children."
        },
        {
            "id": 212,
            "phrase": "equal someone or something in something",
            "definition": "to be even or identical with someone or something in something.  John equals Bill in strength and size, I think.  This cake equals that one in texture but not in richness."
        },
        {
            "id": 213,
            "phrase": "equal to someone",
            "definition": "as good or as accomplished as someone else. I certainly feel equal to Randy. He’s nothing special. I don’t think that Bill feels equal to Bob, even though they are twins."
        },
        {
            "id": 214,
            "phrase": "equal to someone or something",
            "definition": "able to handle or deal with someone or something.  I’m afraid that I’m not equal to Mrs. Smith’s problem right now. Please ask her to come back later. That’s a very difficult task, but I’m sure Bill is equal to it."
        },
        {
            "id": 215,
            "phrase": "equate someone or something with someone or something",
            "definition": "to compare people and things, in any combination. I tend to equate Tom with trouble. I equate the Johnsons with a long boring evening."
        },
        {
            "id": 216,
            "phrase": "equip someone or something (with something) (for something)",
            "definition": "to outfit someone or something with something for something; to provide equipment for someone or something for some purpose.  We equipped everyone with a spade for digging. They equipped the rescuers with equipment for any conceivable occurrence."
        },
        {
            "id": 217,
            "phrase": "equip something with something",
            "definition": "to add a piece of equipment to something. We will equip our truck with a plow blade and plow snow this winter.  This car is equipped with air-conditioning."
        },
        {
            "id": 218,
            "phrase": "erase something from something",
            "definition": "to delete or wipe something from something.  Please erase the writing from the blackboard.  I will erase the incorrectly spelled word from my paper."
        },
        {
            "id": 219,
            "phrase": "erupt from something",
            "definition": "to burst out of something or some place.  A billow of smoke erupted from the chimney.  A mass of ashes and gasses erupted from the volcano."
        },
        {
            "id": 220,
            "phrase": "erupt into something",
            "definition": "[for something] to become a serious problem suddenly.  The argument erupted into a terrible fight.  They were afraid the fight would erupt into a riot."
        },
        {
            "id": 221,
            "phrase": "escalate into something",
            "definition": "to intensify into something; to increase gradually into something.  This argument is going to escalate into something serious very soon.  These cases of the f lu could escalate into a real epidemic."
        },
        {
            "id": 222,
            "phrase": "escalate something into something",
            "definition": "to cause something to intensify. He escalated the argument into a vicious fight.  The dictator tried to escalate the disagreement into a cause for war."
        },
        {
            "id": 223,
            "phrase": "escape (from someone or something) (to some place)",
            "definition": "to get away from someone, something, or some place to another place. Max escaped from prison to a hideout in Alabama.  He escaped to Alabama from one of the worst-run prisons in the land."
        },
        {
            "id": 224,
            "phrase": "escape someone’s notice",
            "definition": "to go unnoticed; not to have been noticed. (Usually a way to point out that someone has failed to see or respond to something.) _I suppose my earlier request escaped your notice, so I’m writing again.  I’m sorry. Your letter escaped my notice."
        },
        {
            "id": 225,
            "phrase": "escort someone or something from something",
            "definition": "to accompany or lead someone or something away from something or some place. A police officer escorted them from the auditorium.  A band of honorary pallbearers escorted the coffin from the chapel."
        },
        {
            "id": 226,
            "phrase": "escort someone or something to something",
            "definition": "to accompany or lead someone or something to something or some place.  We escorted the women to their seats.  Claude escorted Harry to the exit and bade him farewell."
        },
        {
            "id": 227,
            "phrase": "establish someone or something as someone or something",
            "definition": "to validate or confirm someone or something as someone or something. As soon as we establish her as a viable candidate, we will launch the publicity campaign.  She established herself as an authority on rare books."
        },
        {
            "id": 228,
            "phrase": "establish someone or something in something",
            "definition": "to set someone or something up in something or some place; to install someone or something in something or some place. We established a restaurant in the middle of downtown.  My uncle established me in the candy business."
        },
        {
            "id": 229,
            "phrase": "estimate the cost at some amount",
            "definition": "to approximate the cost of something at a particular amount. I estimate the cost at about one hundred dollars.  The cost of repairing the car was estimated at over four thousand dollars!"
        },
        {
            "id": 230,
            "phrase": "*estranged from someone",
            "definition": "to be alienated from someone. (*Typically: be ~; become ~.) _Toward the end, they were estranged from each other, so a separation was perfectly natural. She had been estranged from her husband for a number of years."
        },
        {
            "id": 231,
            "phrase": "eternal life",
            "definition": "Euph. life after death. He passed on into eternal life, leaving us behind to mourn. She is now at rest in eternal life."
        },
        {
            "id": 232,
            "phrase": "the eternal triangle",
            "definition": "a sexual or emotional relationship involving two women and one man or two men and one woman. (Typically, a couple [man and woman] and another man or woman.) _ Henry can’t choose between his wife and his mistress. It’s the eternal triangle. I’m surprised Jane doesn’t get tired of the eternal triangle. She goes out with Peter at the weekend and Jim during the week."
        },
        {
            "id": 233,
            "phrase": "evacuate one’s bowels",
            "definition": "Euph. to defecate.  After taking a jog around the block, Jill felt the need to evacuate her bowels.  I am afraid my little boy is sick. He has not evacuated his bowels for several days."
        },
        {
            "id": 234,
            "phrase": "evacuate someone (from something) (to something)",
            "definition": "to remove someone from something or some place to another thing or place, as in an emergency.  They had to evacuate everyone from the subway station to a nearby building.  The rescuers evacuated the people from the f lames."
        },
        {
            "id": 235,
            "phrase": "evaluate someone as something",
            "definition": "to judge someone’s performance as something.  I will have to evaluate you as a new student. We must evaluate ourselves as teachers and leaders."
        },
        {
            "id": 236,
            "phrase": "Even a worm will turn.",
            "definition": "Prov. Even a meek person will become angry if you abuse him or her too much.  You’d better stop maltreating Amy. She’s a mild-mannered woman, but even a worm will turn."
        },
        {
            "id": 237,
            "phrase": "*an even break",
            "definition": "a fair chance; a fair judgment. (*Typically: get ~; have ~; give someone ~.) _ Please give me an even break! I need some help here!"
        },
        {
            "id": 238,
            "phrase": "even if it kills me",
            "definition": "[pledging to do something] even if [doing it] is very difficult.  Don’t worry. I will get it done even if it kills me."
        },
        {
            "id": 239,
            "phrase": "even in the best of times",
            "definition": "even when things are good; even when things are going well.  It is hard to get highquality leather even in the best of times.  John had difficulty getting a loan even in the best of times because of his poor credit record."
        },
        {
            "id": 240,
            "phrase": "even something out†",
            "definition": "to make something even or level.  Please even the gravel out.  They evened out the surface of the road."
        },
        {
            "id": 241,
            "phrase": "even something up†",
            "definition": "to make something even, square, level, equal, balanced, etc.  I’ll even the table up.  See if you can even up the legs of this table. It wobbles."
        },
        {
            "id": 242,
            "phrase": "even steven",
            "definition": "to be even (with someone or something) by having repaid a debt, replied in kind, etc.  Bill hit Tom; then Tom hit Bill. Now they are even steven.  Mary paid Ann the $100 she owed her. Ann said, “Good, we are even steven.”"
        },
        {
            "id": 243,
            "phrase": "(Even) the best of friends must part.",
            "definition": "Prov. Even very good friends cannot stay together forever. Child: I don’t want Debby to move away. She’s my best friend. Mother: Sometimes the best of friends must part, honey, even if they don’t want to."
        },
        {
            "id": 244,
            "phrase": "the evening of life",
            "definition": "Euph. old age.  As she approached the evening of life, Sarah looked back on her accomplishments with satisfaction.  The residents of this rest home are all in the evening of life."
        },
        {
            "id": 245,
            "phrase": "ever and anon",
            "definition": "now and then; occasionally. (Literary and archaic.) _Ever and anon the princess would pay a visit to the sorcerer in the small walled garden directly behind the castle."
        },
        {
            "id": 246,
            "phrase": "Every cloud has a silver lining.",
            "definition": "Prov. You can derive some benefit from every bad thing that happens to you. (You can also refer to the silver lining of a particular cloud, the benefit you can derive from a particular misfortune.) _ I’m sorry your business is going badly, but don’t despair. Every cloud has a silver lining.  When Mary’s friends visited her in the hospital, they tried to cheer her up, but Mary never could find the silver lining in the cloud of her illness."
        },
        {
            "id": 247,
            "phrase": "every fool thing",
            "definition": "every ridiculous or insignificant thing. Every fool thing seems to go wrong with this car. I don’t want to hear about every fool thing you did on your vacation."
        },
        {
            "id": 248,
            "phrase": "Every horse thinks its own pack heaviest.",
            "definition": "Prov. Everyone thinks he or she has the hardest work to do or the most difficult problems to overcome. When we were growing up, my sister and I each thought our own chores were harder than the other’s. Every horse thinks its own pack heaviest."
        },
        {
            "id": 249,
            "phrase": "Every Jack has his Jill.",
            "definition": "Prov. Every man will eventually find a woman to be his romantic partner. Bill: I’ll never have a girlfriend. None of the girls I take out will agree to a second date. Fred: Cheer up; every Jack has his Jill."
        }
    ]
}