{
    "dictionary": [
        {
            "id": 0,
            "phrase": "You don’t know the half of it.",
            "definition": "Inf. You really don’t know how bad it is.; You might think that what you have heard is bad, but you do not know the whole story.  Mary: They say you’ve been having a bad time at home. Sally: You don’t know the half of it.  Sally: The company has no cash, they are losing orders right and left, and the comptroller is cooking the books. Mary: Sounds bad. Sally: You don’t know the half of it."
        },
        {
            "id": 1,
            "phrase": "You don’t know where it’s been.",
            "definition": "Do not touch something or put it in your mouth, because you do not know where it has been and what kind of dirt it has picked up. (Most often said to children.) _ Mother: Don’t put that money in your mouth. You don’t know where it’s been. Bill: Okay.  Take that stick out of your mouth. You don’t know where it’s been."
        },
        {
            "id": 2,
            "phrase": "You don’t say.",
            "definition": "1. Inf. a general response to something that someone has said. (Expresses a little polite surprise or interest, but not disbelief.) _ Bill: I’m starting work on a new job next Monday. Bob: You don’t say.  Sally: The Jones boys are keeping a pet snake. Alice: You don’t say. 2. Inf. You have just said something that everybody already knows. Bill: I think I’m beginning to put on a little weight. Jane: You don’t say.  John: My goodness, prices are getting high. Sue: You don’t say."
        },
        {
            "id": 3,
            "phrase": "You first.",
            "definition": "an invitation for someone to precede the speaker. (See the examples.) _ Bill: Let’s try some of this goose liver stuff. Jane: You first. Bill: The water sure looks cold. Let’s jump in. Bob: You first."
        },
        {
            "id": 4,
            "phrase": "You get what you pay for.",
            "definition": "Prov. Cliché If you do not pay much money for something, it is probably of poor quality.; If you pay well for something, it is more likely to be of good quality.  Alan: I was so pleased to find shoes for such a low price, but look, they’re falling apart already. Jane: You get what you pay for. This brand of soup is more expensive, but remember, you get what you pay for."
        },
        {
            "id": 5,
            "phrase": "You got it!",
            "definition": "1. Inf. I agree to what you asked!; You will get what you want! _You want a green one? You got it! _This one? You got it! 2. Inf. You are right! _That’s exactly right! You got it! _ That’s the answer. You got it!"
        },
        {
            "id": 6,
            "phrase": "You got me there.",
            "definition": "Inf. I do not know the answer to your question. (Also with subjects other than second person.) _You got me there. I don’t know. You got me there. I have no idea what the answer is."
        },
        {
            "id": 7,
            "phrase": "You have to eat a peck of dirt before you die.",
            "definition": "Prov. No one can escape eating a certain amount of dirt on his or her food.; Everyone must endure a number of unpleasant things in his or her lifetime. (Often said to console someone who has eaten some dirt or had to endure something unpleasant.) _ Ellen: Oh, no! I forgot to wash this apple before I took a bite out of it. Fred: You have to eat a peck of dirt before you die."
        },
        {
            "id": 8,
            "phrase": "You heard someone.",
            "definition": "Don’t argue. You heard your instructions from someone. (The someone can be a person’s name, a title, or a pronoun.) _ Andy: You heard the man. Get moving. Henry: Don’t rush me! _Bill: What makes her think she can tell me what to do? Bob: She’s the boss. Do it! You heard her!"
        },
        {
            "id": 9,
            "phrase": "You just don’t get it!",
            "definition": "Inf. You really don’t see what people are trying to tell you! (Also with subjects other than second person.) _ You just don’t get it! People avoid you because you offend them."
        },
        {
            "id": 10,
            "phrase": "You make a better door than you do a window.",
            "definition": "Rur. I cannot see through you, so move aside.  Joe was just standing in front of the TV. “Hey,” I said, “You make a better door than you do a window.” _ Charlie: Isn’t this a great view? Jane: You make a better door than you do a window. Let me see."
        },
        {
            "id": 11,
            "phrase": "You make me laugh!",
            "definition": "Inf. Fig. What you said is totally ridiculous.; You are totally ridiculous. (Compare this with Don’t make me laugh!) _ Bill: I have this plan to make electricity from garbage. Sally: What a dumb idea! You make me laugh! _Bill: I’m really sorry. Give me another chance. I’ll never do it again! Jane: You make me laugh!"
        },
        {
            "id": 12,
            "phrase": "You must lose a fly to catch a trout.",
            "definition": "Prov. You have to sacrifice something in order to get what you want. (Implies that what you sacrifice is minor compared to what you will get.) _ Amy was willing to live cheaply for several years in order to save enough money to buy her own house. She knew that you must lose a f ly to catch a trout."
        },
        {
            "id": 13,
            "phrase": "You never know (what you can do) till you try.",
            "definition": "Prov. Even if you think you are not able to do something, you should try to do it.  Jill: Want to go rock-climbing with me this weekend? Jane: Oh, I can’t rock-climb. Jill: How do you know? Have you ever tried it? Jane: No, not really. Jill: You don’t know what you can do till you try.  Alan: I’ll never be able to learn to dance. Jane: You don’t know till you try."
        },
        {
            "id": 14,
            "phrase": "You never miss the water till the well runs dry.",
            "definition": "Prov. People are not grateful for what they have until they lose it. Jill: I never realized what a good friend Jeanie was until she moved away. Jane: You never miss the water till the well runs dry."
        },
        {
            "id": 15,
            "phrase": "You pays your money and you takes your chance(s).",
            "definition": "Prov. You must resign yourself to taking risks.; Everything costs something, but paying for something does not guarantee that you will get it. (The grammatical errors are intentional.) _Customer: Can you guarantee that this washing machine won’t break? Salesman: No guarantees. You pays your money and you takes your chances."
        },
        {
            "id": 16,
            "phrase": "You (really) said a mouthful.",
            "definition": "Inf. Fig. You said exactly what needed to be said.; What you said was very meaningful and had great impact.  Bill: Did you hear what I said to her? Jane: Yes. You said a mouthful. Was she mad? _ Bill: This is the worst food I have ever eaten. It is either stale, wilted, dry, or soggy! Tom: You said a mouthful!"
        },
        {
            "id": 17,
            "phrase": "You scratch my back and I’ll scratch yours.",
            "definition": "You do a favor for me and I’ll do a favor for you.; If you do something for me that I cannot do for myself, I will do something for you that you cannot do for yourself.  I’ll grab the box on the top shelf if you will creep under the table and pick up my pen. You scratch my back, and I’ll scratch yours."
        },
        {
            "id": 18,
            "phrase": "You think you’re so smart!",
            "definition": "Inf. You act as if you know far more than you do. (Also with subjects other than second person.) _ You think you’re so smart! You don’t know anything! _ Boy! He thinks he’s so smart!"
        },
        {
            "id": 19,
            "phrase": "(You) took the words right out of my mouth.",
            "definition": "Inf. Fig. You said exactly what I meant to say before I had a chance to say it, and, therefore, I agree with you very much. Bill: I think she’s old enough to know better. Tom: You took the words right out of my mouth.  Mary: This movie is going to put me to sleep. Jane (yawning): You took the words right out of my mouth."
        },
        {
            "id": 20,
            "phrase": "(You) want a piece of me?",
            "definition": "Sl. Do you want to fight with me? _ Come on, Wussy. You want a piece of me?"
        },
        {
            "id": 21,
            "phrase": "You wouldn’t dare (to do something)!",
            "definition": "an exclamation that shows disbelief about something that the speaker has stated an intention of doing.  Bill: I’m going to leave school. Tom: You wouldn’t dare leave! _ Bill: Be quiet or I’ll slap you. Jane: You wouldn’t dare to slap me!"
        },
        {
            "id": 22,
            "phrase": "You(‘d) better believe it!",
            "definition": "Inf. a way of emphasizing a previous statement. Bill: Man, you’re the best goalie this team has ever had! Tom: You better believe it! _ Bill: This food is so bad. It will probably stunt my growth. Tom: You’d better believe it!"
        },
        {
            "id": 23,
            "phrase": "(You’d) better get moving.",
            "definition": "an expression encouraging someone to leave.  Jane: It’s nearly dark. Better get moving. Mary: Okay. I’m leaving right now.  Bob: I’m off. Good night. Bill: Yes, it’s late. You’d better get moving."
        },
        {
            "id": 24,
            "phrase": "You’ll be sorry you asked.",
            "definition": "Inf. The answer to the question you just asked is so bad that you will be sorry you asked it. (Compare this with (Are you) sorry you asked?) _ Father: What are your grades going to be like this semester? Sally: You’ll be sorry you asked. Mary: How much did you pay for that lamp? Jane: You’ll be sorry you asked."
        },
        {
            "id": 25,
            "phrase": "You’ll get the hang of it.",
            "definition": "Don’t worry. You will learn soon how it is done.  Mary: It’s harder than I thought to glue these things together. Tom: You’ll get the hang of it.  Bill: I can’t seem to swing this club the way you showed me. Sally: You’ll get the hang of it. Don’t worry. Golf is easy."
        },
        {
            "id": 26,
            "phrase": "You’ll never get away with it.",
            "definition": "You will never succeed with that illegal or outrageous plan.  Bill: I have a plan to cheat on the exam. Mary: You’ll never get away with it. Jane: I think I can fool the IRS and save a lot on my taxes. Mary: You’ll never get away with it."
        },
        {
            "id": 27,
            "phrase": "*young at heart",
            "definition": "having a youthful spirit no matter what one’s age. (*Typically: act ~; be ~; keep someone ~; stay ~.) _ I am over 70 but I still feel young at heart."
        },
        {
            "id": 28,
            "phrase": "Young men may die, but old men must die.",
            "definition": "Prov. Young people may be killed by accidents or disease, but old people cannot avoid dying for very long, simply because they are old.  When Grandfather was so sick, he told us, “Don’t feel too bad if I pass on; it’s my time. Young men may die, old men must die.” _I’m afraid old Mr. Ferris won’t live much longer. Young men may die, but old men must die."
        },
        {
            "id": 29,
            "phrase": "Your guess is as good as mine.",
            "definition": "Inf. I do not know.  Jane: Are there any good movies playing tonight? Alan: Your guess is as good as mine.  Jill: How long should we bake this pie? Jane: Your guess is as good as mine."
        },
        {
            "id": 30,
            "phrase": "Your place or mine?",
            "definition": "Inf. an expression asking someone about whose dwelling should be the site of a rendezvous. (Often associated with a sudden or spontaneous sexual encounter.) _Bill: So, do you want to go somewhere? Mary: Your place or mine? _ Bill: I was thinking of watching a movie at home. You’re place or mine? Mary: Okay, I’ll rent the movie and we’ll watch it at your place."
        },
        {
            "id": 31,
            "phrase": "Your secret is safe with me.",
            "definition": "I will not tell your secret to anyone. Don’t worry. I won’t tell. Your secret’s safe with me. Your secret is safe with me. I will carry it to my grave."
        },
        {
            "id": 32,
            "phrase": "You’re dern tootin’!",
            "definition": "Rur. You are absolutely right! (Never the full form tooting.) _ Tom: Are you really going to take up boxing? Bob: You’re dern tootin’! _Father: Do you really want to buy that droopy-looking puppy? Bill: You’re dern tootin’!"
        },
        {
            "id": 33,
            "phrase": "You’re excused.",
            "definition": "1. You may leave the room, the table, etc. (Said in response to May I be excused?) _ Mother: Are you finished, Tom? Tom: Yes, ma’am. Mother: You’re excused.  Bill (raising his hand): Can I leave the room? I have to go get my books off my bike. Teacher: You’re excused. Bill: Thanks. 2. You must leave the room or the premises. (Typically said at the end of a scolding.) _ Father: I’ve heard quite enough of this nonsense, Tom. You’re excused. Tom: Sorry.  Andy: That is the end of this conversation. You’re excused. Bob: But, there’s more. 3. You are forgiven for belching or for some other breach of strict etiquette. (Said in response to Excuse me.) _Tom (after belching): Excuse me. Father: You’re excused.  Sally: Excuse me for being so noisy. Mother: You’re excused."
        },
        {
            "id": 34,
            "phrase": "You’re (just) wasting my time.",
            "definition": "Inf. What you have to say is of no interest to me.  Rachel: I’ve heard enough. You’re just wasting my time. Good-bye. Mary: If that’s the way you feel about it, good-bye.  Bill: Come on, Bill. I’ll show you what I mean. Bill: No, you’re wasting my time."
        },
        {
            "id": 35,
            "phrase": "You’re telling me!",
            "definition": "Inf. I know all too well the truth of what you are saying.  Tom: Man, it’s hot today! Bob: You’re telling me! _ Jane: This food is really terrible. Sally: Wow! You’re telling me!"
        },
        {
            "id": 36,
            "phrase": "You’re the doctor.",
            "definition": "Inf. Fig. You are in a position to tell me what to do.; I yield to you and your knowledge of this matter. (Usually jocular; the person being addressed is most likely not a physician.) _ Bill: Eat your dinner, then you’ll feel more like playing ball. Get some energy! Tom: Okay, you’re the doctor.  Teacher: You’d better study the first two chapters more thoroughly. Bob: You’re the doctor."
        },
        {
            "id": 37,
            "phrase": "You’re too much!",
            "definition": "1. Inf. You are too much of a problem for me.  Andy: You’re too much! I’m going to report you to the head office! Bob: Go ahead. See if I care.  Bob: Get out! Just go home! You’re too much! Andy: What did I do? Bob: You’re a pest! 2. Inf. You are just too funny, clever, entertaining, etc.  Alice: Oh, Fred, that was really funny. You’re too much! Fred: I do my best.  Sally: What a clever thing to say! You’re too much! Andy: Actually, I didn’t make it up myself."
        },
        {
            "id": 38,
            "phrase": "yours truly",
            "definition": "1. a closing phrase at the end of a letter, just before the signature.  Yours truly, Tom Jones.  Best wishes from yours truly, Bill Smith. 2. oneself; I; me.  There’s nobody here right now but yours truly.  Everyone else got up and left the table leaving yours truly to pay the bill."
        },
        {
            "id": 39,
            "phrase": "Youth must be served.",
            "definition": "Prov. Young people should be allowed to have fun. Don’t lecture the young folks because they were out dancing all night. Youth must be served.  I don’t know where my daughter gets the energy for school, sports, and a full social life. Youth must be served, I suppose."
        },
        {
            "id": 40,
            "phrase": "You’ve got another think coming.",
            "definition": "You will have to rethink your position. (The second part of an expression something like, “If you think so-and-so, then you’ve got another think coming.” Also with thing rather than think.) _ Rachel: If you think I’m going to stand here and listen to your complaining all day, you’ve got another think coming! Bill: Frankly, I don’t care what you do.  Andy: If you think you can get away with it, you’ve got another think coming! Bob: Get away with what? I didn’t do anything!"
        },
        {
            "id": 41,
            "phrase": "(You’ve) got me stumped.",
            "definition": "Inf. I can’t possibly figure out the answer to your question.  Bill: How long is the Amazon River? Jane: You’ve got me stumped. Bob: Do you know of a book that would interest a retired sea captain? Sally: You’ve got me stumped."
        },
        {
            "id": 42,
            "phrase": "You’ve got to be kidding!",
            "definition": "Inf. This cannot be the truth. Surely you are kidding me! _Bob: Sally is getting married. Did you hear? Mary: You’ve got to be kidding! _Bill: I think I swallowed my gold tooth! Mother: You’ve got to be kidding!"
        },
        {
            "id": 43,
            "phrase": "zeek out",
            "definition": "Sl. to lose control of oneself.  I was in a pretty bad state. I almost zeeked out.  Fred zeeked out and had to be calmed down."
        },
        {
            "id": 44,
            "phrase": "zerked (out)",
            "definition": "Sl. heavily intoxicated on drugs.  Gary looked really zerked out, and I thought he was really stoned.  Wilbur gets zerked out every weekend."
        },
        {
            "id": 45,
            "phrase": "zero in (on someone or something)",
            "definition": "to aim directly at someone or something.  The television camera zeroed in on the little boy scratching his head. The commercial zeroed in on the glass of cola.  Mary is very good about zeroing in on the most important and helpful ideas."
        },
        {
            "id": 46,
            "phrase": "zero tolerance",
            "definition": "absolutely no toleration of even the smallest infraction of a rule. Because of the zero tolerance rule, the kindergartner was expelled from school because his mother accidentally left a table knife in his lunch box."
        },
        {
            "id": 47,
            "phrase": "zigged when one should’ve zagged",
            "definition": "perfomed one deed when another deed would have been better; to do something inconsequentially different from another thing.  I don’t know why she complained. I guess I zigged when I should have zagged."
        },
        {
            "id": 48,
            "phrase": "zip along",
            "definition": "to move along very fast. The motorcycle zipped along nicely.  Let’s zip along and get there on time."
        },
        {
            "id": 49,
            "phrase": "zip past someone or something",
            "definition": "to run or move past someone or something very rapidly. The deer zipped past the hunter, who stood there, startled.  The cars zipped past the intersection."
        },
        {
            "id": 50,
            "phrase": "zip something on†",
            "definition": "to put on a piece of clothing and zip it up.  She zipped her jumper on and headed toward the door.  Zip on your jacket and let’s go."
        },
        {
            "id": 51,
            "phrase": "zip something up†",
            "definition": "1. to close a zipper. You should zip that zipper up. You should zip up that zipper. 2. to close a garment by zipping a zipper closed. You had better zip your jacket up. You had better zip up your jacket. 3. Sl. to close one’s mouth. (Fig. on W.) _ Zip your mouth up, Fred! _ Zip up your mouth, Fred."
        },
        {
            "id": 52,
            "phrase": "zone something as something",
            "definition": "to create a particular legally defined area within a governmental or other local area.  They zoned this area as a shopping district.  The city council zoned the vacant lot as a park."
        },
        {
            "id": 53,
            "phrase": "zone something for something",
            "definition": "to specify what can be built or what can be done within a particular legally defined area within a governmental area.  Did the council zone this area for business? _They zoned this area for residences."
        },
        {
            "id": 54,
            "phrase": "zone something off†",
            "definition": "to create a special regulatory zone in an area. The council zoned part of the land off for a park.  They zoned off land for a park."
        },
        {
            "id": 55,
            "phrase": "zonk out",
            "definition": "Sl. to collapse from exhaustion; to go into a stupor from drugs or exhaustion.  I’m gonna go home and zonk out.  I went home after the trip and just zonked out."
        },
        {
            "id": 56,
            "phrase": "zonk someone out†",
            "definition": "1. Sl. to make someone tired or exhausted.  All the work zonked him out.  She zonked out the team with the long practice. 2. Sl. to cause someone to become intoxicated.  The drug zonked Max out totally.  It zonked out Max."
        },
        {
            "id": 57,
            "phrase": "zoom across (something)",
            "definition": "to run or move across something very fast.  The missile zoomed across the sky.  We looked at the sky just as a comet zoomed across."
        },
        {
            "id": 58,
            "phrase": "zoom along",
            "definition": "to move along very rapidly. The bus zoomed along rapidly all night long.  Let’s zoom along while the road is clear."
        },
        {
            "id": 59,
            "phrase": "zoom off",
            "definition": "to leave in a hurry.  Sorry, I have to zoom off.  We will zoom off soon."
        },
        {
            "id": 60,
            "phrase": "zoom out",
            "definition": "Sl. to lose control.  I nearly zoomed out when I got the news. Fred zoomed out and started screaming at John. "
        },
        {
            "id": 61,
            "phrase": "zoom over someone or something",
            "definition": "to fly over someone or something at high speed.  The plane zoomed over the treetops.  A small bird zoomed over the hikers, shrieking wildly."
        },
        {
            "id": 62,
            "phrase": "zoom past someone or something",
            "definition": "to run or move past someone or something very rapidly.  The runners zoomed past the spectators.  Our train zoomed past town after town."
        },
        {
            "id": 63,
            "phrase": "zoom someone or something (over) to someone",
            "definition": "to send something to someone very fast.  Please use my car to zoom Molly over to the bank. Would you zoom this package to the downtown office?"
        },
        {
            "id": 64,
            "phrase": "zoom through (something)",
            "definition": "1. to pass through a town or some other location very fast.  Don’t just zoom through these little towns. Stop and explore one or two. We didn’t stop. We just zoomed through. 2. to work one’s way through something very rapidly.  She zoomed through the reading assignment and went on to something else.  Jeff can open a book and zoom through in record time."
        },
        {
            "id": 65,
            "phrase": "zoom up",
            "definition": "to drive or pull up to a place.  A car zoomed up, and seven kids got out.  Let’s zoom up to the door and see if she’s home."
        },
        {
            "id": 66,
            "phrase": "abbreviate something to something",
            "definition": "1. to make specific initials or an acronym out of a word or phrase.  The phrase was abbreviated to ABC. 2. to make something into a shorter version of itself.  The act has been abbreviated to just a few minutes."
        },
        {
            "id": 67,
            "phrase": "abbreviate something as something",
            "definition": "to make specific initials or an acronym out of a word or phrase.  The phrase was abbreviated to ABC. "
        },
        {
            "id": 68,
            "phrase": "all over",
            "definition": "1. finished.  Dinner is all over. I’m sorry you didn’t get any.  It’s all over. He’s dead now. 2. everywhere.  Oh, I just itch all over.  She’s spreading the rumor all over."
        },
        {
            "id": 69,
            "phrase": "(all) over with",
            "definition": "finished.  Dinner is all over. I’m sorry you didn’t get any.  It’s all over. He’s dead now. "
        },
        {
            "id": 70,
            "phrase": "amount to something",
            "definition": "[for someone or something] to become worthwhile or successful.  I hope Charles amounts to something some day.  I doubt that this business will ever amount to anything really profitable."
        },
        {
            "id": 71,
            "phrase": "amount (up) to something",
            "definition": "[for a sum of money] to increase [to a large amount]. Is that everything you want to buy? That amounts to twenty dollars.  These charges amount up to a lot."
        },
        {
            "id": 72,
            "phrase": "answer the call",
            "definition": "1. Euph. to die.  Our dear brother answered the call and has gone to his eternal rest. 2. Euph. to find and use the toilet.  We stopped the car long enoug for Jed to answer the call of nature. You had better answer the call of nature when you feel it coming."
        },
        {
            "id": 73,
            "phrase": "answer the call (of nature)",
            "definition": "Euph. to find and use the toilet.  We stopped the car long enoug for Jed to answer the call of nature. You had better answer the call of nature when you feel it coming."
        },
        {
            "id": 74,
            "phrase": "as long as",
            "definition": "1. since; because.  As long as you’re going to the bakery, please buy some fresh bread.  So long as you’re here, please stay for dinner. 2. if; only if.  You may have dessert so long as you eat all your vegetables. You can go out this evening as long as you promise to be home by midnight. 3. for a specified length of time.  You may stay out as long as you like.  I didn’t go to school as long as Bill did."
        },
        {
            "id": 75,
            "phrase": "so long as",
            "definition": "since; because.  As long as you’re going to the bakery, please buy some fresh bread.  So long as you’re here, please stay for dinner. "
        },
        {
            "id": 76,
            "phrase": "ask someone for something",
            "definition": "1. to request something from someone.  The diners asked the waiter for a type of wine the restaurant didn’t have.  A special wine was asked for by a number of patrons. 2. to invite someone to something.  Janet asked us to a party Friday evening.  Janet asked us for dinner."
        },
        {
            "id": 77,
            "phrase": "ask someone out (to something)",
            "definition": "1. to invite someone to go out (to something or some place) [on a date].  He asked her out to dinner, but she had other plans.  She couldn’t go, so he asked out someone else.  Liz asked Carl out for dinner. 2. to invite someone for a visit to a place in the country or some other location remote from the center of things.  Tom must be tired of the city. Let’s ask him out to our place.  I don’t want to ask out everyone in the whole family again.  Oh, let’s ask him out anyway."
        },
        {
            "id": 78,
            "phrase": "ask someone out† (for something)",
            "definition": "to invite someone to go out (to something or some place) [on a date].  He asked her out to dinner, but she had other plans.  She couldn’t go, so he asked out someone else.  Liz asked Carl out for dinner. "
        },
        {
            "id": 79,
            "phrase": "at length",
            "definition": "1. after some time; finally. At length, the roses bloomed, and the tomatoes ripened.  And at length, the wizard spoke. 2. for quite a long time.  He spoke to us about the problem at some length.  He described the history of his village at length."
        },
        {
            "id": 80,
            "phrase": "at some length",
            "definition": "for quite a long time.  He spoke to us about the problem at some length.  He described the history of his village at length."
        },
        {
            "id": 81,
            "phrase": "at one’s best",
            "definition": "1. to the utmost; to the highest degree possible.  This restaurant serves gourmet food at its best. The singer was at her best when she performed ballads. 2. in the best of health; displaying the most civilized behavior. (Often in the negative.) _ He’s at his best after a good nap.  I’m not at my best when I’m angry."
        },
        {
            "id": 82,
            "phrase": "at its best",
            "definition": "to the utmost; to the highest degree possible.  This restaurant serves gourmet food at its best. The singer was at her best when she performed ballads. "
        },
        {
            "id": 83,
            "phrase": "balance the accounts",
            "definition": "to determine through bookkeeping that accounts are in balance, that all money is accounted for. Jane was up all night balancing the accounts. The cashier was not allowed to leave the bank until the manager balanced the books."
        },
        {
            "id": 84,
            "phrase": "balance the books",
            "definition": "to determine through bookkeeping that accounts are in balance, that all money is accounted for. Jane was up all night balancing the accounts. The cashier was not allowed to leave the bank until the manager balanced the books. "
        },
        {
            "id": 85,
            "phrase": "blow a fuse",
            "definition": "1. to burn out the fuse on an electrical circuit and lose power. The microwave oven blew a fuse, so we had no power.  You’ll blow a fuse if you use too many appliances at once. 2. Fig. to explode with anger; to lose one’s temper.  Come on, don’t blow a fuse.  Go ahead, blow a gasket! What good will that do?"
        },
        {
            "id": 86,
            "phrase": "blow one’s fuse; blow a gasket; blow one’s cork; blow one’s lid; blow one’s top; blow one’s stack",
            "definition": "to explode with anger; to lose one’s temper.  Come on, don’t blow a fuse.  Go ahead, blow a gasket! What good will that do?"
        },
        {
            "id": 87,
            "phrase": "blow off",
            "definition": "[for something] to be carried off something by moving air.  The leaves of the trees blew off in the strong wind. My papers blew off the table."
        },
        {
            "id": 88,
            "phrase": "blow someone or something off†",
            "definition": "Sl. to ignore someone or something; to skip an appointment with someone; to not attend something where one is expected.  He decided to sleep in and blow this class off.  It wasn’t right for you to just blow off an old friend the way you did. "
        },
        {
            "id": 89,
            "phrase": "blow someone off†",
            "definition": "Sl. to ignore someone in order to end a romantic or other relationship.  She knew that he had blown her off when he didn’t even call her for a month. Steve blew off Rachel before he started seeing Jane. "
        },
        {
            "id": 90,
            "phrase": "boil down to something",
            "definition": "[for a liquid] to be condensed to something by boiling. Boil this mixture down to about half of what it was."
        },
        {
            "id": 91,
            "phrase": "boil down",
            "definition": "[for a liquid] to be condensed to something by boiling. Boil this mixture down to about half of what it was. "
        },
        {
            "id": 92,
            "phrase": "bottle something up†",
            "definition": "to put some sort of liquid into bottles. She bottled her homemade chili sauce up and put the bottles in a box. She bottled up a lot of the stuff."
        },
        {
            "id": 93,
            "phrase": "bottle something up† (inside (someone))",
            "definition": "to hold one’s feelings within; to keep from saying something that one feels strongly about.  Let’s talk about it, John. You shouldn’t bottle it up.  Don’t bottle up your problems. It’s better to talk them out.  Don’t bottle it up inside you.  Don’t bottle up all your feelings."
        },
        {
            "id": 94,
            "phrase": "bounce back (from something)",
            "definition": "[for something] to rebound; [for something] to return bouncing from where it had been. The ball bounced back from the wall. A rubber ball always bounces back."
        },
        {
            "id": 95,
            "phrase": "bounce back (after something)",
            "definition": "[for someone] to recover after a disability, illness, blow, or defeat.  She bounced back from her illness quickly.  She bounced back quickly after her illness."
        },
        {
            "id": 96,
            "phrase": "bounce something off (of ) someone or something",
            "definition": "to make something rebound off someone or something. (Of is usually retained before pronouns.) _ She bounced the ball off the wall, turned, and tossed it to Wally.  She bounced the ball off of Harry, into the wastebasket."
        },
        {
            "id": 97,
            "phrase": "bounce something",
            "definition": "off† Fig. to try an idea or concept out on someone or a group. (Of is usually retained before pronouns.) _ Let me bounce off this idea, if I may.  Can I bounce something off of you people, while you’re here?"
        },
        {
            "id": 98,
            "phrase": "bring someone around†",
            "definition": "to bring someone for a visit; to bring someone for someone (else) to meet.  Please bring your wife around sometime. I’d love to meet her.  You’ve just got to bring around your doctor friend for dinner."
        },
        {
            "id": 99,
            "phrase": "bring someone around (to consciousness)",
            "definition": "to bring someone to consciousness.  The doctor brought around the unconscious man with smelling salts.  The boxer was knocked out, but his manager brought him around. "
        },
        {
            "id": 100,
            "phrase": "bring someone around (to one’s way of thinking); bring someone around (to one’s position)",
            "definition": "to persuade someone (to accept something); to manage to get someone to agree (to something).  The last debate brought around a lot of voters to our candidate.  I knew I could bring her around if I just had enough time to talk to her."
        },
        {
            "id": 101,
            "phrase": "bump along",
            "definition": "to travel along a rough road.  We bumped along on the dirt road to the lake. We bumped along the road, hanging onto our hats."
        },
        {
            "id": 102,
            "phrase": "bump along something",
            "definition": "to travel along a rough road.  We bumped along on the dirt road to the lake. We bumped along the road, hanging onto our hats. "
        },
        {
            "id": 103,
            "phrase": "bundle someone into something",
            "definition": "1. to put someone, usually a child, into heavy outdoor clothing.  Bill bundled Billy into his parka.  Tom bundled himself into his parka and opened the door to go out. 2. to put someone, usually a child, into bed.  She bundled Sarah into bed after reading her a story.  June pulled the sheets back and bundled Sarah in."
        },
        {
            "id": 104,
            "phrase": "bundle someone in",
            "definition": "to put someone, usually a child, into bed.  She bundled Sarah into bed after reading her a story.  June pulled the sheets back and bundled Sarah in."
        },
        {
            "id": 105,
            "phrase": "carve something into something",
            "definition": "to cut letters or symbols into something.  He carved his initials into a tree.  He carved in the letters one by one."
        },
        {
            "id": 106,
            "phrase": "carve something in†",
            "definition": "to cut letters or symbols into something.  He carved his initials into a tree.  He carved in the letters one by one."
        },
        {
            "id": 107,
            "phrase": "cash (one’s chips) in†",
            "definition": "to turn in one’s gaming tokens or poker chips when one quits playing.  When you leave the game, you should cash your chips in.  Cash in your chips before you go.  I’m going to cash in."
        },
        {
            "id": 108,
            "phrase": "cash one’s checks in†",
            "definition": "Euph. to die; to finish the “game of life.” _There’s a funeral procession. Who cashed his chips in? _ Poor Fred cashed in his chips last week."
        },
        {
            "id": 109,
            "phrase": "caught in the crossfire",
            "definition": "trapped between two lines of enemy fire. I was caught in the crossfire and dove into a ditch to keep from getting killed."
        },
        {
            "id": 110,
            "phrase": "caught in the middle",
            "definition": "caught between two arguing people or groups, making it difficult to remain neutral.  Bill and Ann were arguing, and poor Bobby, their son, was caught in the middle."
        },
        {
            "id": 111,
            "phrase": "chew something over†",
            "definition": "1. Inf. to talk something over; to discuss something. We can chew it over at lunch. Why don’t we do lunch sometime and chew over these matters? 2. Fig. to think something over.  I’ll have to chew it over for a while. I’m not sure now.  I have to chew on all this stuff for a day or two. Then I’ll get back to you."
        },
        {
            "id": 112,
            "phrase": "chew on something",
            "definition": "to think something over.  I’ll have to chew it over for a while. I’m not sure now.  I have to chew on all this stuff for a day or two. Then I’ll get back to you."
        },
        {
            "id": 113,
            "phrase": "come around (to some place)",
            "definition": "1. to come to some place for a visit. You must come around to our place for a while.  Do come around and have dinner with us sometime. 2. to pay a casual visit to someone. Why don’t you come around to visit next week? _ Why don’t you come around for a visit? You are welcome any time."
        },
        {
            "id": 114,
            "phrase": "come out (of something)",
            "definition": "to exit from something.  When will they come out of that meeting? _The people came out from the houses and celebrated."
        },
        {
            "id": 115,
            "phrase": "come out from something",
            "definition": "to exit from something.  When will they come out of that meeting? _The people came out from the houses and celebrated. "
        },
        {
            "id": 116,
            "phrase": "crash in (on someone or something)",
            "definition": "[for something] to collapse on someone or something.  The walls crashed in around the burning house. The branches of the tree crashed down on the roof.  The old barn crashed down. "
        },
        {
            "id": 117,
            "phrase": "cut across something",
            "definition": "to travel across a particular area; to take a shortcut across a particular area.  Please don’t cut across the neighbor’s yard anymore."
        },
        {
            "id": 118,
            "phrase": "cut across",
            "definition": "to travel across a particular area; to take a shortcut across a particular area.  Please don’t cut across the neighbor’s yard anymore. "
        },
        {
            "id": 119,
            "phrase": "cut something into something",
            "definition": "1. to mix something, usually a soft baking ingredient, into something else.  Carefully cut the butter into the f lour mixture.  Now, cut in some more butter. 2. to slice or chop something into very small pieces, bits, etc. We cut the meat into one-inch cubes for the stew."
        },
        {
            "id": 120,
            "phrase": "cut something in†",
            "definition": "to mix something, usually a soft baking ingredient, into something else.  Carefully cut the butter into the f lour mixture.  Now, cut in some more butter. "
        },
        {
            "id": 121,
            "phrase": "divide something into something",
            "definition": "1. to separate something into parts.  I will divide it into two parts.  I will divide the cake in half.  If you divide the pie in fourths, the pieces will be too big. 2. to do mathematical division so that the divisor goes into the number that is to be divided. Divide seven into forty-nine and what do you get? _ If seven is divided into forty-nine, what do you get?"
        },
        {
            "id": 122,
            "phrase": "divide something in something",
            "definition": "to separate something into parts.  I will divide it into two parts.  I will divide the cake in half.  If you divide the pie in fourths, the pieces will be too big."
        },
        {
            "id": 123,
            "phrase": "do something over†",
            "definition": "1. to rebuild, redesign, or redecorate something. We did our living room over for the holidays. We made over the family room because it was looking shabby. 2. to repeat something; to do something again.  I am afraid that you are going to have to do over the complete series again.  Would you do this one over, please?"
        },
        {
            "id": 124,
            "phrase": "make something over†",
            "definition": "to rebuild, redesign, or redecorate something. We did our living room over for the holidays. We made over the family room because it was looking shabby. "
        },
        {
            "id": 125,
            "phrase": "do something over† (again)",
            "definition": "to repeat something; to do something again.  I am afraid that you are going to have to do over the complete series again.  Would you do this one over, please?"
        },
        {
            "id": 126,
            "phrase": "*down for the count",
            "definition": "1. [of a boxer] knocked down by an opponent’s punching and remaining down until the last count, or even beyond. (*Typically: be ~; go ~.) _Wally is down for the count. Chris is the winner. 2. eliminated from something or an activity for a period of time, perhaps permanently. (*Typically: be ~; go ~.) _ I can’t continue with this course. I’m down for the count.  I’m down for the count. I have the f lu."
        },
        {
            "id": 127,
            "phrase": "*out for the count",
            "definition": "[of a boxer] knocked down by an opponent’s punching and remaining down until the last count, or even beyond. (*Typically: be ~; go ~.) _Wally is down for the count. Chris is the winner. "
        },
        {
            "id": 128,
            "phrase": "drag someone or something through something",
            "definition": "to pull someone or something through an opening.  I dragged my brother through the opening into the room.  We dragged the sofa through the window because we couldn’t get it through the door."
        },
        {
            "id": 129,
            "phrase": "drag someone or something through",
            "definition": "to pull someone or something through an opening.  I dragged my brother through the opening into the room.  We dragged the sofa through the window because we couldn’t get it through the door. "
        },
        {
            "id": 130,
            "phrase": "draw near",
            "definition": "to come near to someone or something. Draw near to me, and let me look at you.  Draw near to the table and look at this."
        },
        {
            "id": 131,
            "phrase": "draw near (to someone or something)",
            "definition": "to come near to someone or something. Draw near to me, and let me look at you.  Draw near to the table and look at this. "
        },
        {
            "id": 132,
            "phrase": "dump on someone or something",
            "definition": "1. to snow on someone or something.  Well, it dumped on us again last night.  The cold front dumped on the northeast again today. 2. Sl. to criticize someone or something; to destroy someone or something.  There is no need to do a dump on me. I didn’t wreck your car.  The boss— mad as a wet hen—dumped all over me."
        },
        {
            "id": 133,
            "phrase": "dump one’s load",
            "definition": "1. Sl. to empty one’s stomach; to vomit.  He’s had too much to drink and is dumping his load. 2. Sl. to defecate. (Crude. Potentially offensive. Use only with discretion.) _He had to go dump a load.  He dumped his load and settled back down to work."
        },
        {
            "id": 134,
            "phrase": "dump a load",
            "definition": "Sl. to defecate. (Crude. Potentially offensive. Use only with discretion.) _He had to go dump a load.  He dumped his load and settled back down to work."
        },
        {
            "id": 135,
            "phrase": "eat something up†",
            "definition": "to devour all of some food or an animal.  They ate the turkey up, and no one had to eat leftovers. The lion ate up the zebra very quickly."
        },
        {
            "id": 136,
            "phrase": "eat an animal up†",
            "definition": "to devour all of some food or an animal.  They ate the turkey up, and no one had to eat leftovers. The lion ate up the zebra very quickly. "
        },
        {
            "id": 137,
            "phrase": "entangle someone or something in something",
            "definition": "to catch or tangle up someone, a group, or an animal in something. Careful! Don’t entangle your foot in the anchor chain. Somehow I entangled the dog in the fishing net."
        },
        {
            "id": 138,
            "phrase": "entangle an animal in something",
            "definition": "to catch or tangle up someone, a group, or an animal in something. Careful! Don’t entangle your foot in the anchor chain. Somehow I entangled the dog in the fishing net. "
        },
        {
            "id": 139,
            "phrase": "expect something from someone or something",
            "definition": "1. to anticipate receiving something from someone or a group.  I expect a letter from you at least once a week while you are gone.  We expect at least a postcard out of you. 2. And expect something (out) of someone or something to demand something from someone or something.  I expect more effort from you. Get to work. 3. to anticipate a certain kind of behavior from someone or something.  We expected better from you. I’m very disappointed in your behavior.  We really expected better behavior of you."
        },
        {
            "id": 140,
            "phrase": "expect something (out) of someone or something",
            "definition": "to anticipate a certain kind of behavior from someone or something.  We expected better from you. I’m very disappointed in your behavior.  We really expected better behavior of you."
        },
        {
            "id": 141,
            "phrase": "fall into a trap",
            "definition": "to get caught in a trap. The tiger fell into a trap and leapt out again immediately. The boys tried to get a squirrel to fall into a trap, but squirrels are too clever."
        },
        {
            "id": 142,
            "phrase": "fall into the trap; fall into someone’s trap",
            "definition": "to become caught in someone’s scheme; to be deceived into doing or thinking something. We fell into a trap by asking for an explanation.  I fell into his trap when I agreed to drive him home."
        },
        {
            "id": 143,
            "phrase": "flare up",
            "definition": "[for something] to ignite and burn. The firewood flared up at last—four matches having been used."
        },
        {
            "id": 144,
            "phrase": "flare up at someone or something",
            "definition": "to lose one’s temper at someone or something.  I could tell by the way he f lared up at me that he was not happy with what I had done.  I didn’t mean to f lare up."
        },
        {
            "id": 145,
            "phrase": "flesh and blood",
            "definition": "a living human body, especially with reference to its natural limitations; a human being. This cold weather is more than f lesh and blood can stand.  Carrying 300 pounds is beyond mere f lesh and blood."
        },
        {
            "id": 146,
            "phrase": "own flesh and blood",
            "definition": "one’s own relatives; one’s own kin.  That’s no way to treat one’s own f lesh and blood.  I want to leave my money to my own f lesh and blood."
        },
        {
            "id": 147,
            "phrase": "fly into something",
            "definition": "1. to go to something or some place by air; to arrive by air.  When are you going to f ly into the airport? _We will f ly into Detroit tomorrow. 2. to crash into something while flying.  Birds sometimes f ly into tall buildings. 3. to pass into something, such as fog, clouds, wind, etc., while flying.  We f lew into some clouds, but the f light was not rough.  The plane f lew into some fog as it was landing."
        },
        {
            "id": 148,
            "phrase": "fly in",
            "definition": "to go to something or some place by air; to arrive by air.  When are you going to f ly into the airport? _We will f ly into Detroit tomorrow. "
        },
        {
            "id": 149,
            "phrase": "fold something into something",
            "definition": "1. to blend something, such as eggs, into batter.  Carefully, the chef folded the eggs into the other ingredients. The chef folded in the eggs. 2. to make an object by folding something, such as paper or cloth.  He folded the paper into a little bird.  Wally can fold a sheet of paper into an airplane that f lies."
        },
        {
            "id": 150,
            "phrase": "fold something in†",
            "definition": "to blend something, such as eggs, into batter.  Carefully, the chef folded the eggs into the other ingredients. The chef folded in the eggs."
        },
        {
            "id": 151,
            "phrase": "frighten someone or an animal into something",
            "definition": "1. to scare someone or an animal into entering something or some place.  The trouble in the neighborhood frightened most of the residents into their houses.  The mouse was out of its hole, but we came in and frightened the little mouse back in. 2. to scare someone or an animal into a particular state.  They frightened me into a quivering mass.  The mouse was frightened into a state of confusion."
        },
        {
            "id": 152,
            "phrase": "frighten someone or an animal in†",
            "definition": "to scare someone or an animal into entering something or some place.  The trouble in the neighborhood frightened most of the residents into their houses.  The mouse was out of its hole, but we came in and frightened the little mouse back in. "
        },
        {
            "id": 153,
            "phrase": "get into a mess",
            "definition": "to get some part of one into a sloppy or messy substance. Look at your shoes! You really got into a mess.  Please don’t get into a mess in the park."
        },
        {
            "id": 154,
            "phrase": "get into a jam",
            "definition": "to get into difficulty; to get into trouble.  Now you have really gotten into a mess.  I got into a real mess at work."
        },
        {
            "id": 155,
            "phrase": "get together (with someone) (on someone or something)",
            "definition": "to meet with someone about someone or something.  I would like to get together with you on this Wilson matter. What would be a good time for you? _Let’s get together on Fred and his department at our next meeting."
        },
        {
            "id": 156,
            "phrase": "get together (with someone) (about someone or something)",
            "definition": "to meet with someone about someone or something.  I would like to get together with you on this Wilson matter. What would be a good time for you? _Let’s get together on Fred and his department at our next meeting."
        },
        {
            "id": 157,
            "phrase": "give someone a lift",
            "definition": "1. Fig. to provide transportation for someone.  I’ve got to get into town. Can you give me a lift? 2. Fig. to raise someone’s spirits; to make a person feel better.  It was a good conversation, and her kind words really gave me a lift."
        },
        {
            "id": 158,
            "phrase": "give someone a ride",
            "definition": "to provide transportation for someone.  I’ve got to get into town. Can you give me a lift? "
        },
        {
            "id": 159,
            "phrase": "glean something from something",
            "definition": "to gather the leftovers of something from something; to gather the ears of grain left in a field after a harvest.  The poor people gleaned their entire living from what was left in the fields.  We will have to go out and glean something from the fields."
        },
        {
            "id": 160,
            "phrase": "glean something from someone",
            "definition": "to figure something out from bits of gossip.  I was able to glean some important news from Tommy.  Tell me the news you gleaned from the people in town."
        },
        {
            "id": 161,
            "phrase": "go into something",
            "definition": "to enter something; to penetrate something.  The needle went into the vein smoothly and painlessly.  It went in with no trouble."
        },
        {
            "id": 162,
            "phrase": "go to seed",
            "definition": "[for a plant] to grow long enough to produce seed; [for a plant] to spend its energy going to seed.  The lettuce went to seed and we couldn’t eat it.  Plants like that ought not to be allowed to go to seed."
        },
        {
            "id": 163,
            "phrase": "run to seed",
            "definition": "[for a plant] to grow long enough to produce seed; [for a plant] to spend its energy going to seed.  The lettuce went to seed and we couldn’t eat it.  Plants like that ought not to be allowed to go to seed. "
        },
        {
            "id": 164,
            "phrase": "grind something into something",
            "definition": "1. to pulverize something into powder, grit, particles, etc. The machine ground the rocks into gravel.  The mill ground the grain into f lour. 2. to crush or rub something into something.  People’s feet ground the cigarette ashes into the carpet.  Their feet ground in the ashes."
        },
        {
            "id": 165,
            "phrase": "grind something in†",
            "definition": "to crush or rub something into something.  People’s feet ground the cigarette ashes into the carpet.  Their feet ground in the ashes."
        },
        {
            "id": 166,
            "phrase": "*a grip on something",
            "definition": "1. a hold on something Lit. a good grasp on something. (*Typically: get ~; have ~; give someone ~.) _ Try to get a grip on the ropes and pull yourself up.  You should get a hold on the knob and turn it firmly. 2. Fig. a thorough knowledge of some topic. (*Typically: get ~; have ~; give someone ~.) _ I need to have a grip on the basics of accounting.  Try to get a hold on all the facts first."
        },
        {
            "id": 167,
            "phrase": "*a hold on something",
            "definition": "a good grasp on something. (*Typically: get ~; have ~; give someone ~.) _ Try to get a grip on the ropes and pull yourself up.  You should get a hold on the knob and turn it firmly. "
        },
        {
            "id": 168,
            "phrase": "hang on by a hair; hang on by a thread",
            "definition": "to depend on something very insubstantial; to hang in the balance.  Your whole argument is hanging by a thread.  John isn’t failing geometry, but his passing grade is just hanging by a hair."
        },
        {
            "id": 169,
            "phrase": "hang up (on someone or something)",
            "definition": "1. to end a telephone call by returning the receiver to the cradle while the other party is still talking.  She hung up on me! _ I had to hang up on all that rude talk. 2. to give up on someone or something; to quit dealing with someone or something.  Finally, I had to hang up on Jeff. I can’t depend on him for anything.  We hung up on them because we knew we couldn’t make a deal."
        },
        {
            "id": 170,
            "phrase": "hang up (in someone’s ear)",
            "definition": "to end a telephone call by returning the receiver to the cradle while the other party is still talking.  She hung up on me! _ I had to hang up on all that rude talk. "
        },
        {
            "id": 171,
            "phrase": "hold someone or something off†",
            "definition": "to do something physical to keep someone or something away; to stave someone or something off.  Tom was trying to rob us, but we managed to hold him off.  We held off the attackers.  I couldn’t keep off the reporters any longer."
        },
        {
            "id": 172,
            "phrase": "keep someone or something off†",
            "definition": "to do something physical to keep someone or something away; to stave someone or something off.  Tom was trying to rob us, but we managed to hold him off.  We held off the attackers.  I couldn’t keep off the reporters any longer. "
        },
        {
            "id": 173,
            "phrase": "Hold the phone.",
            "definition": "1. Fig. Please wait on the telephone and do not hang up. (A phrase in use before telephone “hold” circuitry was in wide use.) _ Bill: Hold the wire, please. (Turning to Tom) Tom, the phone’s for you. Tom: Be right there. Rachel: Do you wish to speak to Mr. Jones or Mr. Franklin? Henry: Jones. Rachel: Thank you. Hold the line, please. Sue: Good afternoon, Acme Motors, hold please. Bill (hanging up): That makes me so mad! 2. Fig.Wait just a minute.; Don’t rush into something.  Hold the phone! Let’s think about it a little longer.  Hold the phone. I just had another idea."
        },
        {
            "id": 174,
            "phrase": "Hold the wire(, please).; Hold, please.; Hold the line(, please).; Hold the phone(, please).; Please hold.",
            "definition": "Please wait on the telephone and do not hang up. (A phrase in use before telephone “hold” circuitry was in wide use.) _ Bill: Hold the wire, please. (Turning to Tom) Tom, the phone’s for you. Tom: Be right there. Rachel: Do you wish to speak to Mr. Jones or Mr. Franklin? Henry: Jones. Rachel: Thank you. Hold the line, please. Sue: Good afternoon, Acme Motors, hold please. Bill (hanging up): That makes me so mad!"
        },
        {
            "id": 175,
            "phrase": "hold up",
            "definition": "to endure; to last a long time.  How long will this cloth hold up? _ I want my money back for this chair. It isn’t holding up well."
        },
        {
            "id": 176,
            "phrase": "hold up (for someone or something)",
            "definition": "to wait; to stop and wait for someone or something.  Hold up for Wallace. He’s running hard to catch up to us.  Hold up a minute."
        },
        {
            "id": 177,
            "phrase": "howl at someone or something",
            "definition": "[for a canine] to bay at someone or something.  The dog howls at me when I play the trumpet.  The wolves howled at the moon and created a terrible uproar."
        },
        {
            "id": 178,
            "phrase": "hoot at someone or something",
            "definition": "to yell out at someone or something. The audience howled at the actors and upset them greatly.  We hooted at the singer until he stopped. "
        },
        {
            "id": 179,
            "phrase": "imprint something on(to) something",
            "definition": "1. to print something onto something. We imprinted your name onto your stationery and your business cards.  Please imprint my initials on this label. 2. to record something firmly in the memory of someone.  The severe accident imprinted a sense of fear onto Lucy’s mind.  Imprint the numbers into your brain and never forget them! 3. to make a permanent record of something in an animal’s brain. (As with newly hatched fowl, which imprint the image of the first moving creature they see into their brains.) _The sight of its mother imprinted itself on the little gosling’s brain.  Nature imprints this information into the bird’s memory."
        },
        {
            "id": 180,
            "phrase": "imprint something into something",
            "definition": "to record something firmly in the memory of someone.  The severe accident imprinted a sense of fear onto Lucy’s mind.  Imprint the numbers into your brain and never forget them! "
        },
        {
            "id": 181,
            "phrase": "*in someone’s way",
            "definition": "in the pathway of someone. (*Typically: be ~; get [into] ~; stand ~.) _ Don’t get in Bob’s way while he is bringing groceries in from the car."
        },
        {
            "id": 182,
            "phrase": "in the way of someone(’s plans)",
            "definition": "interfering with a person in the pursuit of plans or intentions; hindering someone’s plans. (*Typically: be ~; get ~; stand ~.) _ I am going to leave home. Please don’t get in my way.  She intends to become a lawyer and no one had better get in her way.  I would never get into the way of her plans."
        },
        {
            "id": 183,
            "phrase": "in the spotlight",
            "definition": "1. Fig. in the beam of a spotlight, as on a stage.  The singer was in the spotlight but the band was almost in the dark. 2. Fig. at the center of attention. (Limelight refers to an obsolete type of spotlight, and the word occurs only in this phrase.) _ John will do almost anything to get himself into the limelight.  I love being in the spotlight.  All elected officials spend a lot of time in the limelight."
        },
        {
            "id": 184,
            "phrase": "in the limelight",
            "definition": "at the center of attention. (Limelight refers to an obsolete type of spotlight, and the word occurs only in this phrase.) _ John will do almost anything to get himself into the limelight.  I love being in the spotlight.  All elected officials spend a lot of time in the limelight."
        },
        {
            "id": 185,
            "phrase": "infiltrate into something",
            "definition": "1. to permeate something; to filter into something. The sour smell infiltrated into everything in the refrigerator.  The paint smell infiltrated into every room in the house. 2. to penetrate a group, secretly, for the purposes of spying or influencing the activities of the group.  The spy infiltrated into the enemy headquarters. They infiltrated into the government."
        },
        {
            "id": 186,
            "phrase": "infiltrate something",
            "definition": "to penetrate a group, secretly, for the purposes of spying or influencing the activities of the group.  The spy infiltrated into the enemy headquarters. They infiltrated into the government."
        },
        {
            "id": 187,
            "phrase": "It’s your move.",
            "definition": "[in a game] It’s your time to play.  It’s your move, and I think I have you trapped."
        },
        {
            "id": 188,
            "phrase": "It’s your turn.",
            "definition": "[in a game] It’s your time to play.  It’s your move, and I think I have you trapped. "
        },
        {
            "id": 189,
            "phrase": "keep on something",
            "definition": "to work to remain mounted on something, such as a horse, bicycle, etc._It’s really hard for me to keep on a horse.  It’s hard to keep on when it’s moving all over the place."
        },
        {
            "id": 190,
            "phrase": "keep on",
            "definition": "to work to remain mounted on something, such as a horse, bicycle, etc._It’s really hard for me to keep on a horse.  It’s hard to keep on when it’s moving all over the place. "
        },
        {
            "id": 191,
            "phrase": "keep someone or something still",
            "definition": "to make someone or something silent or less noisy.  Can you please keep the baby still? _ Keep that stereo quiet! "
        },
        {
            "id": 192,
            "phrase": "keep someone or something quiet",
            "definition": "to make someone or something silent or less noisy.  Can you please keep the baby still? _ Keep that stereo quiet! "
        },
        {
            "id": 193,
            "phrase": "hold someone or something still",
            "definition": "to restrain or control someone or something so that the person or thing cannot move. Please keep your foot still. It makes me nervous when you wiggle it.  You have to hold the nail still if you want to hit it."
        },
        {
            "id": 194,
            "phrase": "Keep still.",
            "definition": "Do not move.  Quit wiggling. Keep still! _ “Hold still. I can’t examine your ear if you’re moving,” said the doctor. "
        },
        {
            "id": 195,
            "phrase": "Hold still.",
            "definition": "Do not move.  Quit wiggling. Keep still! _ “Hold still. I can’t examine your ear if you’re moving,” said the doctor. "
        },
        {
            "id": 196,
            "phrase": "kick off",
            "definition": "to start play in a football game by kicking the ball.  Tom kicked off in the last game. Now it’s my turn.  John tripped when he was kicking off."
        },
        {
            "id": 197,
            "phrase": "kick the bucket",
            "definition": "to die.  Don’t say that George Washington “kicked off.” Say that he “passed away.” _ My cat kicked off last night. She was tough as a lion. When I kick the bucket, I want a huge funeral with lots of flowers and crying."
        },
        {
            "id": 198,
            "phrase": "knock around",
            "definition": "1. to waste time.  Stop knocking around and get to work! _ I need a couple of days a week just for knocking around. 2. to wander around; to bum around.  I think I’ll knock around a few months before looking for another job. We’re just knocking around and keeping out of trouble."
        },
        {
            "id": 199,
            "phrase": "kick around",
            "definition": "to wander around; to bum around.  I think I’ll knock around a few months before looking for another job. We’re just knocking around and keeping out of trouble."
        },
        {
            "id": 200,
            "phrase": "knock someone cold",
            "definition": "1. Fig. to render someone unconscious by a violent blow. One swipe, and he knocked him cold.  If you touch her again, I’ll knock you cold. 2. Fig. to put on a stunning performance or display for someone. (Someone is often replaced by ’em from them.) _This band is going to do great tonight. We’re going to knock them dead.  “See how your sister is all dressed up!” said Bill. “She’s going to knock ’em cold.”"
        },
        {
            "id": 201,
            "phrase": "knock someone dead",
            "definition": "to put on a stunning performance or display for someone. (Someone is often replaced by ’em from them.) _This band is going to do great tonight. We’re going to knock them dead.  “See how your sister is all dressed up!” said Bill. “She’s going to knock ’em cold.”"
        },
        {
            "id": 202,
            "phrase": "knock someone for a loop",
            "definition": "1. Fig. to strike someone hard. You really knocked me for a loop. I hope that was an accident. I was really knocked for a loop by the falling branch. 2. Fig. to confuse or shock someone. (This is more severe and upsetting than throw someone a curve.) _ When Bill heard the news, it threw him for a loop. The manager knocked Bob for a loop by firing him on the spot."
        },
        {
            "id": 203,
            "phrase": "throw someone for a loop",
            "definition": "to confuse or shock someone. (This is more severe and upsetting than throw someone a curve.) _ When Bill heard the news, it threw him for a loop. The manager knocked Bob for a loop by firing him on the spot."
        },
        {
            "id": 204,
            "phrase": "knock the bottom out (of something)",
            "definition": "to break the bottom of a container. I knocked the bottom out of the barrel and used it to store compost. Knock out the bottom and set it right on the soil."
        },
        {
            "id": 205,
            "phrase": "knock the bottom out†",
            "definition": "to break the bottom of a container. I knocked the bottom out of the barrel and used it to store compost. Knock out the bottom and set it right on the soil."
        },
        {
            "id": 206,
            "phrase": "know one’s way around",
            "definition": "to know how to get from place to place.  I can find my way. I know my way around.  I don’t know my way around this city yet."
        },
        {
            "id": 207,
            "phrase": "know one’s way about",
            "definition": "to know how to get from place to place.  I can find my way. I know my way around.  I don’t know my way around this city yet. "
        },
        {
            "id": 208,
            "phrase": "lather up",
            "definition": "1. [for a horse] to develop a foam of sweat from working very hard.  The horses lathered up heavily during the race. Don’t let your horse lather up! 2. [for soap] to develop thick suds when rubbed in water.  This soap won’t lather up, even when I rub it hard.  When the soap lathers up, spread the lather on your face and rub. 3. [for one] to apply soap lather to one’s body.  He will spend a few minutes lathering himself up before he rinses.  He lathered up and then shaved."
        },
        {
            "id": 209,
            "phrase": "lather oneself up",
            "definition": "[for one] to apply soap lather to one’s body.  He will spend a few minutes lathering himself up before he rinses.  He lathered up and then shaved."
        },
        {
            "id": 210,
            "phrase": "lay a (heavy) trip on someone",
            "definition": "1. Inf. to criticize someone.  There’s no need to lay a trip on me. I agree with you.  When he finally does get there, I’m going to lay a heavy trip on him like he’ll never forget. 2. Inf. to confuse or astonish someone.  After he laid a heavy trip on me about how the company is almost broke, I cleaned out my desk and left.  After Mary laid a trip on John about leaving him, all he could do was cry. 3. Inf. to attempt to make someone feel very guilty.  Why do you have to lay a guilt trip on me? Why don’t you go to a shrink? _ Of course, she just had to lay a trip on him about being bossy, self-centered, and aloof. 4. Inf. to reveal serious or devastating information to someone. That’s a powerful story. I didn’t know you were going to lay a heavy trip like that on me. Man, you really laid a trip on me."
        },
        {
            "id": 211,
            "phrase": "lay a guilt trip on someone",
            "definition": "Inf. to attempt to make someone feel very guilty.  Why do you have to lay a guilt trip on me? Why don’t you go to a shrink? _ Of course, she just had to lay a trip on him about being bossy, self-centered, and aloof."
        },
        {
            "id": 212,
            "phrase": "lead someone on",
            "definition": "1. to guide someone onward.  We led him on so he could see more of the gardens.  Please lead Mary on. There is lots more to see here. 2. to tease someone; to encourage someone’s roman- tic or sexual interest without sincerity. You are just leading me on! _ It’s not fair to continue leading him on.  It’s easy to lead on teenage boys."
        },
        {
            "id": 213,
            "phrase": "lead someone on†",
            "definition": "to tease someone; to encourage someone’s roman- tic or sexual interest without sincerity. You are just leading me on! _ It’s not fair to continue leading him on.  It’s easy to lead on teenage boys."
        },
        {
            "id": 214,
            "phrase": "line up behind someone or something",
            "definition": "1. to form or get into a line behind someone or something. Please line up behind Kelly. Please go and line up behind the sign. 2. to organize in support of someone or something.  We all got behind Todd and got him elected.  We got behind the most active political party."
        },
        {
            "id": 215,
            "phrase": "get behind someone or something",
            "definition": "to organize in support of someone or something.  We all got behind Todd and got him elected.  We got behind the most active political party."
        },
        {
            "id": 216,
            "phrase": "look down (at someone or something)",
            "definition": "1. to turn one’s gaze downward at someone or something.  She looked down at me and giggled at the awkward position I was in.  She looked down and burst into laughter. 2. to view someone or something as lowly or unworthy.  She looked down at all the waiters and treated them badly.  They looked down on our humble food. Don’t look down your nose at my car just because it’s rusty and noisy."
        },
        {
            "id": 217,
            "phrase": "look into something",
            "definition": "to gaze into the inside of something.  Look into the box and make sure you’ve gotten everything out of it. Look into the camera’s viewfinder at the little red light."
        },
        {
            "id": 218,
            "phrase": "lose one’s hold over someone or something",
            "definition": "to give up control over someone or something.  The manager lost her hold on her employees and was fired. Fred is losing his grip on his workers.  He is losing his hold over his empire."
        },
        {
            "id": 219,
            "phrase": "not miss much",
            "definition": "1. Inf. not to miss observing any part of what is going on. (Usually with do as in the examples.) _ Ted doesn’t miss much. He is very alert. The puppy doesn’t miss a thing. He sees every move you make. 2. Inf. not to miss experiencing something that really was not worth experiencing anyway. (Usually with do as in the examples.) _I missed the big sales meeting last week, but I understand I didn’t miss much.  Bill: I didn’t see that new movie that is showing at the theater. Tom: You didn’t miss much; it was pretty bad."
        },
        {
            "id": 220,
            "phrase": "not miss a thing",
            "definition": "Inf. not to miss observing any part of what is going on. (Usually with do as in the examples.) _ Ted doesn’t miss much. He is very alert. The puppy doesn’t miss a thing. He sees every move you make. "
        },
        {
            "id": 221,
            "phrase": "*out of control",
            "definition": "[of something, such as a machine] not responding to direction or instructions. (*Typically: be ~; go ~.) _The computer is out of control and making funny-looking characters all over the screen.  My CD player is out of control and only makes screeching noises."
        },
        {
            "id": 222,
            "phrase": "*out of hand",
            "definition": "acting wildly or violently. (*Typically: be ~; get ~.) _Watch out, that dog is out of control.  The kids got out of hand again."
        },
        {
            "id": 223,
            "phrase": "*out of step (with someone or something)",
            "definition": "out of cadence with someone else. (*Typically: be ~; dance ~; get ~; march ~.) _You’ve gotten out of step with the music. Pay attention, Ann. You’re out of time."
        },
        {
            "id": 224,
            "phrase": "*out of time (with someone or something)",
            "definition": "out of cadence with someone else. (*Typically: be ~; dance ~; get ~; march ~.) _You’ve gotten out of step with the music. Pay attention, Ann. You’re out of time. "
        },
        {
            "id": 225,
            "phrase": "*out of the way",
            "definition": "not blocking or impeding the way. (*Typically: get ~; get someone or something ~; move someone or something ~.) _ Please get out of my way.  Would you please get your foot out of the way?"
        },
        {
            "id": 226,
            "phrase": "*out of someone’s way",
            "definition": "not blocking or impeding the way. (*Typically: get ~; get someone or something ~; move someone or something ~.) _ Please get out of my way.  Would you please get your foot out of the way? "
        },
        {
            "id": 227,
            "phrase": "*out of the road",
            "definition": "not blocking or impeding the way. (*Typically: get ~; get someone or something ~; move someone or something ~.) _ Please get out of my way.  Would you please get your foot out of the way? "
        },
        {
            "id": 228,
            "phrase": "*out of one’s way",
            "definition": "not along the way; not included in the proposed route. (*Typically: be ~.) _ I’m sorry, but I can’t give you a ride home. It’s out of my way. That route is out of our way. "
        },
        {
            "id": 229,
            "phrase": "out to lunch",
            "definition": "eating lunch away from one’s place of work or activity. I’m sorry, but Sally Jones is out to lunch. May I take a message? _ She’s been out to lunch for nearly two hours. When will she be back?"
        },
        {
            "id": 230,
            "phrase": "out of it",
            "definition": "not alert; giddy; uninformed. Bill is really out of it. Why can’t he pay attention? _Don’t be out of it, John. Wake up! _ Ann is really out to lunch these days."
        },
        {
            "id": 231,
            "phrase": "*out-of-bounds",
            "definition": "outside the boundaries of the playing area. (*Typically: be ~; get ~; go ~.) _ The ball went out-of-bounds just at the end of the game.  The whistle blew when Juan went out-of-bounds."
        },
        {
            "id": 232,
            "phrase": "*offlimits",
            "definition": "forbidden. (*Typically: be ~.) _This area is off-limits. You can’t go in there.  Don’t go there. It’s outof- bounds.  That kind of behavior is off-limits. Stop it!"
        },
        {
            "id": 233,
            "phrase": "*over someone’s head",
            "definition": "1. Fig. [of the intellectual content of something] too difficult for someone to understand. (*Typically: be ~; go ~; pass ~.) _All that talk about computers went over my head.  I hope my lecture didn’t go over the students’ heads. 2. Fig. to an authority higher than someone. (*Typically: be ~; go ~.) _ I don’t want to have to go over your head, but I will if necessary.  I had to go over Fran to get it done.  My boss wouldn’t listen to my complaint, so I went above her."
        },
        {
            "id": 234,
            "phrase": "pan out",
            "definition": "to move back to a wider angle picture using a zoom lens.  The camera zoomed out.  Pan out at this point in the script and give a wider view of the scene. "
        },
        {
            "id": 235,
            "phrase": "zoom out",
            "definition": "to move back to a wider angle picture using a zoom lens.  The camera zoomed out.  Pan out at this point in the script and give a wider view of the scene. "
        },
        {
            "id": 236,
            "phrase": "pick holes in something",
            "definition": "1. to criticize something severely; to point out the flaws or fallacies in an argument.  The lawyer picked holes in the witness’s story.  They will pick holes in your argument.  Stop picking holes in everything I say! 2. to poke or pinch little holes in something. Look! You’ve picked holes in the bread! How can I make sandwiches? _Who picked holes in the blanket?"
        },
        {
            "id": 237,
            "phrase": "pick something to pieces",
            "definition": "to criticize something severely; to point out the flaws or fallacies in an argument.  The lawyer picked holes in the witness’s story.  They will pick holes in your argument.  Stop picking holes in everything I say! "
        },
        {
            "id": 238,
            "phrase": "*plain as the nose on one’s face",
            "definition": "Cliché clear and understandable. (*Also: as ~.) _ The lecture was as plain as day. No one had to ask questions. Jane: I don’t understand why Professor Potter has been so friendly this week. Alan: It’s plain as the nose on your face. He wants to be nominated for Professor of the Year."
        },
        {
            "id": 239,
            "phrase": "play around (with someone or something)",
            "definition": "1. to play and frolic with someone or something.  Kelly likes to play around with the other kids.  The boys are out in the yard, playing about with the neighbor girls.  Will you kids stop playing about and get busy? _ Stop playing around and get busy! 2. Euph. to have a romantic or sexual affair with someone or persons in general.  Kelly found out that her husband had been playing around with Susan. I can’t believe that Roger is playing around!"
        },
        {
            "id": 240,
            "phrase": "play about (with someone or something)",
            "definition": "to play and frolic with someone or something.  Kelly likes to play around with the other kids.  The boys are out in the yard, playing about with the neighbor girls.  Will you kids stop playing about and get busy? _ Stop playing around and get busy!"
        },
        {
            "id": 241,
            "phrase": "play something by ear",
            "definition": "1. to be able to play a piece of music after just listening to it a few times, without looking at the notes.  I can play “Stardust” by ear.  Some people can play Chopin’s music by ear. 2. to play a musical instrument well, without formal training.  John can play the piano by ear.  If I could play by ear, I wouldn’t have to take lessons—or practice! 3. to improvise; to decide one’s next steps after one is already involved in a situation.  If we go into the meeting unprepared, we’ll have to play everything by ear. He never prepared his presentations. He always played things by ear."
        },
        {
            "id": 242,
            "phrase": "play by ear",
            "definition": "to play a musical instrument well, without formal training.  John can play the piano by ear.  If I could play by ear, I wouldn’t have to take lessons—or practice! "
        },
        {
            "id": 243,
            "phrase": "poke around",
            "definition": "1. to look or search around.  I’ve been poking around in the library looking for some statistics.  I don’t mind if you look in my drawer for a paper clip, but please don’t poke about. 2. to waste time while moving about.  I just poked around all afternoon and didn’t accomplish much.  Stop poking around and get moving."
        },
        {
            "id": 244,
            "phrase": "poke about",
            "definition": "to look or search around.  I’ve been poking around in the library looking for some statistics.  I don’t mind if you look in my drawer for a paper clip, but please don’t poke about. "
        },
        {
            "id": 245,
            "phrase": "pour cold water on something",
            "definition": "to douse something with cold water.  Pour cold water on the vegetables to freshen them.  I poured cold water on my head to cool myself off."
        },
        {
            "id": 246,
            "phrase": "puff (away) at something",
            "definition": "1. to blow at or into something in puffs.  She puffed away at the beach ball, blowing it up as fast as she could. Todd puffed at the fire until it grew larger. 2. to smoke something, such as a cigar, cigarette, or pipe. Scott was puffing away at his pipe. She is always puffing on a cigarette."
        },
        {
            "id": 247,
            "phrase": "puff (away) on something",
            "definition": "to smoke something, such as a cigar, cigarette, or pipe. Scott was puffing away at his pipe. She is always puffing on a cigarette."
        },
        {
            "id": 248,
            "phrase": "pull something off†",
            "definition": "1. Inf. to manage to make something happen. Yes, I can pull it off. Do you think you can pull off this deal? 2. Lit. to tug or drag something off someone or something else. (Of is usually retained before pronouns.) _ Sam pulled the covers off the bed and fell into it, dead tired.  He pulled off his clothes and stepped into the shower."
        },
        {
            "id": 249,
            "phrase": "push ahead (with something)",
            "definition": "to go on ahead, pushing with something. The worker pushed ahead with the plow, moving the snow to the side of the road.  Our car followed the snowplow, which was pushing ahead at a fast clip."
        }
    ]
}