{
    "dictionary": [
        {
            "id": 0,
            "phrase": "switch over (to someone or something)",
            "definition": "to change to or choose someone or something else.  That newscaster is too contentious. Switch over to another station. Okay, I’ll switch over."
        },
        {
            "id": 1,
            "phrase": "switch someone or something around†",
            "definition": "to change, swing, or turn someone or something. I was prepared for a late f light out of Miami, but they switched me around at the last minute.  They switched around my f lights."
        },
        {
            "id": 2,
            "phrase": "switch someone or something off†",
            "definition": "to cause someone or something to be quiet or stop doing something.  I got tired of listening to her, so I punched the button and switched her off.  I switched off the television set."
        },
        {
            "id": 3,
            "phrase": "switch someone or something over to something",
            "definition": "to reassign, change, or convert someone or something to something.  They switched me over to a later f light.  I want to switch my furnace over to gas."
        },
        {
            "id": 4,
            "phrase": "switch someone or something over to someone or something",
            "definition": "to transfer electronically a signal from someone or something to someone or something else.  Tom is on the line. Shall I switch him over to Jeff ? _Please switch the call over to my other line."
        },
        {
            "id": 5,
            "phrase": "switch someone or something through",
            "definition": "to connect someone or something with something else. I will switch you through the priority network.  The operator switched the call through."
        },
        {
            "id": 6,
            "phrase": "switch something back† (to something)",
            "definition": "to return something to the way it was.  I switched the television back to the previous channel. I switched back the channel to what I was watching before."
        },
        {
            "id": 7,
            "phrase": "switch something (from something) (in)to something",
            "definition": "to change something from one thing into another.  The magician switched the silk scarf from red into green.  I would love to be able to switch lead into gold."
        },
        {
            "id": 8,
            "phrase": "switch something on†",
            "definition": "to close an electrical circuit that causes something to start functioning or operating.  Please switch the fan on.  I switched on the fan."
        },
        {
            "id": 9,
            "phrase": "switch something out†",
            "definition": "to remove something from an electrical circuit to turn it off. Please switch the light out.  I switched out the light."
        },
        {
            "id": 10,
            "phrase": "switch something over† (to something)",
            "definition": "to convert something to something else.  We are switching our furnace over to gas.  We switched over our furnace to gas."
        },
        {
            "id": 11,
            "phrase": "switch something to something else",
            "definition": "to change something to something else.  It was hot so I switched the thermostat from heating to cooling.  Mary switched the controls to automatic so she wouldn’t have to worry about them constantly."
        },
        {
            "id": 12,
            "phrase": "switch to something",
            "definition": "to change to something. I am going to switch to a cheaper brand of tissues.  We switched to a different long-distance telephone company to save some money."
        },
        {
            "id": 13,
            "phrase": "switched on",
            "definition": "1. Sl. alert and up-to-date; with it.  My brother is switched on and has lots of friends.  I’m not switched on. In fact, I am pretty dull. 2. Sl. excited. I get switched on by that kind of music.  I am never switched on by raucous music."
        },
        {
            "id": 14,
            "phrase": "swoon over someone or something",
            "definition": "to seem to faint or pass out about someone or something. The kids swooned over the rock star like the kids of thirty years ago.  Evangeline swooned over the frightful news."
        },
        {
            "id": 15,
            "phrase": "swoop down (up)on someone or something",
            "definition": "to dive or plunge downward on someone or something.  The eagle swooped down upon the lamb."
        },
        {
            "id": 16,
            "phrase": "sympathize with someone (about someone or something)",
            "definition": "to share someone else’s sorrow or anger about someone or something; to comfort someone who is sad or angry (about someone or something).  I sympathize with you about what you are going through.  I really sympathize with you."
        },
        {
            "id": 17,
            "phrase": "synchronize something with something else",
            "definition": "to set or adjust something to coordinate its timing with something else. Would you please synchronize your watch with mine? _ We could never synchronize our schedules so that we could get together."
        },
        {
            "id": 18,
            "phrase": "tab someone for something",
            "definition": "to choose someone for something.  The director tabbed Sam for a walk-on part.  I wanted her to tab me for a part."
        },
        {
            "id": 19,
            "phrase": "table a motion",
            "definition": "to postpone the discussion of something during a meeting. Mary suggested that they should table the motion. The motion for a new policy was tabled until the next meeting."
        },
        {
            "id": 20,
            "phrase": "tack something down†",
            "definition": "to fasten something down with small nails.  Someone had better tack this carpet down.  Please tack down this carpet."
        },
        {
            "id": 21,
            "phrase": "tack something up†",
            "definition": "to fasten something onto something with tacks.  The drapes started to fall, so we tacked them up again.  Please tack up these posters."
        },
        {
            "id": 22,
            "phrase": "tag someone out†",
            "definition": "[in baseball] to touch with the ball, and thereby put someone out. The shortstop tagged the runner out and retired the side.  He tagged out the runner."
        },
        {
            "id": 23,
            "phrase": "tail after someone",
            "definition": "to follow after someone. Why do you always have to tail after me? _ There is someone tailing after you."
        },
        {
            "id": 24,
            "phrase": "tail off",
            "definition": "to dwindle to nothing. The number of people filing for unemployment insurance is beginning to tail off.  As the storms tailed off, we began to realize how much damage had been done."
        },
        {
            "id": 25,
            "phrase": "the tail wagging the dog",
            "definition": "a situation where a small part is controlling the whole of something.  John was just hired yesterday, and today he’s bossing everyone around. It’s a case of the tail wagging the dog. Why is this small matter taking so much time? Now it’s the tail wagging the dog!"
        },
        {
            "id": 26,
            "phrase": "tailor someone or something to someone or something",
            "definition": "to fit or revise someone or something to fit someone or something. The coach tailored his defensive team to the opposition. We can tailor service to your company very easily.  I will tailor this suit to your specifications for no extra charge."
        },
        {
            "id": 27,
            "phrase": "taint something with something",
            "definition": "to spoil or debase something with something.  The f lood tainted the drinking water with disease germs. The food had been tainted with germs."
        },
        {
            "id": 28,
            "phrase": "take a backseat (to someone or something)",
            "definition": "to become less important than someone or something else.  My homework had to take a backseat to football during the playoffs.  Jimmy always took a backseat to his older brother, Bill, until Bill went away to college."
        },
        {
            "id": 29,
            "phrase": "take a bath (on something)",
            "definition": "Sl. to accumulate large losses on a business transaction or an investment. (Alludes to getting soaked, a slang expression meaning “being heavily charged for something.”) _Sally took a bath on that stock that she bought. Its price went down to nothing.  I’m afraid that I will take a bath on any investment I make."
        },
        {
            "id": 30,
            "phrase": "take a beating",
            "definition": "to be beaten, bested, or defeated.  The candidate took a beating in the primaries. The team took quite a beating."
        },
        {
            "id": 31,
            "phrase": "take a bow",
            "definition": "to bow and acknowledge credit for a good performance. At the end of the concerto, the pianist rose and took a bow.  The audience applauded wildly and demanded that the conductor come out and take a bow again."
        },
        {
            "id": 32,
            "phrase": "take a chance on someone or something",
            "definition": "to gamble that something good might happen or that someone might do well; to take a risk that something would go wrong or that someone would do badly.  I just couldn’t take a chance on Walter, so I picked David. I would never take a chance on that horse!"
        },
        {
            "id": 33,
            "phrase": "take a collection up† (from someone) (for someone or something)",
            "definition": "to collect money from people for someone or something.  Karen took a collection up from everyone in the office for Bill. Karen took up a collection for Bill from everyone in the office."
        },
        {
            "id": 34,
            "phrase": "take a course (in something)",
            "definition": "to enroll in a course and do the required work.  I decided to take a course in history.  Bob drives into the city where he is taking a course."
        },
        {
            "id": 35,
            "phrase": "take a dim view of someone or something",
            "definition": "to disapprove of someone or something.  Of all the boys, the teacher likes Dave the least. She takes a dim view of him.  I take a dim view of that law."
        },
        {
            "id": 36,
            "phrase": "take a dirt nap",
            "definition": "Sl. to die and be buried.  I don’t want to end up taking a dirt nap during this operation.  Isn’t Tom a little young to take a dirt nap?"
        },
        {
            "id": 37,
            "phrase": "take a firm grip on someone or something",
            "definition": "to grasp someone or something tightly.  The police officer took a firm grip on Fred and led him to the squad car. Mary took a firm grip on the handle and pulled hard."
        },
        {
            "id": 38,
            "phrase": "take a (firm) stand on something",
            "definition": "to express and maintain a strong opinion of something.  I hope you take a firm stand on the need for more office security. Yes, I will take a stand on it."
        },
        {
            "id": 39,
            "phrase": "take a gander (at someone or something)",
            "definition": "to look at someone or something.  Wow, take a gander at that new car! _I wanted to take a gander at the new computer before they started using it."
        },
        {
            "id": 40,
            "phrase": "take a hand in something",
            "definition": "to help with something; to participate in something.  Would you take a hand in this work? We need your efforts.  Ted refused to take a hand in the preparations for the evening meal."
        },
        {
            "id": 41,
            "phrase": "take a hard line (with someone)",
            "definition": "to be firm with someone; to have a firm policy for dealing with someone.  The manager takes a hard line with people who show up late.  This is a serious matter. The police are likely to take a hard line."
        },
        {
            "id": 42,
            "phrase": "take a hint",
            "definition": "to understand a hint and behave accordingly.  I said I didn’t want to see you anymore. Can’t you take a hint? I don’t like you. Sure I can take a hint, but I’d rather be told directly."
        },
        {
            "id": 43,
            "phrase": "take a leak",
            "definition": "Inf. to urinate. (Crude. Use caution with the topic. Usually in reference to a male.) _ I gotta go take a leak. Back in a minute.  He just went out to take a leak."
        },
        {
            "id": 44,
            "phrase": "take a lot out of someone",
            "definition": "to drain a lot of energy from someone. This kind of workout takes a lot out of the team.  Hot days like this take a lot out of me."
        },
        {
            "id": 45,
            "phrase": "take a nap",
            "definition": "to have a brief period of sleep. I took a short nap just after lunch. The baby takes a long nap each afternoon."
        },
        {
            "id": 46,
            "phrase": "take a new turn",
            "definition": "[for something] to begin a new course or direction. When I received the telegram with the exciting news, my life took a new turn. I began taking the medicine at noon, and by evening the disease had begun to take a new turn. I was getting better!"
        },
        {
            "id": 47,
            "phrase": "take a potshot at someone or something",
            "definition": "to shoot at someone or something, as with a shotgun. (A potshot refers to the type of shooting done to provide meat for the cooking pot.) _ The hunters were taking potshots at each other in the woods.  Someone has been taking potshots at my mailbox!"
        },
        {
            "id": 48,
            "phrase": "take a powder",
            "definition": "Sl. to leave; to leave town. (Underworld.) _ Why don’t you take a powder? Go on! Beat it! _ Willie took a powder and will lie low for a while."
        },
        {
            "id": 49,
            "phrase": "Take a running jump (in the lake)!",
            "definition": "Sl. Go away!; Get away from me! _You know what you can do? You can take a running jump. Beat it! _You can just take a running jump in the lake, you creep!"
        },
        {
            "id": 50,
            "phrase": "take a shot at someone or something",
            "definition": "to fire a shot at someone or something.  The hunter took a shot at the deer.  Who took a shot at my mailbox? "
        },
        {
            "id": 51,
            "phrase": "take a spill",
            "definition": "to have a fall; to tip over. (Also with bad, nasty, quite, etc. Also with have.) _Ann tripped on the curb and took a nasty spill.  John had quite a spill when he fell off his bicycle."
        },
        {
            "id": 52,
            "phrase": "take a stand (against someone or something)",
            "definition": "to take a position in opposition to someone or something; to oppose or resist someone or something.  The treasurer was forced to take a stand against the board because of its wasteful spending.  The treasurer took a stand, and others agreed."
        },
        {
            "id": 53,
            "phrase": "take a swing at someone",
            "definition": "to attempt to punch someone.  He took a swing at me! _ Tom took a swing at Bob, but Bob ducked out of the way."
        },
        {
            "id": 54,
            "phrase": "take a swipe at someone or something",
            "definition": "1. Sl. to hit at someone or something.  Max took a swipe at the cop by mistake. Lefty took a swipe at the punching bag—and missed. 2. Sl. to have a try at someone or something.  I think I can persuade him. I’ll take a swipe at him and see.  I will probably fail, but I’ll take a swipe at it."
        },
        {
            "id": 55,
            "phrase": "take a turn for the better",
            "definition": "to start to improve; to start to get well.  She was very sick for a month; then suddenly she took a turn for the better.  Things are taking a turn for the better at my store. I may make a profit this year."
        },
        {
            "id": 56,
            "phrase": "take a turn for the worse",
            "definition": "to start to get worse.  It appeared that she was going to get well; then, unfortunately, she took a turn for the worse. My job was going quite well; then last week things took a turn for the worse."
        },
        {
            "id": 57,
            "phrase": "take a vacation",
            "definition": "to go somewhere for a vacation; to stop work to have a vacation. Sue took a vacation at the Grand Canyon last year.  I need to take a vacation and relax."
        },
        {
            "id": 58,
            "phrase": "take account of someone or something",
            "definition": "to pay attention to someone or something. You should take account of Tom. He has some good advice.  Do I have to take account of the new policies?"
        },
        {
            "id": 59,
            "phrase": "take action against someone or something",
            "definition": "to begin activity against someone or something.  The city council vowed to take action against the mayor. I will take action against the company for its negligence."
        },
        {
            "id": 60,
            "phrase": "take action on someone or something",
            "definition": "to act on someone or something; to do what has to be done on someone or something. We still have to discuss what to do with Sam. I hope we can take action on him today.  Do we still have time to take action on this proposal?"
        },
        {
            "id": 61,
            "phrase": "take advantage of someone",
            "definition": "1. to deceive someone.  I knew that you wouldn’t take advantage of me! I trusted you.  Please don’t take advantage of me the way you took advantage of Carl. 2. to impose on someone.  I am glad to have your help. I hope I am not taking advantage of you.  I am glad to do it. You are not taking advantage of me."
        },
        {
            "id": 62,
            "phrase": "take advantage of someone or something",
            "definition": "to utilize someone or something to the fullest extent.  Try to take advantage of every opportunity that comes your way.  Please take advantage of the consultant while she is here in the office."
        },
        {
            "id": 63,
            "phrase": "take after someone",
            "definition": "to resemble a close, older relative.  Don’t you think that Sally takes after her mother? _ No, Sally takes after her Aunt Ann."
        },
        {
            "id": 64,
            "phrase": "take aim at someone or something",
            "definition": "to prepare to deal with someone or something; to focus on someone or something. (Based on take aim (at someone, something, or an animal).) _ Now we have to take aim at the problem and try to get it solved.  The critics took aim at the star of the musical and tore her to pieces."
        },
        {
            "id": 65,
            "phrase": "take aim (at someone, something, or an animal)",
            "definition": "to aim [something] at someone, something, or an animal. The hunter took aim at the deer and pulled the trigger.  You must take aim carefully before you shoot."
        },
        {
            "id": 66,
            "phrase": "take an amount of money for something",
            "definition": "to charge a certain amount for something.  I’ll take four thousand for that car there.  How much will you take for a big bag of f lour?"
        },
        {
            "id": 67,
            "phrase": "take an interest in someone or something",
            "definition": "to become concerned or interested in someone or something.  Do you take an interest in your children? _ You should take an interest in everything your child does."
        },
        {
            "id": 68,
            "phrase": "take an oath",
            "definition": "to make an oath; to swear to something.  You must take an oath that you will never tell anyone about this. When I was a witness in court, I had to take an oath that I would tell the truth."
        },
        {
            "id": 69,
            "phrase": "take attendance",
            "definition": "to make a record of persons attending something.  The teacher took attendance before starting the class.  I will take attendance each day."
        },
        {
            "id": 70,
            "phrase": "take away from someone or something",
            "definition": "to lessen the value or esteem of someone or something; to detract from someone or something.  The fact that she is quiet does not take away from her one bit.  The huge orange spot in the center of the painting takes away from the intense green of the rest of the work."
        },
        {
            "id": 71,
            "phrase": "take care of someone",
            "definition": "1. to tip someone.  I took care of the doorman as we left.  Did you remember to take care of the waiter? 2. Euph. to kill or dispose of someone.  Max said he was going to take care of Lefty once and for all. The crime king ordered Max to take care of a certain private detective."
        },
        {
            "id": 72,
            "phrase": "take care of someone or something",
            "definition": "to oversee and protect someone or something; to care for someone or something.  Please take care of my child while I am away.  I will take care of everything for you."
        },
        {
            "id": 73,
            "phrase": "take care of something",
            "definition": "to deal with something; to handle or manage a problem or detail.  Would you please take care of this little problem? _ This is an easy thing to take care of. I will fix it immediately."
        },
        {
            "id": 74,
            "phrase": "Take care (of yourself ).",
            "definition": "1. Good-bye and keep yourself healthy. John: I’ll see you next month. Good-bye. Bob: Good-bye, John. Take care of yourself.  Mary: Take care. Sue: Okay. See you later. 2. Take care of your health and get well. Mary: Don’t worry. I’ll get better soon. Sue: Well, take care of yourself. Bye.  Jane: I’m sorry you’re ill. Bob: Oh, it’s nothing. Jane: Well, take care of yourself."
        },
        {
            "id": 75,
            "phrase": "take charge (of someone or something)",
            "definition": "to take (over) control of someone or something.  The president came in late and took charge of the meeting. When the new manager took charge, things really began to happen."
        },
        {
            "id": 76,
            "phrase": "take control of someone or something",
            "definition": "to get the power and right to direct someone or something.  I will take control of him and see that he does what I want.  Will you take control of the Wilson project?"
        },
        {
            "id": 77,
            "phrase": "take cover",
            "definition": "to seek shelter from gunfire or other projectiles.  As soon as the firing started, we took cover behind a huge boulder."
        },
        {
            "id": 78,
            "phrase": "take credit for something",
            "definition": "to allow people to believe that one has done something praiseworthy, whether or not one has actually done it. I can’t take credit for the entire success. Toby helped a lot.  Mary took credit for everything that Dave did."
        },
        {
            "id": 79,
            "phrase": "take exception (to something)",
            "definition": "1. to take offense at something.  I must take exception to your remark.  Sue took exception to Fred’s characterization of Bill as a cheapskate. 2. to disagree with something.  I have to take exception to the figure you quoted.  The manager took exception to the statement about having only three employees."
        },
        {
            "id": 80,
            "phrase": "take five",
            "definition": "Sl. to take a five-minute rest period; to take a short break. Okay, everybody. Take five! _Hey, Bob. I’m tired. Can we take five?"
        },
        {
            "id": 81,
            "phrase": "take fuel on†",
            "definition": "to refuel; to be refueled. (Usually said of a large conveyance, such as a ship or a plane.) _We need to land at the next major airport to take fuel on.  We will land somewhere to take on fuel."
        },
        {
            "id": 82,
            "phrase": "take (great) pains (to do something)",
            "definition": "to make a great effort to do something.  Tom took pains to decorate the room exactly right.  We took great pains to get there on time."
        },
        {
            "id": 83,
            "phrase": "take heart (from something)",
            "definition": "to receive courage or comfort from some fact. I hope that you will take heart from what we told you today. Even though you did not win the race, take heart from the fact that you did your best. I told her to take heart and try again next time."
        },
        {
            "id": 84,
            "phrase": "take heed (of someone or something)",
            "definition": "to be cautious with someone or something; to pay attention to someone or something.  We will have to take heed of Wendy and see what she will do next. You will learn to take heed of these little signs that things are not going well."
        },
        {
            "id": 85,
            "phrase": "take hold of someone or something",
            "definition": "to grasp someone or something.  He took hold of the child, which frightened her very much.  Terry took hold of the doorknob and turned it."
        },
        {
            "id": 86,
            "phrase": "take inventory",
            "definition": "to make an inventory list. They are taking inventory in the warehouse, counting each item and writing the number on a list.  The hardware store closed once a year in order to take inventory."
        },
        {
            "id": 87,
            "phrase": "take issue with someone",
            "definition": "to argue with someone.  I heard your last statement and I have to take issue with you.  Tom took issue with Maggie about the cost of the house."
        },
        {
            "id": 88,
            "phrase": "take issue with something",
            "definition": "to disagree with or argue about something.  I have to take issue with that statement.  I want to take issue with the last statement you made."
        },
        {
            "id": 89,
            "phrase": "Take it away!",
            "definition": "Inf. Start up the performance!; Let the show begin! (Typically a public announcement of the beginning of a musical performance.) _ And now, here is the band playing “Song of Songs.” Take it away! _Sally will now sing us a song. Take it away, Sally!"
        },
        {
            "id": 90,
            "phrase": "Take it easy.",
            "definition": "1. Inf. Good-bye and be careful.  Mary: Bye-bye. Bill: See you, Mary. Take it easy.  Sue: Take it easy, Tom. Tom: Bye, Sue. See you soon. 2. Inf. Be gentle.; Treat someone carefully.  Sue: Then I want you to move the piano and turn all the mattresses. Andy: Come on. Take it easy! I’m not made of steel, you know.  Henry: Oh, I’m pooped. Alice: You just need a little rest and you’ll feel as good as new. Just take it easy. 3. Inf. Calm down.; Relax.; Do not get excited.  Andy: I am so mad I could blow my top! Rachel: Now, now. Take it easy. What’s wrong? _Mary could see that Sally was very upset at the news. “Now, just take it easy,” said Mary. “It can’t be all that bad.”"
        },
        {
            "id": 91,
            "phrase": "take it easy on someone, something, or an animal",
            "definition": "to be gentle on someone, something, or an animal.  Take it easy on Mary. She’s been sick. Please take it easy on the furniture. It has to last us many years."
        },
        {
            "id": 92,
            "phrase": "take it easy on something",
            "definition": "to use less of something (rather than more). Take it easy on the soup. There’s just enough for one serving for each person. Please take it easy! There are hardly any left."
        },
        {
            "id": 93,
            "phrase": "Take it from me!",
            "definition": "Inf. Believe me! _It’s true! Take it from me! _Take it from me. This is a very good day for this part of the country."
        },
        {
            "id": 94,
            "phrase": "take it from the top",
            "definition": "to begin [again] at the beginning, especially the beginning of a piece of music. (Originally in reference to the top of a sheet of music.) _ The conductor stopped the band and had the players take it from the top again.  Let’s take it from the top and play it a bit softer this time."
        },
        {
            "id": 95,
            "phrase": "take it like a man",
            "definition": "[for a male] to suffer misfortune stoically. (Compare this with take it.) _She said some really cutting things to him, but he took it like a man.  I knew he could take it like a man."
        },
        {
            "id": 96,
            "phrase": "take it on the lam",
            "definition": "Sl. to get out of town; to run away. (Underworld.) _ Both crooks took it on the lam when things got hot. Walt knew that the time had come to take it on the lam."
        },
        {
            "id": 97,
            "phrase": "Take it or leave it.",
            "definition": "Inf. Take this one or none; you have no choice.  Bill: That’s my final offer. Take it or leave it. Bob: Aw, come on! Take off a few bucks.  Bill: Aw, I want eggs for breakfast, Mom. Mother: There’s only cornf lakes left. Take it or leave it."
        },
        {
            "id": 98,
            "phrase": "take it out on someone or something",
            "definition": "to punish or harm someone or something because one is angry or disturbed about something.  I’m sorry about your difficulty, but don’t take it out on me.  Don’t take it out on the cat."
        },
        {
            "id": 99,
            "phrase": "take it slow",
            "definition": "to go slowly and carefully.  Just relax and take it slow. You’ve got a good chance. You’ll make it. Take it slow and keep your spirits up."
        },
        {
            "id": 100,
            "phrase": "take it that...",
            "definition": "to understand it to be thus... Am I to take it that you think this is the end of our relationship?"
        },
        {
            "id": 101,
            "phrase": "take it to one’s grave",
            "definition": "to carry a secret with one until one dies.  I will never tell anyone. I’ll take your secret to my grave.  She took the answer to the mystery to her grave."
        },
        {
            "id": 102,
            "phrase": "take it to the street",
            "definition": "Sl. to tell everyone about your problems. If there’s something bothering her, she’s gonna take it to the street, first thing.  Come on, don’t take it to the street."
        },
        {
            "id": 103,
            "phrase": "take it with one",
            "definition": "to take possessions with you when you die. (Usually negative.) _ Spend a little on yourself. You can’t take it with you, you know. He knew he couldn’t take it with him, so he spent it all."
        },
        {
            "id": 104,
            "phrase": "take its course",
            "definition": "to continue along its way; [for a disease] to progress the way it normally progresses until it is cured naturally.  There is really no good medicine for this. This disease simply has to take its course."
        },
        {
            "id": 105,
            "phrase": "take kindly to something",
            "definition": "to be agreeable to something.  My father doesn’t take kindly to anyone using his tools.  I hope they’ll take kindly to our request."
        },
        {
            "id": 106,
            "phrase": "take leave of one’s senses",
            "definition": "to become irrational. (Often verbatim with one’s.) _ What are you doing? Have you taken leave of your senses? _What a terrible situation! It’s enough to make one take leave of one’s senses."
        },
        {
            "id": 107,
            "phrase": "take leave of someone or something",
            "definition": "to go away from someone or something.  It is time for me to take leave of all of you. It saddened me to take leave of the city I grew up in."
        },
        {
            "id": 108,
            "phrase": "Take my word for it.",
            "definition": "Believe me.; Trust me, I am telling you the truth. Bill: Take my word for it. These are the best power tools you can buy. Bob: But I don’t need any power tools. Rachel: No one can cook better than Fred. Take my word for it. Bill: Really? Fred: Oh, yes. It’s true."
        },
        {
            "id": 109,
            "phrase": "take names",
            "definition": "Sl. to make a list of wrongdoers. (Often figuratively, referring to a schoolteacher making a list of the names of misbehaving students to be sent to the principal.) _The boss is madder than hell, and he’s taking names.  Gary is coming by to talk about the little riot last night, and I think he’s taking names."
        },
        {
            "id": 110,
            "phrase": "take no prisoners",
            "definition": "to kill the enemy rather than seize the enemy as prisoners.  The soldiers’ orders were to take no prisoners."
        },
        {
            "id": 111,
            "phrase": "take note of someone or something",
            "definition": "to notice someone or something; to commit something about someone or something to one’s memory, possibly by making a note on paper. I took note of her when she came in. I thought she had left the company.  Please take note of the hour. It is late."
        },
        {
            "id": 112,
            "phrase": "take notice of someone or something",
            "definition": "to notice the presence or existence of someone or something.  They didn’t take notice of me, so I left.  I took notice of the amount of the bill."
        },
        {
            "id": 113,
            "phrase": "take off",
            "definition": "1. Fig. to leave the ground and begin to fly. (As with a bird or an airplane.) _ When do we take off ? _ The eagle took off and headed toward the mountains. 2. Fig. [for someone] to leave in a hurry. She really took off from there quickly.  I’ve got to take off—I’m late. 3. Fig. [for something] to start selling well.  The f luffy dog dolls began to take off, and we sold out the lot.  Ticket sales really took off after the first performance. 4. Fig. to become active and exciting. Did the party ever take off, or was it dull all night? _ Things began to take off about midnight."
        },
        {
            "id": 114,
            "phrase": "take off (for some place)",
            "definition": "to take flight, heading for some place. We took off for Moscow early in the evening.  We took off at dawn."
        },
        {
            "id": 115,
            "phrase": "take off from something",
            "definition": "to take flight from something or some place. The plane took off from the busy airport right on schedule. We will take off from the airport on one side of town, f ly across the city, and land at our destination within 15 minutes."
        },
        {
            "id": 116,
            "phrase": "take off (on something)",
            "definition": "to start out speaking on something; to begin a discussion of something.  My father took off on the subject of taxes and talked for an hour.  My uncle is always taking off on the state of the economy."
        },
        {
            "id": 117,
            "phrase": "take off one’s hat (to someone)",
            "definition": "to offer praise for someone’s good accomplishments. I have to take off my hat to Mayor Johnson. She has done an excellent job. Yes, we all ought to take off our hats. She is our best mayor ever."
        },
        {
            "id": 118,
            "phrase": "take offense (at someone or something)",
            "definition": "to be insulted by someone or something. Bill took offense at Mary for her thoughtless remarks. Almost everyone took offense at Bill’s new book.  I’m sorry you took offense. I meant no harm."
        },
        {
            "id": 119,
            "phrase": "take office",
            "definition": "to begin serving as an elected or appointed official. When did the mayor take office? _All the elected officials took office just after the election."
        },
        {
            "id": 120,
            "phrase": "take on (so)",
            "definition": "to behave very emotionally. (Usually negative.) _ Stop crying. Please don’t take on so.  I wish you wouldn’t take on about this matter."
        },
        {
            "id": 121,
            "phrase": "take one at one’s word",
            "definition": "to believe what someone says and act accordingly.  She told me to go jump in the lake, and I took her at her word. You shouldn’t take her at her word. She frequently says things she doesn’t really mean."
        },
        {
            "id": 122,
            "phrase": "take one back (to some time)",
            "definition": "to cause one to think of a time in the past. This takes me back to the time I spent the summer in Paris. What you said really takes me back."
        },
        {
            "id": 123,
            "phrase": "take one’s cue from someone",
            "definition": "to use someone else’s behavior or reactions as a guide to one’s own. (From the theatrical cue as a signal to speak, etc.) _ If you don’t know which spoons to use at the dinner, just take your cue from John. The other children took their cue from Tommy and ignored the new boy."
        },
        {
            "id": 124,
            "phrase": "take one’s eyes off (of ) someone or something",
            "definition": "to cease looking at someone or something. (Usually negative. Of is usually retained before pronouns.) _I couldn’t take my eyes off of the usher.  Ken couldn’t take his eyes off Judy."
        },
        {
            "id": 125,
            "phrase": "take one’s gloves off†",
            "definition": "to stop being calm or civil and show an intention of winning a dispute by any means. (As if boxers were to remove their gloves in order to inflict more damage. See also The gloves are off.) _Both of them took their gloves off and really began arguing."
        },
        {
            "id": 126,
            "phrase": "take one’s hat† off to someone",
            "definition": "to salute or pay an honor to someone.  Good work. I take my hat off to you.  I take off my hat to you! What an excellent job!"
        },
        {
            "id": 127,
            "phrase": "take (one’s) leave (of someone)",
            "definition": "to say good-bye to someone and leave. I took leave of the hostess at an early hour.  One by one, the guests took their leave."
        },
        {
            "id": 128,
            "phrase": "take one’s lumps",
            "definition": "Inf. to accept the result or punishment one deserves.  You’ve got to learn to take your lumps if you’re going to be in politics.  I hate taking my lumps. I’d rather pretend nothing had happened."
        },
        {
            "id": 129,
            "phrase": "take one’s medicine",
            "definition": "to accept the consequences or the bad fortune that one deserves. (Alludes to having to take unpleasant-tasting medicine.) _ I know I did wrong, and I know I have to take my medicine. Billy knew he was going to get spanked, and he didn’t want to take his medicine."
        },
        {
            "id": 130,
            "phrase": "take one’s own life",
            "definition": "to kill oneself; to commit suicide.  Bob tried to take his own life, but he was stopped in time.  Later, he was sorry that he had tried to take his own life."
        },
        {
            "id": 131,
            "phrase": "take one’s pick of someone or something",
            "definition": "to be able to have one’s choice of someone or something.  Can I take my pick of anyone in the group? _ Please take your pick of desserts."
        },
        {
            "id": 132,
            "phrase": "take one’s time",
            "definition": "to go as slow as one wants or needs to; to use as much time as is required. There is no hurry. Please take your time.  Bill is very careful and takes his time so he won’t make any mistakes."
        },
        {
            "id": 133,
            "phrase": "take one’s turn",
            "definition": "[when playing a game] to make one’s move or play one’s cards; [when alternating with someone, waiting for one’s opportunity or place in a sequence] to perform one’s task. Somebody please wake Max up so he can take his turn."
        },
        {
            "id": 134,
            "phrase": "take oneself off some place",
            "definition": "to go away to some place more private. I need to take myself off someplace and think all this over.  She kept her sanity by taking herself off to her bedroom for a few hours each day."
        },
        {
            "id": 135,
            "phrase": "take out a loan",
            "definition": "to get a loan of money, especially from a bank. Mary took out a loan to buy a car. We will have to take out a loan to remodel the kitchen."
        },
        {
            "id": 136,
            "phrase": "take over (from someone)",
            "definition": "to assume the role or job of someone. I take over for the manager next month. Liz takes over and will be in charge."
        },
        {
            "id": 137,
            "phrase": "take pains over something",
            "definition": "to deal with something with great care. She certainly takes pains over her work. You will have to take pains over this if you want it to be done right."
        },
        {
            "id": 138,
            "phrase": "take pains with someone or something",
            "definition": "to deal with someone or something with great care.  He really took pains with me to make sure I understood it all.  Ken took pains with the model plane."
        },
        {
            "id": 139,
            "phrase": "take part (in something)",
            "definition": "to participate in something.  Bill refused to take part in the game.  Everyone is asked to take part in the celebration."
        },
        {
            "id": 140,
            "phrase": "take pity (on someone or an animal)",
            "definition": "to feel sorry for someone or an animal. We took pity on the hungry people and gave them some hot food.  She took pity on the little dog and brought it in to get warm."
        },
        {
            "id": 141,
            "phrase": "take place",
            "definition": "to happen.  When will this party take place? _ It’s taking place right now."
        },
        {
            "id": 142,
            "phrase": "take possession (of something)",
            "definition": "to assume ownership of something.  I am to take possession of the house as soon as we sign the papers."
        },
        {
            "id": 143,
            "phrase": "take pride in someone or something",
            "definition": "to be proud of someone or something. I take a great deal of pride in my children. She takes pride in her work and it shows in her products."
        },
        {
            "id": 144,
            "phrase": "take (quite) a toll (on someone or something)",
            "definition": "to cause damage or wear by using something or by hard living.  Years of sunbathing took a toll on Mary’s skin. Drug abuse takes quite a toll on the lives of people."
        },
        {
            "id": 145,
            "phrase": "take refuge in something",
            "definition": "to hide in something; to seek safety or the comfort of being safe in something.  The rabbits took refuge in a hole in the ground.  The children took refuge in the house as soon as the storm began."
        },
        {
            "id": 146,
            "phrase": "take root",
            "definition": "[for a plant] to develop roots in soil or some other growing medium.  The new plants should take root in a few weeks and start growing."
        },
        {
            "id": 147,
            "phrase": "take shape",
            "definition": "[for something, such as plans, writing, ideas, arguments, etc.] to begin to be organized and specific.  My plans are beginning to take shape. As my manuscript took shape, I started showing it to publishers."
        },
        {
            "id": 148,
            "phrase": "take sides",
            "definition": "to choose one side of an argument.  They were arguing, but I didn’t want to take sides, so I left.  I don’t mind taking sides on important issues."
        },
        {
            "id": 149,
            "phrase": "take sides against someone or something",
            "definition": "to join a faction opposing someone or something; to establish a faction against someone or something.  Both of them took sides against me. It wasn’t fair. We took sides against the bank."
        },
        {
            "id": 150,
            "phrase": "take solace (in something)",
            "definition": "to console oneself with some fact. I am inordinately impoverished, but I take solace in the fact that I have a splendiferous vocabulary."
        },
        {
            "id": 151,
            "phrase": "take some doing",
            "definition": "to require considerable effort and care.  It’ll take some doing, but it’ll get done.  It’s not impossible. It’ll just take some doing."
        },
        {
            "id": 152,
            "phrase": "take someone apart†",
            "definition": "1. Sl. to beat someone up.  Don’t talk to me that way, or I’ll take you apart. He was so mad that I thought he was going to take apart all of us. 2. Inf. to criticize or defame someone or something.  They really took me apart, but I just ignore bad reviews.  The editorial took apart the entire city government."
        },
        {
            "id": 153,
            "phrase": "take someone around†",
            "definition": "to show someone the premises; to introduce someone to the people on the premises.  Mr. Franklin needs a plant tour. Would you take him around? _ Would you kindly take around our guests?"
        },
        {
            "id": 154,
            "phrase": "take someone aside†",
            "definition": "to remove someone temporarily from the group for the purposes of discussing something privately.  I’m sorry he insulted you. I’ll take him aside and take talk to him about it.  I took aside my secretary and explained the procedure."
        },
        {
            "id": 155,
            "phrase": "take someone below",
            "definition": "to guide someone to a lower deck on a ship.  The captain told the first mate to take the passengers below.  Please take Mr. Wilson below, where he will not be in the way."
        },
        {
            "id": 156,
            "phrase": "take someone for a ride",
            "definition": "to carry someone about, usually for recreation, in a car, plane, boat, etc.  Would you take us for a ride in your boat? _ Please take me for a ride in your new car."
        },
        {
            "id": 157,
            "phrase": "take someone for dead",
            "definition": "to assume that someone who is still alive is dead.  When we found her, we took her for dead, but the paramedics were able to revive her. He was taken for dead and abandoned."
        },
        {
            "id": 158,
            "phrase": "take someone for someone or something",
            "definition": "to perceive someone as someone or something.  I took you for a fairly even-tempered person. You aren’t.  Alice took Jim for a gentleman—which he was."
        },
        {
            "id": 159,
            "phrase": "take someone for something",
            "definition": "to escort someone to and through some activities, such as a walk, a swim, a ride, etc.  Can I take you for a ride? _ He took me for a walk in the park, and then we came home."
        },
        {
            "id": 160,
            "phrase": "take someone hostage",
            "definition": "to kidnap or seize someone to be a hostage. The terrorists planned to take the ambassador hostage.  The entire family was taken hostage by the robber."
        },
        {
            "id": 161,
            "phrase": "take someone in†",
            "definition": "to give someone shelter.  Do you think you could take me in for the night? _ I don’t take in strangers. "
        },
        {
            "id": 162,
            "phrase": "take someone in† as something",
            "definition": "to make someone a member of an organization. We took her in as an associate at first.  I took in Karen as an associate."
        },
        {
            "id": 163,
            "phrase": "take someone in hand",
            "definition": "to take control of someone; to assume the responsibility of guiding someone.  Someone is going to have to take Tim in hand and help him out. Alice decided that she would take the new worker in hand."
        },
        {
            "id": 164,
            "phrase": "take someone into one’s confidence",
            "definition": "to trust someone with confidential information; to tell a secret to someone and trust the person to keep the secret.  We are good friends, but I didn’t feel I could take her into my confidence. I know something very important about Jean. Can I take you into my confidence?"
        },
        {
            "id": 165,
            "phrase": "take someone off†",
            "definition": "Sl. to kill someone. (Underworld.) _ The mob took the witness off a week before the trial. Barlowe didn’t want to have to take off Lefty, but he was afraid he might talk."
        },
        {
            "id": 166,
            "phrase": "take someone on",
            "definition": "1. to enter into a fight or argument with someone. I pretended to agree because I really didn’t want to take him on. 2. to employ someone.  I think we could take you on as an assistant editor, but it doesn’t pay very well."
        },
        {
            "id": 167,
            "phrase": "take someone or an animal in†",
            "definition": "to provide shelter for someone or an animal. When I needed a place to live, my uncle took me in.  Mrs. Wilson took in the lonely little dog and gave it a loving home."
        },
        {
            "id": 168,
            "phrase": "take someone or an animal into one’s heart",
            "definition": "to grow to love and trust someone or an animal; to receive a newcomer graciously and lovingly.  He was such a cute little boy. We took him into our hearts immediately.  We loved the puppy instantly and took her into our hearts at once."
        },
        {
            "id": 169,
            "phrase": "take someone or something aboard",
            "definition": "to load someone or something onto a ship.  The ship was in its berth, taking passengers aboard.  The ship took many tons of cargo aboard."
        },
        {
            "id": 170,
            "phrase": "take someone or something across (something)",
            "definition": "to carry or lead someone or something across something. Tim took Liz across the bridge. We took a lot of food and medicine across before the f looded river washed the bridge out."
        },
        {
            "id": 171,
            "phrase": "take someone or something along†",
            "definition": "to bring someone or something along with one.  Can I take my friend along on the hike? _ You should take along your own drinking water."
        },
        {
            "id": 172,
            "phrase": "take someone or something at face value",
            "definition": "to accept someone or something just as it appears; to believe that the way things appear is the way they really are. He means what he says. You have to take him at face value.  I take everything he says at face value."
        },
        {
            "id": 173,
            "phrase": "take someone or something away† (from someone or something)",
            "definition": "to remove someone or something to some distance away from someone or something else; to remove someone or something from the possession of someone or something else.  Take her away from me! _ Take away that horrible food."
        },
        {
            "id": 174,
            "phrase": "take someone or something before someone or something",
            "definition": "to bring someone or something in front of someone or a group for judgment.  I will have to take Tom before the manager and let Tom tell his story.  I took the invention before the committee."
        },
        {
            "id": 175,
            "phrase": "take someone or something by something",
            "definition": "to grasp someone or something by holding on to some part. She took him by the hand and helped him up.  Tom took the dog by the collar and led it out."
        },
        {
            "id": 176,
            "phrase": "take someone or something by storm",
            "definition": "1. Fig. to conquer someone or something in a fury.  The army took city after city by storm.  They crashed in and took the general by storm. 2. Fig. to succeed overwhelmingly with someone, some place, or a group.  The singing star took the audience in each town by storm.  The star took the critics by storm."
        },
        {
            "id": 177,
            "phrase": "take someone or something by surprise",
            "definition": "to startle or surprise someone or something.  She bolted into the room and took them by surprise.  I took the little bird by surprise, and it f lew away."
        },
        {
            "id": 178,
            "phrase": "take someone or something down†",
            "definition": "to move someone or something to a lower position or level. The boss is downstairs and wants to meet our visitor. Will you take her down? _The way down to the lobby is confusing. Let me take down our visitor.  Let me take the sandwiches down."
        },
        {
            "id": 179,
            "phrase": "take someone or something for granted",
            "definition": "to expect someone or something to be always available to serve in some way without thanks or recognition; to value someone or something too lightly.  I wish you didn’t take me for granted.  I guess that I take a lot of things for granted."
        },
        {
            "id": 180,
            "phrase": "take someone or something off†",
            "definition": "Sl. to rob someone or something. (Underworld.) _Weren’t you in that bunch that took the bank off in Philly? _ No, we never took off no bank, did we, Lefty?"
        },
        {
            "id": 181,
            "phrase": "take someone or something off someone’s hands",
            "definition": "to relieve someone of the burden or bother of someone or something.  I would be happy to take your uncle off your hands for a few hours.  Will you please take some of this food off my hands?"
        },
        {
            "id": 182,
            "phrase": "take someone or something off (something)",
            "definition": "to remove someone or something from the surface of something.  Bob helped take his children off the merry-go-round.  Please take your books off the table."
        },
        {
            "id": 183,
            "phrase": "take someone or something on†",
            "definition": "to accept the task of handling a difficult person or thing. I’ll take it on if nobody else will do it.  Nobody wanted to take on Mrs. Franklin, but it had to be done."
        },
        {
            "id": 184,
            "phrase": "take someone or something over†",
            "definition": "to take charge (of someone or something); to assume control of someone or something.  The new manager will take the office over next week. Will you please take over your children? I can’t seem to control them."
        },
        {
            "id": 185,
            "phrase": "take someone or something over (to someone or something)",
            "definition": "to deliver someone or something to someone or something. Would you take this over to Tiffany? _Would you take Tiffany over to the office?"
        },
        {
            "id": 186,
            "phrase": "take someone or something with one",
            "definition": "to take away someone or something when one leaves.  When you go, take Liz with you.  Please take your dog with you."
        },
        {
            "id": 187,
            "phrase": "take someone or something wrong",
            "definition": "to misunderstand someone or something.  Please don’t take me wrong, but I believe that your socks don’t match.  You’ll probably take this wrong, but I have to say that I’ve never seen you looking better."
        },
        {
            "id": 188,
            "phrase": "take someone out†",
            "definition": "1. to date someone.  I hope he’ll take me out soon. She wanted to take out her guest for the evening. 2. to block out a player in football.  You take Joe out and I’ll carry the ball.  Who was supposed to take out that huge guy? 3. Sl. to kill someone. (Underworld.) _Mr. Gutman told Lefty to take Max out.  One more word out of you, and I’m going to take you out."
        },
        {
            "id": 189,
            "phrase": "take someone out† to dinner",
            "definition": "to take someone as one’s guest to a meal at a restaurant. Can I take you out to dinner sometime? _ We will take out the visitors to dinner tonight."
        },
        {
            "id": 190,
            "phrase": "take someone’s blood pressure",
            "definition": "to measure a person’s blood pressure. The doctor takes my blood pressure every time I am in the office.  Bob takes his blood pressure at home every day."
        },
        {
            "id": 191,
            "phrase": "take someone’s breath away",
            "definition": "to cause someone to be out of breath due to a shock or hard exercise.  Running this fast takes my breath away.  Mary frightened me and took my breath away."
        },
        {
            "id": 192,
            "phrase": "take someone’s head off",
            "definition": "to scold or berate someone severely.  There is no need to take his head off about such a simple matter."
        },
        {
            "id": 193,
            "phrase": "take someone’s life",
            "definition": "to kill someone. (Can include onself.) _ It’s the executioner’s job to take people’s lives."
        },
        {
            "id": 194,
            "phrase": "take someone’s life in one’s hands",
            "definition": "to risk someone’s life.  If you go into the war zone, you will be taking your life in your hands.  Ted didn’t want to take his life in his hands by going there alone."
        },
        {
            "id": 195,
            "phrase": "take someone’s part",
            "definition": "to take a side in an argument; to support someone in an argument.  My sister took my mother’s part in the family argument. You are always taking the part of the underdog!"
        },
        {
            "id": 196,
            "phrase": "take someone’s pulse",
            "definition": "to measure the frequency of the beats of a person’s pulse. I can take my own pulse. The nurse took my pulse and said I was fine."
        },
        {
            "id": 197,
            "phrase": "take someone’s temperature",
            "definition": "to measure a person’s body temperature with a thermometer.  I took my temperature and I found that I am running a fever.  The nurse took my temperature and said I was okay."
        },
        {
            "id": 198,
            "phrase": "take someone, something, or an animal in(side)",
            "definition": "to transport someone, something, or an animal to shelter or inside something.  Please take your little brother in. It’s starting to rain.  Take the dog inside when you go."
        },
        {
            "id": 199,
            "phrase": "take someone through (something)",
            "definition": "to escort someone through something or some place. Would you mind taking Jerry through the factory? _ I would be happy to take him through."
        },
        {
            "id": 200,
            "phrase": "take someone to court",
            "definition": "to sue someone; to force someone to appear in court.  I will take you to court if you persist in pestering my client.  Don was taken to court in a negligence suit."
        },
        {
            "id": 201,
            "phrase": "take someone to one side",
            "definition": "to lead someone to a relatively private place, to say something private or give private instructions.  Gary took Fran to one side to talk to her.  I will take Sue to one side and have a word with her about this matter."
        },
        {
            "id": 202,
            "phrase": "take someone to task",
            "definition": "to scold or reprimand someone.  The teacher took John to task for his bad behavior.  I lost a big contract, and the boss took me to task in front of everyone."
        },
        {
            "id": 203,
            "phrase": "take someone to the cleaners",
            "definition": "1. Sl. to take a lot of someone’s money; to swindle someone.  The lawyers took the insurance company to the cleaners, but I still didn’t get enough to pay for my losses.  The con artists took the old man to the cleaners. 2. Sl. to defeat or best someone. We took the other team to the cleaners.  Look at the height they’ve got! They’ll take us to the cleaners!"
        },
        {
            "id": 204,
            "phrase": "take someone up†",
            "definition": "to discuss or deal with someone.  What are we going to do about Bill? Are we going to take Bill up today at the board meeting? _ Let’s take up the applicants in our next meeting."
        },
        {
            "id": 205,
            "phrase": "take someone up on something",
            "definition": "to accept an offer that someone has made.  That’s a good offer. I’ll take you up on it.  Tom took Sue up on her offer of dinner."
        },
        {
            "id": 206,
            "phrase": "take something aloft",
            "definition": "to take an aircraft into the air. The pilot took the plane aloft and tested it out. When will you take this aloft for a test f light?"
        },
        {
            "id": 207,
            "phrase": "take something apart†",
            "definition": "to disassemble something.  Bobby took his bicycle apart.  You take apart everything that is mechanical."
        },
        {
            "id": 208,
            "phrase": "take something around†",
            "definition": "to take something from various people or places. Would you take the pictures around and show them to everyone? _ I will take around this stack of pictures and show them to each person."
        },
        {
            "id": 209,
            "phrase": "take something at face value",
            "definition": "to accept something exactly the way it appears to be. I don’t know whether I can take her story at face value, but I will assume that she is not lying. The committee took the report at face value and approved the suggested changes."
        },
        {
            "id": 210,
            "phrase": "take something away† (from someone or something)",
            "definition": "to detract from someone or something.  The bright costume on the soprano takes a lot away from the tenor, who is just as important.  The main subject of the picture is good, but the busy background takes away a lot."
        },
        {
            "id": 211,
            "phrase": "take something back†",
            "definition": "to retract a statement; to rescind one’s remark.  You had better take back what you said about my sister. I won’t take what I said back! She’s a twit!"
        },
        {
            "id": 212,
            "phrase": "take something back† (from someone)",
            "definition": "to take possession of something that one had previously given away. I took my sweater back from Tim, since he never wore it.  I took back my money from the child."
        },
        {
            "id": 213,
            "phrase": "take something back† to someone or something",
            "definition": "to carry or transport something from someone or something.  Please take this report back to Liz. Take back this book to Karen."
        },
        {
            "id": 214,
            "phrase": "take something down†",
            "definition": "1. to take some large or complicated things apart.  They plan to take all these buildings down and turn the land into a park. Do they plan to take down the television broadcasting tower? 2. to write something down in something. Please take these figures down in your notebook. Take down these figures in your record of this meeting."
        },
        {
            "id": 215,
            "phrase": "take something from someone",
            "definition": "to remove something from someone’s possession.  Jimmy took Tim’s cookie from him.  Please don’t take my money from me."
        },
        {
            "id": 216,
            "phrase": "take something from something",
            "definition": "to subtract something from something; to remove something from something. Take ten from twenty and see what you have left.  If you take the lettuce out of the salad, what do you have left?"
        },
        {
            "id": 217,
            "phrase": "take something home (with oneself)",
            "definition": "to carry something to one’s home. We took a lot of souvenirs home with us."
        },
        {
            "id": 218,
            "phrase": "take something in†",
            "definition": "1. to reduce the size of a garment.  This is too big. I’ll have to take it in around the waist. I’ll have to take in these pants. 2. to view and study something; to attend something involving viewing. The mountains are so beautiful! I need an hour or so to take it all in.  I want to sit here a minute and take in the view. Would you like to take in a movie? 3. to receive money as payment or proceeds.  How much did we take in today? _ The box office took nearly a thousand dollars in within just the last hour. 4. to receive something into the mind, usually visu- ally.  Could you take those explanations in? I couldn’t.  I could hardly take in everything she said. 5. to inhale, drink, or eat something.  I think I’ll go for a walk and take some fresh air in. Jane was very ill, but she managed to take in some fresh air from the open window. "
        },
        {
            "id": 219,
            "phrase": "take something in (one’s) stride",
            "definition": "to accept advances or setbacks as the normal course of events. She faced a serious problem, but she was able to take it in her stride.  I’ll just take it in stride.  We were afraid that success would spoil her, but she just took it in stride."
        },
        {
            "id": 220,
            "phrase": "take something into one’s head",
            "definition": "to get an obsession or overpowering idea into one’s thinking.  George took this strange idea into his head about fixing the car himself. I don’t know why she took that strange idea into her head."
        },
        {
            "id": 221,
            "phrase": "take something lying down",
            "definition": "to endure something unpleasant without fighting back.  He insulted me publicly. You don’t expect me to take that lying down, do you? _I’m not the kind of person who’ll take something like that lying down."
        },
        {
            "id": 222,
            "phrase": "take something off†",
            "definition": "to remove something, such as an article of clothing. Please take your coat off and stay awhile.  Please take off your coat."
        },
        {
            "id": 223,
            "phrase": "take something on faith",
            "definition": "to accept or believe something on the basis of little or no evidence.  Please try to believe what I’m telling you. Just take it on faith. Surely you can’t expect me to take a story like that on faith."
        },
        {
            "id": 224,
            "phrase": "take something on the chin",
            "definition": "to absorb a blow on the chin.  The boxer tried to duck but took the blow on the chin."
        },
        {
            "id": 225,
            "phrase": "take something on trust",
            "definition": "to accept that something is true through trust.  I don’t know if it’s so, but I’ll take it on trust. You will have to take it on trust because I can’t prove it."
        },
        {
            "id": 226,
            "phrase": "take something out†",
            "definition": "to carry something outside.  Please take the trash out. I’ll take out the trash."
        },
        {
            "id": 227,
            "phrase": "take something out in trade",
            "definition": "to accept someone’s goods or services in payment of a bill.  The grocer told the plumber that he would pay the plumber by allowing him to take his bill out in trade.  I don’t have any cash right now. Can you take what I owe you out in trade?"
        },
        {
            "id": 228,
            "phrase": "take something out† on someone or something",
            "definition": "to punish someone or something because of something, such as anger, hurt feelings, frustration, etc. I know you’re angry, but don’t take it out on me! _ Don’t take out your anger on me."
        },
        {
            "id": 229,
            "phrase": "take something over†",
            "definition": "1. to assume responsibility for a task.  It looks as if I’m going to have to take the project over.  I will take over the project. 2. to acquire all of an asset; [for a company] to acquire another company.  Carl set out to take the failing airline over.  He took over the failing company with the help of a number of investment bankers. 3. to take control of something.  The dictator hoped to take over the world little by little.  He just might take it over."
        },
        {
            "id": 230,
            "phrase": "take something personally",
            "definition": "to interpret a remark as if it were mean or critical about oneself.  Don’t take it personally, but you really need a haircut.  I want to tell you something, but please don’t take it personally."
        },
        {
            "id": 231,
            "phrase": "take something public",
            "definition": "1. to make something known to the public.  You gotta take it public—put it on the street— even when it’s none of your business.  Don’t take it public. You’ll just get talked about. 2. to sell shares in a company to the general public. (Securities markets.) _ The board decided not to take the company public. We’re going to take it public whenever the market looks good."
        },
        {
            "id": 232,
            "phrase": "take something to heart",
            "definition": "to consider that some comment is significant to oneself.  Mary listened to Bob’s advice and took it all to heart.  All Sue’s advice was taken to heart by the show committee."
        },
        {
            "id": 233,
            "phrase": "take something to pieces",
            "definition": "Inf. to disassemble something.  I will have to take the vacuum cleaner to pieces to find out what’s wrong with it. The machine was taken to pieces again in an effort to find where the leftover part belonged."
        },
        {
            "id": 234,
            "phrase": "take something under advisement",
            "definition": "to hear an idea and think about it carefully.  It’s a good idea, but I’ll have to take it under advisement. The suggestion was taken under advisement, and a reply was not expected for at least a month."
        },
        {
            "id": 235,
            "phrase": "take something up†",
            "definition": "1. [for someone or a group] to deliberate something.  When will the board of directors take this up? _ Let’s take up that matter now. 2. to raise something, such as the height of a hem.  The skirt is too long. I’ll have to take it up.  Can you take up this skirt for me? 3. to continue with something after an interruption.  They took it up where they left off. Let’s take up this matter at the point we were at when we were interrupted.  We must take up our work again. 4. to begin something; to start to acquire a skill in something. When did you take this hobby up? _ I took up skiing last fall. 5. to absorb something.  This old sponge doesn’t take much water up.  It used to take up more. 6. to adopt something new.  I see you’ve taken a new lifestyle up. Toby took up the life of a farmer."
        },
        {
            "id": 236,
            "phrase": "take something up to someone",
            "definition": "to deliver something to a person on a higher level.  I will take this up to the boss and try to get it approved.  Please take this up to Sue on the next f loor and see what she thinks about it."
        },
        {
            "id": 237,
            "phrase": "take something up† (with someone)",
            "definition": "to raise and discuss a matter with someone.  This is a very complicated problem. I’ll have to take it up with the office manager.  She’ll take up this problem with the owner in the morning."
        },
        {
            "id": 238,
            "phrase": "take something (up)on oneself",
            "definition": "to accept the entire burden of something on oneself. (Upon is formal and less commonly used than on.) _ You didn’t need to take it all upon yourself. There are others here who can help, you know.  Jan takes too much on herself."
        },
        {
            "id": 239,
            "phrase": "take something with one",
            "definition": "to take something [away] with one.  I am going to take this food with me.  Can I take one of these catalogs with me?"
        },
        {
            "id": 240,
            "phrase": "take something with something",
            "definition": "to eat or swallow something, such as medicine, with something.  You have to take this medicine with milk or soda water. I will take this pill with milk."
        },
        {
            "id": 241,
            "phrase": "take steps (to prevent something)",
            "definition": "to do what is necessary to prevent something. I took steps to prevent John from learning what we were talking about. I have to keep John from knowing what I’ve been doing. I can prevent it if I take steps."
        },
        {
            "id": 242,
            "phrase": "take stock (of something)",
            "definition": "to make an appraisal of resources and potentialities. I spent some time yesterday taking stock of my good and bad qualities. We all need to take stock now and then."
        },
        {
            "id": 243,
            "phrase": "Take the bitter with the sweet.",
            "definition": "Prov. Accept the bad things as well as the good things that happen. (Implies that the bad and good things you are talking about are very serious or important.) _ If you intend to get married, you must be prepared to take the bitter with the sweet."
        },
        {
            "id": 244,
            "phrase": "take the blame (for doing something)",
            "definition": "to acknowledge that one is to blame for doing something. Do you really expect for me to take the blame for something I didn’t do?"
        },
        {
            "id": 245,
            "phrase": "take the bull by the horns",
            "definition": "to confront a problem head-on and deal with it openly. It’s time to take the bull by the horns and get this job done."
        },
        {
            "id": 246,
            "phrase": "take the chill off ((of ) a place)",
            "definition": "to do something that warms a place up slightly.  Let’s build a fire and take the chill off this place.  I turned up the heat to take the chill off of the apartment."
        },
        {
            "id": 247,
            "phrase": "take the coward’s way out",
            "definition": "Euph. to kill oneself.  When faced with financial disaster, Sarah took the coward’s way out.  I can’t believe that Bill would take the coward’s way out. His death must have been an accident."
        },
        {
            "id": 248,
            "phrase": "take the cure",
            "definition": "to enter into any treatment program or treatment center. (Especially those dealing with drugs and alcohol.) _ I wanted to take the cure, but I just couldn’t bring myself to do it.  It’s hard to get those addicted to realize that they are the ones who have to decide to take the cure."
        },
        {
            "id": 249,
            "phrase": "take the easy way out",
            "definition": "to get free of something by taking the path of least resistance. You can depend on Kelly to take the easy way out of a tough situation.  I’m not the type that takes the easy way out."
        }
    ]
}