{
    "dictionary": [
        {
            "id": 0,
            "phrase": "wander in(to something)",
            "definition": "to stray or roam into something or some place. A deer wandered into the parking lot and frightened some of the shoppers.  Someone wandered in and sat down."
        },
        {
            "id": 1,
            "phrase": "wangle out of something",
            "definition": "to get out of having to do something; to argue or deceive one’s way out of a responsibility.  Don’t try to wangle out of this mess. You must stay and fix the problems you made.  Mary managed to wangle out of staying late again."
        },
        {
            "id": 2,
            "phrase": "want for nothing",
            "definition": "not to lack anything; to have everything one needs or desires. The Smiths don’t have much money, but their children seem to want for nothing. Lisa’s husband spoils her. She wants for nothing."
        },
        {
            "id": 3,
            "phrase": "want for something",
            "definition": "to lack something; to need something.  I certainly don’t want for advice. In fact, I have had too much.  We don’t want for helpers around here."
        },
        {
            "id": 4,
            "phrase": "want in((to) something)",
            "definition": "to want to come into something or some place.  It’s cold out here! I want into the house.  The dog wants in."
        },
        {
            "id": 5,
            "phrase": "want out (of something)",
            "definition": "1. to desire to get out of something or some place.  I want out of this stuffy room.  Where’s the door? I want out. 2. Fig. to desire to be relieved of a responsibility. I want out of this responsibility. I don’t have the time to do it right.  This job is no good for me. I want out. 3. Fig. to want to remove oneself from some association or relationship. I want out. This relationship is stif ling me."
        },
        {
            "id": 6,
            "phrase": "want someone for something",
            "definition": "1. to desire someone for some job or purpose. I want Fred for my team. We all want you for a candidate. 2. to hunt or seek someone as a criminal suspect.  The police want Max for questioning.  They want him for a number of crimes."
        },
        {
            "id": 7,
            "phrase": "want someone or something back",
            "definition": "to desire the return of someone or something. Timmy wanted his mother back very badly.  I want my money back!"
        },
        {
            "id": 8,
            "phrase": "want someone or something in something",
            "definition": "to desire that someone or something be in something or some place. I want you in my office immediately.  I want some coffee in this room now!"
        },
        {
            "id": 9,
            "phrase": "want someone or something out of something",
            "definition": "to desire that someone or something leave or be removed from something or some place. I want you out of here immediately.  I want this box out of here now!"
        },
        {
            "id": 10,
            "phrase": "want something for someone or something",
            "definition": "to desire to have something for someone or something.  I want a gift for my wife. What would you suggest? _I want a button for my shirt."
        },
        {
            "id": 11,
            "phrase": "war against someone or something",
            "definition": "to fight against someone or something; to oppose someone or something.  That country is always warring against its neighbors.  Why do you want to war against the city council?"
        },
        {
            "id": 12,
            "phrase": "war over someone or something",
            "definition": "to fight about who is to get someone or something.  Stop warring over Tom. He refuses to play on either team.  There is no point in warring over the contract."
        },
        {
            "id": 13,
            "phrase": "war with someone",
            "definition": "to fight or dispute with someone.  Ruth is always warring with someone, usually about something trivial.  Please don’t war with me!"
        },
        {
            "id": 14,
            "phrase": "ward someone or something off†",
            "definition": "to hold someone or something off; to fight someone or something off.  The army was able to ward the attackers off repeatedly. We couldn’t ward off the attackers any longer."
        },
        {
            "id": 15,
            "phrase": "*warm as toast",
            "definition": "very warm and cozy. (*Also: as ~.) _ The baby will be warm as toast in that blanket.  We were as warm as toast by the side of the fire."
        },
        {
            "id": 16,
            "phrase": "warm body",
            "definition": "a person; just any person (who can be counted on to be present).  See if you can get a couple of warm bodies to stand at the door and hand out programs.  You mean among all these warm bodies nobody knows calculus?"
        },
        {
            "id": 17,
            "phrase": "warm someone or something up†",
            "definition": "to make someone or something warmer; to take the chill off someone or something.  I put him by the fire to warm him up a little.  We warmed up our feet before the fire.  Could you warm up my coffee, please?"
        },
        {
            "id": 18,
            "phrase": "warm someone up†",
            "definition": "1. to make someone warmer. Stand by the fire and warm yourself up. Warm up the kids and then give them some cookies. 2. Fig. to help someone get physically prepared to perform in an athletic event. (As if exercising or loosening up someone’s muscles.) _The referee told the coach to warm his team up so the game could begin.  You have to warm up the team before a game.  Be sure to warm yourself up before playing. 3. Fig. to prepare an audience for another—more famous—performer. (Fig. on W.) _ A singer came out to warm us up for the main attraction.  This comedian is a superb choice to warm up the audience."
        },
        {
            "id": 19,
            "phrase": "warm something over†",
            "definition": "1. to reheat food to serve it as leftovers.  I’ll just warm the rest over for lunch tomorrow.  Jane warmed over yesterday’s turkey. 2. Fig. to bring up a matter that was thought to have been settled. (Fig. on Q.) _ Please don’t warm that business over again. It is settled and should remain that way.  Don’t warm over that matter. We have discussed it enough."
        },
        {
            "id": 20,
            "phrase": "warm the bench",
            "definition": "[for a player] to remain out of play during a game—seated on a bench. John spent the whole game warming the bench. Mary never warms the bench. She plays from the beginning to the end."
        },
        {
            "id": 21,
            "phrase": "warm the cockles of someone’s heart",
            "definition": "to make someone feel warm and happy.  It warms the cockles of my heart to hear you say that. Hearing that old song again warmed the cockles of her heart."
        },
        {
            "id": 22,
            "phrase": "warm up to someone or something",
            "definition": "to become more fervent and earnest toward someone, something, or a group; to become more responsive and receptive to someone, a group, or something. After we talked, he began to warm up to us a little.  I warmed up to the committee as the interview went on."
        },
        {
            "id": 23,
            "phrase": "warmed over",
            "definition": "not very original; rehashed.  I am not interested in reading warmed over news on a computer screen.  The lecture sounded sort of warmed over, but it wasn’t too dull."
        },
        {
            "id": 24,
            "phrase": "warn someone about someone or something",
            "definition": "to advise someone about the dangers associated with someone or something. Didn’t I warn you about the dangers of going there? _ I warned you about Alice."
        },
        {
            "id": 25,
            "phrase": "warn someone against someone or something",
            "definition": "to advise someone against someone, something, or doing something. We warned them all against going to the region at this time.  I warned her against Gerald."
        },
        {
            "id": 26,
            "phrase": "warn someone away from someone or something",
            "definition": "to advise someone to avoid someone or something.  We warned her away from the danger, but she did not heed our warning.  Why didn’t you warn me away from Roger?"
        },
        {
            "id": 27,
            "phrase": "warn someone of something",
            "definition": "to advise someone that something bad is likely to happen.  I wish you had warned us of what was going to happen.  Please warn John of the heavy traffic he may run into."
        },
        {
            "id": 28,
            "phrase": "warn someone off†",
            "definition": "to advise a person to stay away.  We placed a guard outside the door to warn people off until the gas leak could be fixed.  The guards warned off everyone in the vicinity."
        },
        {
            "id": 29,
            "phrase": "warts and all",
            "definition": "Cliché even with the flaws.  It’s a great performance—warts and all.  Yes, we admire each other very much, warts and all."
        },
        {
            "id": 30,
            "phrase": "wash away",
            "definition": "to be carried away by water or some other liquid.  The bridge washed away in the f lood.  All the soil washed away and left the rocks exposed."
        },
        {
            "id": 31,
            "phrase": "wash off ((of ) someone or something)",
            "definition": "to be carried off of or away from someone or something by the action of water or another liquid. (Of is usually retained before pro- nouns.) _ The dirt washed off of the f loor easily.  The label washed off this can, and now I don’t know what’s in it."
        },
        {
            "id": 32,
            "phrase": "wash one’s hands of someone or something",
            "definition": "to end one’s association with someone or something. (Fig. on the notion of getting rid of a problem by removing it as if it were dirt on the hands.) _ I washed my hands of Tom. I wanted no more to do with him.  That car was a real headache. I washed my hands of it long ago."
        },
        {
            "id": 33,
            "phrase": "wash out",
            "definition": "1. Inf. to fail and be removed from something, such as school.  I studied all I could, but I still washed out. I don’t want to wash out. It’s my whole future. 2. Inf. to have a serious wreck; to wipe out.  The little car washed out on the curve. The vehicles have a tendency to wash out when cornering. 3. Inf. to lose a large amount of money.  Fred washed out on that stock deal.  Lefty and Willie washed out at the racetrack. 4. Inf. to break down or collapse from exhaustion.  The whole play began to wash out during the second act. It was a lost cause by the third.  Finally, after a long day, I just washed out. They had to call the paramedics."
        },
        {
            "id": 34,
            "phrase": "wash over someone",
            "definition": "[for a powerful feeling] to flood over a person.  A feeling of nausea washed over me.  A strong feeling of satisfaction washed over me."
        },
        {
            "id": 35,
            "phrase": "wash overboard",
            "definition": "[for someone or something] to be carried overboard (off the deck of a ship) by water.  Our chairs washed overboard in the storm.  I was afraid that the dog would wash overboard, so I took her below."
        },
        {
            "id": 36,
            "phrase": "wash someone or something away†",
            "definition": "[for a flood of water] to carry someone or something away. The f lood washed the boats away. The high water washed away much of the sand along the shoreline."
        },
        {
            "id": 37,
            "phrase": "wash someone or something off†",
            "definition": "to clean someone or something by washing.  She washed the muddy children off with a hose and put their clothes right into the washing machine.  Jane washed off the children."
        },
        {
            "id": 38,
            "phrase": "wash someone or something overboard",
            "definition": "[for water] to flood up and carry someone or something off the deck of a ship into the sea.  The high seas washed two of the sailors overboard.  The storm washed our chairs overboard."
        },
        {
            "id": 39,
            "phrase": "wash someone or something up†",
            "definition": "1. to clean up someone or something by washing.  Please wash the baby up as long as you are changing the diaper.  I’ll wash up the baby.  Sam will wash himself up before dinner. 2. [for water or the waves] to bring someone or something up onto the shore or beach.  Look what the waves washed up! A bottle with a note in it! _ The waves washed a bottle up."
        },
        {
            "id": 40,
            "phrase": "wash someone out†",
            "definition": "to deplete the strength or vitality of someone.  The f lu really washed me out.  The disease washed out the whole class."
        },
        {
            "id": 41,
            "phrase": "wash someone up†",
            "definition": "to terminate someone in something.  This error is going to wash you up as an account executive.  That washed me up.  Problems like this have washed up quite a few careers."
        },
        {
            "id": 42,
            "phrase": "wash something away†",
            "definition": "to clean something by scrubbing and flushing away the dirt.  Fresh water will wash the seawater away.  Let’s wash away these muddy footprints."
        },
        {
            "id": 43,
            "phrase": "wash something down something",
            "definition": "to get rid of something by flooding it down the sewer, drain, sink, etc. Wash all the soap suds down the drain and clean the sink, please.  Please wash all that stuff down the drain."
        },
        {
            "id": 44,
            "phrase": "wash something down† (with something)",
            "definition": "1. to clean something by flooding with water, alcohol, etc.  The doctor washed the area down and began to stitch up the wound. She washed down the wound with alcohol to clean it thoroughly.  Todd washed the driveway down with water. 2. Fig. to use fluid to aid the swallowing of food or medicine. Molly washed the pills down with a gulp of coffee.  She washed down the pills with a glass of water."
        },
        {
            "id": 45,
            "phrase": "wash something of something",
            "definition": "to get something cleaned of something by washing.  I washed my hair of the smell of cigarette smoke I was saturated with in the meeting.  I have to get home and wash my trousers of this stain."
        },
        {
            "id": 46,
            "phrase": "wash something out†",
            "definition": "1. to wash out the inside of something; to wash something made of fabric. I have to wash my socks out tonight. Wash the pitcher out before you put it away.  I will wash out my socks tomorrow. 2. Fig. to rain on or flood an event so that it must be canceled. (Fig. on Q.) _Rain washed the game out. The storm washed out the picnic. 3. to wash or erode something out or away.  The f lood washed the new bushes out.  The rains washed out the paving stones."
        },
        {
            "id": 47,
            "phrase": "wash up (for something)",
            "definition": "to clean [oneself] up for something, such as a meal.  Please wash up for dinner.  Go and wash up!"
        },
        {
            "id": 48,
            "phrase": "washed out",
            "definition": "Inf. exhausted; tired.  I feel too washed out to go to work today.  Poor Ted really looks washed out."
        },
        {
            "id": 49,
            "phrase": "washed up",
            "definition": "finished.  “You’re through, Tom,” said the manager, “Fired—washed up!” _Wilbur is washed up as a bank teller."
        },
        {
            "id": 50,
            "phrase": "waste away",
            "definition": "to wither or dwindle away. Our money just seemed to waste away.  As she grew older, she just sort of wasted away."
        },
        {
            "id": 51,
            "phrase": "Waste not, want not.",
            "definition": "Prov. Cliché If you do not waste anything, you will always have enough. Always save the fabric scraps left over from your sewing projects; you can use them to make something else. Waste not, want not.  Sam never let his leftovers spoil in the refrigerator but made sure to eat them. “Waste not, want not,” he said."
        },
        {
            "id": 52,
            "phrase": "a waste of space",
            "definition": "something that is completely without value.  The wrecked furniture in here is just a waste of space.  This broken-down car is a waste of space!"
        },
        {
            "id": 53,
            "phrase": "waste one’s breath",
            "definition": "to waste one’s time talking; to talk in vain. Don’t waste your breath talking to her. She won’t listen.  You can’t persuade me. You’re just wasting your breath."
        },
        {
            "id": 54,
            "phrase": "waste someone",
            "definition": "Sl. to kill someone.  The thief tried to waste the bank guard after the bank robbery.  The crook said, “Try that again, and I’ll waste you!”"
        },
        {
            "id": 55,
            "phrase": "waste something away†",
            "definition": "to use something up wastefully; to dissipate something.  He wasted all his money away and had to live in poverty.  They wasted away everything and regretted it later."
        },
        {
            "id": 56,
            "phrase": "waste something on someone or something",
            "definition": "to throw something away on someone or something. Please don’t waste any sweet potatoes on me. I don’t like them.  I can’t waste any more money on this car."
        },
        {
            "id": 57,
            "phrase": "watch for someone or something",
            "definition": "to keep looking for someone or something to appear. Watch for me. I’ll be wearing a red carnation in my hair.  I will watch for the bus."
        },
        {
            "id": 58,
            "phrase": "Watch it!",
            "definition": "1. Inf. Be careful.  Rachel: Watch it! There’s a broken stair there. Jane: Gee, thanks.  Mary: Watch it! There’s a pothole in the street. Bob: Thanks. 2. Inf. Do not act or talk that way. Sally: I really hate John! Sue: Watch it! He’s my brother! _ Bill: You girls always seem to take so long to do a simple thing like getting dressed. Mary: Watch it!"
        },
        {
            "id": 59,
            "phrase": "watch one’s step",
            "definition": "1. be careful of one’s walking or stepping.  It’s slippery here. Watch your step. 2. Fig. to act with care and caution so as not to make a mistake or offend someone. John had better watch his step with the new boss. He won’t put up with his lateness.  Mary was told by the teacher to watch her step and stop missing classes."
        },
        {
            "id": 60,
            "phrase": "watch over someone or something",
            "definition": "to keep guard over someone or something; to care for someone or something.  Could you please watch over my little girl while I go to the store? _ I will watch over your house while you are away."
        },
        {
            "id": 61,
            "phrase": "watch someone or something like a hawk",
            "definition": "to watch someone or something very carefully.  The teacher watched the pupils like a hawk to make sure they did not cheat on the exam. We had to watch our dog like a hawk in case he ran away."
        },
        {
            "id": 62,
            "phrase": "A watched pot never boils.",
            "definition": "Prov. Something you are waiting for will not happen while you are concentrating on it.  Don’t just sit there staring at the phone while you wait for Lucy to call. A watched pot never boils.  I’d better do something besides look out the window waiting for Emily to drive up. A watched pot never boils."
        },
        {
            "id": 63,
            "phrase": "water something down†",
            "definition": "1. to dilute something.  Who watered the orange juice down? _ Jim watered down the orange juice. 2. to water something thoroughly. Will you water the lawn down tonight? _Water down the lawn this evening so it will grow tomorrow. 3. Fig. to reduce the effectiveness or force of something. (Fig. on Q.) _Please don’t water my declaration down. The new laws watered down the power of the president."
        },
        {
            "id": 64,
            "phrase": "watering hole",
            "definition": "a place where there is water for animals (and people) to drink.  The elephants came down to the watering hole and chased away the lions so they could drink in peace."
        },
        {
            "id": 65,
            "phrase": "wave back (at someone)",
            "definition": "to return someone’s hand signal of greeting.  I waved back at her, but she didn’t see me.  She didn’t wave back."
        },
        {
            "id": 66,
            "phrase": "wave someone back (from something)",
            "definition": "to motion someone to move back from something.  The police officer waved the curious onlookers back from the scene of the crime. The students started to go onstage, but the teacher waved them back."
        },
        {
            "id": 67,
            "phrase": "wave someone or something aside†",
            "definition": "to make a signal with the hand for someone or something to move aside. The police officer waved us aside and would not let us turn into our street.  The officer waved aside the spectators.  She waved all the traffic aside."
        },
        {
            "id": 68,
            "phrase": "wave someone or something away† (from someone or something)",
            "definition": "to make a signal with the hand for someone or something to move away from someone or something.  The officer waved us away from the intersection where we were about to turn left.  The guard waved away the traffic from the intersection."
        },
        {
            "id": 69,
            "phrase": "wave someone or something off†",
            "definition": "to make a signal with the hand for someone or something to remain at a distance.  There was someone standing in front of the bridge, waving everyone off. The bridge must have collapsed.  He waved off all the traffic."
        },
        {
            "id": 70,
            "phrase": "wave someone or something on†",
            "definition": "to make a signal with the hand for someone or something to move on or keep moving. The traffic cop waved us on. The cop waved on the hordes of pedestrians."
        },
        {
            "id": 71,
            "phrase": "wave something around†",
            "definition": "to raise something up and move it around so that everyone can see it.  When Ruth found the money, she waved it around so everyone could see it.  She kept waving around the dollar she found in the street."
        },
        {
            "id": 72,
            "phrase": "waver between someone and someone else",
            "definition": "to vacillate between choosing one person or another.  I had to appoint the new manager, and I was wavering between Jane and Janet. We wavered between Bill and Bob for the position."
        },
        {
            "id": 73,
            "phrase": "waver between something and something else",
            "definition": "to vacillate between choosing one thing and another; to linger indecisively between doing one thing or another.  The captain was wavering between St. Thomas and St. Croix. We wavered between chocolate and vanilla."
        },
        {
            "id": 74,
            "phrase": "wax and wane",
            "definition": "to increase and then decrease, as the phases of the moon.  As the moon waxes and wanes, so does the height of the tide change. Voter sentiment about the tax proposal waxes and wanes with each passing day."
        },
        {
            "id": 75,
            "phrase": "wax eloquent",
            "definition": "to speak with eloquence. Perry never passed up a chance to wax eloquent at a banquet."
        },
        {
            "id": 76,
            "phrase": "wax poetic",
            "definition": "to speak poetically. I hope you will pardon me if I wax poetic for a moment when I say that your lovely hands drift across the piano keys like swans on a lake."
        },
        {
            "id": 77,
            "phrase": "the way it plays",
            "definition": "Sl. the way it is; the way things are. The world is a rough place, and that’s the way it plays.  It’s tough, but it’s the way it plays."
        },
        {
            "id": 78,
            "phrase": "way off (base)",
            "definition": "Inf. Fig. on the wrong track; completely wrong.  I think you’re way off base. Try again.  Sorry. You are way off. You should just give up."
        },
        {
            "id": 79,
            "phrase": "way out",
            "definition": "1. extreme; arcane. Some of your ideas are really way out. What a way-out hairdo. 2. heavily intoxicated. That guy is way out—can’t even walk. She was so wayout, she was almost unconscious."
        },
        {
            "id": 80,
            "phrase": "(way) over there",
            "definition": "in a place some distance away.  I see a house way over there in the field.  My hat is over there on the table."
        },
        {
            "id": 81,
            "phrase": "The way to a man’s heart is through his stomach.",
            "definition": "Prov. If you want a man to love you, you should feed him good food. Sue: I want Keith to notice me, but he doesn’t even know I’m alive. Mother: Invite him over and cook him a good meal. The way to a man’s heart is through his stomach."
        },
        {
            "id": 82,
            "phrase": "We aim to please.",
            "definition": "Fig.We try hard to please you. (Usually a commercial slogan, but can be said in jest by one person, often in response to Thank you.) _ Mary: This meal is absolutely delicious! Waiter: We aim to please.  Tom: Well, Sue, here’s the laundry detergent you wanted from the store. Sue: Oh, thanks loads. You saved me a trip. Tom: We aim to please."
        },
        {
            "id": 83,
            "phrase": "We must learn to walk before we can run.",
            "definition": "Prov. You must master a basic skill before you are able to learn more complex things. Maria wanted to make a tailored jacket as her first sewing project, but her mother convinced her that she should make something much simpler; she would have to learn to walk before she could run."
        },
        {
            "id": 84,
            "phrase": "We need to talk about something.",
            "definition": "an expression urging or ordering someone to discuss something.  Bill: Can I come over tonight? We need to talk about something. Mary: I guess so.  “Mr. Franklin,” said Bill’s boss sort of sternly, “I want to see you in my office for a minute. We need to talk about something.”"
        },
        {
            "id": 85,
            "phrase": "We were just talking about you.",
            "definition": "a phrase said when a person being discussed appears on the scene. (Compare this with Speak of the devil.) _ Tom: Speak of the devil, here comes Bill. Mary: We were just talking about you, Bill.  Sally (approaching Tom and Bill): Hi, Tom. Hi, Bill. What’s new? Bill: Oh, Sally! We were just talking about you."
        },
        {
            "id": 86,
            "phrase": "the weak link (in the chain)",
            "definition": "the weak point or person in a system or organization.  Joan’s hasty generalizations about the economy were definitely the weak link in her argument."
        },
        {
            "id": 87,
            "phrase": "weak sister",
            "definition": "a timid person, usually a male. It looks like Dave is the weak sister on the team.  We’ve got to pull together and stop playing like a bunch of weak sisters."
        },
        {
            "id": 88,
            "phrase": "a wealth of something",
            "definition": "a large amount of something. There’s a wealth of information on parrots at the library.  The junkyard had a wealth of used car parts."
        },
        {
            "id": 89,
            "phrase": "wean someone (away†) from something",
            "definition": "to force someone or an animal to break a habit. (Fig. on the notion of ending the dependence of a young creature on milk alone.) _It was almost impossible to wean her from her high spending habits.  We couldn’t wean away the dog from its mother."
        },
        {
            "id": 90,
            "phrase": "wear and tear (on something)",
            "definition": "the process of wearing down or breaking down something by regular use.  Driving in freezing weather means lots of wear and tear on your car.  I drive carefully and have my car serviced regularly to avoid wear and tear."
        },
        {
            "id": 91,
            "phrase": "wear away at someone or something",
            "definition": "to annoy or diminish someone or something.  Facing the same problems year after year was wearing away at the president of the company.  The rain wore away at the stone through time."
        },
        {
            "id": 92,
            "phrase": "wear down",
            "definition": "to break down with wear; to erode. The steps had worn down so much that each one was curved and slanted dangerously."
        },
        {
            "id": 93,
            "phrase": "wear off",
            "definition": "[for the effects of something] to become less; to stop gradually.  The effects of the painkiller wore off and my tooth began to hurt.  I was annoyed at first, but my anger wore off."
        },
        {
            "id": 94,
            "phrase": "wear off ((of ) something)",
            "definition": "[for something] to be ground or rubbed away. (Of is usually retained before pronouns.) _ The paint has worn off the porch steps.  The finish is wearing off."
        },
        {
            "id": 95,
            "phrase": "wear on (for a period of time)",
            "definition": "[for an event] to continue for a long period of time. The lecture seemed to wear on for hours.  It wore on until I went to sleep."
        },
        {
            "id": 96,
            "phrase": "wear on someone",
            "definition": "to bother or annoy someone.  We stayed with them only a short time because my children seemed to wear on them.  Always being short of money wears on a person after a while."
        },
        {
            "id": 97,
            "phrase": "wear out",
            "definition": "to become worn from use; to become diminished or useless from use. My car engine is about to wear out.  It takes a lot of driving to wear out an engine."
        },
        {
            "id": 98,
            "phrase": "wear out one’s welcome",
            "definition": "to stay too long (at an event to which one has been invited); to visit somewhere too often.  Tom visited the Smiths so often that he wore out his welcome.  At about midnight, I decided that I had worn out my welcome, so I went home."
        },
        {
            "id": 99,
            "phrase": "wear someone down†",
            "definition": "1. Fig. to exhaust someone.  This hot weather wears me down.  The steamy weather wore down the tourists and made them stay in their hotels. 2. Fig. to reduce someone to submission or agreement by constant badgering.  Finally they wore me down and I told them what they wanted to know. The interrogation wore down the suspect."
        },
        {
            "id": 100,
            "phrase": "wear someone out†",
            "definition": "to exhaust someone; to make someone tired.  The coach made the team practice until he wore them out. If he wears out everybody on the team, nobody will be left to play in the game."
        },
        {
            "id": 101,
            "phrase": "wear someone to a frazzle",
            "definition": "to exhaust someone.  Her work wears her to a frazzle.  Taking care of all those kids must wear you to a frazzle."
        },
        {
            "id": 102,
            "phrase": "wear something away†",
            "definition": "to erode something. The constant rains wore the side of the cathedral away.  The flooding wore away the topsoil."
        },
        {
            "id": 103,
            "phrase": "wear something down†",
            "definition": "to grind something away; to erode something.  The constant rubbing of the door wore the carpet down. The rubbing of the door wore down the carpet."
        },
        {
            "id": 104,
            "phrase": "wear something out†",
            "definition": "to make something worthless or nonfunctional from use.  I wore my shoes out in no time at all.  I wore out my shoes in less than a month."
        },
        {
            "id": 105,
            "phrase": "wear something (up)on something",
            "definition": "to have something on something as clothing or adornment. (Upon is formal and less commonly used than on.) _ I wore a lovely diamond pin upon my blouse.  I wore the flower on my lapel."
        },
        {
            "id": 106,
            "phrase": "wear through something",
            "definition": "to grind or rub through something. My heel finally wore through the carpeting beneath the accelerator of my car.  The constant rubbing of hands wore through the paint on the railing."
        },
        {
            "id": 107,
            "phrase": "wear (up)on someone",
            "definition": "to diminish someone’s energy and resistance; to bore or annoy someone. (Upon is formal and less commonly used than on.) _You could see that the lecture was beginning to wear upon the audience. This kind of thing really wears on me."
        },
        {
            "id": 108,
            "phrase": "wear (up)on something",
            "definition": "to grind or rub at something. (Upon is formal and less commonly used than on.) _The bottom of the door is wearing upon the carpet and leaving marks.  It is wearing on the carpet."
        },
        {
            "id": 109,
            "phrase": "weary of someone or something",
            "definition": "to become tired of or bored with someone or something.  I am beginning to weary of you. Isn’t it time you were going? _ We soon wearied of chicken twice a week."
        },
        {
            "id": 110,
            "phrase": "weary someone with something",
            "definition": "to tire or bore someone with something.  He wearied her with his constant requests.  Please don’t weary me with your complaints."
        },
        {
            "id": 111,
            "phrase": "weasel out (of something)",
            "definition": "1. Fig. to squeeze one’s way out of something. Somehow, the child managed to weasel out of the hole she was stuck in.  The mouse tried to weasel out. 2. Fig. to evade or avoid a job or responsibility. (Fig. on Q.) _ Don’t try to weasel out of your responsibility! _ You can’t weasel out! You have to do it."
        },
        {
            "id": 112,
            "phrase": "weather permitting",
            "definition": "if the weather allows it.  Weather permitting, we will be there on time.  The plane lands at midnight, weather permitting."
        },
        {
            "id": 113,
            "phrase": "weather the storm",
            "definition": "1. Fig. to experience and survive a storm.  We decided to stay in the building and weather the storm there with the other visitors. 2. Fig. to experience something and survive it. (Fig. on Q.) _ The manager went on another shouting rampage and frightened his assistants. The rest of us stayed in our offices to weather the storm."
        },
        {
            "id": 114,
            "phrase": "weave around",
            "definition": "to move about, changing directions at random. The drunken driver wove around all over the road.  He was weaving around everywhere."
        },
        {
            "id": 115,
            "phrase": "weave in and out (of something)",
            "definition": "to move, drive, or walk in and out of something, such as traffic, a line, etc.  The car was weaving in and out of traffic dangerously.  The deer ran rapidly through the forest, weaving in and out of the trees."
        },
        {
            "id": 116,
            "phrase": "weave something from something",
            "definition": "1. to make a fabric from some type of fiber.  They weave this cloth from a fine plant fiber.  This cloth is woven from silk threads. 2. Fig. to make a story or explanation out of a small amount of information. (Fig. on Q.) _You have woven the entire tale from something you heard me say to Ruth.  Your explanation has been woven from supposition."
        },
        {
            "id": 117,
            "phrase": "weave something into something",
            "definition": "1. to form fibers into a fabric.  They could weave the threads into simple cloth with a primitive loom. We will weave this wool into a rug. 2. Fig. to turn separate episodes into a story. (Fig. on Q.) _Skillfully, the writer wove the elements into a clever story.  Memories from her childhood were woven into a series of short stories."
        },
        {
            "id": 118,
            "phrase": "weave through something",
            "definition": "to move through something by turning and dodging.  The car wove through traffic, almost hitting a number of other cars. We wove through the jungle vines, trying to avoid touching the poisonous ones."
        },
        {
            "id": 119,
            "phrase": "wed someone to someone",
            "definition": "to marry someone to someone else. Her parents wedded her to a young prince when she was only twelve.  They cannot wed her to anyone if she has already married someone of her own choosing."
        },
        {
            "id": 120,
            "phrase": "wed someone to something",
            "definition": "to join someone firmly to a concept. (Fig. on wed someone to someone.) _Don’t try to wed me to your way of doing things. I have my own way.  Don’t wed yourself to that idea."
        },
        {
            "id": 121,
            "phrase": "wed(ded) to someone",
            "definition": "married to someone.  The couple will have been wed to each other for fifty years next June.  Anne is wed to one of my cousins."
        },
        {
            "id": 122,
            "phrase": "wedded to something",
            "definition": "mentally attached to something; firmly committed to something. (Fig. on wed(ded) to someone.) _The manager was wedded to the idea of getting new computers.  The mayor was wedded to the new budget plan."
        },
        {
            "id": 123,
            "phrase": "wedge someone or something (in†) between people or things",
            "definition": "to work someone or something into a tiny space between people or things.  The usher wedged us in between two enormously fat people, and we were all very uncomfortable. They wedged in the package between Jane and the wall.  We had to wedge Timmy between Jed and the side of the car."
        },
        {
            "id": 124,
            "phrase": "weed someone or something out†",
            "definition": "to remove someone or something unwanted or undesirable from a group or collection. (Fig. on removing weeds from the soil.) _ We had to weed the less productive workers out one by one.  The auditions were held to weed out the actors with the least ability. I’m going through my books to weed out those that I don’t need anymore."
        },
        {
            "id": 125,
            "phrase": "week in, week out",
            "definition": "every week, week after week.  We have the same old food, week in, week out.  I’m tired of this job. I’ve done the same thing—week in, week out— for three years."
        },
        {
            "id": 126,
            "phrase": "weep about someone or something",
            "definition": "to cry about someone or something; to mourn someone or something.  She was weeping about her grandfather, who had passed away in the night.  There is no use weeping about spilled milk."
        },
        {
            "id": 127,
            "phrase": "weep for joy",
            "definition": "to cry out of happiness.  She was so happy, she wept for joy.  We all wept for joy at the safe return of the child."
        },
        {
            "id": 128,
            "phrase": "weep for someone or an animal",
            "definition": "to cry out of sorrow for someone or an animal.  She wept for her puppy when it was terribly sick. Please don’t weep for me after I’m gone."
        },
        {
            "id": 129,
            "phrase": "weep over someone or something",
            "definition": "to cry about someone or something.  No need to weep over me. I’ll do all right.  There is no point in weeping over something you can’t do anything about."
        },
        {
            "id": 130,
            "phrase": "weigh against someone or something",
            "definition": "to count against someone or something; [for some fact] to work against someone or something. I hope my many absences do not weigh against me on the final grade.  This will weigh against you."
        },
        {
            "id": 131,
            "phrase": "weigh in (at something)",
            "definition": "to present oneself at a certain weight. (Usually said of boxers.) _ The fighter weighed in at over two hundred pounds.  The contenders weighed in yesterday."
        },
        {
            "id": 132,
            "phrase": "weigh on someone’s mind",
            "definition": "[for something] to be in a person’s thoughts; [for something] to be bothering someone’s thinking.  This problem has been weighing on my mind for many days now.  I hate to have things weighing on my mind. I can’t sleep when I’m worried."
        },
        {
            "id": 133,
            "phrase": "weigh someone down†",
            "definition": "[for a thought] to worry or depress someone.  All these problems really weigh me down. Financial problems have been weighing down our entire family."
        },
        {
            "id": 134,
            "phrase": "weigh someone or something down†",
            "definition": "to burden someone or something.  The heavy burden weighed the poor donkey down.  The load of bricks weighed down the truck."
        },
        {
            "id": 135,
            "phrase": "weigh someone’s words",
            "definition": "1. Fig. to consider carefully what someone says.  I listened to what he said, and I weighed his words very carefully. Everyone was weighing his words. None of us knew exactly what he meant. 2. Fig. to consider one’s own words carefully when speaking. I always weigh my words when I speak in public. John was weighing his words carefully because he didn’t want to be misunderstood."
        },
        {
            "id": 136,
            "phrase": "weigh something against something",
            "definition": "to ponder something by balancing it against something.  I weighed going to town against staying here and sleeping and I decided to stay here.  When I weigh your suggestion against my own ideas, I realize that I must follow my own conscience."
        },
        {
            "id": 137,
            "phrase": "weigh something out†",
            "definition": "to weigh something as it is distributed. The merchant weighed the cuts of meat out for each of the waiting women.  They weighed out the grain carefully."
        },
        {
            "id": 138,
            "phrase": "weigh something up†",
            "definition": "to find out the weight of something.  I can’t tell you how much this will cost until I weigh it up.  Liz weighed up the meat and jotted down the price."
        },
        {
            "id": 139,
            "phrase": "weigh (up)on someone",
            "definition": "to burden or worry someone. (Upon is formal and less commonly used than on.) _The problems at the office were beginning to weigh upon Mr. Franklin.  My problems began to weigh on me."
        },
        {
            "id": 140,
            "phrase": "weight someone or something down† (with something)",
            "definition": "to place a heavy weight in or on someone or something; to press down or hold down someone or something with a heavy weight. The inquisitors weighted the accused down with stones, but he still refused to say what they wanted.  Karen weighted down the papers with an ornamental paperweight."
        },
        {
            "id": 141,
            "phrase": "weight something against someone or something",
            "definition": "to bias something against someone or something.  The prosecutor tried to weight the evidence against the defendant.  The police weighted the case against the accused company."
        },
        {
            "id": 142,
            "phrase": "weird out",
            "definition": "Sl. to become emotionally disturbed or unnerved; to flip out.  The day was just gross. I thought I would weird out at noon.  I weirded out at the news of Frankie’s death."
        },
        {
            "id": 143,
            "phrase": "weirded out",
            "definition": "Sl. disturbed or unnerved by drugs or events.  I was totally weirded out and couldn’t control myself.  After the blowup, Fred was really weirded out."
        },
        {
            "id": 144,
            "phrase": "Welcome aboard.",
            "definition": "Welcome to employment at our company. Glad to meet you. Welcome aboard."
        },
        {
            "id": 145,
            "phrase": "welcome someone or something back†",
            "definition": "to greet the return of someone or something. We are delighted to welcome you back to our house.  The students welcomed back the teacher who had been ill."
        },
        {
            "id": 146,
            "phrase": "welcome someone to something",
            "definition": "to greet someone who has come into something or some place.  I am very pleased to welcome you to Adamsville! _ They welcomed us to the party and showed us where to put our coats and hats."
        },
        {
            "id": 147,
            "phrase": "welcome someone with something",
            "definition": "to present something to someone as a sign of greeting.  The natives welcomed us with garlands of f lowers. I welcomed the visitors with gifts and good wishes."
        },
        {
            "id": 148,
            "phrase": "welcome to do something",
            "definition": "free to do something; allowed to do something.  The audience is welcome to ask questions at the end of the speech.  You are welcome to help yourself to anything in the kitchen."
        },
        {
            "id": 149,
            "phrase": "Welcome to our house.",
            "definition": "an expression said by a host or hostess when greeting guests and bringing them into the house.  Andy: Hello, Sally. Welcome to our house. Come on in. Sally: Thanks. It’s good to be here.  Tom: Welcome to our house. Make yourself at home. Henry: Thanks, I’m really tired."
        },
        {
            "id": 150,
            "phrase": "weld someone and someone else together",
            "definition": "to bind people together. (Fig. on weld something and something else together.) _Their experiences in the war welded Tom and Sam together for life.  They were welded together by their common goals."
        },
        {
            "id": 151,
            "phrase": "weld something and something else together",
            "definition": "to attach things to one another by welding.  The worker welded the ends of the rods together.  See if you can weld these plates together."
        },
        {
            "id": 152,
            "phrase": "Well begun is half done.",
            "definition": "Prov. Beginning a project well makes it easier to do the rest.; Once you have begun a project well, you do not need to put in much more effort to finish it.  Jill: I’m afraid I’ll never be able to finish writing this report. Jane: You’ve already written a good introduction. Well begun is half done."
        },
        {
            "id": 153,
            "phrase": "Well, bust my buttons!",
            "definition": "Rur. What a surprise! _ Well, bust my buttons! It’s good to see you! _ Well, bust my buttons! You did all the dishes!"
        },
        {
            "id": 154,
            "phrase": "*well disposed to(ward) someone or something",
            "definition": "friendly with someone or something; having a positive or favorable attitude toward someone or something. (*Typically: be ~; become ~.) _ I am not well disposed toward Walter. We are quite well disposed to all of them."
        },
        {
            "id": 155,
            "phrase": "Well done!",
            "definition": "You did that nicely! _ Sally: Well done, Tom. Excellent speech. Tom: Thanks.  In the lobby after the play, Tom was met with a chorus of well-wishers saying, “Well done, Tom!”"
        },
        {
            "id": 156,
            "phrase": "well in hand",
            "definition": "under control.  Is that matter well in hand? _ We have everything well in hand. Don’t worry."
        },
        {
            "id": 157,
            "phrase": "*well into something",
            "definition": "far into something or far along in something. (*Typically: be ~; get ~.) _ It was well into the morning before she awoke.  The car was well into the tunnel when it broke down."
        },
        {
            "id": 158,
            "phrase": "well out (of something)",
            "definition": "to gush out of something.  I opened the door and the water welled out."
        },
        {
            "id": 159,
            "phrase": "well out(side) of something",
            "definition": "far outside something. We were well out of the city when the air-raid sirens went off."
        },
        {
            "id": 160,
            "phrase": "well over",
            "definition": "[for a liquid] to fill up and spill over.  The laundry tub finally welled over as it became too full. The milk glass began to well over, and Timmy began to cry."
        },
        {
            "id": 161,
            "phrase": "Well said.",
            "definition": "You said that very well, and I agree.  As Sally sat down, Mary complimented her, “Well said, Sally. You made your point very well.” _ John: And I for one will never stand for this kind of encroachment on my rights again! Mary: Well said! Bob: Well said, John! Fred: Yes, well said."
        },
        {
            "id": 162,
            "phrase": "Well, shut my mouth!",
            "definition": "Rur. I am very surprised! _Well, shut my mouth! I didn’t know you were in town! _ Tom: The governor’s on the phone and wants to talk to you. Jane: Well, shut my mouth!"
        },
        {
            "id": 163,
            "phrase": "well up in years",
            "definition": "Euph. aged; old. Jane’s husband is well up in years. He is nearly seventy-five.  Joan’s well up in years but healthy."
        },
        {
            "id": 164,
            "phrase": "well up (inside someone)",
            "definition": "[for a feeling] to seem to swell and move inside one’s body.  A feeling of revulsion began to well up inside Fred.  Burning resentment welled up, and George knew he was going to lose his temper."
        },
        {
            "id": 165,
            "phrase": "well up with something",
            "definition": "to fill up or gush with something, such as water. Her eyes welled up with tears. The basement drain welled up with the f loodwaters."
        },
        {
            "id": 166,
            "phrase": "(Well,) what do you know!",
            "definition": "Inf. a way of expressing surprise at finding something that is unexpected; an expression of mild surprise at something someone has said. (No answer is expected or desired.) _Andy: Well, what do you know! Here’s a brand new shirt in this old trunk. Bob: I wonder how it got there.  Tom: These two things fit together like this. John: Well, what do you know!"
        },
        {
            "id": 167,
            "phrase": "well-to-do",
            "definition": "wealthy and of good social position. (Often with quite, as in the examples.) _ The Jones family is quite well-to-do.  There is a gentleman waiting for you at the door. He appears quite well-to-do."
        },
        {
            "id": 168,
            "phrase": "welsh on someone",
            "definition": "to renege on a bet or an agreement made with someone. (Also spelled welch.) _You had better not welsh on me if you know what is good for you.  Max welshed on the mob boss and made a lot of trouble for himself."
        },
        {
            "id": 169,
            "phrase": "welsh on something (with someone)",
            "definition": "to renege on a bet or agreement made with someone. (Also spelled welch.) _ Max welshed on his bet with Lefty. That was not a wise thing to do.  It is not wise to welsh on a bet."
        },
        {
            "id": 170,
            "phrase": "welter in something",
            "definition": "1. to roll about or wallow in something; to be immersed in or surrounded by something.  Most breeds of pigs will welter happily in mud. I hate having to welter in the heat. 2. [for someone or something] to drip or run with liquid, such as blood, sweat, water, etc.  Three minutes into the jungle, we were weltering in our own sweat.  The wounded man weltered in his blood. 3. Fig. to be immersed in something such as activity, work, demands, etc. (Fig. on Q.) _ Toward the peak of the season, we welter in orders for our goods. She was weltering in work, eager to take a break."
        },
        {
            "id": 171,
            "phrase": "Were you born in a barn?",
            "definition": "Rur. an expression chiding someone who has left a door open or who is ill-mannered or messy. Andy: Close the door! Were you born in a barn? Bob: Sorry.  Fred: Can’t you clean this place up a little? Were you born in a barn? Bob: I call it the messy look."
        },
        {
            "id": 172,
            "phrase": "a wet blanket",
            "definition": "a dull or depressing person who spoils other people’s enjoyment.  Jack’s fun at parties, but his brother’s a wet blanket.  I was with Anne and she was being a real wet blanket."
        },
        {
            "id": 173,
            "phrase": "wet one’s whistle",
            "definition": "Rur. to take a drink. He stopped at the bar to wet his whistle.  I don’t need a big glass of water. Just enough to wet my whistle."
        },
        {
            "id": 174,
            "phrase": "wet someone or something down†",
            "definition": "to put water onto someone or something.  Mother wet the children down with a hose while she was washing the car.  Karen wet down the children with the hose. We wet the new concrete down to help it cure in all the heat."
        },
        {
            "id": 175,
            "phrase": "whack someone or something up†",
            "definition": "Sl. to damage someone or something.  Bob got mad at Greg and whacked him up.  Clara whacked up her car yesterday."
        },
        {
            "id": 176,
            "phrase": "whack something off†",
            "definition": "1. Sl. to complete something easily or quickly. If you want a pair of these, I can whack them off for you in a few minutes.  The artisan whacked off a set of the earrings in a few minutes. 2. Sl. to cut or chop something off. A tree branch is rubbing against the house. I guess I’ll go out and whack that branch off.  Whack off that other branch while you are at it."
        },
        {
            "id": 177,
            "phrase": "whack something up†",
            "definition": "Sl. to chop something up. In about an hour, he had whacked the tree up into small logs. Have you whacked up the chicken for frying yet?"
        },
        {
            "id": 178,
            "phrase": "whacked (out)",
            "definition": "Sl. intoxicated. Gee, is he ever whacked! _ Dave was so whacked out he couldn’t stand up."
        },
        {
            "id": 179,
            "phrase": "whale into someone or an animal",
            "definition": "to attack or punish someone or an animal _ Jimmy’s dad really whaled into him.  The sailor whaled into the dog."
        },
        {
            "id": 180,
            "phrase": "whale the tar out of someone",
            "definition": "Inf. to spank or beat someone.  My father threatened to whale the tar out of me. I’ll whale the tar out of you when we get home if you don’t settle down."
        },
        {
            "id": 181,
            "phrase": "wham bam thank you ma’am",
            "definition": "Rur. a bump in the road. We hit a wham bam thank you ma’am and lost one of our hubcaps. Watch out for the wham bam thank you ma’am at the corner of Third Street."
        },
        {
            "id": 182,
            "phrase": "What about (doing) something?",
            "definition": "Would you like to do something? _What about going on a picnic? _What about a picnic?"
        },
        {
            "id": 183,
            "phrase": "What about (having) something?",
            "definition": "Inf. Would you like to have something? _ What about having another drink? _ What about another drink?"
        },
        {
            "id": 184,
            "phrase": "What about it?",
            "definition": "Inf. So what?; Do you want to argue about it? (Contentious.) _ Bill: I heard you were the one accused of breaking the window. Tom: Yeah? So, what about it? _ Mary: Your piece of cake is bigger than mine. Sue: What about it?"
        },
        {
            "id": 185,
            "phrase": "What about you?",
            "definition": "1. Fig. What is your choice? (Compare this with How about you?) _ Tom: I’m having the pot roast and a cup of coffee. What about you? Mary: I want something fattening and unhealthy.  Sally: I prefer green and purple for this room. What about you? Mary: Well, purple’s okay, but green is not right for this room. 2. What will happen to you? _ Mary: My parents are taking my brothers to the circus. Sue: What about you? Mary: I have a piano lesson.  Mary: All my friends have been accepted to colleges. Sue: What about you? Mary: Oh, I’m accepted too."
        },
        {
            "id": 186,
            "phrase": "What are you drinking?",
            "definition": "1. Fig. a phrase inquiring what someone is already drinking so that the person who asks the question can offer another drink of the same thing.  Bill: Hi, Tom. Nice to see you. Can I get you something to drink? Tom: Sure. What are you drinking? Bill: Scotch and water. Waiter: What are you drinking, madam? Sue: It’s just soda. No more, thanks. Waiter: Very good. 2. Fig. a phrase inquiring what is being drunk at a particular gathering so that the person asking can request the same drink. (A way of finding out what drinks are available.) _Mary: Do you want a drink? Sue: Yes, thanks. Say, that looks good. What are you drinking? Mary: It’s just ginger ale.  Bill: Can I get you something to drink? Jane: What are you drinking? Bill: I’m having gin and tonic. Jane: I’ll have that too, thanks."
        },
        {
            "id": 187,
            "phrase": "What are you driving at?",
            "definition": "What are you implying?; What do you mean? _ What are you driving at? What are you trying to say? _ Why are you asking me all these questions? What are you driving at?"
        },
        {
            "id": 188,
            "phrase": "What are you having?",
            "definition": "What food or drink are you planning to order? (Either part of a conversation or a request from food service personnel. In a restaurant, sometimes the host or hostess will signal to a guest to order first by saying this. Sometimes a guest will ask this of a host or hostess to determine the price range that is appropriate.) _Waiter: Would you care to order now? Tom: What are you having? Mary: You order. I haven’t made up my mind.  Waiter: May I help you? Tom: What are you having, Pop? Father: I’ll have the roast chicken, I think, with fries. Tom: I’ll have the same."
        },
        {
            "id": 189,
            "phrase": "What brings you here?",
            "definition": "What is your reason for being here? (A polite request for this information. More polite than “Why are you here?”) _ Tom: Hello, Mary. What brings you here? Mary: I was invited, just like you.  Doctor: Well, John, what brings you here? John: I’ve had this cough for nearly a month, and I think it needs looking into."
        },
        {
            "id": 190,
            "phrase": "What can I say?",
            "definition": "Inf. I have no explanation or excuse. What do you expect me to say? _ Bill: Why on earth did you lose that big order? Sally: What can I say? I’m sorry! _ Bob: You’re going to have to act more aggressive if you want to make sales. You’re just too timid. Tom: What can I say? I am what I am."
        },
        {
            "id": 191,
            "phrase": "What can I tell you?",
            "definition": "What kind of information do you want? _ Bill: I have a question. Bob: What can I tell you? Bill: When do we arrive at Chicago? _ Mary: I would like to ask a question about the quiz tomorrow. Bill: What can I tell you? Mary: The answers, if you know them."
        },
        {
            "id": 192,
            "phrase": "What can’t be cured must be endured.",
            "definition": "Prov. If you cannot do anything about a problem, you will have to live with it.  Alan: No matter what I do, I can’t make the dog stop barking in the middle of the night. Jane: What can’t be cured must be endured, then, I guess."
        },
        {
            "id": 193,
            "phrase": "What difference does it make?",
            "definition": "Does it really matter?; Does it cause any trouble? _What if I choose to leave home? What difference does it make? _So Jane dropped out of the club. What difference does it make?"
        },
        {
            "id": 194,
            "phrase": "What do you know?",
            "definition": "Inf. a typical inquiry on greeting someone. (A specific answer is not expected. Often pronounced “Wha-da-ya know?”) _Bob: Hey, Tom! What do you know? Tom: Look who’s here! Hi, Bob! _ John: What do you know? Mary: Nothing. How are you? John: Okay."
        },
        {
            "id": 195,
            "phrase": "What do you know (about that)?",
            "definition": "Inf. That is very interesting.  Tom: I heard that Jim and Mary are getting married. Jane: Well! What do you know about that? _What do you know? Bill finally sold his house!"
        },
        {
            "id": 196,
            "phrase": "What do you know for sure?",
            "definition": "Inf. How are you?; What do you know? (Familiar. An elaboration of What do you know? Does not require a direct answer.) _ Tom: Hey, man! What do you know for sure? Bill: Howdy, Tom. What’s new? _ John: How are you doing, old buddy? Bill: Great, John! John: What do you know for sure? Bill: Nothing much."
        },
        {
            "id": 197,
            "phrase": "What do you say?",
            "definition": "1. Inf. Hello, how are you? _ Bob: What do you say, Tom? Tom: Hey, man. How are you doing? _Bill: What do you say, man? Fred: What’s the good word, you old so-and-so? 2. Lit. What is your answer or decision? _ Bill: I need an answer from you now. What do you say? Bob: Don’t rush me! _ Sue: I can offer you seven hundred dollars for your old car. What do you say? Bob: I’ll take it! 3. Lit. an expression urging a child to say Thank you or please.  When Aunt Sally gave Billy some candy, his mother said to Billy, “What do you say?” “Thank you,” said Billy.  Mother: Here’s a nice glass of milk. Child: Good. Mother: What do you say? Child: Very good. Mother: No. What do you say? Child: Thank you."
        },
        {
            "id": 198,
            "phrase": "What do you think?",
            "definition": "What is your opinion? _Mary: This is our new company stationery. What do you think? Bill: Stunning. Simply stunning.  Mary: We’re considering moving out into the country. What do you think? Sue: Sounds good to me."
        },
        {
            "id": 199,
            "phrase": "What do you think of this weather?",
            "definition": "a phrase used to open a conversation with someone, often someone one has just met.  Sue: Glad to meet you, Mary. Mary: What do you think about this weather? Sue: I’ve seen better.  Bill: What do you think about this weather? Jane: Lovely weather for ducks."
        },
        {
            "id": 200,
            "phrase": "What do you think you are doing here?",
            "definition": "Why are you in this place? (Stern and threatening.) _ John: Mary! Mary: John! John: What do you think you’re doing here? _ “What do you think you’re doing here?” said Fred to a frightened rabbit trapped in the garage."
        },
        {
            "id": 201,
            "phrase": "What do you want me to say?",
            "definition": "Inf. You caught me and I’m sorry, and I don’t know what more to say.  What do you want me to say? I apologized. There is nothing more I can do. Okay, so I’m wrong. What do you want me to say?"
        },
        {
            "id": 202,
            "phrase": "What does that prove?",
            "definition": "So what?; that does not mean anything. (A defensive expression. The heaviest stress is on that. Often with so, as in the examples.) _Tom: It seems that you were in the apartment the same night that it was robbed. Bob: So, what does that prove? Tom: Nothing, really. It’s just something we need to keep in mind.  Rachel: You’re late again on your car payment. Jane: What does that prove? Rachel: Simply that you can’t afford the car and we are going to repossess it."
        },
        {
            "id": 203,
            "phrase": "What else can I do for you?",
            "definition": "In what other way can I serve you? (Said by shopkeepers, clerks, and service personnel.) _Bill: What else can I do for you? Bob: Please check the oil.  “Here’s your prescription. What else can I do for you?” said the pharmacist."
        },
        {
            "id": 204,
            "phrase": "*what for",
            "definition": "1. Fig. a scolding; a stern lecture. (*Typically: get ~; give someone ~.) _Billy’s mother gave him what for because he didn’t get home on time.  I will really give you what for if you don’t straighten up. 2. Why?; For what reason? _ Father: “I want you to clean your room.” Child: “What for? It’s clean enough.” _ What did you do that for?"
        },
        {
            "id": 205,
            "phrase": "What gives?",
            "definition": "Inf. What happened?; What went wrong?; What’s the problem? _Bill: Hi, you guys. What gives? Bob: Nothing, just a little misunderstanding. Tom’s a little angry.  Bob: Where’s my wallet? What gives? Tom: I think one of those roughnecks who just walked by us has borrowed it for a little while."
        },
        {
            "id": 206,
            "phrase": "What goes up must come down.",
            "definition": "Prov. Anything that has risen or been raised up must eventually fall down.  When it came time to move out of our second-f loor apartment, we looked at our large, heavy sofa with dismay, not sure how we would get it down the stairs. “What goes up must come down,” my husband said, “Somehow.”"
        },
        {
            "id": 207,
            "phrase": "What happened?",
            "definition": "What went wrong here? _ Bob (approaching a crowd): What happened? Tom (with Bob): What’s wrong? Bystander: Just a little mix-up. A car wanted to drive on the sidewalk, that’s all.  There was a terrible noise, an explosion that shook the house. Bob looked at Jane and said, “What happened?”"
        },
        {
            "id": 208,
            "phrase": "What have you been up to?",
            "definition": "Inf. I haven’t seen you for a long time, so tell me what you have been doing? _ Hi, Tom. Where have you been? What have you been up to? _ What have you been up to? Busy, I am sure."
        },
        {
            "id": 209,
            "phrase": "What if...?",
            "definition": "What would be the result if something were true? _ What if you had all the money you want? _ What if everyone thought you were great?"
        },
        {
            "id": 210,
            "phrase": "What if I do?",
            "definition": "Does it matter to you if I do it?; What difference does it make if I do it? _Tom: Are you really going to sell your leather coat? Bob: What if I do? _ Jane: You’re not going to go out dressed like that, are you? Sue: So what if I do?"
        },
        {
            "id": 211,
            "phrase": "What if I don’t?",
            "definition": "Does it matter to you if I do not do it?; What difference does it make if I do not do it? _ Bob: You’re certainly going to tidy up a bit before going out, aren’t you? Tom: What if I don’t? _ Father: You are going to get in by midnight tonight or you’re grounded. Fred: So what if I don’t? Father: That’s enough! You’re grounded as of this minute!"
        },
        {
            "id": 212,
            "phrase": "What (in) the hell?",
            "definition": "1. Inf. What has happened?; What? _ What in the hell? Who did this? _ What the hell happened here? 2. Inf. What does it matter? Why not? (Usually with the force of an exclamation.) _ Give her a new one. What the hell! _ Don’t be such a cheapskate. Get the nice one. What the hell!"
        },
        {
            "id": 213,
            "phrase": "What in (the) Sam Hill?",
            "definition": "Inf. What has happened?; What? (An elaboration of what. Sam Hill is a euphemism for hell. Often with the force of an exclamation. See examples for variations.) _What in Sam Hill is going on around here? _ What in the Sam Hill do you think you are doing?"
        },
        {
            "id": 214,
            "phrase": "What is it?",
            "definition": "What do you want from me?; Why do you want to get my attention? _ Tom: John, can I talk to you for a minute? John: What is it? _Sue: Jane? Jane: What is it? Sue: Close the door, please."
        },
        {
            "id": 215,
            "phrase": "what makes someone tick",
            "definition": "something that motivates someone; something that makes someone behave in a certain way. (Fig. on what makes something tick.) _ William is sort of strange. I don’t know what makes him tick.  When you get to know people, you find out what makes them tick."
        },
        {
            "id": 216,
            "phrase": "what makes something tick",
            "definition": "the sense or mechanism that makes something run or function. (With reference to the ticking of a clock representing the functioning of the clock.) _ I don’t know what makes it tick.  I took apart the radio to find out what made it tick."
        },
        {
            "id": 217,
            "phrase": "What makes you think so?",
            "definition": "Why do you think that?; What is your evidence for that conclusion? _ Tom: This bread may be a little old. Alice: What makes you think so? Tom: The green spots on the edges.  Bob: Congress is in session again. Tom: What makes you think so? Bob: My wallet’s empty."
        },
        {
            "id": 218,
            "phrase": "What number are you calling?",
            "definition": "an expression used when one suspects that a telephone caller may have gotten the wrong number.  Bob (on the telephone): Hello? Mary: Hello, is Sally there? Bob: Uh, what number are you calling? Mary: I guess I have the wrong number. Sorry. Bob: No problem. Good-bye.  When the receptionist asked, “What number are you calling?” I realized I had made a mistake."
        },
        {
            "id": 219,
            "phrase": "What of it?",
            "definition": "Inf. What does it matter?; Why treat it as if it were important?; Why do you think that this is any of your business? (A bit contentious.) _ John: I hear you’ve been having a little trouble at the office. Bob: What of it? _ Sue: You missed a spot shaving. Fred: What of it?"
        },
        {
            "id": 220,
            "phrase": "What one doesn’t know won’t hurt one.",
            "definition": "Cliché Unknown facts cannot worry or upset a person.  Don’t tell me that I have made a mistake. What I don’t know won’t hurt me.  Don’t tell him the truth about his missing dog. What he doesn’t know won’t hurt him."
        },
        {
            "id": 221,
            "phrase": "What price something?",
            "definition": "What is the value of something?; What good is something? (Said when the value of the thing referred to is being diminished or ignored.) _Jane’s best friend told us all about Jane’s personal problems. What price friendship? _ Jack simply declared himself president of the political society. What price democracy?"
        },
        {
            "id": 222,
            "phrase": "What’s buzzin’ (cousin)?",
            "definition": "Sl. What’s happening? _Hey, chum! What’s buzzin’ cousin? _ What’s buzzin’ around here?"
        },
        {
            "id": 223,
            "phrase": "*what’s coming to one",
            "definition": "what one deserves. (*Typically: get ~; have ~; give one ~.) _ If you cheat, you’ll get in trouble. You’ll get what’s coming to you. They gave Billy what was coming to him."
        },
        {
            "id": 224,
            "phrase": "What’s cooking?",
            "definition": "Inf. What is happening?; How are you? _Bob: Hi, Fred! What’s cooking? Fred: How are you doing, Bob? _ Bob: Hi, Fred! What’s cooking? Bill: Nothing. Anything happening with you?"
        },
        {
            "id": 225,
            "phrase": "What’s done cannot be undone.",
            "definition": "Prov. You cannot change what has already happened.  Jill: I wish I hadn’t insulted Maria. Jane: What’s done cannot be undone. Jill soon regretted telling Mike that she loved him, but she knew that what’s done cannot be undone."
        },
        {
            "id": 226,
            "phrase": "What’s done is done.",
            "definition": "Prov. It is final and in the past.  It’s too late to change it now. What’s done is done. What’s done is done. The past cannot be altered."
        },
        {
            "id": 227,
            "phrase": "What’s eating someone?",
            "definition": "Inf. Fig. What is bothering someone? _ Tom: Go away! Bob: Gee, Tom, what’s eating you? _ Bill: Tom’s so grouchy lately. What’s eating him? Bob: Beats me!"
        },
        {
            "id": 228,
            "phrase": "What’s going on (around here)?",
            "definition": "What is happening in this place?; What is the explanation for the strange things that are happening here? _Bill: There was an accident in the factory this morning. Bob: That’s the second one this week. What’s going on around here? _ Mary: What’s all the noise? What’s going on? Sue: We’re just having a little party."
        },
        {
            "id": 229,
            "phrase": "What’s got(ten) into someone?",
            "definition": "What is bothering someone?; What caused someone to act that way? (Past or perfect only. The has is contracted except for emphasis.) _ I just don’t know what’s gotten into her. I don’t know what got into me."
        },
        {
            "id": 230,
            "phrase": "What’s happ(ening)?",
            "definition": "Sl. Hello, what’s new? _ Hey, dude! What’s happening? _ What’s happ? How’s it goin’?"
        },
        {
            "id": 231,
            "phrase": "What’s in a name?",
            "definition": "Prov. The name of a thing does not matter as much as the quality of the thing. (From Shakespeare’s play, Romeo and Juliet.) _ Sue: I want to buy this pair of jeans. Mother: This other pair is much cheaper. Sue: But it doesn’t have the designer brand name. Mother: What’s in a name?"
        },
        {
            "id": 232,
            "phrase": "What’s in it for me?",
            "definition": "Inf. What is the benefit for me in this scheme? _ Bob: Now that plan is just what is needed. Bill: What’s in it for me? What do I get out of it? _ Sue: We signed the Wilson contract yesterday. Mary: That’s great! What’s in it for me?"
        },
        {
            "id": 233,
            "phrase": "What’s it to you?",
            "definition": "Inf. Why does it matter to you?; It’s none of your business. (A bit contentious.) _Tom: Where are you going? Jane: What’s it to you? _ Mary: Bill’s pants don’t match his shirt. Jane: Does it matter? What’s it to you?"
        },
        {
            "id": 234,
            "phrase": "What’s keeping someone?",
            "definition": "What is delaying someone? (The someone is replaced by a person’s name or a pronoun.) _ Bob: Wasn’t Mary supposed to be here? Bill: I thought so. Bob: Well, what’s keeping her? Bill: How should I know? _ Bill: I’ve been waiting here for an hour for Sally. Sue: What’s keeping her?"
        },
        {
            "id": 235,
            "phrase": "What’s new?",
            "definition": "Inf. What things have happened since we last met? _Mary: Greetings, Jane. What’s new? Jane: Nothing much.  Bob: What’s new? Tom: Not a whole lot."
        },
        {
            "id": 236,
            "phrase": "What’s new with you?",
            "definition": "Inf. a typical greeting, often a response to What’s new? _ Mary: What’s new with you? Sally: Oh, nothing. What’s new with you? Mary: The same. Fred: Hi, John! How you doing? John: Great! What’s new with you?"
        },
        {
            "id": 237,
            "phrase": "What’s on tap for today?",
            "definition": "Inf. What is on the schedule for today?; What is going to happen today? (As a beer that is on tap and ready to be served.) _ Tom: Good morning, Fred. Fred: Morning. What’s on tap for today? Tom: Trouble in the morning and difficulty in the afternoon. Fred: So nothing’s new.  Sally: Can we have lunch today? Sue: I’ll have to look at my schedule and see what’s on tap for today."
        },
        {
            "id": 238,
            "phrase": "What’s poppin’?",
            "definition": "Sl. Hello, what is happening? _ What’s poppin’? Anything new? _ What’s poppin’, G?"
        },
        {
            "id": 239,
            "phrase": "What’s sauce for the goose is sauce for the gander.",
            "definition": "Prov. What is good for one person is good for another.; What is good for the man in a couple is good for the woman.  Jane: You’re overweight; you should get more exercise. Alan: But I don’t really have time to exercise. Jane: When I was overweight, you told me to exercise; what’s sauce for the goose is sauce for the gander."
        },
        {
            "id": 240,
            "phrase": "What’s shakin’ (bacon)?",
            "definition": "Sl.How are you?; What is new? _ What’s shakin’ bacon? What’s going down? _ Hi, Jim. What’s shakin’?"
        },
        {
            "id": 241,
            "phrase": "What’s that?",
            "definition": "What did you say? _ Tom: We’re leaving tomorrow. Jane: What’s that? _ What’s that? Did you say “Iowa” or “Idaho”?"
        },
        {
            "id": 242,
            "phrase": "What’s the (big) idea?",
            "definition": "Inf. Why did you do that? (Usually said in anger.) _Please don’t do that! What’s the idea? _ Why did you shove me? What’s the big idea?"
        },
        {
            "id": 243,
            "phrase": "What’s the catch?",
            "definition": "Sl. What is the drawback?; It sounds good, but are there any hidden problems? _ Sounds too good to be true. What’s the catch? _ This looks like a good deal. What’s the catch?"
        },
        {
            "id": 244,
            "phrase": "What’s the damage?",
            "definition": "Sl. What are the charges?; How much is the bill? _ Bill: That was delicious. Waiter, what’s the damage? Waiter: I’ll get the check, sir.  Waiter: Your check sir. Tom: Thanks. Bill: What’s the damage, Tom? Let me pay my share. Tom: Nonsense, I’ll get it. Bill: Okay this time, but I owe you one."
        },
        {
            "id": 245,
            "phrase": "What’s the drill?",
            "definition": "1. Inf. What is going on here? _ Bill: I just came in. What’s the drill? Tom: We have to carry all this stuff out to the truck.  “What’s the drill?” asked Mary. “Why are all these people sitting around like this?” 2. Inf. What are the rules and procedures for doing this? _ Bill: I need to apply for new license plates. What’s the drill? Is there a lot of paperwork? Clerk: Yes, there is.  Bill: I have to get my computer repaired. Who do I talk to? What’s the drill? Bob: You have to get a purchase order from Fred."
        },
        {
            "id": 246,
            "phrase": "What’s the good of something?",
            "definition": "What is the point of something?; Why bother with something? _ What’s the good of my going at all if I’ll be late? _ There is no need to get there early. What’s the good of that?"
        },
        {
            "id": 247,
            "phrase": "What’s the (good) word?",
            "definition": "Sl. Hello, how are you? _Hi, Jim! What’s the good word? _ Haven’t seen you in a long time. What’s the good word?"
        },
        {
            "id": 248,
            "phrase": "What’s the matter (with you)?",
            "definition": "Is there something wrong with you?; Are you ill? _Bill: What’s the matter with you? Fred: I have this funny feeling in my chest. Bill: Sounds serious. Bob: I have to stay home again today. Bill: What’s the matter with you? Have you seen a doctor? _ Mary: Oh, I’m so miserable! Sue: What’s the matter? Mary: I lost my contact lenses and my glasses. John: Ouch! Alice: What’s the matter? John: I bit my tongue."
        },
        {
            "id": 249,
            "phrase": "What’s the problem?",
            "definition": "What problem are you presenting to me? _ Bill (coming in): I need to talk to you about something. Tom: What’s the problem, Bill? _“What’s the problem?” said Mary, peering at her secretary over her glasses."
        }
    ]
}