{
    "dictionary": [
        {
            "id": 0,
            "phrase": "*a hold on someone",
            "definition": "a strong and secure influence on someone. (*Typically: get ~; have ~; give someone ~.) _ The strange religion seemed to have a strong hold on its followers. The drug has a hold on the minds of those who use it."
        },
        {
            "id": 1,
            "phrase": "hold (on) tight",
            "definition": "to grasp (someone or something) tightly. Here we go on the merry-go-round! Hold on tight! _The children were told to hold tight on the swings."
        },
        {
            "id": 2,
            "phrase": "hold one’s breath",
            "definition": "to stop breathing for a short period, on purpose.  Do you hold your breath when you dive into the water? _ I can’t hold my breath for very long."
        },
        {
            "id": 3,
            "phrase": "hold one’s end up†",
            "definition": "to carry one’s share of the burden; to do one’s share of the work.  You’re not holding your end up. We’re having to do your share of the work.  Get busy. You have to hold up your end."
        },
        {
            "id": 4,
            "phrase": "hold one’s fire",
            "definition": "to refrain from shooting (a gun, etc.).  The sergeant told the soldiers to hold their fire.  Please hold your fire until I get out of the way."
        },
        {
            "id": 5,
            "phrase": "hold one’s head up†",
            "definition": "to be confident of the respect of other people; to hold up one’s head with pride rather than bowing one’s head. (A bowed head would indicate a lack of confidence.) _I am so embarrassed. I will never be able to hold my head up again.  Now I can hold up my head with pride."
        },
        {
            "id": 6,
            "phrase": "hold one’s liquor",
            "definition": "to be able to drink alcohol in quantity without ill effects. Old Jed can sure hold his liquor— and a lot of it, too.  I asked him to leave because he can’t hold his liquor."
        },
        {
            "id": 7,
            "phrase": "hold one’s mouth the right way",
            "definition": "do something very carefully under optimal conditions. It was a tedious task. If I didn’t hold my mouth just the right way, I wouldn’t be able to do it."
        },
        {
            "id": 8,
            "phrase": "hold one’s nose",
            "definition": "to use one’s fingers to keep one’s nose closed to avoid a bad smell or to keep water out.  The kid held his nose and jumped off the dock into the lake."
        },
        {
            "id": 9,
            "phrase": "hold one’s own",
            "definition": "to do as well as anyone else.  I can hold my own in a footrace any day.  She was unable to hold her own, and she had to quit."
        },
        {
            "id": 10,
            "phrase": "hold one’s peace",
            "definition": "to remain silent.  Bill was unable to hold his peace any longer. “Don’t do it!” he cried.  Quiet, John. Hold your peace for a little while longer."
        },
        {
            "id": 11,
            "phrase": "hold one’s tongue",
            "definition": "to refrain from speaking; to refrain from saying something unpleasant.  I felt like scolding her, but I held my tongue.  Hold your tongue, John. You can’t talk to me that way!"
        },
        {
            "id": 12,
            "phrase": "hold oneself together",
            "definition": "to maintain one’s calmness or sanity. I don’t know if I can hold myself together through another horrible day like this one.  I don’t know how she held herself together through all her troubles."
        },
        {
            "id": 13,
            "phrase": "hold out (against someone or something)",
            "definition": "to continue one’s defense against someone or something. We can hold out against them only a little while longer. Dave can hold out forever."
        },
        {
            "id": 14,
            "phrase": "hold out (for someone or something)",
            "definition": "to strive to wait for someone or something.  I will hold out for someone who can do the job better than the last person we interviewed.  I want to hold out for a better offer."
        },
        {
            "id": 15,
            "phrase": "hold out the olive branch",
            "definition": "to offer to end a dispute and be friendly; to offer reconciliation. (The olive branch is a symbol of peace and reconciliation. A biblical reference.) _ Jill was the first to hold out the olive branch after our argument.  I always try to hold out the olive branch to someone I have offended. Life is too short for a person to bear grudges for very long."
        },
        {
            "id": 16,
            "phrase": "hold someone for ransom",
            "definition": "to demand money for the return of a person who has been kidnapped.  The kidnappers held me for ransom, but no one would pay.  We will hold Timmy for ransom and hope that the police don’t find us."
        },
        {
            "id": 17,
            "phrase": "hold someone hostage",
            "definition": "to keep someone as a hostage.  The terrorists planned to hold everyone hostage in the airplane. My neighbor was held hostage in his own home by a robber."
        },
        {
            "id": 18,
            "phrase": "hold someone or an animal down†",
            "definition": "to keep someone, something, or an animal down.  The heavy beam held him down, and he could not rise.  The owner held down his pet while the vet treated the injured paw."
        },
        {
            "id": 19,
            "phrase": "hold someone or something at bay",
            "definition": "to make someone, a group, or an animal stay at a safe distance. (Originally referred only to animals.) _I held the attacker at bay while Mary got away and called the police.  The dogs held the bear at bay while I got my gun loaded."
        },
        {
            "id": 20,
            "phrase": "hold someone or something at something",
            "definition": "to keep someone or something at some distance, such as an arm’s length, respectful distance, comfortable distance, etc. I held the child at an arm’s length until he could be calmed.  The police held the crowd at a distance from the injured man."
        },
        {
            "id": 21,
            "phrase": "hold someone or something by something",
            "definition": "to grasp someone or something by a particular part.  I held him by the shoulder while I talked to him. Donna held the dog by the collar."
        },
        {
            "id": 22,
            "phrase": "hold someone or something in high regard",
            "definition": "to think well of someone or something.  All of us hold the vice president in high regard.  We hold these policies in high regard."
        },
        {
            "id": 23,
            "phrase": "hold someone or something in low regard",
            "definition": "to think poorly of someone or something.  I’m afraid that Hazel holds you in low regard.  I’m afraid we hold this establishment in low regard."
        },
        {
            "id": 24,
            "phrase": "hold someone or something over†",
            "definition": "to retain someone or something (for a period of time).  The storm held John over for another day. The manager held over the hit movie for another week."
        },
        {
            "id": 25,
            "phrase": "hold someone or something together",
            "definition": "to keep a group of people or things together. She worked at two jobs in order to hold her family together.  Our club was failing despite our efforts to hold it together."
        },
        {
            "id": 26,
            "phrase": "hold someone or something up†",
            "definition": "to keep someone or something upright.  Johnny is falling asleep. Please hold him up until I prepare the bed for him. Hold up the window sash while I prop it open."
        },
        {
            "id": 27,
            "phrase": "hold someone or something up† as an example",
            "definition": "to single out someone or something as a person or thing worthy of imitation. No one has ever held me up as an example.  Jane held up Doris as an example.  I hate to hold myself up as an example, but if you would do what I do, at least I wouldn’t criticize you."
        },
        {
            "id": 28,
            "phrase": "hold someone or something up† to ridicule",
            "definition": "to ridicule someone or something. They must stop holding Matt up to ridicule! Who do they think they are? _She held up Donald to ridicule."
        },
        {
            "id": 29,
            "phrase": "hold someone or something up to scorn†",
            "definition": "to single out someone or something for repudiation.  The entire crowd held Randy up to scorn for his part in the riot. The disappointed fans held up the losing team to scorn."
        },
        {
            "id": 30,
            "phrase": "hold someone’s attention",
            "definition": "to keep someone’s attention; to keep someone interested.  The boring teacher could not hold the students’ attention. The mystery novel held my attention and I couldn’t put it down."
        },
        {
            "id": 31,
            "phrase": "hold someone’s hand",
            "definition": "to hold the hand of someone who is frightened, especially a child. Please hold Jimmy’s hand when you cross the street."
        },
        {
            "id": 32,
            "phrase": "hold someone, something, or an animal back† (from someone or something)",
            "definition": "to restrain someone, something, or an animal from getting at or getting to someone or something.  The parents held the children back from the cake and ice cream until the hostess said she was ready. Please hold back your dog."
        },
        {
            "id": 33,
            "phrase": "hold someone to something",
            "definition": "to make someone adhere to an agreement.  You promised me that you would buy six of them, and I’m going to hold you to your promise.  It was difficult, but he held himself to the terms of the contract."
        },
        {
            "id": 34,
            "phrase": "hold someone up† to something",
            "definition": "to lift someone up to the level of something.  I held up little Mary to the window so she could see out.  She was held up to the window so she could see better."
        },
        {
            "id": 35,
            "phrase": "hold something against someone",
            "definition": "to blame something on someone; to bear a grudge against someone; to resent someone.  Your brother is mean to me, but I can’t hold it against you.  You’re holding something against me. What is it?"
        },
        {
            "id": 36,
            "phrase": "hold something against someone or something",
            "definition": "to press something against someone, a group, or something.  Max held the gun against the bank guard’s head and threatened to pull the trigger.  Fred held the drill against the wall and turned it on."
        },
        {
            "id": 37,
            "phrase": "hold something for someone",
            "definition": "1. to keep something safe for someone. I will hold your money for you. Do you want me to hold your wallet for you while you swim? 2. [for a merchant] to set something aside for a purchaser who will pay for it and take delivery at a later date.  I will hold it for you until you can pay for it.  We can hold it for you right here and give it to you when you have the money."
        },
        {
            "id": 38,
            "phrase": "hold something in abeyance",
            "definition": "to stall or postpone something.  This is a good plan but not at this time. Let’s just hold it in abeyance until things get better.  We will hold the matter in abeyance until we hear from you."
        },
        {
            "id": 39,
            "phrase": "hold something out† (to someone)",
            "definition": "to offer something to someone.  I held a bouquet of roses out to her.  I held out an offer of immunity from prosecution to her, but she would not cooperate."
        },
        {
            "id": 40,
            "phrase": "hold something over someone(‘s head)",
            "definition": "to have knowledge of something about a person and to use that knowledge to control the person.  So I made a mistake when I was young. Are you going to hold that over my head all my life? _ Please don’t hold that over me anymore."
        },
        {
            "id": 41,
            "phrase": "hold something together",
            "definition": "to keep the parts of an object together.  Hold this broken vase together until I get back with the glue.  What can I use to hold this together?"
        },
        {
            "id": 42,
            "phrase": "hold terror for someone",
            "definition": "[for something] to be frightening to a person.  The thought of f lying to Rio by myself held great terror for me.  Nothing holds terror for me. I am a daredevil."
        },
        {
            "id": 43,
            "phrase": "hold the fort",
            "definition": "to take care of a place while someone who is usually there is gone, such as a store or one’s home. (From western movies.) _I’m going next door to visit Mrs. Jones. You stay here and hold the fort.  You should open the store at eight o’clock and hold the fort until I get there at ten."
        },
        {
            "id": 44,
            "phrase": "hold the line (at someone or something)",
            "definition": "not to exceed a certain limit regarding someone or something.  Having your wife on the payroll is one thing, but no one else from the family—I will hold the line at her.  We have to hold the line at this kind of expenditure.  Okay, we’ll hold the line."
        },
        {
            "id": 45,
            "phrase": "hold together",
            "definition": "[for something] to keep from falling apart.  Don’t run the engine too fast because it won’t hold together.  Do you think that this book will hold together much longer?"
        },
        {
            "id": 46,
            "phrase": "hold true",
            "definition": "[for something] to be true; [for something] to remain true. Does this rule hold true all the time? _Yes, it holds true no matter what."
        },
        {
            "id": 47,
            "phrase": "hold up (on someone or something)",
            "definition": "to delay or postpone further action on someone or something.  I know you are getting ready to choose someone, but hold up on Tom. There may be someone better.  Hold up on the project, would you? _ We need to hold up for a while longer."
        },
        {
            "id": 48,
            "phrase": "Hold your tongue!",
            "definition": "Inf. You have said enough!; You have said enough rude things.  Bill: You’re seeing Tom a lot, aren’t you? You must be in love. Jane: Hold your tongue, Bill Franklin! _ After listening to the tirade against him for nearly four minutes, Tom cried out, “Hold your tongue!”"
        },
        {
            "id": 49,
            "phrase": "hole in one",
            "definition": "an instance of hitting a golf ball from the tee to the hole in only one try. (From the game of golf.) _ John made a hole in one yesterday.  I’ve never gotten a hole in one."
        },
        {
            "id": 50,
            "phrase": "a hole in the wall",
            "definition": "a tiny shop, room, etc., not much wider than its doorway.  I went into this little hole in the wall where they had the nicest little gifts.  His office is just a hole in the wall."
        },
        {
            "id": 51,
            "phrase": "hole up (somewhere)",
            "definition": "1. to take shelter somewhere. During the blizzard, we holed up in a lean-to made of branches.  Looks like bad weather coming. We’d better find a place to hole up. 2. to hide somewhere.  The police are looking for me. I need somewhere to hole up. The outlaw holed up in a cave."
        },
        {
            "id": 52,
            "phrase": "holler something out†",
            "definition": "to yell something out.  The guard hollered a warning out.  They hollered out a warning."
        },
        {
            "id": 53,
            "phrase": "hollow something out†",
            "definition": "to make the inside of something hollow. Martha hollowed the book out and put her money inside.  She hollowed out a book."
        },
        {
            "id": 54,
            "phrase": "Holy cow!",
            "definition": "Inf. Wow! _ Holy cow! I never expected such a nice gift! _ Give me a chance! Holy cow, don’t rush me!"
        },
        {
            "id": 55,
            "phrase": "holy Joe",
            "definition": "1. a chaplain; a cleric; a clergyman.  I went to see the holy Joe, and he was a lot of help.  Old holy Joe wants to see all of us at services. 2. a very pious person.  Martin looks stuffy, but he’s no holy Joe.  Don’t let that holy Joe hear about what you’ve done."
        },
        {
            "id": 56,
            "phrase": "Holy mackerel!",
            "definition": "Inf.Wow! _Holy mackerel! What a beautiful day! _ Holy mackerel! What’s this? A new car?"
        },
        {
            "id": 57,
            "phrase": "Holy moley!",
            "definition": "Inf.Wow! _Holy moley! A whole quarter! _ Look, here’s another one! Holy moley!"
        },
        {
            "id": 58,
            "phrase": "(home) folks",
            "definition": "Rur. one’s family, especially one’s parents.  It sure is good to see the home folks again.  Sally went to visit her folks."
        },
        {
            "id": 59,
            "phrase": "*home free",
            "definition": "safe and without problems. (Not necessarily about home or about money. *Typically: be ~; get ~.) _ Everyone else had a lot of trouble with the bureaucrats, but we got home free."
        },
        {
            "id": 60,
            "phrase": "home in (on someone or something)",
            "definition": "to aim directly at someone or something.  She came into the room and homed in on the chocolate cake.  She saw the cake and homed in."
        },
        {
            "id": 61,
            "phrase": "Home is where the heart is.",
            "definition": "Prov. People long to be at home.; Your home is whatever place you long to be. I’ve had a lovely time visiting you, but home is where the heart is, and I think it’s time I went back.  If home is where the heart is, then my home is my parents’ old house. I’ve never loved my own apartment the way I love their place."
        },
        {
            "id": 62,
            "phrase": "home on(to something)",
            "definition": "to aim directly at something; to fix some type of receiver on a signal source. The navigator homed onto the radio beam from the airport.  The navigator located the beam and homed on."
        },
        {
            "id": 63,
            "phrase": "homely enough to stop a clock",
            "definition": "Rur. ugly.  She’s a sweet girl, but homely enough to stop a clock. No one asks Mary out, and no wonder. She’s homely enough to stop a clock."
        },
        {
            "id": 64,
            "phrase": "hone for someone or something",
            "definition": "Rur. to long for someone or something. Tom: What’s wrong with Jane? Mary: She’s honing for her sweetheart.  Jimmy was honing for the red bicycle in the toy store window."
        },
        {
            "id": 65,
            "phrase": "Honesty is the best policy.",
            "definition": "Prov. You should always tell the truth, even when it seems as if it would be useful to tell a lie. Jill: I borrowed Jane’s white blouse without asking her, and then I spilled tomato sauce on it. Should I tell her what happened, or should I just put the blouse back in her closet and hope she won’t notice? Jane: Honesty is the best policy."
        },
        {
            "id": 66,
            "phrase": "The honeymoon is over.",
            "definition": "The early pleasant beginning (as at the start of a marriage) has ended. Okay, the honeymoon is over. It’s time to settle down and do some hard work.  I knew the honeymoon was over at my new job when they started yelling at me to work faster."
        },
        {
            "id": 67,
            "phrase": "honk at someone or something",
            "definition": "to sound a horn at someone or something.  Is someone honking at me? _ The motorists honked at the sheep that were clogging the roadway."
        },
        {
            "id": 68,
            "phrase": "honor someone as something",
            "definition": "to praise someone as something; to praise someone for being something.  Aren’t you going to honor Kevin as a hero? _We will honor Henry as the most promising scholar of the year."
        },
        {
            "id": 69,
            "phrase": "honor someone for something",
            "definition": "to praise someone for doing something.  The committee agreed to honor Laurel for her role in the benefit dance. I want to honor you for your efforts on behalf of our cause."
        },
        {
            "id": 70,
            "phrase": "honor someone’s check",
            "definition": "to accept someone’s personal check in payment of an obligation. The clerk at the store wouldn’t honor my check. I had to pay cash.  The bank didn’t honor your check when I tried to deposit it. Please give me cash."
        },
        {
            "id": 71,
            "phrase": "honor someone with something",
            "definition": "to show one’s respect for someone with something, such as a gift, party, ceremony, a response, etc.  We would like to honor you with a little reception.  We chose to honor you with a little gift."
        },
        {
            "id": 72,
            "phrase": "hooched (up)",
            "definition": "Sl. intoxicated.  Sally is too hooched to drive.  She got herself hooched up and couldn’t give her talk."
        },
        {
            "id": 73,
            "phrase": "hoodwink someone into something",
            "definition": "to deceive someone into doing something. She will try to hoodwink you into driving her to the airport. Watch out. You can’t hoodwink me into doing that!"
        },
        {
            "id": 74,
            "phrase": "hoodwink someone out of something",
            "definition": "to get something away from someone by deception.  Are you trying to hoodwink me out of my money? _ Max tried to hoodwink the old lady out of all her money."
        },
        {
            "id": 75,
            "phrase": "hoof it",
            "definition": "Inf. to walk.  If nobody gives us a ride, we’ll have to hoof it. She hoofed it home from the dance in her highheeled shoes."
        },
        {
            "id": 76,
            "phrase": "hook in(to something)",
            "definition": "to connect into something.  We will hook into the water main tomorrow morning. We dug the pipes up and hooked in."
        },
        {
            "id": 77,
            "phrase": "hook, line, and sinker",
            "definition": "totally. She fell for our story hook, line, and sinker.  They believed every word hook, line, and sinker."
        },
        {
            "id": 78,
            "phrase": "hook oneself on someone or something",
            "definition": "to become enamored of someone or something.  I’m afraid I’ve hooked myself on Alice. He hooked himself on Bach organ music."
        },
        {
            "id": 79,
            "phrase": "hook someone on something",
            "definition": "to addict someone to a drug or alcohol. Careful, or you’ll hook yourself on those tranquilizers.  Some friend at school hooked Roger on dope.  Sharon has hooked herself on cocaine."
        },
        {
            "id": 80,
            "phrase": "hook someone up (with someone)",
            "definition": "to arrange for someone to go out with someone. I hooked Alice up with Tom last year, and now they’re getting married."
        },
        {
            "id": 81,
            "phrase": "hook something down†",
            "definition": "to attach something and hold it down with a hook.  Please hook the lid down so it doesn’t fall off. Please hook down the lid."
        },
        {
            "id": 82,
            "phrase": "hook something into something",
            "definition": "to connect something to something.  I want to hook another communication line into the system.  Is it possible to hook my computer into your network?"
        },
        {
            "id": 83,
            "phrase": "hook something up†",
            "definition": "to set something up and get it working. (The object is to be connected to a power supply, electronic network, telephone lines, etc.) _ Will it take long to hook the telephone up? _ As soon as they hook up the computer to the network, I can e-mail my friends."
        },
        {
            "id": 84,
            "phrase": "hook up with someone",
            "definition": "1. Fig. Inf. to meet with someone. Fancy hooking up with you here, Bill. How have you been? _ Well, hello, Tom. I didn’t think I’d hook up with you again so soon. 2. Fig. to join forces with someone.  If we hook up with each other it’ll be easier to defeat the others.  These two competitors have hooked up together and we now have a real problem."
        },
        {
            "id": 85,
            "phrase": "hooked on something",
            "definition": "1. Fig. addicted to a drug or something similar. Jenny is hooked on cocaine. She was not hooked on anything before that. 2. Fig. enthusiastic about something; supportive of something. Mary is hooked on football. She never misses a game.  Jane is so happy! She’s hooked on life."
        },
        {
            "id": 86,
            "phrase": "hoot and holler",
            "definition": "to shout in disapproval; to call and shout one’s displeasure. After the umpire rendered his decision, the spectators hooted and hollered their thoughts on the matter.  It’s hard to play a good game of basketball when the fans are hooting and hollering at everything you do."
        },
        {
            "id": 87,
            "phrase": "hop in(to something)",
            "definition": "to jump into something; to get into something. Hop into your car and drive over to my house.  I hopped in and drove off."
        },
        {
            "id": 88,
            "phrase": "hop off ((of ) something)",
            "definition": "to jump off something. (Of is usually retained before pronouns.) _ She hopped off her bike and came into the house.  The bird on the branch hopped off."
        },
        {
            "id": 89,
            "phrase": "hop on(to something)",
            "definition": "to jump or get onto something that is moving. Sometimes you have to hop onto the cable car after it has started to move.  I ran to the cable car and hopped on."
        },
        {
            "id": 90,
            "phrase": "a hop, skip, and a jump",
            "definition": "a short distance. Bill lives just a hop, skip, and a jump from here. We can be there in two minutes. My car is parked just a hop, skip, and a jump away."
        },
        {
            "id": 91,
            "phrase": "hop something up†",
            "definition": "Sl. to make a machine, especially a car, run extra fast or give it extra power.  He will take that junk heap home and hop it up. He spent nearly every evening hopping up his old car."
        },
        {
            "id": 92,
            "phrase": "Hop to it!",
            "definition": "Inf. Get started right now! _ Bill: I have to get these things stacked up before I go home. Bob: Then hop to it! You won’t get it done standing around here talking.  “Hurry up! Hop to it!” urged Bill. “We’ve got to get this done!”"
        },
        {
            "id": 93,
            "phrase": "hop up (to someone or something)",
            "definition": "[for an animal] to come close to someone or something by hopping. The bunny hopped up to me and just sat there.  It hopped up and stared."
        },
        {
            "id": 94,
            "phrase": "hope against (all) hope",
            "definition": "to have hope even when the situation appears to be hopeless. We hope against all hope that she’ll see the right thing to do and do it.  There is little point in hoping against hope, except that it makes you feel better."
        },
        {
            "id": 95,
            "phrase": "hope for something",
            "definition": "to be optimistic that one’s wish for something will come true.  I still hope for her return.  We hope for good weather on Friday."
        },
        {
            "id": 96,
            "phrase": "hope for the best",
            "definition": "to desire the best to happen.  Good luck. You know we all hope for the best. Mary is worried, but she hopes for the best."
        },
        {
            "id": 97,
            "phrase": "Hope is a good breakfast but a bad supper.",
            "definition": "Prov. It is good to start the day feeling hopeful, but if none of the things you hope for come to pass by the end of the day, you will feel disappointed. (Can be used to warn someone against hoping for something that is unlikely to happen.) _Lisa began the day hoping that she would find work, and by the end of the day she had learned that hope is a good breakfast but a bad supper."
        },
        {
            "id": 98,
            "phrase": "Hope springs eternal (in the human breast).",
            "definition": "Prov. People will continue to hope even though they have evidence that things cannot possibly turn out the way they want. (From Alexander Pope’s poem, “Essay on Man.” Sometimes used to remark that you believe someone’s situation is hopeless, as in the first example.) _Jill: The boss may have turned me down the first twelve times I asked for a raise, but this time I really think she’ll give it to me. Jane: Hope springs eternal in the human breast.  Alan: You’re not still trying to teach the dog to shake hands! Jane: Hope springs eternal.s"
        },
        {
            "id": 99,
            "phrase": "hopeless at doing something",
            "definition": "incapable of doing something. Tom is hopeless at cooking. Sally is hopeless at keeping her room clean, and it shows."
        },
        {
            "id": 100,
            "phrase": "hopped up",
            "definition": "1. Sl. intoxicated with drugs or alcohol; stimulated by drugs or alcohol.  The old man was hopped up again. He was addicted to opium.  John usually gets hopped up on the weekends. 2. Inf. excited; enthusiastic.  What are you hopped up about now? You’re certainly cheery. I always get hopped up when I think of mountain climbing."
        },
        {
            "id": 101,
            "phrase": "hopping mad",
            "definition": "very angry. Joe got hopping mad when the salesclerk was rude to him.  The student’s practical jokes made the teacher hopping mad."
        },
        {
            "id": 102,
            "phrase": "horn in (on someone)",
            "definition": "to attempt to displace someone; to interfere with someone, especially with someone’s romantic interests.  I’m going to ask Sally to the party. Don’t you dare try to horn in on me! _ I wouldn’t think of horning in."
        },
        {
            "id": 103,
            "phrase": "horn in (on something)",
            "definition": "to attempt to participate in something without invitation or consent.  Are you trying to horn in on my conversation with Sally? _ I hope you are not trying to horn in on our party."
        },
        {
            "id": 104,
            "phrase": "horse around (with someone or something)",
            "definition": "1. Fig. to play around roughly with someone or something, possibly abusing someone or something.  Stop horsing around with your little brother. Leave him alone.  Will you kids stop horsing around? 2. Fig. to join someone in boisterous play; to participate in rough play with someone.  He’s horsing around with his little brother. They are really having a good time. We spent the entire afternoon just horsing around."
        },
        {
            "id": 105,
            "phrase": "horse sense",
            "definition": "common sense; practical thinking.  Bob is no scholar but he has a lot of horse sense.  Horse sense tells me I should not be involved in that project."
        },
        {
            "id": 106,
            "phrase": "hose someone down†",
            "definition": "Sl. to kill someone. (Underworld. From the image of spraying someone with bullets.) _Mr. Big told Sam to hose Wilbur down. The thugs tried to hose down the witness."
        },
        {
            "id": 107,
            "phrase": "hose someone or something down†",
            "definition": "to wash something down with water from a hose. Hose her down to cool her off and maybe she will do the same for you.  Please hose down the driveway.  Hose it down."
        },
        {
            "id": 108,
            "phrase": "hot and bothered",
            "definition": "1. Fig. excited; anxious.  Now don’t get hot and bothered. Take it easy.  John is hot and bothered about the tax increase. 2. Fig. amorous; interested in romance or sex.  John gets hot and bothered whenever Mary comes into the room.  The dog seems hot and bothered. I think it’s that time of the year again."
        },
        {
            "id": 109,
            "phrase": "hot and heavy",
            "definition": "referring to serious passion or emotions.  Things were getting a little hot and heavy so Ellen asked to be taken home. The movie had one hot and heavy scene after another. Pretty soon it got to be a joke."
        },
        {
            "id": 110,
            "phrase": "Hot damn!",
            "definition": "Inf. Wow!; Hooray! (An exclamation of surprise and delight.) _ Hot damn! I just won a vacation trip to Florida!"
        },
        {
            "id": 111,
            "phrase": "hot enough to burn a polar bear ’s butt",
            "definition": "Rur. very hot. (Used to describe weather.) _ Every day in August was hot enough to burn a polar bear’s butt. Even in October, it was hot enough to burn a polar bear’s butt."
        },
        {
            "id": 112,
            "phrase": "hot off the press",
            "definition": "freshly printed; just released by a publisher. Here is a copy of the new Perry Hodder novel. It’s hot off the press."
        },
        {
            "id": 113,
            "phrase": "hot on something",
            "definition": "enthusiastic about something; very much interested in something; knowledgeable about something. Meg’s hot on animal rights.  Jean is hot on modern ballet just now."
        },
        {
            "id": 114,
            "phrase": "hot on the trail (of someone, some creature, or something)",
            "definition": "very close to finding or catching up with someone, some creature, or something. I am hot on the trail of the book that I have been seeking for months."
        },
        {
            "id": 115,
            "phrase": "a hot ticket",
            "definition": "something that is really popular and attractive at the moment.  Singers who can dance are a hot ticket right now. Who knows what folks will like next month?"
        },
        {
            "id": 116,
            "phrase": "hot under the collar",
            "definition": "very angry.  The boss was really hot under the collar when you told him you lost the contract.  I get hot under the collar every time I think about it."
        },
        {
            "id": 117,
            "phrase": "a hotbed of something",
            "definition": "a nest of something; a gathering place of something.  This office is a hotbed of lazy people.  My class is a hotbed of nerds."
        },
        {
            "id": 118,
            "phrase": "hotfoot it (off to) somewhere",
            "definition": "to go somewhere as fast as possible. I’ve got to hotfoot it off to school. When they heard the police sirens, the thieves hotfooted home."
        },
        {
            "id": 119,
            "phrase": "hotfoot it out of somewhere",
            "definition": "to run away from a place.  Did you see Tom hotfoot it out of the office when the boss came in? _ Things are looking bad. I think we had better hotfoot it out of here."
        },
        {
            "id": 120,
            "phrase": "hound someone or an animal down†",
            "definition": "to pursue and capture someone or an animal. I will hound the killer down if it takes me the rest of my life.  I will hound down that killer if it takes years."
        },
        {
            "id": 121,
            "phrase": "hound something out of someone",
            "definition": "to force someone to give information.  We are going to have to hound the information out of her.  We hounded the combination to the safe out of them."
        },
        {
            "id": 122,
            "phrase": "A house divided against itself cannot stand.",
            "definition": "Prov. If the members of a group fight each other, the group will disintegrate. (Often the group under discussion is a family.) _ The leader of the newly formed union tried hard to reconcile the different factions within his organization, because he knew that a house divided against itself cannot stand."
        },
        {
            "id": 123,
            "phrase": "house of correction",
            "definition": "Euph. a prison. He was sentenced to five years in the county’s house of correction. The Jones House of Correction was built in the 1950s, when violent crime was much less common here."
        },
        {
            "id": 124,
            "phrase": "hover around (someone or something)",
            "definition": "to hang or wait around someone or something.  The mugger hovered around the side door to the theater, waiting for a victim.  The birds hovered around the bird feeder."
        },
        {
            "id": 125,
            "phrase": "hover between something and something else",
            "definition": "to float or hang between things.  The helicopter hovered between the buildings and lowered a rescue chair.  The hummingbird hovered between the blossoms, sipping from one and then the other."
        },
        {
            "id": 126,
            "phrase": "hover over someone or something",
            "definition": "to remain suspended over someone or something.  The rescue helicopter hovered over the f loating sailor. A huge blimp hovered over the football stadium."
        },
        {
            "id": 127,
            "phrase": "How about that!",
            "definition": "Isn’t that surprising! _ A: My husband and I just celebrated our sixtieth anniversary. B: How about that!"
        },
        {
            "id": 128,
            "phrase": "How about you?",
            "definition": "What do you think?; What is your choice?; What about you? _Bob: How are you, Bill? Bill: I’m okay. How about you? Bob: Fine, fine. Let’s do lunch sometime.  Waiter: Can I take your order? Bill: I’ll have the chef ’s salad and ice tea. Waiter (turning to Sue): How about you? Sue: I’ll have the same."
        },
        {
            "id": 129,
            "phrase": "How (are) you doing?",
            "definition": "a standard greeting inquiry. (The entry without are is informal and usually pronounced “How ya doin’?”) _ Jane: How are you doing? Mary: I’m okay. What about you? Jane: Likewise.  Sally: Sue, this is my little brother, Bill. Sue: How are you, Bill? Bill: Okay. How you doing?"
        },
        {
            "id": 130,
            "phrase": "How (are) you feeling?",
            "definition": "an inquiry into the state of someone’s health.  Sally: How are you feeling? Bill: Oh, better, thanks. Sally: That’s good.  Bill: Hey, Jane! You been sick? Jane: Yeah. Bill: How you feeling? Jane: Not very well."
        },
        {
            "id": 131,
            "phrase": "How are you getting on?",
            "definition": "How are you managing?; How are you doing? _Jane: Well, Mary, how are you getting on? Mary: Things couldn’t be better. Sue: Hey, John! How are you getting on? What’s it like with all the kids out of the house? John: Things are great, Sue!"
        },
        {
            "id": 132,
            "phrase": "How come?",
            "definition": "How did that come about?; Why? _ Sally: I have to go to the doctor. Mary: How come? Sally: I’m sick, silly.  John: I have to leave now. Bill: How come? John: I just have to, that’s all.  Henry: How come you always put your right shoe on first? Rachel: Do I have to have a reason for something like that?"
        },
        {
            "id": 133,
            "phrase": "How could you (do something)?",
            "definition": "How could you bring yourself to do a thing like that? (No answer is expected.) _Looking first at the broken lamp and then at the cat, Mary shouted, “How could you do that?” _Tom: Then I punched him in the nose. Rachel: Oh, how could you?"
        },
        {
            "id": 134,
            "phrase": "How do you do.",
            "definition": "a standard inquiry and response on greeting or meeting someone. (This expression never has rising question intonation, but the first instance of its use calls for a response. Sometimes the response does, in fact, explain how one is.) _ Sally: Hello. How do you do. Bob: How do you do.  Mary: How do you do. So glad to meet you, Tom. Tom: Thank you. How are you? Mary: Just fine. Your brother tells me you like camping. Tom: Yes. Are you a camper? Mary: Sort of."
        },
        {
            "id": 135,
            "phrase": "How do you know?",
            "definition": "1. How did you get that information? (A straightforward question. The stress in on know.) _ Bill: The train is about to pull into the station. Sue: How do you know? Bill: I hear it.  Fred: I have to apologize for the coffee. It probably isn’t very good. Jane: How do you know? Fred: Well, I made it. 2. Inf. What makes you think you are correct?; Why do you think you have enough information to make this judgment? (Contentious. The heaviest stress is on you.) _ Bill: This is the best recording made all year. Bob: How do you know? Bill: Well, I guess it’s just my opinion.  Tom: Having a baby can be quite an ordeal. Mary: How do you know? Tom: I read a lot."
        },
        {
            "id": 136,
            "phrase": "How do you like school?",
            "definition": "a phrase used to start a conversation with a school-age person. Bob: Well, Billy, how do you like school? Billy: I hate it. Bob: Too bad.  Mary: How do you like school? Bob: It’s okay. Almost everything else is better, though."
        },
        {
            "id": 137,
            "phrase": "How do you like that?",
            "definition": "Do you like that?; Is that to your liking? _Tom: There’s a bigger one over there. How do you like that? Bill: It’s better, but not quite what I want.  Clerk: Here’s one without pleats. How do you like that? Fred: That’s perfect!"
        },
        {
            "id": 138,
            "phrase": "How do you like this weather?",
            "definition": "something said when greeting someone. (A direct answer is expected.) _Henry: Hi, Bill. How do you like this weather? Bill: Lovely weather for ducks. Not too good for me, though. Alice: Gee, it’s hot! How do you like this weather? Rachel: You can have it!"
        },
        {
            "id": 139,
            "phrase": "How does that grab you?",
            "definition": "Inf. What do you think of that? (Pronounced more like HowZAT grab ya?.) _ Looks good, okay? How does that grab you? _How does that grab you? Enough salt?"
        },
        {
            "id": 140,
            "phrase": "How dumb do you think I am?",
            "definition": "Inf. Your question is insulting. I am not stupid. (Shows agitation. An answer is not expected or desired.) _ Mary: Are you really going to sell your new car? Sally: Come on! How dumb do you think I am? _ Tom: Do you think you could sneak into that theater without paying? Bob: Good grief! How dumb do you think I am?"
        },
        {
            "id": 141,
            "phrase": "How goes it?",
            "definition": "Inf. How are you?; How are things going? _ Nice to see you. How goes it? _ How goes it? Everything okay?"
        },
        {
            "id": 142,
            "phrase": "How (have) you been?",
            "definition": "a standard greeting inquiry.  Bob: Hi, Fred! How have you been? Fred: Great! What about you? Bob: Fine.  Bob: How you been? Sue: Okay, I guess. You okay? Bob: Yup."
        },
        {
            "id": 143,
            "phrase": "How is someone fixed for something?",
            "definition": "Is there enough of something? _How are you fixed for ketchup? Do you have enough for the picnic?"
        },
        {
            "id": 144,
            "phrase": "How is someone getting along?",
            "definition": "How is someone feeling or progressing? _ How is your father getting along? Is he any better?"
        },
        {
            "id": 145,
            "phrase": "How is someone making out?",
            "definition": "How is someone doing?; How is someone surviving or getting along? _ How are you making out since your retirement?"
        },
        {
            "id": 146,
            "phrase": "How many times do I have to tell you?",
            "definition": "Inf. a phrase admonishing someone who has forgotten instructions.  Mother: How many times do I have to tell you? Do your homework! Bill: Mom! I hate school! _ Mary: Clean this place up! How many times do I have to tell you? Bill: I’ll do it! I’ll do it!"
        },
        {
            "id": 147,
            "phrase": "How’s business?",
            "definition": "Inf. a question asked in a conversation about the state of someone’s business or job. Tom: Hello, Sally. How’s business? Sally: Okay, I suppose.  Bob: Good to see you, Fred. Fred: Hello, Bob. How’s business? Bob: Just okay."
        },
        {
            "id": 148,
            "phrase": "How’s by you?",
            "definition": "Inf. a greeting inquiry.  Fred: Hey, man! How’s by you? John: Just fine, Fred.  Bob: Hello. What’s cooking? Bill: Nothing. How’s by you?"
        },
        {
            "id": 149,
            "phrase": "How’s every little thing?",
            "definition": "Inf. How are you?; How are things with you? _Bill: Hello, Tom. Tom: Hi, Bill. How’s every little thing? Bill: Couldn’t be better. Bill: Hi, Mary. How’s every little thing? Mary: Things are fine. How are you? Bill: Fine, thanks."
        },
        {
            "id": 150,
            "phrase": "How’s (it) with you?",
            "definition": "Inf. a greeting inquiry. Tom: Hey, man. How’s with you? Bob: Great! And you? Tom: Okay.  Bill: How’s with you, old buddy? John: Can’t complain. And you? Bill: Couldn’t be better."
        },
        {
            "id": 151,
            "phrase": "How’s that again?",
            "definition": "Inf. Please say that again.; I did not hear it all. Sue: Would you like some coffee? Mary: How’s that again? Sue: I said, would you like some coffee? _ Tom: The car door is frozen closed. Bob: How’s that again? Tom: The car door is frozen closed."
        },
        {
            "id": 152,
            "phrase": "How’s the wife?",
            "definition": "Inf. a phrase used by a man when inquiring about a male friend’s wife.  Tom: Hi, Fred, how are you? Fred: Good. And you? Tom: Great! How’s the wife? Fred: Okay, and yours? Tom: Couldn’t be better. Bill: Hi, Bob. How’s the wife? Bob: Doing fine. How’s every little thing? Bill: Great!"
        },
        {
            "id": 153,
            "phrase": "How’s the world (been) treating you?",
            "definition": "Inf. How are you? _Hi, Jane. How’s the world treating you? _How’s the world been treating you, Bill?"
        },
        {
            "id": 154,
            "phrase": "How’s tricks?",
            "definition": "Inf. a greeting inquiry.  Bob: Fred! How’s tricks? Fred: How are you doing, Bob? Bob: Doing great! _ Bill: What’s up? How’s tricks? Bob: I can’t complain. How are things going for you? Bill: Can’t complain."
        },
        {
            "id": 155,
            "phrase": "How so?",
            "definition": "Please explain your remark.  A: You have to bring all the lawn furniture in. B: How so?"
        },
        {
            "id": 156,
            "phrase": "How the mighty have fallen.",
            "definition": "Prov. a jovial or mocking way of remarking that someone is doing something that he or she used to consider very demeaning. Jill: Ever since Fred’s wife left him, he has had to cook his own meals. Jane: Well! How the mighty have fallen! _ When Dan lost his money, he had to sell his expensive sports car. Now he drives an ugly old sedan. How the mighty have fallen."
        },
        {
            "id": 157,
            "phrase": "how the other half lives",
            "definition": "how poorer people live; how richer people live.  Now that I am bankrupt I am beginning to understand how the other half lives.  Most people don’t care how the other half lives."
        },
        {
            "id": 158,
            "phrase": "a howdy and a half",
            "definition": "Rur. a short distance.  Tom: Is it far to the dime store? Jane: Just a howdy and a half.  Her house was a howdy and a half from the place where I grew up."
        },
        {
            "id": 159,
            "phrase": "howl with something",
            "definition": "to yell or holler because of something, such as pain.  Roger howled with pain as the needle went into his arm.  Mary howled with grief when she saw what had happened to her roses."
        },
        {
            "id": 160,
            "phrase": "How’re things going?",
            "definition": "Inf. a standard greeting inquiry.  Bob: Hi, Fred! How’re things going? Fred: Could be better. How’s by you? _Bill: How are things going? Mary: Fine, but I need to talk to you."
        },
        {
            "id": 161,
            "phrase": "How’re things (with you)?",
            "definition": "Inf. a greeting inquiry.  Sally: How are you? Bill: Fine. How are things? _Bill: How are things going? Mary: Fine. How are things with you?"
        },
        {
            "id": 162,
            "phrase": "huddle around someone or something",
            "definition": "to gather or bunch around someone or something.  The girls huddled around Mary to hear what she had to say.  The kids huddled around the cake and consumed it almost instantaneously."
        },
        {
            "id": 163,
            "phrase": "huddle someone together",
            "definition": "to bunch people together.  The scoutmaster huddled the boys together to give them a pep talk.  Let’s huddle everyone together to keep warm."
        },
        {
            "id": 164,
            "phrase": "huddle (up) (together)",
            "definition": "to bunch up together.  The children huddled up together to keep warm.  They huddled up to keep warm.  The newborn rabbits huddled together and squirmed hungrily."
        },
        {
            "id": 165,
            "phrase": "a hue and cry",
            "definition": "a loud public protest or opposition. There was a hue and cry when the city government tried to build houses on the playing field.  The decision to close the local school started a real hue and cry."
        },
        {
            "id": 166,
            "phrase": "huff and puff",
            "definition": "to breathe very hard; to pant as one exerts effort.  John came up the stairs huffing and puffing. He huffed and puffed and finally got up the steep hill."
        },
        {
            "id": 167,
            "phrase": "hum with activity",
            "definition": "[for a place] to be busy with activity.  The kitchen hummed with activity as usual.  Our main office was humming with activity during the busy season."
        },
        {
            "id": 168,
            "phrase": "hunch over",
            "definition": "[for someone] to bend over.  The wounded man hunched over and staggered to the window.  He was hunched over with pain."
        },
        {
            "id": 169,
            "phrase": "hunch something up†",
            "definition": "to raise up or lift up some body part, usually the shoulders.  He hunched his shoulders up in his effort to get warm.  He hunched up his shoulders to keep warm."
        },
        {
            "id": 170,
            "phrase": "hunch up",
            "definition": "to squeeze or pull the parts of one’s body together.  He hunched up in a corner to keep warm.  Why is that child hunched up in the corner?"
        },
        {
            "id": 171,
            "phrase": "hung up (on someone or something)",
            "definition": "obsessed with someone or something; devoted to someone or something.  John is really hung up on Mary.  She’s hung up, too. See how she smiles at him."
        },
        {
            "id": 172,
            "phrase": "hunger after something",
            "definition": "to crave for something, not necessarily food.  I hunger after some old-fashioned gospel music.  Mary hungered after something fattening, such as ice cream or even a baked potato with sour cream."
        },
        {
            "id": 173,
            "phrase": "hunger for someone or something",
            "definition": "to desire someone or something; to yearn for someone or something.  I hunger for you. I want you madly.  He looked at the cake and you could see he was hungering for it.  The prisoner was consumed with a hunger for freedom."
        },
        {
            "id": 174,
            "phrase": "Hunger is the best sauce.",
            "definition": "Prov. Everything tastes especially good when you are hungry, because you are so eager to eat it.  After our twenty-mile hike, we stopped at a little roadside restaurant. It may have been that they made the most delicious food in the world there, or it may have been that hunger was the best sauce."
        },
        {
            "id": 175,
            "phrase": "hungry for something",
            "definition": "desiring something, often something other than food.  The orphan was hungry for the warmth of a family.  Bill has become hungry for knowledge and is always studying."
        },
        {
            "id": 176,
            "phrase": "hunker down (on something)",
            "definition": "to squat down on one’s heels, a stool, a stone, etc.  Jeff hunkered down on the pavement and watched the world go by.  He hunkered down to take a rest."
        },
        {
            "id": 177,
            "phrase": "hunker down to something",
            "definition": "to apply oneself to something, to get started working at something.  I hunkered down to my chores, hoping to get them done before noon.  If you want to get a good grade on that report, you’d better hunker down to it."
        },
        {
            "id": 178,
            "phrase": "hunt after someone or something",
            "definition": "to seek or pursue someone or something.  I’m hunting after a tall man with straight black hair. Elaine is hunting after a place to store her bicycle."
        },
        {
            "id": 179,
            "phrase": "hunt for someone or something",
            "definition": "1. to chase someone or something for sport.  The hunter hunted for grouse on the game preserve. Frank likes to hunt for deer. 2. to look for someone or something.  I am hunting for someone to help me with the piano. I am hunting for a new piano."
        },
        {
            "id": 180,
            "phrase": "hunt someone or something down†",
            "definition": "1. to chase and catch someone or something.  I don’t know where Amy is, but I’ll hunt her down. I’ll find her. I will hunt down the villain. 2. to locate someone or something.  I don’t have a big enough gasket. I’ll have to hunt one down.  I have to hunt down a good dentist."
        },
        {
            "id": 181,
            "phrase": "hunt someone or something out†",
            "definition": "to find someone or something even if concealed.  We will hunt them all out and find every last one of those guys.  We will hunt out all of them.  They hunted out the murderer."
        },
        {
            "id": 182,
            "phrase": "hurl someone or something at someone or something",
            "definition": "to throw someone or something at someone or something.  The huge man actually hurled me at the tree. Larry hurled his shoe at me."
        },
        {
            "id": 183,
            "phrase": "hurl someone or something down†",
            "definition": "to throw or push someone or something downward to the ground.  Roger hurled the football down and it bounced away wildly. He hurled down the football in anger.  The angry player hurled the ball down."
        },
        {
            "id": 184,
            "phrase": "hurl someone or something into something",
            "definition": "to throw someone or something into something.  She hurled the little boys into the storm cellar and went back to the house for the dog.  Sharon hurled her belongings into the suitcase and jammed it closed."
        },
        {
            "id": 185,
            "phrase": "hurl something around†",
            "definition": "to throw something, such as words, around carelessly. Don’t just go hurling foul words around like they didn’t mean anything. You are just hurling around words!"
        },
        {
            "id": 186,
            "phrase": "hurl something away† (from someone or something)",
            "definition": "to throw or push something away from someone or something.  She hurled the bricks away from the partially buried child.  Hurl away the bricks as fast as you can."
        },
        {
            "id": 187,
            "phrase": "hurry back (to someone or something)",
            "definition": "to return to someone or something immediately or as fast as possible. Oh, please hurry back to me as soon as you can.  Hurry back!"
        },
        {
            "id": 188,
            "phrase": "hurry down (to somewhere)",
            "definition": "to descend rapidly.  We need you down here in the basement. Hurry down. Please hurry down to the kitchen and help us."
        },
        {
            "id": 189,
            "phrase": "hurry one on one’s way",
            "definition": "to help someone to hasten on.  Mary hurried Joel on his way so he could catch his train.  There is no need to hurry me on my way. I am leaving."
        },
        {
            "id": 190,
            "phrase": "hurry someone or something along",
            "definition": "to make someone or something go faster. Go hurry your mother along. We’re almost late.  Why don’t you hurry the meeting along?"
        },
        {
            "id": 191,
            "phrase": "hurry someone or something in(to something)",
            "definition": "to make someone or something go into something fast.  She hurried the chickens into the coop and closed the door on them for the night.  It was beginning to rain, so Jerry hurried the children in."
        },
        {
            "id": 192,
            "phrase": "hurry someone or something up",
            "definition": "to make someone or something go or work faster. Please hurry them all up. We are expecting to have dinner very soon.  See if you can hurry this project up a little."
        },
        {
            "id": 193,
            "phrase": "hurry up and wait",
            "definition": "to do some things in a series fast and then have to wait a long time to do the next things in the series. (Originally military.) _ That’s all we ever do. Rush to stand in line somewhere. We just hurry up and wait all day long. Hurry up and wait! That’s the army for you."
        },
        {
            "id": 194,
            "phrase": "hurt someone’s feelings",
            "definition": "to cause someone emotional pain. It hurts my feelings when you talk that way. I’m sorry. I didn’t mean to hurt your feelings."
        },
        {
            "id": 195,
            "phrase": "hurtin’ for something",
            "definition": "Rur. in need of something.  I went to fetch a bottle of cough syrup. My sick child was hurtin’ for it.  Jim was hurting for a new set of tools."
        },
        {
            "id": 196,
            "phrase": "hurtle through something",
            "definition": "to travel through something at great speed or with great force, possibly causing breakage. A brick hurtled through the window and fell on the f loor.  The rocket hurtled through space toward Mars."
        },
        {
            "id": 197,
            "phrase": "a hush fell over someone or something",
            "definition": "a sudden silence enveloped something or a group. As the conductor raised his arms, a hush fell over the audience. The coach shouted and a hush fell over the locker room."
        },
        {
            "id": 198,
            "phrase": "hush money",
            "definition": "Fig.money paid as a bribe to persuade someone to remain silent and not reveal certain information.  Bob gave his younger sister hush money so that she wouldn’t tell Jane that he had gone to the movies with Sue.  The crooks paid Fred hush money to keep their whereabouts secret."
        },
        {
            "id": 199,
            "phrase": "hush someone up†",
            "definition": "1. to make someone quiet.  Please hush the children up. I have a telephone call.  Hush up those kids! 2. Sl. to kill someone.  The gang was afraid the witness would testify and wanted to hush him up. Mr. Big told Sam to hush up Richard."
        },
        {
            "id": 200,
            "phrase": "hush something up†",
            "definition": "to keep something a secret; to try to stop a rumor from spreading.  We just couldn’t hush it up.  We wanted to hush up the story, but there was no way to do it."
        },
        {
            "id": 201,
            "phrase": "hush up",
            "definition": "to be quiet; to get quiet; to stop talking.  You talk too much. Hush up! _ I want you to hush up and sit down!"
        },
        {
            "id": 202,
            "phrase": "Hush your mouth!",
            "definition": "Inf. Please be quiet. (Not very polite.) _I’ve heard enough of that talk. Hush your mouth! _Now, hush your mouth! You shouldn’t talk like that!"
        },
        {
            "id": 203,
            "phrase": "hustle and bustle",
            "definition": "confusion and business. I can’t stand the hustle and bustle of big cities.  There is a lot of hustle and bustle in this office at the end of the fiscal year."
        },
        {
            "id": 204,
            "phrase": "hustle up",
            "definition": "to hurry up.  Hustle up, you guys. We have to get moving.  Hustle up. We are almost late."
        },
        {
            "id": 205,
            "phrase": "hygienically challenged",
            "definition": "Euph. [of a person] dirty. (Jocular.) _Bill always smells terrible. He must be hygienically challenged.  A couple of the kids in my class are, let us say, hygienically challenged."
        },
        {
            "id": 206,
            "phrase": "hype someone or something (up)",
            "definition": "to promote, advertise, or boost someone or something, often excessively. No matter how much they hyped it up, it was still a very dull movie.  Her agent hyped her up as a great actress."
        },
        {
            "id": 207,
            "phrase": "hypothesize about something",
            "definition": "to speculate about something; to make guesses about something.  Don’t waste time hypothesizing about what happened.  There is no point in hypothesizing about what happened when we don’t know the actual truth."
        },
        {
            "id": 208,
            "phrase": "hypothesize on something",
            "definition": "to conjecture on the origin or nature of something.  We sat around hypothesizing on the origin of life."
        },
        {
            "id": 209,
            "phrase": "I am so sure!",
            "definition": "Inf. I am right! _ You are way rad! I am so sure! _ This is too much. I am so sure!"
        },
        {
            "id": 210,
            "phrase": "I believe we’ve met.",
            "definition": "a phrase suggesting that one has already met a person to whom one is being introduced.  John: Alice, have you met Fred? Alice: Oh, yes, I believe we’ve met. How are you, Fred? Fred: Hello, Alice. Good to see you again. Alice: Tom, this is my cousin, Mary. Tom: I believe we’ve met. Nice to see you again, Mary. Mary: Hello, Tom. Good to see you again."
        },
        {
            "id": 211,
            "phrase": "I can accept that.",
            "definition": "Inf. I accept your evaluation as valid.  Bob: Now, you’ll probably like doing the other job much better. It doesn’t call for you to do the things you don’t do well. Tom: I can accept that. Sue: On your evaluation this time, I noted that you need to work on telephone manners a little bit. Bill: I can accept that."
        },
        {
            "id": 212,
            "phrase": "I can live with that.",
            "definition": "Inf. That is something I can get used to.; That is all right as far as I’m concerned. Sue: I want to do this room in green. Bill: I can live with that.  Clerk: This one will cost twelve dollars more. Bob: I can live with that. I’ll take it."
        },
        {
            "id": 213,
            "phrase": "(I) can too.",
            "definition": "You are wrong, I can.; Don’t say I can’t, because I can! (The response to (You) cannot!) _Sue: I’m going to the party. Mother: You can’t. Sue: I can too. Mother: Cannot! Sue: Can too! _“Can too!” protested Fred. “I can, if you can!”"
        },
        {
            "id": 214,
            "phrase": "I can’t accept that.",
            "definition": "Inf. I do not believe what you said.; I reject what you said.  Sue: The mechanic says we need a whole new engine. John: What? I can’t accept that! _Tom: You’re now going to work on the night shift. You don’t seem to be able to get along with some of the people on the day shift. Bob: I can’t accept that. It’s them, not me."
        },
        {
            "id": 215,
            "phrase": "(I) can’t argue with that.",
            "definition": "Inf. I agree with what you said.; It sounds like a good idea.  Tom: This sure is good cake. Bob: Can’t argue with that.  Sue: What do you say we go for a swim? Fred: I can’t argue with that."
        },
        {
            "id": 216,
            "phrase": "I can’t believe (that)!",
            "definition": "That is unbelievable! _Tom: What a terrible earthquake! All the houses collapsed, one by one. Jane: I can’t believe that! _Bill: This lake is nearly two hundred feet deep. Sue: I can’t believe that! Bill: Take my word for it."
        },
        {
            "id": 217,
            "phrase": "I can’t get over something!",
            "definition": "I am just so amazed! (The something can be a fact or a pronoun, such as that or it. Also with just, as in the examples.) _ “I just can’t get over the way everybody pitched in and helped,” said Alice. Bob: The very idea, Sue and Tom doing something like that! Bill: I can’t get over it!"
        },
        {
            "id": 218,
            "phrase": "(I) can’t help it.",
            "definition": "There is nothing I can do to help the situation.; That is the way it is.; There is nothing I can do. (Often in answer to a criticism.) _ Mary: Your hair is a mess. Sue: It’s windy. I can’t help it.  Fred: I wish you’d quit coughing all the time. Sally: I can’t help it. I wish I could too."
        },
        {
            "id": 219,
            "phrase": "(I) can’t rightly say.",
            "definition": "Rur. I do not know with any certainty. Fred: When do you think we’ll get there? Bill: Can’t rightly say.  Bob: Okay, how does this look to you? Bill: I can’t rightly say. I’ve never seen anything like it before."
        },
        {
            "id": 220,
            "phrase": "(I) can’t say for sure.",
            "definition": "Inf. I do not know with any certainty.  Tom: When will the next train come through? Jane: I can’t say for sure.  Bob: How can the driver hit so many potholes? Bill: Can’t say for sure. I know he doesn’t see too well, though."
        },
        {
            "id": 221,
            "phrase": "(I) can’t thank you enough.",
            "definition": "a polite expression of gratitude.  Bill: Here’s the book I promised you. Sue: Oh, good. I can’t thank you enough.  Tom: Well, here we are. Bill: Well, Tom. I can’t thank you enough. I really appreciate the ride."
        },
        {
            "id": 222,
            "phrase": "(I) changed my mind.",
            "definition": "I have reversed my previous decision or statement.  Tom: I thought you were going to Atlanta today. Bill: I changed my mind. I’m leaving tomorrow. Mary: I thought that this room was going to be done in red. Sue: I changed my mind."
        },
        {
            "id": 223,
            "phrase": "I could eat a horse!",
            "definition": "I am very hungry! _ Where’s dinner? I could eat a horse!"
        },
        {
            "id": 224,
            "phrase": "(I) couldn’t ask for more.",
            "definition": "Inf. Everything is fine, and there is no more that I could want.  Bill: Are you happy? Sue: Oh, Bill. I couldn’t ask for more.  Waiter: Is everything all right? Bill: Oh, yes, indeed. Couldn’t ask for more."
        },
        {
            "id": 225,
            "phrase": "I couldn’t ask you to do that.",
            "definition": "That is a very kind offer, but I would not ask you to do it. (This is not a refusal of the offer.) _ Sally: Look, if you want, I’ll drive you to the airport. Mary: Oh, Sally. I couldn’t ask you to do that.  Bill: I’ll lend you enough money to get you through the week. Sally: I couldn’t ask you to do that."
        },
        {
            "id": 226,
            "phrase": "(I) couldn’t be better.",
            "definition": "Inf. I am fine.  John: How are you? Jane: Couldn’t be better.  Bill: I hope you’re completely well now. Mary: I couldn’t be better."
        },
        {
            "id": 227,
            "phrase": "(I) could(n’t) care less.",
            "definition": "Inf. It doesn’t matter to me. (The less bears the heaviest stress in both versions. Despite the apparent contradiction, either reading of this—both the affirmative and negative—usually have the same meaning. The exception would be in a sentence where the could bears the heaviest stress: I COULD care less, [but I don’t.].) _ Tom: The rain is coming! The carpet will get wet! Mary: I couldn’t care less.  Bill: I’m going to go in there and tell off the boss? John: I could care less."
        },
        {
            "id": 228,
            "phrase": "(I) couldn’t help it.",
            "definition": "There was no way I could prevent it.; I was unable to prevent something from happening.; I was unable to control myself. Sally: You let the paint dry with brush marks in it. Mary: I couldn’t help it. The telephone rang.  Fred: You got fingerprints all over the window. Mary: Sorry. Couldn’t help it."
        },
        {
            "id": 229,
            "phrase": "I declare (to goodness)!",
            "definition": "Rur. What a surprise! _ I declare to goodness! You certainly have grown since I saw you.  Tom: Jim and Sally are going to get married. Mary: Well, I declare!"
        },
        {
            "id": 230,
            "phrase": "I do believe.",
            "definition": "a way of affirming or reaffirming one’s opinion. Jim’s in love with that gal, I do believe. Jane’s store will do well, I do believe."
        },
        {
            "id": 231,
            "phrase": "I (do) declare!",
            "definition": "Inf. I am surprised to hear that! (Oldfashioned.) _ Mary: I’m the new president of my sorority! Grandmother: I declare! That’s very nice.  A plane had landed right in the middle of the cornfield. The old farmer shook his head in disbelief. “I do declare!” he said over and over as he walked toward the plane."
        },
        {
            "id": 232,
            "phrase": "I don’t believe it!",
            "definition": "an expression of amazement and disbelief.  Bob: Tom was just elected president of the trade association! Mary: I don’t believe it! _ Bob: They’re going to build a Disney World in Moscow. Sally: I don’t believe it!"
        },
        {
            "id": 233,
            "phrase": "(I) don’t believe I’ve had the pleasure.",
            "definition": "an expression meaning I haven’t met you yet._Tom: I’m Tom Thomas. I don’t believe I’ve had the pleasure. Bill: Hello. I’m Bill Franklin. Tom: Nice to meet you, Bill. Bill: Likewise.  Bob: Looks like rain. Fred: Sure does. Oh, I don’t believe I’ve had the pleasure. Bob: I’m Bob, Bob Jones. Fred: My name is Fred Wilson. Glad to meet you."
        },
        {
            "id": 234,
            "phrase": "I don’t believe this!",
            "definition": "Inf. What is happening right now is unbelievable! _ It’s snowing in July! I don’t believe this! _ I don’t believe this! It can’t be happening."
        },
        {
            "id": 235,
            "phrase": "I don’t care.",
            "definition": "It doesn’t matter to me.  Mary: Can I take these papers away? Tom: I don’t care. Do what you want.  Bill: Should this room be white or yellow? Sally: I don’t care."
        },
        {
            "id": 236,
            "phrase": "(I) don’t care if I do.",
            "definition": "Rur. Thank you.; I will. don’t mind if I do.) _ Tom: Have some more grits? Jane: Don’t care if I do.  Charlie: Come on in and set a spell. Mary: Don’t care if I do."
        },
        {
            "id": 237,
            "phrase": "I don’t mean maybe!",
            "definition": "Inf. I am very serious about my demand or order.  Bob: Do I have to do this? Sue: Do it now, and I don’t mean maybe! _ Father: Get this place cleaned up! And I don’t mean maybe! John: All right! I’ll do it!"
        },
        {
            "id": 238,
            "phrase": "(I) don’t mind if I do.",
            "definition": "Yes, I would like to.  Sally: Have some more coffee? Bob: Don’t mind if I do.  Jane: Here are some lovely roses. Would you like to take a few blossoms with you? John: I don’t mind if I do."
        },
        {
            "id": 239,
            "phrase": "I don’t mind telling you (something).",
            "definition": "I want you to know something.  Tom: You have a beautiful garden. Mary: Thank you. But I don’t mind telling you, it’s an awful lot of work.  I don’t mind telling you, I was as pleased as Punch when my daughter won the race."
        },
        {
            "id": 240,
            "phrase": "I don’t rightly know.",
            "definition": "Rur. I do not know.  Tom: When will Joe be getting back? Charlie: I don’t rightly know.  Jane: What’s the difference between a first cousin and a first cousin once removed? Mary: I don’t rightly know."
        },
        {
            "id": 241,
            "phrase": "I don’t want to sound like a busybody, but",
            "definition": "an expression used to introduce an opinion or suggestion. Bob: I don’t want to sound like a busybody, but didn’t you intend to have your house painted? Bill: Well, I guess I did.  Bob: I don’t want to sound like a busybody, but some of your neighbors wonder if you could stop parking your car on your lawn. Sally: I’ll thank you to mind your own business!"
        },
        {
            "id": 242,
            "phrase": "I don’t want to wear out my welcome.",
            "definition": "a phrase said by a guest who doesn’t want to be a burden to the host or hostess or to visit too often. Mary: Good night, Tom. You must come back again soon. Tom: Thank you. I’d love to. I don’t want to wear out my welcome, though.  Bob: We had a fine time. Glad you could come to our little gathering. Hope you can come again next week. Fred: I don’t want to wear out my welcome, but I’d like to come again. Bob: Good. See you next week. Bye. Fred: Bye."
        },
        {
            "id": 243,
            "phrase": "I doubt it.",
            "definition": "I do not think so.  Tom: Think it will rain today? Sue: I doubt it. Sally: Think you’ll go to New York? Mary: I doubt it."
        },
        {
            "id": 244,
            "phrase": "I doubt that.",
            "definition": "I do not believe that something is so. Bob: I’ll be there exactly on time. Sue: I doubt that. John: Fred says he can’t come to work because he’s sick. Jane: I doubt that."
        },
        {
            "id": 245,
            "phrase": "I felt like a penny waiting for change.",
            "definition": "Rur. I felt worthless or helpless.  When I lost the race, I felt like a penny waiting for change.  My best girl went off with someone else. I felt like a penny waiting for change."
        },
        {
            "id": 246,
            "phrase": "(I) hate to eat and run.",
            "definition": "Cliché an apology made by someone who must leave a social event soon after eating.  Bill: Well, I hate to eat and run, but it’s getting late. Sue: Oh, you don’t have to leave, do you? Bill: I think I really must. Mary: Oh, my goodness! I hate to eat and run, but I have to catch an early plane tomorrow. Bob: Do you have to go? Mary: Afraid so."
        },
        {
            "id": 247,
            "phrase": "(I have) no problem with that.",
            "definition": "That is okay with me.  Bob: Is it okay if I sign us up to play mixed doubles? Sally: I have no problem with that.  Bill: It looks as though we will have to come back later. They’re not open yet. Is that all right? Jane: No problem with that. When do they open?"
        },
        {
            "id": 248,
            "phrase": "(I) have to go now.",
            "definition": "an expression announcing the need to leave.  Fred: Bye, have to go now. Mary: See you later. Take it easy. Sue: Would you help me with this box? John: Sorry. I have to go now."
        },
        {
            "id": 249,
            "phrase": "(I) have to run along.",
            "definition": "an expression announcing the need to leave.  Jane: It’s late. I have to run along. Tom: Okay, Jane. Bye. Take care.  John: Leaving so soon? Sally: Yes, I have to run along."
        }
    ]
}