{
    "dictionary": [
        {
            "id": 0,
            "phrase": "fork something over† (to someone)",
            "definition": "Inf. to give something to someone. (Usually refers to money.) _ Come on! Fork the money over to me! _ Fork over the cash you owe me!"
        },
        {
            "id": 1,
            "phrase": "form an opinion",
            "definition": "to think up or decide on an opinion. (Note the variations in the examples.) _ I don’t know enough about the issue to form an opinion.  Don’t tell me how to think! I can form my own opinion.  I don’t form opinions without careful consideration."
        },
        {
            "id": 2,
            "phrase": "form and substance",
            "definition": "structure and meaningful content.  The first act of the play was one screaming match after another. It lacked form and substance throughout.  Jane’s report was good. The teacher commented on the excellent form and substance of the paper."
        },
        {
            "id": 3,
            "phrase": "form from something",
            "definition": "[for something] to develop from something; [for something] to assume a shape, using something else as raw material. Suddenly, an idea began to form from the things that you had said. It seemed that a figure was forming from the mists arising from the swamps."
        },
        {
            "id": 4,
            "phrase": "form someone or something into something",
            "definition": "to shape someone or something into something.  We formed the people into a line.  Kathy formed the clay into a small elephant."
        },
        {
            "id": 5,
            "phrase": "form something out of something",
            "definition": "to shape something from something.  He formed a tiny elephant out of the clay.  Wally formed a mound out of the sand."
        },
        {
            "id": 6,
            "phrase": "form (up) into something",
            "definition": "[for a group of people] to assume the shape of something. The boys formed up into a jagged line.  We’ll form into a line."
        },
        {
            "id": 7,
            "phrase": "fortify someone or an animal (against something) (with something)",
            "definition": "to strengthen someone or an animal against something with something.  I’ll need a cup of hot chocolate to fortify me against the storm.  We have to fortify the dogs against the cold with extra food."
        },
        {
            "id": 8,
            "phrase": "forty winks",
            "definition": "a nap; some sleep.  I could use forty winks before I have to get to work.  I need forty winks before I get started again."
        },
        {
            "id": 9,
            "phrase": "forward something from some place (to someone or some place)",
            "definition": "to send something onward to someone from the place it was originally received. We forwarded the letter from Chicago to Springfield.  Kelly forwarded the letter to her brother."
        },
        {
            "id": 10,
            "phrase": "foul one’s own nest",
            "definition": "to harm one’s own interests; to bring disadvantage upon oneself. (Alludes to a bird excreting into its own nest. See also It’s an ill bird that fouls its own nest.) _He tried to discredit a fellow senator with the president, but just succeeded in fouling his own nest.  The boss really dislikes Mary. She certainly fouled her own nest when she spread those rumors about him."
        },
        {
            "id": 11,
            "phrase": "foul out (of something)",
            "definition": "[for a basketball player] to be forced out of a game because of having too many fouls.  The center fouled out in the first fifteen minutes.  Two other players fouled out soon after."
        },
        {
            "id": 12,
            "phrase": "foul play",
            "definition": "illegal activity; bad practices. The police investigating the death suspect foul play.  Each student got an A on the test, and the teacher imagined it was the result of foul play."
        },
        {
            "id": 13,
            "phrase": "foul someone or something up†",
            "definition": "to cause disorder and confusion for someone or something; to tangle up someone or something; to mess someone or something up.  Go away! Don’t foul me up any more.  You’ve fouled up my whole day.  Watch out! You’re going to foul up my kite strings."
        },
        {
            "id": 14,
            "phrase": "foul up",
            "definition": "to blunder; to mess up. Please don’t foul up this time. The quarterback fouled up in the first quarter, and that lost us the game."
        },
        {
            "id": 15,
            "phrase": "fouled up",
            "definition": "messed up; ruined; tangled up. (Usually as fouled-up when attributive.) _ This is sure a fouled-up mess.  You sure are fouled up, you know."
        },
        {
            "id": 16,
            "phrase": "found money",
            "definition": "money that has come to someone with such ease or surprise that one might have just as well found it by accident.  The money he got from his uncle’s estate is all found money except for the taxes. He did nothing to earn it."
        },
        {
            "id": 17,
            "phrase": "found something (up)on something",
            "definition": "to establish something on some kind of basis or justification. (Upon is formal and less commonly used than on.) _ The owners founded this company upon prompt service. We founded our business on practically no money."
        },
        {
            "id": 18,
            "phrase": "fraidy cat",
            "definition": "a coward; a person who is frightened of everything. (Used in children’s taunts.) _Don’t be a fraidy cat. Go ahead, jump! _ Carl is such a fraidy cat. He runs inside when it starts to rain."
        },
        {
            "id": 19,
            "phrase": "frame something in something",
            "definition": "to place a frame of something around something.  Let us frame the photograph in a wood frame rather than a metal one.  Alice chose to frame the painting in a simple, unmatted frame."
        },
        {
            "id": 20,
            "phrase": "frame something out†",
            "definition": "to build the basic wood structure of a building, such as a house. The carpenters, working fast, framed the whole house out in a day. They framed out the house."
        },
        {
            "id": 21,
            "phrase": "fraternize with someone or something",
            "definition": "to associate with someone or a group; to consort with someone or a group.  They were instructed not to fraternize with the opposing team before the game.  Don’t fraternize with Lefty “Fingers” Moran."
        },
        {
            "id": 22,
            "phrase": "fraught with danger",
            "definition": "Cliché [of something] full of something dangerous or unpleasant.  The spy’s trip to Russia was fraught with danger. My escape from the kidnappers was fraught with danger."
        },
        {
            "id": 23,
            "phrase": "freak out (on something)",
            "definition": "to lose control of one’s mind because of something, usually a drug.  She freaked out on the stuff she was smoking.  She took some funny little pills and freaked out immediately."
        },
        {
            "id": 24,
            "phrase": "freak someone out†",
            "definition": "to shock or disorient someone. The whole business freaked me out. I didn’t mean to freak out everybody with the bad news."
        },
        {
            "id": 25,
            "phrase": "freaked (out)",
            "definition": "1. shocked; disoriented. (Sometimes used of the effects of drugs or alcohol.) _I was too freaked out to reply.  Man, was I freaked. 2. tired out; exhausted.  I’m too freaked out to go on without some rest.  The chick is really freaked. Let her rest."
        },
        {
            "id": 26,
            "phrase": "free and clear",
            "definition": "without encumbrance, particularly in regard to the ownership of something.  After the last payment, Jane owned the car free and clear.  If you can’t prove that you own the house and the land it stands on free and clear, you can’t sell it."
        },
        {
            "id": 27,
            "phrase": "free and easy",
            "definition": "casual.  John is so free and easy. How can anyone be so relaxed? _ Now, take it easy. Just act free and easy. No one will know you’re nervous."
        },
        {
            "id": 28,
            "phrase": "free gift",
            "definition": "something extra given to you when you buy something else.  When you order your magazine subscription, this book is yours to keep as our free gift.  This canvas tote is a free gift for everyone who opens an account at our bank today!"
        },
        {
            "id": 29,
            "phrase": "*a free hand (with someone or something)",
            "definition": "freedom to exercise complete control over something. (*Typically: get ~; have ~; give someone ~.) _ I didn’t get a free hand with the last project.  John was in charge then, but he didn’t get a free hand either."
        },
        {
            "id": 30,
            "phrase": "free lunch",
            "definition": "something of value that is free. (Often negative. See also There’s no such thing as a free lunch.) _ There’s always somebody who’ll do anything to get a free lunch."
        },
        {
            "id": 31,
            "phrase": "a free ride",
            "definition": "a ride to somewhere for which no payment is demanded.  I got a free ride from a truck driver who was headed for town.  I won’t call a taxi when I can get a free ride."
        },
        {
            "id": 32,
            "phrase": "free someone or something from someone or something",
            "definition": "to release or unburden someone or something from someone or something.  We freed the raccoon from the trap.  Max tried to free himself from the police officer.  The dog tried to free itself from the dogcatcher."
        },
        {
            "id": 33,
            "phrase": "a freeze on doing something",
            "definition": "a policy that put a temporary end to something.  The company put a freeze on hiring as soon as they took us over."
        },
        {
            "id": 34,
            "phrase": "freeze one’s tail off",
            "definition": "Inf. to freeze; to get very cold.  Don’t stand out there in the cold wind! You’ll freeze your tail off! _ It’s as cold as a welldigger’s nose today. I about froze my tail off walking to work."
        },
        {
            "id": 35,
            "phrase": "freeze (on)to something",
            "definition": "[for something] to touch something very cold and freeze hard and fast to it.  My hand froze to the railing.  The branch froze onto the side of the house."
        },
        {
            "id": 36,
            "phrase": "freeze over",
            "definition": "[for a body of water] to get cold and form a layer of ice on top. The pond froze over, so we went skating."
        },
        {
            "id": 37,
            "phrase": "freeze someone or something in one’s memory",
            "definition": "to preserve the image of someone or something in one’s memory.  I tried to freeze her in my memory so I would have her with me always.  I froze the scene in my memory."
        },
        {
            "id": 38,
            "phrase": "freeze someone or something to death",
            "definition": "[for cold weather] to kill someone or something. I was afraid that the cold snap would freeze the dog to death."
        },
        {
            "id": 39,
            "phrase": "freeze someone out†",
            "definition": "to make it too cold for someone, usually by opening windows or through the use of air-conditioning.  Turn up the heat unless you’re trying to freeze us out.  Are you trying to freeze out everybody? Close the door."
        },
        {
            "id": 40,
            "phrase": "freeze someone’s wages",
            "definition": "to hold someone’s pay at its current level. The company froze everyone’s wages as soon as the economy went sour."
        },
        {
            "id": 41,
            "phrase": "freeze something into something",
            "definition": "1. to use cold to solidify something into a different state, usually water into ice.  The extreme cold froze the water of the river into solid ice.  The cold snap froze the water in the puddles into hard sheets of ice. 2. to use cold to solidify something into a particular shape.  We froze the ice cream into the shape of a penguin.  This ice tray will freeze water into little round balls of ice."
        },
        {
            "id": 42,
            "phrase": "freeze up",
            "definition": "[for something] to freeze and stop functioning.  The joint froze up and wouldn’t move anymore."
        },
        {
            "id": 43,
            "phrase": "fresh and sweet",
            "definition": "1. very clean and fresh smelling. Now the baby is changed and she is all fresh and sweet. 2. Inf. just out of jail.  Mary is fresh and sweet and back on the street."
        },
        {
            "id": 44,
            "phrase": "*fresh as a daisy",
            "definition": "Cliché very fresh; [of a person] always alert and ready to go. (*Also: as ~.) _ How can you be fresh as a daisy so early in the morning? _I always feel fresh as a daisy after a shower."
        },
        {
            "id": 45,
            "phrase": "*a fresh start",
            "definition": "a new start; an act of starting over. (*Typically: get ~; get off to ~; give someone ~; have ~; make ~.) _ After our apologies and a little discussion, we decided to make a fresh start."
        },
        {
            "id": 46,
            "phrase": "*fresh (with someone)",
            "definition": "overly bold or impertinent with someone. (*Typically: be ~; get ~.) _ When I tried to kiss Mary, she slapped me and shouted, “Don’t get fresh with me!” _ I can’t stand people who get fresh."
        },
        {
            "id": 47,
            "phrase": "freshen someone or something up†",
            "definition": "to revive or restore the appearance or vitality of someone or something. What can we do to freshen this room up? _ A cold shower freshened up the runner."
        },
        {
            "id": 48,
            "phrase": "freshen up",
            "definition": "to get cleaned up, rested up, or restored.  I need a few minutes to freshen up before dinner."
        },
        {
            "id": 49,
            "phrase": "Fret not!",
            "definition": "Inf. Don’t worry!; Do not fret about it! _Mary: Oh, look at the clock! I’m going to be late for my appointment! Bob: Fret not! I’ll drive you.  “Fret not!” said Sally. “We’re almost there!”"
        },
        {
            "id": 50,
            "phrase": "A friend in need is a friend indeed.",
            "definition": "A true friend is a person who will help you when you really need help.  When Bill helped me with geometry, I really learned the meaning of “A friend in need is a friend indeed.”"
        },
        {
            "id": 51,
            "phrase": "friend or foe",
            "definition": "a friend or an enemy.  I can’t tell whether Jim is friend or foe. “Who goes there? Friend or foe?” asked the sentry."
        },
        {
            "id": 52,
            "phrase": "*friends with someone",
            "definition": "a friend of someone. (*Typically: be ~; become ~.) _Sally is friends with Bill. Mary and Bill are friends with one another."
        },
        {
            "id": 53,
            "phrase": "frighten someone or an animal into doing something",
            "definition": "to threaten someone or an animal into doing something.  You can’t frighten me into leaving! _ Let’s try to frighten the coyotes into running away."
        },
        {
            "id": 54,
            "phrase": "fritter something away† (on someone or something)",
            "definition": "to waste something, such as money, on someone or something, foolishly. Did you fritter good money away on that old car? _ You frittered away one hundred dollars on that piece of junk?"
        },
        {
            "id": 55,
            "phrase": "*a frog in one’s throat",
            "definition": "a feeling of hoarseness or a lump in one’s throat. (Often regarded as a sign of fear. *Typically: get ~; have ~.) _ I feel like I’m getting a frog in my throat when I have to speak in public. She says she gets a frog in her throat when she is nervous."
        },
        {
            "id": 56,
            "phrase": "from A to Z",
            "definition": "of a complete and wide variety.  We have just about everything from A to Z.  She ordered everything on the menu from A to Z."
        },
        {
            "id": 57,
            "phrase": "from dawn to dusk",
            "definition": "during the period of the day when there is light; from the rising of the sun to the setting of the sun. I have to work from dawn to dusk on the farm. The factory runs from dawn to dusk to produce hats and gloves."
        },
        {
            "id": 58,
            "phrase": "from day to day",
            "definition": "on a daily basis; one day at a time; occasionally.  We face this kind of problem from day to day.  I’ll have to check into this matter from day to day."
        },
        {
            "id": 59,
            "phrase": "from door to door",
            "definition": "moving from one door to another— typically, from one house to another.  The candidate went from door to door, campaigning for town council.  The children went from door to door, saying “Trick or treat!” at each one."
        },
        {
            "id": 60,
            "phrase": "from giddy-up to whoa",
            "definition": "Rur. all the way from the beginning to the end.  The road is paved from giddy-up to whoa.  The play stinks. It is dull from giddy-up to whoa."
        },
        {
            "id": 61,
            "phrase": "from hand to hand",
            "definition": "from one person to a series of other persons. The book traveled from hand to hand until it got back to its owner.  By the time the baby had been passed from hand to hand, it was crying."
        },
        {
            "id": 62,
            "phrase": "from head to toe",
            "definition": "from the top of one’s head to one’s feet.  She was decked out in f lowers from head to toe.  The huge parka covered the small child from head to toe, assuring that she would be well-protected against the cold."
        },
        {
            "id": 63,
            "phrase": "from hell to breakfast",
            "definition": "Rur. from one end of the earth to the other; all over; everywhere. (Use with caution.) _ We searched from hell to breakfast, but never did find the runaway kid.  I tracked that deer from hell to breakfast, but never got a shot at it."
        },
        {
            "id": 64,
            "phrase": "from here till next Tuesday",
            "definition": "Rur. for a great distance; for a long time. If you try that again, I’ll knock you from here till next Tuesday.  You can lecture him from here till next Tuesday, but he won’t listen."
        },
        {
            "id": 65,
            "phrase": "from Missouri",
            "definition": "requiring proof; needing to be shown something in order to believe it. (From the nickname for the state of Missouri, the Show Me State.) _ You’ll have to prove it to me. I’m from Missouri. She’s from Missouri and has to be shown."
        },
        {
            "id": 66,
            "phrase": "from overseas",
            "definition": "from a location on the other side of the Atlantic or Pacific Ocean, according to the point of view of someone located in the U.S.  The latest word from overseas is that the treaty has been signed.  Is there any news from overseas about the war?"
        },
        {
            "id": 67,
            "phrase": "from pillar to post",
            "definition": "from one place to a series of other places; (figuratively) from person to person, as with gossip.  My father was in the army, and we moved from pillar to post year after year.  After I told one person my secret, it went quickly from pillar to post."
        },
        {
            "id": 68,
            "phrase": "from rags to riches",
            "definition": "from poverty to wealth; from modesty to elegance.  The princess used to be quite poor. She certainly moved from rags to riches. After I inherited the money, I went from rags to riches."
        },
        {
            "id": 69,
            "phrase": "*from scratch",
            "definition": "[making something] by starting from the beginning with the basic ingredients. (*Typically: bake something ~; do something ~; make something ~; start (something) ~.) _ We made the cake from scratch, using no prepared ingredients. I didn’t have a ladder, so I made one from scratch."
        },
        {
            "id": 70,
            "phrase": "from sea to shining sea",
            "definition": "from coast to coast. (Taken from the lyrics of the song “America the Beautiful”.) _ The new insect pest spread from sea to shining sea in a matter of months."
        },
        {
            "id": 71,
            "phrase": "from side to side",
            "definition": "moving first to one side and then to the other, repeatedly.  The pendulum of the clock swings from side to side.  The singers swayed from side to side as they sang."
        },
        {
            "id": 72,
            "phrase": "from start to finish",
            "definition": "entirely; throughout.  I disliked the whole business from start to finish. Mary caused problems from start to finish."
        },
        {
            "id": 73,
            "phrase": "from stem to stern",
            "definition": "from the front of a boat or ship to the back. He inspected the boat from stem to stern and decided he wanted to buy it."
        },
        {
            "id": 74,
            "phrase": "from the bottom of one’s heart",
            "definition": "sincerely. When I returned the lost kitten to Mrs. Brown, she thanked me from the bottom of her heart.  Oh, thank you! I’m grateful from the bottom of my heart."
        },
        {
            "id": 75,
            "phrase": "from the cradle to the grave",
            "definition": "from birth to death. The government promised to take care of us from the cradle to the grave.  You can feel secure and well-protected from the cradle to the grave."
        },
        {
            "id": 76,
            "phrase": "from (the) git-go",
            "definition": "Sl. from the very start.  This kind of thing has been a problem from the git-go.  I warned you about this from git-go."
        },
        {
            "id": 77,
            "phrase": "from the ground up",
            "definition": "from the very beginning.  We must plan our sales campaign carefully from the ground up.  Sorry, but you’ll have to start all over again from the ground up."
        },
        {
            "id": 78,
            "phrase": "from the heart",
            "definition": "from a deep and sincere emotional source. I know that your kind words come from the heart.  We don’t want your gift unless it comes from the heart."
        },
        {
            "id": 79,
            "phrase": "from the outset",
            "definition": "throughout, from the very beginning.  I felt from the outset that Lisa was the wrong one for the job.  From the outset, I felt unwelcome in the group."
        },
        {
            "id": 80,
            "phrase": "from the sublime to the ridiculous",
            "definition": "from something fine and uplifting to something ridiculous or mundane. After Mr. Jones had introduced my wife to his wife, he jokingly turned to introduce me and said, “From the sublime to the ridiculous.” _ After the opera singer finished, the master of ceremonies introduced the comic juggler saying, “From the sublime to the ridiculous....”"
        },
        {
            "id": 81,
            "phrase": "From the sublime to the ridiculous is only a step.",
            "definition": "Prov. Something grand can easily become very funny.  Bob, I don’t think you should include a bowl of breakfast cereal in your still-life painting. From the sublime to the ridiculous is only a step. The production of Macbeth went from the sublime to the ridiculous when Lady Macbeth came onstage in an old army uniform."
        },
        {
            "id": 82,
            "phrase": "from the top",
            "definition": "from the beginning of something, such as a song or a script. Okay, let’s try it again from the top.  Play it from the top one more time."
        },
        {
            "id": 83,
            "phrase": "from the word go",
            "definition": "Cliché from the very beginning.  I knew about the problem from the word go.  She was failing the class from the word go."
        },
        {
            "id": 84,
            "phrase": "from time to time",
            "definition": "irregularly; now and then; occasionally; sometimes; not predictably.  From time to time, I like to go fishing instead of going to work.  Bob visits us at our house from time to time."
        },
        {
            "id": 85,
            "phrase": "from tip to toe",
            "definition": "from the top to the bottom.  She is wearing all new clothes from tip to toe.  The house needs to be cleaned thoroughly from tip to toe."
        },
        {
            "id": 86,
            "phrase": "from top to bottom",
            "definition": "from the highest point to the lowest point; throughout. I have to clean the house from top to bottom today.  We need to replace our elected officials from top to bottom."
        },
        {
            "id": 87,
            "phrase": "from way back",
            "definition": "from far in the past; from a much earlier time. Grandfather comes from way back. This antique clock is from way back."
        },
        {
            "id": 88,
            "phrase": "front for someone or something",
            "definition": "to serve as the public contact or public “face” for someone or something.  Her publicity agent fronted for her most of the time.  Max fronted for a gang of thieves."
        },
        {
            "id": 89,
            "phrase": "front off (about something)",
            "definition": "Sl. to be brash and resentful about something. Todd was fronting off about his assignment and got a detention for it.  You will wish you hadn’t fronted off about your supervisor."
        },
        {
            "id": 90,
            "phrase": "front on something",
            "definition": "[for a building or a piece of land] to face out on something.  The property fronts on a lovely boulevard that has very little traffic. Our house fronts on a lake."
        },
        {
            "id": 91,
            "phrase": "the front-runner",
            "definition": "the person or thing thought most likely to win or succeed. The press found out some juicy secrets about the front-runner and made them all public.  Who is the front-runner in the race to be governor?"
        },
        {
            "id": 92,
            "phrase": "frost over",
            "definition": "to become covered with frost.  The windows had all frosted over in the night. The car windows frosted over."
        },
        {
            "id": 93,
            "phrase": "frosted (over)",
            "definition": "Sl. angry; annoyed.  The clerk was really frosted over when I asked for a better one.  Why was he so frosted?"
        },
        {
            "id": 94,
            "phrase": "froth something up†",
            "definition": "to whip or aerate something until it is frothy.  Froth the milk up before you add it to the sauce.  Froth up the milk before you pour it in."
        },
        {
            "id": 95,
            "phrase": "froth up",
            "definition": "[for something] to build up a froth when whipped, aerated, or boiled. The mixture began to froth up as Dan beat it. The milk frothed up as the steam went through it."
        },
        {
            "id": 96,
            "phrase": "frown at someone or something",
            "definition": "to scowl at someone or something.  Please don’t frown at me. I didn’t do anything.  Frank frowned at the dog and gave it a kick."
        },
        {
            "id": 97,
            "phrase": "frown on someone or something",
            "definition": "to disapprove of someone or something; to show displeasure or disapproval of someone or something.  The Internal Revenue Service frowns on tax cheaters.  Aunt Clara always seemed to frown on my cousin for some reason."
        },
        {
            "id": 98,
            "phrase": "the fruits of one’s labor(s)",
            "definition": "the results of one’s work. We displayed the fruits of our labor at the county fair.  What have you accomplished? Where is the fruit of your labors?"
        },
        {
            "id": 99,
            "phrase": "fry something up†",
            "definition": "to cook something by frying.  Let’s fry some chicken up for dinner.  We fried up some chicken."
        },
        {
            "id": 100,
            "phrase": "Fuck you!",
            "definition": "a strong condemnation. (Taboo.) _ Fuck you! Why did you have to do that? _ Fuck you! I don’t care any more!"
        },
        {
            "id": 101,
            "phrase": "fudge factor",
            "definition": "a margin of error.  I never use a fudge factor. I measure correctly, and I cut the material exactly the way I measured it.  I built in a fudge factor of three percent."
        },
        {
            "id": 102,
            "phrase": "fuel something (up†)",
            "definition": "to put fuel into something.  I have to fuel this car up before I go any farther.  I need to fuel up the car."
        },
        {
            "id": 103,
            "phrase": "fuel up",
            "definition": "to fill one’s tank with fuel.  Let’s stop here and fuel up.  I need to fuel up at the next little town."
        },
        {
            "id": 104,
            "phrase": "*full as a tick",
            "definition": "very full of food or drink. (Alludes to a tick that has filled itself full of blood. See also tight as a tick. *Also: as ~.) _Little Billy ate and ate until he was as full as a tick.  Our cat drank the cream until he became full as a tick."
        },
        {
            "id": 105,
            "phrase": "full of holes",
            "definition": "[of an argument or plan] that cannot stand up to challenge or scrutiny. Your argument is full of holes.  This plan is full of holes and won’t work."
        },
        {
            "id": 106,
            "phrase": "*full of oneself",
            "definition": "conceited; self-important. (*Typically: act ~; be ~.) _ Mary is very unpopular because she’s so full of herself. She doesn’t care about other people’s feelings. She’s too full of herself."
        },
        {
            "id": 107,
            "phrase": "a full plate",
            "definition": "a full schedule; a lot to do. I’m very busy at work, and I’ve got a full plate at home too."
        },
        {
            "id": 108,
            "phrase": "full steam ahead",
            "definition": "onward with determination. We started moving full steam ahead on the project. Full steam ahead! Let’s see how fast this will go!"
        },
        {
            "id": 109,
            "phrase": "full up",
            "definition": "Rur. full.  I ate till I was full up.  I can’t get any more gas in the tank. It’s full up."
        },
        {
            "id": 110,
            "phrase": "fulminate against someone or something",
            "definition": "to denounce someone or something.  The workers were fulminating against their employer. They are fulminating against the president of the union."
        },
        {
            "id": 111,
            "phrase": "fumble for something",
            "definition": "to try to grasp awkwardly for something. He fumbled for his wallet, hoping Wally would pay the bill.  Tex was shot while fumbling for his gun."
        },
        {
            "id": 112,
            "phrase": "fume at someone",
            "definition": "to rage at someone. She was really fuming at Sam, who had broken her table leg."
        },
        {
            "id": 113,
            "phrase": "fun and games",
            "definition": "playing around; doing worthless things. All right, Bill, the fun and games are over. It’s time to get down to work. This isn’t a serious course. It’s nothing but fun and games."
        },
        {
            "id": 114,
            "phrase": "funked out",
            "definition": "Sl. intoxicated.  Do you think you can go through life funked out all the time? _ Are you funked out again?"
        },
        {
            "id": 115,
            "phrase": "*funny as a barrel of monkeys",
            "definition": "Cliché very funny. (*Also: as ~.) _Ron was as funny as a barrel of monkeys.  The entire evening was funny as a barrel of monkeys."
        },
        {
            "id": 116,
            "phrase": "*funny as a crutch",
            "definition": "not funny at all. (Sarcastic. *Also: as ~.) _ Your trick is about as funny as a crutch. Nobody thought it was funny. The lame joke Ron told was as funny as a crutch, and we all yawned."
        },
        {
            "id": 117,
            "phrase": "funny ha-ha",
            "definition": "amusing; comical. (As opposed to funny peculiar.) _I didn’t mean that Mrs. Peters is funny ha-ha. She’s weird—funny peculiar in fact. Mike thinks his jokes are funny ha-ha, but we laugh because they are so silly."
        },
        {
            "id": 118,
            "phrase": "funny money",
            "definition": "1. Sl. counterfeit money. The bank teller spotted the funny money in the man’s deposit almost immediately. 2. Fig. temporary or substitute money, good only in certain places.  What am I going to do with all this funny money when I leave here? It’s no good anywhere else. 3. Fig. foreign currency. (Jocular.) _ We had better buy some gifts and get rid of some of this funny money before our f light."
        },
        {
            "id": 119,
            "phrase": "funny peculiar",
            "definition": "odd; eccentric. (As opposed to funny haha.) _ I didn’t mean that Mrs. Peters is funny ha-ha. She’s weird—funny peculiar in fact. His face is sort of funny— funny peculiar, that is."
        },
        {
            "id": 120,
            "phrase": "a fur piece",
            "definition": "Rur. a long distance. (Fur = far.) _ It’s a fur piece to the library. You’d best take the bus instead of walking.  It’s a pretty fur piece to the nearest big town."
        },
        {
            "id": 121,
            "phrase": "furnish something for something",
            "definition": "to provide something to be used as something.  Could you furnish the salad for our picnic? _ We can’t furnish enough glassware for the whole party."
        },
        {
            "id": 122,
            "phrase": "a furtive glance",
            "definition": "a secret or quick glance, quickly averted.  He made a furtive glance in the direction of the closet when the robbers asked where the jewelery was hidden."
        },
        {
            "id": 123,
            "phrase": "fuse something with something",
            "definition": "to bond something together with something.  You have to fuse the upper layer to the lower layer with heat.  He used heat and pressure to fuse the patch with the soft rubber of the raft."
        },
        {
            "id": 124,
            "phrase": "fuse with something",
            "definition": "to bond with something. The metal has fused with the glass coating on the tank. I didn’t know that metal could fuse with glass."
        },
        {
            "id": 125,
            "phrase": "fuss about someone or something",
            "definition": "to complain about someone or something.  What are you fussing about now? _ Are you still fussing about Tony?"
        },
        {
            "id": 126,
            "phrase": "fuss and feathers",
            "definition": "Rur. fancy addictions that are overdone or troublesome.  A truly elegant dress doesn’t have a lot of fuss and feathers.  They ruined a nice room with all that fuss and feathers."
        },
        {
            "id": 127,
            "phrase": "fuss (around) with someone or something",
            "definition": "to keep bothering with someone or something; to fiddle with someone or something.  Don’t fuss around with it. We’ll have to get a new one.  Don’t fuss with your children. They will get along just fine without all that attention."
        },
        {
            "id": 128,
            "phrase": "fuss at someone or something",
            "definition": "to complain at someone.  Stop fussing at me! _ The squirrel is fussing at the dog."
        },
        {
            "id": 129,
            "phrase": "fuss over someone or something",
            "definition": "to go to a lot of bother about someone or something.  My aunt always fusses over me and my sister. You spend a lot of time fussing over your hair."
        },
        {
            "id": 130,
            "phrase": "futz around",
            "definition": "Sl. to waste time.  Stop futzing around and get the job done.  I wish you would stop futzing around!"
        },
        {
            "id": 131,
            "phrase": "futz something up†",
            "definition": "Sl. to mess something up. Who futzed the computer up? _I don’t want to futz up the deal, so I will be quiet."
        },
        {
            "id": 132,
            "phrase": "gag on something",
            "definition": "to choke on something; to retch on something.  The dog is gagging on whatever you gave her.  This fish is good, but I hope I don’t gag on a bone."
        },
        {
            "id": 133,
            "phrase": "gain dominion over someone or something",
            "definition": "to achieve total authority over someone or something.  The dictator sought to gain dominion over the entire country.  Harry was not happy until he had gained dominion over the people who worked for him."
        },
        {
            "id": 134,
            "phrase": "gain from something",
            "definition": "to benefit from something.  I hope you gain from this experience.  What do you think I will gain from this?"
        },
        {
            "id": 135,
            "phrase": "gain ground",
            "definition": "to make progress; to advance; to become more important or popular.  Our new product is gaining ground against that of our competitor. Since the government announced its new policies, the opposition has been gaining ground."
        },
        {
            "id": 136,
            "phrase": "gain in something",
            "definition": "to advance in a particular quality. Todd grew in stature and gained in wisdom.  Mary gained in experience as the weeks went on."
        },
        {
            "id": 137,
            "phrase": "gain on someone or something",
            "definition": "to begin to catch up or move ahead of someone or something.  We were gaining on them when they suddenly sped up.  Our horse was gaining on the horse in front."
        },
        {
            "id": 138,
            "phrase": "gain something by doing something",
            "definition": "to achieve some benefit by doing something.  What did he gain by dropping out of school? _ I will gain some degree of security by investing in U.S. Treasury bonds."
        },
        {
            "id": 139,
            "phrase": "gain something from something",
            "definition": "to earn or achieve something from something. I hope you gain something worthwhile from all this. I know I will gain some valuable experience from this job."
        },
        {
            "id": 140,
            "phrase": "gallivant around",
            "definition": "to travel around aimlessly. Why don’t you stop gallivanting around and come home for a while? _ Mary is off gallivanting around with her boyfriend."
        },
        {
            "id": 141,
            "phrase": "gallop through something",
            "definition": "[for a horse] to pass through something at a gallop.  Her horse galloped through the garden and dumped her in the cabbages.  A few horses galloped through the meadow."
        },
        {
            "id": 142,
            "phrase": "galumph around",
            "definition": "to move around looking for someone or something or transporting someone or something.  I am so tired of galumphing around, dropping off and picking up kids.  I have to stop galumphing around day after day."
        },
        {
            "id": 143,
            "phrase": "galvanize someone into action",
            "definition": "to stimulate someone into some activity. The explosion galvanized Martha into action. We were galvanized into action by the storm."
        },
        {
            "id": 144,
            "phrase": "gamble on someone or something",
            "definition": "to make a wager on something concerning someone or something.  I wouldn’t gamble on it happening.  Don’t gamble on that horse. You’ll be sorry."
        },
        {
            "id": 145,
            "phrase": "gamble something away†",
            "definition": "to lose all of something by gambling.  He gambled all his money away.  He gambled away all his money."
        },
        {
            "id": 146,
            "phrase": "a game that two can play",
            "definition": "a manner of competing that two competitors can use; a strategy that competing sides can both use. (Said when about to use the same ploy that an opponent has used.) _ The mayor shouted at the city council, “Politics is a game that two can play.” _“Flattery is a game that two can play,” said John as he returned Mary’s compliment."
        },
        {
            "id": 147,
            "phrase": "gang up (on someone)",
            "definition": "to form into a group and attack someone. (Usually a physical attack, but it can also be a verbal attack.) _ We can’t win against the robber unless we gang up on him.  All right, you guys, don’t gang up on me. Play fair!"
        },
        {
            "id": 148,
            "phrase": "gape at someone or something",
            "definition": "to stare at someone or something in wonder.  Don’t just stand there, gaping at me. Come in. Stop gaping at the storm clouds and get in here."
        },
        {
            "id": 149,
            "phrase": "garb someone in something",
            "definition": "to dress someone in something. He hoped that someday he wouldn’t have to garb his children in rags.  She garbed herself in her finest clothes and got ready to meet her husband’s family."
        },
        {
            "id": 150,
            "phrase": "Garbage in, garbage out.",
            "definition": "Prov. If you give nonsensical instructions to people or computers, those instructions will produce nonsensical results.  Jill: Why is my computer generating all this gibberish? Jane: You must have made a mistake in the program. Garbage in, garbage out.  Ed insists that children are so ignorant nowadays because their teachers are incompetent. “Garbage in, garbage out,” he says."
        },
        {
            "id": 151,
            "phrase": "garbage something down†",
            "definition": "Sl. to gobble something up; to quickly swallow something down.  Don’t garbage your food down! _That guy will garbage down almost anything."
        },
        {
            "id": 152,
            "phrase": "garnish something with something",
            "definition": "to embellish or decorate something, such as food, with something.  For the final presentation, I will garnish the dish with a sprig of parsley.  The roast was garnished with slices of apple."
        },
        {
            "id": 153,
            "phrase": "gas something up†",
            "definition": "to put gasoline into a vehicle.  I have to gas this car up soon.  I will stop and gas up the car at the next little town."
        },
        {
            "id": 154,
            "phrase": "gas up",
            "definition": "to fill up one’s gasoline tank with gasoline. I have to stop at the next service station and gas up.  The next time you gas up, try some of the gasoline with alcohol in it."
        },
        {
            "id": 155,
            "phrase": "gasp at someone or something",
            "definition": "to inhale sharply in surprise or shock at someone or something. I gasped at the sight that lay before me.  I saw how weary Denise looked and I gasped at her."
        },
        {
            "id": 156,
            "phrase": "gasp for air",
            "definition": "to fight for a breath of air. (After one has been deprived of air.) _ Walter popped to the surface of the water and gasped for air. The injured dog appeared to be gasping for air."
        },
        {
            "id": 157,
            "phrase": "gasp for breath",
            "definition": "to labor for one’s breath. (Usually because of physical exertion.) _She ran and ran until she was gasping for breath. The diver finally came to the surface, gasping for breath."
        },
        {
            "id": 158,
            "phrase": "gasp something out†",
            "definition": "to utter something, gasping.  She gasped the words out haltingly. Dan was just able to gasp out the instructions before he passed out."
        },
        {
            "id": 159,
            "phrase": "gassed (up)",
            "definition": "Sl. intoxicated.  Fred is gassed up and very wobbly.  He was too gassed up to drive home."
        },
        {
            "id": 160,
            "phrase": "gather around someone or something",
            "definition": "to collect around someone or something.  Let’s all gather around her and hear her out.  Please gather around the table for dinner."
        },
        {
            "id": 161,
            "phrase": "gather dust",
            "definition": "[for something] to sit unused for a long time.  Most of my talent is just gathering dust because I don’t really have an opportunity to perform."
        },
        {
            "id": 162,
            "phrase": "gather someone or something around (oneself)",
            "definition": "to collect people or things around oneself; to draw someone or something to oneself.  He gathered a lot of arty people around himself.  She liked to gather exotic plants around herself.  Grandpa gathered all the kids around and read them a story."
        },
        {
            "id": 163,
            "phrase": "gather someone or something to oneself",
            "definition": "to draw someone or something to oneself.  The hen gathered her chicks to herself.  Harry gathered the poker chips to himself."
        },
        {
            "id": 164,
            "phrase": "gather someone or something together†",
            "definition": "to assemble people or things together in one place.  Gather everyone together in the drawing room for a meeting. Please gather together all the suspects so that they can be questioned again. Would you gather all your papers together and put them away?"
        },
        {
            "id": 165,
            "phrase": "gather something from someone",
            "definition": "to collect something from someone.  I will gather the papers from Wally, and you go get those that Ted is working on.  Would you gather the pictures from everyone? We have to leave now and take them with us."
        },
        {
            "id": 166,
            "phrase": "gather something from someone or something",
            "definition": "to learn something from someone or something; to infer something from someone or someone’s remarks. (The something is often a clause shifted to another position in the sentence.) _ I gather from your brother that you do not approve of her.  We gathered that from your remarks."
        },
        {
            "id": 167,
            "phrase": "gather something from something",
            "definition": "to collect something from something.  Kristine gathered the honey from the beehives.  I gathered my money from the cashier."
        },
        {
            "id": 168,
            "phrase": "gather something in†",
            "definition": "to collect something and bring it in; to harvest something.  We gathered the pumpkins in just before Halloween.  We gathered in the pumpkins just in time."
        },
        {
            "id": 169,
            "phrase": "gather something up†",
            "definition": "to collect something; to pick something up.  Let’s gather our things up and go.  Please gather up your things."
        },
        {
            "id": 170,
            "phrase": "gather together",
            "definition": "to assemble together.  We will gather together on the main deck for a meeting.  Let’s all gather together this evening and sing."
        },
        {
            "id": 171,
            "phrase": "Gather ye rosebuds while ye may.",
            "definition": "Prov. Enjoy yourself while you can, before you lose the opportunity or before you become too old. (From Robert Herrick’s poem, “To the Virgins, to Make Much of Time.”) _ Sue: Should I go out on a date with Robbie on Saturday, or should I stay home and study? Ellen: Gather ye rosebuds while ye may.  You ought to travel abroad now, while you’re young, before you have responsibilities that might keep you from going. Gather ye rosebuds while ye may."
        },
        {
            "id": 172,
            "phrase": "*gaudy as a butterfly",
            "definition": "fancy; colorful. (*Also: as ~.) _Marie looked as gaudy as a butterf ly in her new dress.  Michael’s scarf is gaudy as a butterf ly."
        },
        {
            "id": 173,
            "phrase": "gawk at someone or something",
            "definition": "to stare at someone or something, obviously and awkwardly.  Why are you standing there, gawking at me? _ The tourists stood at the foot of the mountain and gawked at the top."
        },
        {
            "id": 174,
            "phrase": "gaze around (at someone or something)",
            "definition": "to look all around at someone or something.  The manager gazed around at each of us, and finally spoke. Tourists gazed around at the scenery for a while and got back in the bus.  We just stood there, gazing around."
        },
        {
            "id": 175,
            "phrase": "gaze at someone or something",
            "definition": "to stare at someone or something. I stood for an hour, gazing at the sea. She gazed at me for a moment and then smiled."
        },
        {
            "id": 176,
            "phrase": "gaze on someone or something",
            "definition": "to look at someone or something; to survey someone or something.  She gazed sullenly on the ruin that had been her home.  The teacher gazed on the student and frightened her."
        },
        {
            "id": 177,
            "phrase": "gaze out on something",
            "definition": "to look out on something, such as a lovely view, from inside a building or from a particular spot. She gazed out on the flowering trees and knew that life would go on.  Henry sat for hours, gazing out on the lake."
        },
        {
            "id": 178,
            "phrase": "gear someone or something up† (for someone or something)",
            "definition": "to prepare someone or something for someone or some- thing.  We have to gear up the workers for the arrival of the new manager. We geared ourselves up for Frank, who was coming to lecture to us."
        },
        {
            "id": 179,
            "phrase": "gear something to someone or something",
            "definition": "to cause something to match something else; to create or adapt something for a specific purpose.  Tim geared his speech to his audience. The newspaper geared its language to a fourth-grade reading level."
        },
        {
            "id": 180,
            "phrase": "gear up for someone or something",
            "definition": "to get ready for something.  We are busy gearing up for Joan’s visit next week."
        },
        {
            "id": 181,
            "phrase": "generalize from something",
            "definition": "to assume a general pattern in something from specific observances of something. You can hardly generalize from only two instances.  You can’t generalize anything from the testimony of a single witness!"
        },
        {
            "id": 182,
            "phrase": "generous to a fault",
            "definition": "Cliché too generous; overly generous.  My favorite uncle is generous to a fault.  Sally— always generous to a fault—gave away her lunch to a homeless man."
        },
        {
            "id": 183,
            "phrase": "Genius is an infinite capacity for taking pains.",
            "definition": "Prov. Genius is the quality of being exceedingly careful about everything you do.  If genius is an infinite capacity for taking pains, Marilyn certainly has it. She never overlooks a single detail that needs attention."
        },
        {
            "id": 184,
            "phrase": "Genius is ten percent inspiration and ninety percent perspiration.",
            "definition": "Prov. People get brilliant results primarily by working hard, not because they have special inborn powers.  Child: Betty always does the best drawings in art class. She must be a genius. Father: If you worked hard, you could do just as well. Remember, genius is ten percent inspiration and ninety percent perspiration."
        },
        {
            "id": 185,
            "phrase": "*gentle as a lamb",
            "definition": "Cliché [of someone] very gentle. (*Also: as ~.) _Don’t be afraid of Mr. Schaeffer. He may look fierce, but he’s as gentle as a lamb.  Lisa was gentle as a lamb when dealing with children."
        },
        {
            "id": 186,
            "phrase": "the genuine article",
            "definition": "the real thing rather than a substitute.  Is this the genuine article or some cheap imitation substitute? _ I’ll take the genuine article, thanks."
        },
        {
            "id": 187,
            "phrase": "get a buzz out of someone or something",
            "definition": "to get some humor from someone or something.  I thought you’d get a buzz out of that gag.  I hope you get a buzz out of Ted. He’s a funny guy."
        },
        {
            "id": 188,
            "phrase": "get a laugh",
            "definition": "to do something that will create laughter.  John will do almost anything to get a laugh."
        },
        {
            "id": 189,
            "phrase": "Get a life!",
            "definition": "Inf. Change your life radically! Find something interesting to do or say! _ You are such a twit! Get a life! _ Get a life, you clown!"
        },
        {
            "id": 190,
            "phrase": "get a load of someone or something",
            "definition": "to get a good look at someone or something. Wow! Get a load of that car! _ Get a load of Mary!"
        },
        {
            "id": 191,
            "phrase": "get a lot of mileage out of something",
            "definition": "to get a lot of use from something, as if it were a car.  Bob always got a lot of mileage out of one joke.  I got a lot of mileage out of my TV before it broke down."
        },
        {
            "id": 192,
            "phrase": "get a ticket",
            "definition": "to receive a traffic ticket.  If you keep racing along at this speed, you will get a ticket!"
        },
        {
            "id": 193,
            "phrase": "get aboard something",
            "definition": "to get onto a ship, a train, or an airplane.  What time should we get aboard the ship? _ Everyone can get aboard at noon."
        },
        {
            "id": 194,
            "phrase": "get across (something)",
            "definition": "to manage to cross something. We finally got across the river where it was very shallow.  Where the water was low, it was easy to get across."
        },
        {
            "id": 195,
            "phrase": "get after someone",
            "definition": "to begin to chase someone.  The other boys got after him and almost caught him.  Henry got after Bill and almost caught up with him."
        },
        {
            "id": 196,
            "phrase": "get ahead (in something)",
            "definition": "to advance in one’s employment, school, or life in general.  I work hard every day, but I can’t seem to get ahead in my job.  I want to get ahead in life."
        },
        {
            "id": 197,
            "phrase": "get ahead of oneself",
            "definition": "[for someone] to do or say something sooner than it ought to be done so that the proper explanation or preparations have not been made. I have to stick to my notes or I will get ahead of myself in my lecture. When he bought a new little bicycle before the baby was born, he was getting ahead of himself."
        },
        {
            "id": 198,
            "phrase": "get along",
            "definition": "1. [for people or animals] to be amiable with one another. Those two just don’t get along. They seem to get along just fine. 2. to leave; to be on one’s way. I’ve got to get along. It’s getting late.  It’s time for me to get along. See you later."
        },
        {
            "id": 199,
            "phrase": "get along on something",
            "definition": "to manage to survive with just something.  I think we can get along on what I earn.  I can’t get along on what they pay me."
        },
        {
            "id": 200,
            "phrase": "Get along with you!",
            "definition": "Rur. to go on; to depart; to go and “take oneself along.” (Only with you.) _ Get along with you, now. Get going! _ Get along with you, Sally!"
        },
        {
            "id": 201,
            "phrase": "get along without (someone or something)",
            "definition": "to manage without someone or something; to do without someone or something.  I don’t think I can get along without my secretary.  My secretary just quit, and I don’t think I will be able to get along without."
        },
        {
            "id": 202,
            "phrase": "get an amount of money for something",
            "definition": "to receive an amount of money in exchange for something; to sell something for a specific price.  I got nearly two thousand dollars for my car.  How much did they get for their house?"
        },
        {
            "id": 203,
            "phrase": "get around someone or something",
            "definition": "to cluster around someone or something.  Tell everyone to get around the cat so she won’t run away. Let’s get around Mary and sing “Happy Birthday” to her."
        },
        {
            "id": 204,
            "phrase": "get around to doing something",
            "definition": "to find time to do something; to do something after a long delay. to someone or something.) _ I finally got around to buying a new coat.  It took Sally years to get around to visiting her aunt."
        },
        {
            "id": 205,
            "phrase": "get at someone",
            "definition": "to find a way to irritate someone; to manage to wound someone, physically or emotionally.  Mr. Smith found a way to get at his wife.  John kept trying to get at his teacher."
        },
        {
            "id": 206,
            "phrase": "get at someone or an animal",
            "definition": "to attack or strike someone or an animal.  The cat jumped over the wall to get at the mouse.  Ok, you guys. There he is. Get at him!"
        },
        {
            "id": 207,
            "phrase": "get at something",
            "definition": "1. Fig. to explain or understand something.  We spent a long time trying to get at the answer.  I can’t understand what you’re trying to get at. 2. Fig. begin doing something.  I won’t be able to get at it until the weekend.  I’ll get at it first thing in the morning."
        },
        {
            "id": 208,
            "phrase": "get away",
            "definition": "to move away. (Often a command.) _Get away! Don’t bother me! _ I tried to get away, but he wouldn’t let me."
        },
        {
            "id": 209,
            "phrase": "get away (from someone or something)",
            "definition": "to escape from someone, something, or some place.  Max did get away from the prison guard but was caught soon after.  Mary couldn’t get away from the telephone all morning. "
        },
        {
            "id": 210,
            "phrase": "get away with murder",
            "definition": "to commit murder and not get punished for it.  Don’t kill me! You can’t get away with murder!"
        },
        {
            "id": 211,
            "phrase": "get away with someone or something",
            "definition": "to escape, taking someone or something with one.  The kidnapper got away with little Brian.  The burglars got away with a lot of cash and some diamonds."
        },
        {
            "id": 212,
            "phrase": "get axed",
            "definition": "to get fired.  Betty and two of her friends got axed today."
        },
        {
            "id": 213,
            "phrase": "get back (to someone) (on something)",
            "definition": "to continue talking with someone (at a later time); to find out information and tell it to a person (at a later time).  I don’t have the answer to that question right now. Let me find out and get back to you.  Okay. Please try to get back early tomorrow."
        },
        {
            "id": 214,
            "phrase": "get back to something",
            "definition": "to return to dealing with something.  I will have to get back to my work now.  I want to get back to my knitting."
        },
        {
            "id": 215,
            "phrase": "get better",
            "definition": "to improve.  I had a bad cold, but it’s getting better.  Business was bad last year, but it’s getting better.  I’m sorry you’re ill. I hope you get better."
        },
        {
            "id": 216,
            "phrase": "get between someone or something and someone or something else",
            "definition": "to position oneself between people and things, in any combination. She got between Dan and his career.  The dog got between the archer and the target."
        },
        {
            "id": 217,
            "phrase": "get busy",
            "definition": "to start working; to work or appear to work harder or faster. The boss is coming. You’d better get busy.  I’ve got to get busy and clean this house up."
        },
        {
            "id": 218,
            "phrase": "get by (on a small amount of money)",
            "definition": "to survive with only a small amount of money.  I can’t get by on that much money.  That is a very small amount of money to live on. No one could get by."
        },
        {
            "id": 219,
            "phrase": "get by (someone or something)",
            "definition": "to move past someone or something.  I need to get by this intersection, and then I will stop and look at the tires.  Please let me get by."
        },
        {
            "id": 220,
            "phrase": "get by (with something)",
            "definition": "to satisfy the minimum requirements. I was failing geometry, but managed to get by with a D.  I took the bar exam and just barely got by. "
        },
        {
            "id": 221,
            "phrase": "get by (without someone or something)",
            "definition": "to survive without someone or something.  I can’t get by without you.  We can probably get by without two cars."
        },
        {
            "id": 222,
            "phrase": "get carried away",
            "definition": "to be overcome by emotion or enthusiasm (in one’s thinking or actions).  Calm down, Jane. Don’t get carried away.  Here, Bill. Take this money and go to the candy store, but don’t get carried away."
        },
        {
            "id": 223,
            "phrase": "get cracking",
            "definition": "Rur. to get to work.  If you want to finish that quilt by Labor Day, you best get cracking.  Sit down to your homework and get cracking!"
        },
        {
            "id": 224,
            "phrase": "get down",
            "definition": "1. Sl. to lay one’s money on the table. (Gambling.) _Okay, everybody get down. Get down, and let’s get going! 2. Sl. to concentrate; to do something well.  I’m flunking two subjects, man. I gotta get down.  Come on, Sam, pay attention. Get down and learn this stuff. 3. Sl. to copulate.  Hey, let’s get down! _ All Steve wants to do is get down all the time."
        },
        {
            "id": 225,
            "phrase": "get down (from something)",
            "definition": "to get off something; to climb down from something.  Please get down from there this instant! _ Get down before you fall!"
        },
        {
            "id": 226,
            "phrase": "get (down) off one’s high horse",
            "definition": "to become humble; to be less haughty. It’s about time that you got down off your high horse.  Would you get off your high horse and talk to me?"
        },
        {
            "id": 227,
            "phrase": "get down (on all fours)",
            "definition": "to position oneself on one’s hands and knees.  He got down on all fours and played with the children. Mary got down and walked around like a dog."
        },
        {
            "id": 228,
            "phrase": "get down to brass tacks",
            "definition": "to begin to talk about important things; to get down to business.  Let’s get down to brass tacks. We’ve wasted too much time chatting.  Don’t you think that it’s about time to get down to brass tacks?"
        },
        {
            "id": 229,
            "phrase": "get down to cases",
            "definition": "to begin to discuss specific matters; to get down to business. When we’ve finished the general discussion, we’ll get down to cases.  Now that everyone is here, we can get down to cases."
        },
        {
            "id": 230,
            "phrase": "get down to (doing) something",
            "definition": "to begin doing some kind of work in earnest.  I have to get down to my typing.  John, you get in here this minute and get down to that homework!"
        },
        {
            "id": 231,
            "phrase": "get down to the facts",
            "definition": "to begin to talk about things that matter; to get to the truth. The judge told the lawyer that the time had come to get down to the facts. Let’s get down to the facts, Mrs. Brown. Where were you on the night of January 16?"
        },
        {
            "id": 232,
            "phrase": "get down to the nitty-gritty",
            "definition": "to get down to the basic facts.  Stop messing around and get down to the nittygritty.  If we could only get down to the nitty-gritty and stop wasting time."
        },
        {
            "id": 233,
            "phrase": "get down to the nuts and bolts",
            "definition": "to get down to the basic facts.  Stop fooling around. Get down to the nuts and bolts.  Let’s stop wasting time. We have to get down to the nuts and bolts."
        },
        {
            "id": 234,
            "phrase": "get euchred out of something",
            "definition": "to get cheated out of something. (Alludes to losing in the card game euchre.) _Joe’s dad left him a farm, but he got euchred out of it by some city slicker real estate agent.  I got euchred out of ten bucks by a con artist with a hard-luck story."
        },
        {
            "id": 235,
            "phrase": "get going",
            "definition": "1. to start moving.  Let’s get going! We can’t stand here all day. 2. to depart.  What time should we get going in the morning?"
        },
        {
            "id": 236,
            "phrase": "get home to someone or something",
            "definition": "to manage to return home to someone or something there. The infantryman wants to get home to his wife.  I like to get home to a nice warm house."
        },
        {
            "id": 237,
            "phrase": "get in deeper",
            "definition": "to get in more and more trouble; to get more deeply involved with someone or something.  Everytime he opened his mouth to complain, he just got in deeper."
        },
        {
            "id": 238,
            "phrase": "get inside something",
            "definition": "to go inside of something or some place. Get inside the house and wait for me. Get inside the car so you won’t get wet."
        },
        {
            "id": 239,
            "phrase": "get into bed with someone",
            "definition": "to work closely as business partners; to merge businesses. Have you heard? The company’s getting into bed with Acme Industries.  I want you to get into bed with the other department supervisors and sort this problem out."
        },
        {
            "id": 240,
            "phrase": "get into one’s stride",
            "definition": "[for a runner] to reach a comfortable and efficient pace.  I got into my stride right away, and that helped win the race. She never got into her stride, and that’s why she lost."
        },
        {
            "id": 241,
            "phrase": "get in(to) the act",
            "definition": "to participate in something; to try to be part of whatever is going on. (As if someone were trying to get on stage and participate in a performance.) _ Everybody wants to get into the act! There is not room here for everyone.  I want to get in the act."
        },
        {
            "id": 242,
            "phrase": "get in(to) the swing of things",
            "definition": "to join in with people and their activities; to become more social and up-todate.  Come on, Bill. Try to get into the swing of things.  John just couldn’t seem to get in the swing of things."
        },
        {
            "id": 243,
            "phrase": "get it (all) together",
            "definition": "to become fit or organized; to organize one’s thinking; to become relaxed and rational. Bill seems to be acting more normal now. I think he’s getting it all together. I hope he gets it together soon. His life is a mess."
        },
        {
            "id": 244,
            "phrase": "get it in the neck",
            "definition": "Sl. to receive trouble or punishment.  You are going to get it in the neck if you are not home on time.  I got it in the neck for being late."
        },
        {
            "id": 245,
            "phrase": "get it off",
            "definition": "Sl. to achieve sexual release; to copulate. (Potentially offensive. Use only with discretion. Compare this with get it off with someone.) _Harry kept saying he had to get it off or die. What’s wrong with Harry? _ The entire crew of the yacht came ashore to get it off."
        },
        {
            "id": 246,
            "phrase": "get it off with someone",
            "definition": "Sl. to have sexual intercourse with someone.  She said she wanted to get it off with him.  She said all he wanted was to get it off with just anybody."
        },
        {
            "id": 247,
            "phrase": "get it on",
            "definition": "1. Sl. to begin something.  Time to go back to work. Let’s get it on! _ Get it on, you guys! Time to start your engines. 2. Sl. to begin dancing.  Let’s go out there and get it on! _ He wanted to get it on, but my feet hurt. 3. Sl. [for people] to copulate. (Potentially offensive. Use only with discretion.) _ Come on, baby, let’s get it on.  I don’t want to get it on with you or any other creep. 4. Sl. to undertake to enjoy oneself. I can really get it on with that slow jazz.  Let’s go listen to some new age and get it on."
        },
        {
            "id": 248,
            "phrase": "get it out",
            "definition": "to tell someone about a problem; to pour out one’s grief. (Fixed order.) _ Come on, get it out. You’ll feel better.  He would feel better if he could get it out."
        },
        {
            "id": 249,
            "phrase": "get it wrong",
            "definition": "to misunderstand someone or something.  Oh, Otto, you’ve got it wrong again! _ Why do you have to get it wrong every time?"
        }
    ]
}