{
    "dictionary": [
        {
            "id": 0,
            "phrase": "call a meeting",
            "definition": "to ask that people assemble for a meeting; to request that a meeting be held.  The mayor called a meeting to discuss the problem.  I’ll be calling a meeting of the library board to discuss the new building project."
        },
        {
            "id": 1,
            "phrase": "call a spade a spade",
            "definition": "to call something by its right name; to speak frankly about something, even if it is unpleasant. (Considered offensive by some. Use only with discretion.) _Well, I believe it’s time to call a spade a spade. We are just avoiding the issue.  Let’s call a spade a spade. The man is a liar."
        },
        {
            "id": 2,
            "phrase": "Call again.",
            "definition": "Please visit this shop again sometime. (Said by shopkeepers and store clerks.) _ “Thank you,” said the clerk, smiling, “Call again.” _ Clerk: Is that everything? John: Yes. Clerk: That’s ten dollars even. John: Here you are. Clerk: Thanks. Call again."
        },
        {
            "id": 3,
            "phrase": "call (all) the shots",
            "definition": "to decide on the course of action; to be in charge.  Why do you have to call all the shots? _ Do what you’re told. I’ll call the shots."
        },
        {
            "id": 4,
            "phrase": "call around (about someone or something)",
            "definition": "to telephone a number of different people in succession about something.  I’ll call around about Tom and see if I can find out anything."
        },
        {
            "id": 5,
            "phrase": "call at some place",
            "definition": "to visit some place; [for a ship] to put into port at a place.  I called at the druggist’s for some medicine. Our ship will call at seven ports during the voyage."
        },
        {
            "id": 6,
            "phrase": "call attention to someone or something",
            "definition": "to cause someone, including oneself, or something to be noticed or observed. I think he dresses like that simply to call attention to himself."
        },
        {
            "id": 7,
            "phrase": "call back",
            "definition": "1. to call [someone] again on the telephone at a later time. Call back later, please. I will call back when you are not so busy. 2. to return a telephone call received earlier.  The note says I am to call back. What did you want? _ This is Bill Wilson calling back."
        },
        {
            "id": 8,
            "phrase": "call for someone or something",
            "definition": "1. to need, require, or demand something or the services of someone.  The recipe calls for two cups of f lour.  This job calls for someone with experience. 2. to arrive to collect or pick up a person or a thing. (Used especially when you are to pick someone up and are acting as an escort.) _ I will call for you about eight this evening.  The messenger will call for your reply in the morning. 3. to shout for or request someone or something. I called for Ted, but he didn’t hear me.  I stood on the porch and called for the dog."
        },
        {
            "id": 9,
            "phrase": "call hogs",
            "definition": "Rur. to snore.  I couldn’t sleep at all last night, with Cousin Joe calling hogs in the next room.  Joe calls hogs so loud the windows rattle."
        },
        {
            "id": 10,
            "phrase": "call in sick",
            "definition": "to call one’s place of work to say that one is ill and cannot come to work.  Four of our office staff called in sick today.  I have to call in sick today."
        },
        {
            "id": 11,
            "phrase": "call in (to some place)",
            "definition": "to telephone to some central place, such as one’s place of work, as to check for messages.  I have to call in to the office at noon.  I will call in whenever I have a chance."
        },
        {
            "id": 12,
            "phrase": "call it a day",
            "definition": "to quit work and go home; to say that a day’s work has been completed.  I’m tired. Let’s call it a day.  The boss was mad because Tom called it a day at noon and went home."
        },
        {
            "id": 13,
            "phrase": "call it a night",
            "definition": "to end what one is doing at night and go [home] to bed. At midnight, I called it a night and went to bed.  Guest after guest called it a night, and at last we were alone."
        },
        {
            "id": 14,
            "phrase": "call it quits",
            "definition": "to quit; to resign from something; to announce that one is quitting.  Okay! I’ve had enough! I’m calling it quits.  Time to go home, John. Let’s call it quits."
        },
        {
            "id": 15,
            "phrase": "Call my service.",
            "definition": "Please don’t call me directly, but through my answering service. (Not a friendly or encouraging invitation.) _ Good to talk to you, but I gotta go now. Call my service.  I can’t talk now. Call my service."
        },
        {
            "id": 16,
            "phrase": "the call of nature",
            "definition": "Euph. the need to go to the lavatory.  Stop the car here! I have to answer the call of nature.  There was no break in the agenda, not even for the call of nature."
        },
        {
            "id": 17,
            "phrase": "call on someone",
            "definition": "to court someone.  Jim’s calling on the new cook over at the Browns’.  In the old days, a boy had to ask a girl’s father for permission to come call on her."
        },
        {
            "id": 18,
            "phrase": "call on something",
            "definition": "to draw on something, such as a particular quality or talent.  This project calls on all the creative skills you can gather together.  It calls on everything you’ve got."
        },
        {
            "id": 19,
            "phrase": "call out (to someone)",
            "definition": "to speak loudly to get someone’s attention.  Mike called out to Tom that there was a telephone call for him.  I heard someone call out, but I could see no one."
        },
        {
            "id": 20,
            "phrase": "call someone about something",
            "definition": "to call someone on the telephone, seeking information about someone or something. I’ll call Maggie about Ted and see what she knows. Let me call the manager about this."
        },
        {
            "id": 21,
            "phrase": "call someone away† (from something)",
            "definition": "to ask someone to come away from some place or from doing something.  The boss called Kathy away from her office.  The principal called away the teacher from the classroom.  Why did you call Kathy away?"
        },
        {
            "id": 22,
            "phrase": "call someone back†",
            "definition": "1. to call someone again on the telephone.  Since she is not there, I will call her back in half an hour.  Carl called back Mary after his meeting was over. 2. to return a telephone call to a person who had called earlier.  I got his message; I will call him back tomorrow.  I have to call back my friend now. "
        },
        {
            "id": 23,
            "phrase": "call someone by a name",
            "definition": "to address someone by a particular kind of name.  They call me by my first name.  Don’t call me by my nickname!"
        },
        {
            "id": 24,
            "phrase": "call someone down†",
            "definition": "to reprimand a person; to bawl someone out.  The teacher had to call down Sally in front of everybody.  “I wish you wouldn’t call me down in public,” cried Sally."
        },
        {
            "id": 25,
            "phrase": "call someone forth†",
            "definition": "to call to someone to come out or come forward.  The principal called Wally forth.  Please call forth Wally again."
        },
        {
            "id": 26,
            "phrase": "call someone forward",
            "definition": "to call to someone to the front, and to the attention of everyone present.  The teacher called the student forward to recite. Don’t call me forward. I am not prepared."
        },
        {
            "id": 27,
            "phrase": "call someone in† (for something)",
            "definition": "1. to request that someone come to have a talk.  The manager called Karen in for a private meeting.  The police called in Gary for questioning. 2. to request a consultation with a specialist in some field. (The person called probably will not “come in,” but will work at another place.) _We will have to call a heart specialist in for a consultation.  We called in another specialist for an opinion."
        },
        {
            "id": 28,
            "phrase": "call someone names",
            "definition": "to call someone by an abusive or insulting name. Billy cried when the other kids called him names.  John was punished for calling his teacher names."
        },
        {
            "id": 29,
            "phrase": "call someone or something back†",
            "definition": "to call out that someone or something should come back.  As she left, the clerk called her back.  The clerk called back the customer."
        },
        {
            "id": 30,
            "phrase": "call someone or something in†",
            "definition": "to call on the special talents, abilities, or power of someone or something. They had to call a new doctor in.  Yes, they had to call in a specialist. "
        },
        {
            "id": 31,
            "phrase": "call someone or something into question",
            "definition": "to cause someone or something to be evaluated; to examine or reexamine the qualifications or value of someone or something. Because of her poor record, we were forced to call Dr. Jones into question.  We called Dr. Jones’s qualifications into question."
        },
        {
            "id": 32,
            "phrase": "call someone or something out†",
            "definition": "to request the services of someone or a group. Things got bad enough that the governor called the militia out.  The governor called out the militia."
        },
        {
            "id": 33,
            "phrase": "call someone or something up†",
            "definition": "to call someone, a group, or a company on the telephone.  I will call them up and see what they have to say.  Please call up the supplier."
        },
        {
            "id": 34,
            "phrase": "call someone out†",
            "definition": "to challenge someone to a fight.  Wilbur wanted to call him out, but thought better of it.  Why did you call out that guy? He used to be a prizefighter!"
        },
        {
            "id": 35,
            "phrase": "call someone over (to some place)",
            "definition": "to request that someone come to where one is.  I will call her over to us, and you can ask her what you want to know.  Call over the waitress so we can order.  I called Ted over."
        },
        {
            "id": 36,
            "phrase": "call someone’s bluff",
            "definition": "to demand that someone prove a claim or is not being deceptive.  All right, I’ll call your bluff. Show me you can do it! _Tom said, “You’ve made me really angry, and I’ll punch you if you come any closer!” “Go ahead,” said Bill, calling his bluff."
        },
        {
            "id": 37,
            "phrase": "call someone to account",
            "definition": "to ask one to explain and justify one’s behavior, policy, performance, etc.  The sergeant called the police officer to account. I called my workers to account for the accident."
        },
        {
            "id": 38,
            "phrase": "call someone to attention",
            "definition": "to demand that someone assume the formal military stance of attention. The officer called the platoon to attention.  The sergeant called us to attention."
        },
        {
            "id": 39,
            "phrase": "call someone together",
            "definition": "to request that people come together for a meeting. Please call everyone together and we’ll discuss this.  I called all the players together."
        },
        {
            "id": 40,
            "phrase": "call someone up†",
            "definition": "to request that someone or a group report for active military service. The government called the reserve units up for active service.  They called up another battalion."
        },
        {
            "id": 41,
            "phrase": "call something down† (on someone)",
            "definition": "to invoke some sort of divine punishment onto someone. The preacher sounded as though he was calling down the wrath of God on us.  Moses called down a plague on the Pharoah."
        },
        {
            "id": 42,
            "phrase": "call something down† (to someone)",
            "definition": "to shout something to a person on a lower level.  The worker called a warning down to the people below.  She called down a warning to them."
        },
        {
            "id": 43,
            "phrase": "call something forth†",
            "definition": "[for an event] to draw a particular quality or induce a particular behavior. The battle called extraordinary courage forth from the soldiers.  It called forth great courage."
        },
        {
            "id": 44,
            "phrase": "call something off†",
            "definition": "to cancel an event.  It’s too late to call the party off. The first guests have already arrived.  Because of rain, they called off the baseball game."
        },
        {
            "id": 45,
            "phrase": "call something out†",
            "definition": "1. to draw on something, such as a particular quality or talent.  It’s times like these that call the best out in us.  These times call out our best effort. 2. to shout out something.  Who called the warning out? _ You should call out a warning to those behind you on the trail."
        },
        {
            "id": 46,
            "phrase": "call something square",
            "definition": "to pronounce a debt or obligation to have been paid, balanced, or ended.  Thanks for the hundred bucks. I think we can call it square now."
        },
        {
            "id": 47,
            "phrase": "call something up†",
            "definition": "to summon information from a computer.  John used his laptop to call the information up.  With a few strokes on the computer keyboard, Sally called up the figures she was looking for."
        },
        {
            "id": 48,
            "phrase": "call the dogs off†",
            "definition": "to order hunting or watch dogs to abandon their quarry.  They robber gave up and the guard called the dogs off. Call off the dogs!"
        },
        {
            "id": 49,
            "phrase": "call to someone",
            "definition": "to shout to get someone’s attention.  I called to Fred, but he didn’t hear me.  Did you hear me call to you?"
        },
        {
            "id": 50,
            "phrase": "call (up)on someone",
            "definition": "1. to visit someone. (Upon is formal and less commonly used than on.) _ My mother’s friends call upon her every Wednesday. Let’s call on Mrs. Franklin this afternoon. 2. to choose someone to respond, as in a classroom.  The teacher called upon me, but I was not ready to recite.  Please don’t call on me. I can’t remember a thing."
        },
        {
            "id": 51,
            "phrase": "call (up)on someone (for something)",
            "definition": "to choose someone to do or to help with some particular task. (Upon is formal and less commonly used than on.) _ Can I call upon you for help? _ You can call on me at any time."
        },
        {
            "id": 52,
            "phrase": "call (up)on someone (to do something)",
            "definition": "to choose someone to do something. (Upon is formal and less commonly used than on.) _ I call upon all of you to make your feelings known to your elected representatives. I called on George for his help, but he refused."
        },
        {
            "id": 53,
            "phrase": "called to straw",
            "definition": "Rur. about to begin labor and childbirth.  Susan was called to straw when she was only seven months along.  Nancy’s nine months pregnant and could be called to straw any day now."
        },
        {
            "id": 54,
            "phrase": "calm down",
            "definition": "to relax; to become less busy or active. Now, now, calm down. You look so nervous. Please calm down. Nothing bad is going to happen."
        },
        {
            "id": 55,
            "phrase": "calm someone or an animal down†",
            "definition": "to cause someone or an animal to be less active, upset, or unsettled.  Please try to calm yourself down! _Can you calm down your yapping dog?"
        },
        {
            "id": 56,
            "phrase": "camp it up",
            "definition": "[for performers] to overact or behave in an affected manner. The cast began to camp it up in the second act, and the critics walked out. (Fixed order.) _ There is no need to camp it up. Play it the way it was written."
        },
        {
            "id": 57,
            "phrase": "camp out",
            "definition": "to live out of doors temporarily in a tent or camping vehicle, as on a vacation or special camping trip.  I love to camp out in the winter."
        },
        {
            "id": 58,
            "phrase": "campaign against someone or something",
            "definition": "1. to crusade or battle against someone or something.  Currently, I am campaigning against littering.  Sarah is campaigning against crooked politicians. 2. to run one’s political campaign against someone or something.  I campaigned against the incumbent and won.  John spent a lot of time campaigning against Sarah for class president."
        },
        {
            "id": 59,
            "phrase": "campaign for someone or something",
            "definition": "to support actively someone or someone’s candidacy for political office.  I would be very happy to campaign for you. I want to campaign for the winning candidate."
        },
        {
            "id": 60,
            "phrase": "can (just) whistle for something",
            "definition": "can just forget about having something. The last time Mary came over for dinner, she was downright rude. If she wants dinner at my house again, she can just whistle for it! _ I asked the boss for a promotion. He told me I could whistle for it."
        },
        {
            "id": 61,
            "phrase": "*a can of worms",
            "definition": "a very difficult issue or set of problems; an array of difficulties. (*Typically: be ~; open ~.) _This political scandal is a real can of worms. Let’s not open that can of worms!"
        },
        {
            "id": 62,
            "phrase": "can take it to the bank",
            "definition": "able to depend on the truthfulness of my statement: it is not counterfeit or bogus; to be able to bank on something.  Believe me. What I am telling you is the truth. You can take it to the bank.  This information is as good as gold. You can take it to the bank."
        },
        {
            "id": 63,
            "phrase": "Can you imagine?",
            "definition": "Can you believe that?; Imagine that! _She wore jeans to the wedding. Can you imagine? _Billy was eating the houseplant! Can you imagine?"
        },
        {
            "id": 64,
            "phrase": "cancel each other out†",
            "definition": "[for the opposite effects of two things] to balance each other.  The cost of the meal you bought and what I owed you cancel each other out, so we’re even.  They canceled out each other."
        },
        {
            "id": 65,
            "phrase": "cancel out (of something)",
            "definition": "to withdraw from something.  I hate to cancel out of the event at the last minute, but this is an emergency.  It’s too late to cancel out."
        },
        {
            "id": 66,
            "phrase": "cancel someone’s Christmas",
            "definition": "Sl. to kill someone; to destroy someone. (Underworld or jocular; the idea is that the dead person will not live until Christmas.) _ If he keeps bugging me, I’m gonna cancel his Christmas. Willie threatened to cancel Richard’s Christmas if Richard didn’t pay up."
        },
        {
            "id": 67,
            "phrase": "cancel something out†",
            "definition": "to balance the effects of something. Sending f lowers might cancel the bad feelings out. The last payment canceled out the debt."
        },
        {
            "id": 68,
            "phrase": "*a candidate for a pair of wings",
            "definition": "Euph. someone who is likely to die; someone who is close to death. (Jocular. *Typically: be ~; look like ~.) _Whenever Jane wants to cross the street, she just walks out into traffic without looking. She’s a candidate for a pair of wings, I say.  Tom: How’s Bill doing? I heard he was sick. Jane: Not good, I’m afraid. He looks like a candidate for a pair of wings."
        },
        {
            "id": 69,
            "phrase": "cannot help doing something",
            "definition": "not able to refrain from doing something; not able not to do something.  Anne is such a good cook, I can’t help eating everything she serves.  Since John loves to shop, he can’t help spending money."
        },
        {
            "id": 70,
            "phrase": "can’t call one’s soul one’s own",
            "definition": "working for other people all the time.  Jane has to work two jobs and take care of both her aging parents. She can’t call her soul her own.  Between supporting his family and working off his brother’s bad debts, Bob really can’t call his soul his own."
        },
        {
            "id": 71,
            "phrase": "can’t do anything with someone or something",
            "definition": "not [to be] able to manage or control someone or something. (Also with cannot.) _ Bill is such a discipline problem. I can’t do anything with him.  My hair is such a mess. I just can’t do anything with it."
        },
        {
            "id": 72,
            "phrase": "can’t find one’s butt with both hands (in broad daylight)",
            "definition": "Sl. is stupid or incompetent. (Use caution with butt, which is often considered crude.) _ Why did they put Jim in charge? He can’t find his butt with both hands! _ Tom: Jane seems like a bright girl. Bill: You’ve got to be kidding! She couldn’t find her butt with both hands in broad daylight!"
        },
        {
            "id": 73,
            "phrase": "can’t hack it",
            "definition": "unable to do the job.  I thought delivering papers would be an easy job, but I just can’t hack it. If you can’t hack it, let me know, and I’ll help you out."
        },
        {
            "id": 74,
            "phrase": "can’t help but do something",
            "definition": "[to be] unable to choose any but one course of action. (Also with cannot.) _ Her parents live nearby, so she can’t help but go there on holidays.  Bob is a tennis fan and can’t help but travel to Wimbledon each year."
        },
        {
            "id": 75,
            "phrase": "can’t hit the (broad) side of a barn",
            "definition": "Rur. cannot aim something accurately. You’re way off. You couldn’t hit the broad side of a barn.  Please don’t try to throw the paper into the wastebasket. You can’t hit the side of a barn."
        },
        {
            "id": 76,
            "phrase": "can’t hold a candle to someone",
            "definition": "not [to be] equal to someone; unable to measure up to someone. (Also with cannot.) _ Mary can’t hold a candle to Ann when it comes to athletics.  As for singing, John can’t hold a candle to Jane."
        },
        {
            "id": 77,
            "phrase": "can’t make heads or tails (out) of someone or something",
            "definition": "[to be] unable to understand someone or something. (Also with cannot.) _John is so strange. I can’t make heads or tails of him.  Do this report again. I can’t make heads or tails out of it."
        },
        {
            "id": 78,
            "phrase": "Can’t say (a)s I do(, can’t say (a)s I don’t).",
            "definition": "Rur. I am not sure. Tom: Do you know Mr. Smith? Mary: Well, I can’t say as I do, can’t say as I don’t.  Jane: What do you think of my cousin? Do you like him? Mary: Can’t say’s I do, can’t say’s I don’t."
        },
        {
            "id": 79,
            "phrase": "can’t say boo to a goose",
            "definition": "Rur. shy and not talkative.  I was surprised to see Joe so talkative at the party. Usually he can’t say boo to a goose.  She’s a quiet little kid. Can’t say boo to a goose."
        },
        {
            "id": 80,
            "phrase": "can’t see a hole in a ladder",
            "definition": "stupid or drunk. No use asking her questions. She can’t see a hole in a ladder. After the big party, Joe needed someone to drive him home. He couldn’t see a hole in a ladder."
        },
        {
            "id": 81,
            "phrase": "can’t see one’s hand in front of one’s face",
            "definition": "[to be] unable to see very far, usually due to darkness or fog. (Also with cannot.) _ It was so dark that I couldn’t see my hand in front of my face.  Bob said that the fog was so thick he couldn’t see his hand in front of his face."
        },
        {
            "id": 82,
            "phrase": "can’t see straight",
            "definition": "cannot function (often because of strong emotion). I am so mad I can’t see straight. She left me so frustrated that I couldn’t see straight."
        },
        {
            "id": 83,
            "phrase": "can’t wait (for something (to happen))",
            "definition": "to be very eager, as if to be unable to endure the wait for something to happen.  I am so eager for my birthday to come. I just can’t wait."
        },
        {
            "id": 84,
            "phrase": "can’t wait (to do something)",
            "definition": "to be very eager, as if to be unable to endure the wait until it is possible to do something. I’m glad it’s almost summertime—I just can’t wait to go swimming!"
        },
        {
            "id": 85,
            "phrase": "cap and gown",
            "definition": "the academic cap or mortarboard and the robe worn in formal academic ceremonies.  We all had to rent cap and gown for graduation.  I appeared wearing my cap and gown, but I had shorts on underneath because it gets so hot at that time of year."
        },
        {
            "id": 86,
            "phrase": "capable of doing something",
            "definition": "having the ability to do something. Do you think Tom is capable of lifting 200 pounds? _ No one I know is capable of such a crime!"
        },
        {
            "id": 87,
            "phrase": "capitalize on something",
            "definition": "to build on something; to exploit something, such as an opportunity of talent, to one’s own benefit.  Let’s try to capitalize on the strength of the economy and invest for the future.  Capitalize on your experience in the field and you’ll do well in the interview."
        },
        {
            "id": 88,
            "phrase": "capitulate to someone or something",
            "definition": "to surrender or submit to someone or something. The general finally capitulated to the enemy.  I won’t capitulate in this argument."
        },
        {
            "id": 89,
            "phrase": "captain of industry",
            "definition": "a high-ranking corporation officer; a wealthy and successful capitalist. The captains of industry manage to hang on to their money no matter what.  It’s fun to see those captains of industry drive up in their limousines."
        },
        {
            "id": 90,
            "phrase": "capture someone’s imagination",
            "definition": "to intrigue someone; to interest someone in a lasting way; to stimulate someone’s imagination.  The story of the young wizard has captured the imagination of the world’s children."
        },
        {
            "id": 91,
            "phrase": "*a card",
            "definition": "an entertaining and clever person who says or does funny things. (*Typically: act like ~; be ~.) _ He is such a card. Always making jokes.  Mary is a card, and she has to learn to take things seriously sometimes."
        },
        {
            "id": 92,
            "phrase": "card-carrying member",
            "definition": "an official member of some group, originally, the communist party.  Bill is a cardcarrying member of the electricians union."
        },
        {
            "id": 93,
            "phrase": "the cards are stacked against one",
            "definition": "[informal] luck is against one.  I have the worst luck. The cards are stacked against me all the time.  How can I accomplish anything when the cards are stacked against me?"
        },
        {
            "id": 94,
            "phrase": "care about someone or something",
            "definition": "1. to hold someone or something dear; to prize someone or something. I really care about you.  I care very much about my family. 2. to have even minimal regard for someone or something. (Does not imply any of the tender feelings expressed in Q.) _ Don’t you care about animals? _ I care about what happens in Washington."
        },
        {
            "id": 95,
            "phrase": "care for someone",
            "definition": "to feel tenderly toward someone; to love someone.  I care for you a great deal, Walter.  I care for you too, Alice."
        },
        {
            "id": 96,
            "phrase": "care for someone or something",
            "definition": "to take care of someone or something. Will you care for my cat while I am away? _ I would be happy to care for your child."
        },
        {
            "id": 97,
            "phrase": "care for something",
            "definition": "to like the taste of some kind of food or drink. (Usually used with a negative.) _ I don’t care for sweet potatoes.  I don’t care for sweet desserts."
        },
        {
            "id": 98,
            "phrase": "care nothing about someone or something",
            "definition": "to have no regard or respect for someone or something.  You have hurt me with your insults. I care nothing about you! _ She cares nothing about your money!"
        },
        {
            "id": 99,
            "phrase": "care nothing for someone or something",
            "definition": "not to like someone or something. She cares nothing for your suggestion.  Sarah cares nothing for Jeff."
        },
        {
            "id": 100,
            "phrase": "care to do something",
            "definition": "to want to do something; to be willing to do something. I really don’t care to see that movie.  Would you care to go out for dinner?"
        },
        {
            "id": 101,
            "phrase": "careful not to do something",
            "definition": "using care to avoid some difficulty or difficulties. Please be careful not to discuss politics with Mr. Brown.  Please be careful not to leave the house unlocked."
        },
        {
            "id": 102,
            "phrase": "carp about someone or something",
            "definition": "to complain about someone or something. You are always carping about all your petty problems at work.  Stop carping about Randy!"
        },
        {
            "id": 103,
            "phrase": "carp at someone (about someone or something)",
            "definition": "to complain to someone about someone or something.  Why are you always carping at me about your family? _ You are always carping at Joan about her brother."
        },
        {
            "id": 104,
            "phrase": "carp at someone or something",
            "definition": "to criticize someone or something.  Poor Clara is carping at Bill’s carelessness again.  Please stop carping at me."
        },
        {
            "id": 105,
            "phrase": "carry (a lot of ) weight (with someone or something)",
            "definition": "to be very influential with someone or some group of people.  Your argument does not carry a lot of weight with me.  The senator’s testimony carried a lot of weight with the council."
        },
        {
            "id": 106,
            "phrase": "carry coals to Newcastle",
            "definition": "Prov. to do something unnecessary; to do something that is redundant or duplicative. (Newcastle is an English town from which coal was shipped to other parts of England.) _Mr. Smith is so rich he doesn’t need any more money. To give him a gift certificate is like carrying coals to Newcastle."
        },
        {
            "id": 107,
            "phrase": "carry on",
            "definition": "to behave badly or mischievously. The children always carry on when the teacher’s out of the room. Stop carrying on and go to sleep!"
        },
        {
            "id": 108,
            "phrase": "carry on (about someone or something)",
            "definition": "to make a great fuss over someone or something; to cry (especially for a long time or uncontrollably) about someone or something. (Note the variation in the examples.) _ Billy, stop carrying on about your tummy ache like that.  The child carried on endlessly when his mother scolded him. When the soldier finally came home, his wife cried and carried on for hours.  Calm down. There’s no need to carry on so."
        },
        {
            "id": 109,
            "phrase": "carry on somehow",
            "definition": "to manage to continue or endure, in spite of problems.  Even though we did not have a lot of money, we managed to carry on somehow.  Don’t worry about us. We will carry on somehow."
        },
        {
            "id": 110,
            "phrase": "carry on (to something)",
            "definition": "to continue on to some place or some time.  Please keep reading. Carry on to the next page.  Please carry on with your report."
        },
        {
            "id": 111,
            "phrase": "carry on (with someone)",
            "definition": "to flirt with someone; to have a love affair with someone.  It looks like Linda is carrying on with James."
        },
        {
            "id": 112,
            "phrase": "carry on (with something)",
            "definition": "to continue doing something. (Compare this with carry something on.) _ Please carry on with your singing.  Tom carried on with his boring speech for twenty minutes."
        },
        {
            "id": 113,
            "phrase": "carry on without someone or something",
            "definition": "to manage to continue without someone or something. I don’t know how we will be able to carry on without you.  We can’t carry on without a leader!"
        },
        {
            "id": 114,
            "phrase": "carry over",
            "definition": "to extend into another time period or location.  I don’t like for bills to carry over into the next month.  Please do not let the paragraph carry over."
        },
        {
            "id": 115,
            "phrase": "carry over (to something)",
            "definition": "1. [for a sum or other figure] to be taken to another column of figures.  This amount carries over into the next column.  Yes, this number carries over. 2. to last or continue until another time.  Will this enthusiasm carry over to the following week? _ Of course, it will carry over."
        },
        {
            "id": 116,
            "phrase": "carry someone along† (with someone)",
            "definition": "[for someone’s enthusiasm or power] to affect other people and persuade them.  The excitement of the play carried the audience along with the actors. She carried along the audience with her all the way."
        },
        {
            "id": 117,
            "phrase": "carry someone along† (with something)",
            "definition": "[for something] to transport someone as it moves along.  The f lood carried us along with the debris.  The rushing water carried along everything with it."
        },
        {
            "id": 118,
            "phrase": "carry someone around† (with oneself)",
            "definition": "to be the source of transport for someone, usually a child.  I’m tired of carrying this baby around with me everywhere. Can’t I buy a baby carriage? _ I always carry around my child with me."
        },
        {
            "id": 119,
            "phrase": "carry someone away†",
            "definition": "[for someone or something] to cause a person to lose control.  The excitement of the parade carried us all away. The fervor of the speech carried away the whole crowd."
        },
        {
            "id": 120,
            "phrase": "carry someone back (to some time)",
            "definition": "to return someone, mentally, to a former time; to remind someone of an earlier time. This carries me back to the times of knights and jousting.  This article about the Sixties really carries me back."
        },
        {
            "id": 121,
            "phrase": "carry someone or something away†",
            "definition": "to take or steal someone or something.  Someone carried our lawn furniture away while we were on vacation. The kidnappers carried away the child when no one was looking."
        },
        {
            "id": 122,
            "phrase": "carry someone or something off†",
            "definition": "to take or steal someone or something.  The kidnappers carried the child off.  They carried off the child."
        },
        {
            "id": 123,
            "phrase": "carry someone or something out†",
            "definition": "to lift up and move someone or something out.  Help me carry the baby and her things out.  Let’s carry out the dishes and set the table."
        },
        {
            "id": 124,
            "phrase": "carry someone or something over† from something",
            "definition": "to transport someone or something from somewhere, usually a great distance or another country.  The ship carried the travel club over from Spain. They carried over all my furniture from Paris."
        },
        {
            "id": 125,
            "phrase": "carry someone or something over to something",
            "definition": "to lift and move someone or something to another place.  Please carry this over to the window.  Could you carry Timmy over to his bed, please? He’s asleep."
        },
        {
            "id": 126,
            "phrase": "carry someone or something through something",
            "definition": "to lift up and move someone or something through something.  We will have to carry him through the crowd to the ambulance.  Jane carried the groceries through the doorway."
        },
        {
            "id": 127,
            "phrase": "carry someone through (something)",
            "definition": "to sustain someone (as someone’s expenses or needs) during something.  Can this amount carry you through the week? _ Yes, this will carry me through."
        },
        {
            "id": 128,
            "phrase": "carry something along† (with someone)",
            "definition": "to bring or take something with one; to have something with one and have it handy at all times.  You should carry this emergency phone list along with you whenever you travel.  Please carry along this package when you go."
        },
        {
            "id": 129,
            "phrase": "carry something around† (with one)",
            "definition": "to have something on one’s person at all times.  He carries a backpack around with him. Max carries around his checkbook with him."
        },
        {
            "id": 130,
            "phrase": "carry something back†",
            "definition": "to take something back to where it came from.  Did you bring this here? If so, carry it back.  Please carry back the empty box after you take out all the books."
        },
        {
            "id": 131,
            "phrase": "carry something down†",
            "definition": "to take something from a higher to a lower place. Would you go up to the attic and carry the trunk down? _ Why should I carry down the trunk?"
        },
        {
            "id": 132,
            "phrase": "carry something forward",
            "definition": "to take a figure from one column or category to another.  Now, carry this figure forward into the tens column."
        },
        {
            "id": 133,
            "phrase": "carry something off†",
            "definition": "to take something away with oneself; to steal something.  Someone carried off my books! _ I think someone carried off the lawn chairs last night."
        },
        {
            "id": 134,
            "phrase": "carry something on†",
            "definition": "1. to do something over a period of time. (Compare this with carry on (with something.) _ Do you think you can carry this on for a year? _I will carry on this activity for three years if you want. 2. to continue to do something as a tradition.  We intend to carry this celebration on as long as the family can gather for the holidays. We will carry on this tradition for decades, in fact. "
        },
        {
            "id": 135,
            "phrase": "carry something out†",
            "definition": "to perform a task; to perform an assignment.  “This is a very important job,” said Jane. “Do you think you can carry it out?” _ The students didn’t carry out their assignments."
        },
        {
            "id": 136,
            "phrase": "carry something over†",
            "definition": "to let something like a bill extend into another period of time.  We’ll carry the amount of money due over into the next month.  Yes, please carry over the balance."
        },
        {
            "id": 137,
            "phrase": "carry the ball",
            "definition": "to be the player who is relied on to gain yardage, especially in football.  It was the fullback carrying the ball. Yes, Tom always carries the ball."
        },
        {
            "id": 138,
            "phrase": "carry the torch",
            "definition": "to lead or participate in a (figurative) crusade.  The battle was over, but John continued to carry the torch.  If Jane hadn’t carried the torch, no one would have followed, and the whole thing would have failed. "
        },
        {
            "id": 139,
            "phrase": "carry the weight of the world on one’s shoulders",
            "definition": "to appear or behave as if burdened by all the problems in the whole world.  Look at Tom. He appears to be carrying the weight of the world on his shoulders.  Cheer up, Tom! You don’t need to carry the weight of the world on your shoulders."
        },
        {
            "id": 140,
            "phrase": "carry weight (with someone)",
            "definition": "to have influence with someone; [for an explanation] to amount to a good argument to use with someone.  That carries a lot of weight with the older folks. What you say carries no weight with me."
        },
        {
            "id": 141,
            "phrase": "cart someone or something off†",
            "definition": "to take or haul someone or something away. (When used with someone the person is treated like an object.) _ The police came and carted her off.  Let’s cart off these boxes."
        },
        {
            "id": 142,
            "phrase": "*carte blanche",
            "definition": "freedom or permission to act as one wishes or thinks necessary. (*Typically: get ~; have ~; give someone ~.) _ He’s been given carte blanche with the reorganization of the workforce.  The manager has been given no instructions about how to train the staff. He has carte blanche from the owner."
        },
        {
            "id": 143,
            "phrase": "carve someone or something up†",
            "definition": "to damage someone or something by careless or purposeful cutting (of a person, can be figurative). Someone carved the tabletop up. Who did it and why? _ The boxer wanted to carve up his opponent."
        },
        {
            "id": 144,
            "phrase": "carve something from something",
            "definition": "to shape by cutting something off or out of something with a knife.  Can you carve an elephant from a bar of soap?"
        },
        {
            "id": 145,
            "phrase": "carve something in stone",
            "definition": "to fix some idea permanently.  No one has carved this one approach in stone; we have several options."
        },
        {
            "id": 146,
            "phrase": "2",
            "definition": "to create a carved object by sculpturing raw material.  Ken carved the apple into a tiny snowman."
        },
        {
            "id": 147,
            "phrase": "carve something out†",
            "definition": "to hollow something out by carving; to make something hollow by carving.  Can he carve a bowl out of such soft wood? _ He carved out the bowl of the pipe and then began to sand it."
        },
        {
            "id": 148,
            "phrase": "carve something out† (of something)",
            "definition": "to remove something from the inside of something else by carving or cutting.  She carved the insides out.  She carved out the insides of the pumpkin."
        },
        {
            "id": 149,
            "phrase": "carve something up†",
            "definition": "to divide something up, perhaps carelessly. The peace treaty carved the former empire up into several countries. You can’t just carve up one country and give the pieces away."
        },
        {
            "id": 150,
            "phrase": "the case",
            "definition": "the [current] instance; an actual situation.  I think Bill is a vegetarian, and if that is the case, we should not serve him meat. Susie believes trees can talk, but that is not the case."
        },
        {
            "id": 151,
            "phrase": "a case in point",
            "definition": "a specific example of what one is talking about.  Now, as a case in point, let’s look at nineteenthcentury England. Fireworks can be dangerous. For a case in point, look at what happened to Bob Smith last Fourth of July."
        },
        {
            "id": 152,
            "phrase": "a case of mistaken identity",
            "definition": "the incorrect identification of someone.  I am not the criminal you want to arrest. This is a case of mistaken identity."
        },
        {
            "id": 153,
            "phrase": "*a case of something",
            "definition": "1. an instance of something. (*Typically: be ~; have ~.) _ This is a case of police brutality. They should not have injured the suspect. 2. an occurrence of a disease. (*Typically: be ~; look like ~; treat ~.) _ I am suffering from a case of the f lu."
        },
        {
            "id": 154,
            "phrase": "a case of the blind leading the blind",
            "definition": "a situation where people who don’t know how to do something try to teach other people. Tom doesn’t know anything about cars, but he’s trying to teach Sally how to change the oil. It’s a case of the blind leading the blind. When I tried to show Mary how to use a computer, it was a case of the blind leading the blind."
        },
        {
            "id": 155,
            "phrase": "case someone or something out†",
            "definition": "Sl. to look someone or something over carefully, with a view to additional activity at a later time.  He came into the room and cased all the lighting fixtures out.  He cased out the fixtures to see which ones to replace.  John cased the girls out."
        },
        {
            "id": 156,
            "phrase": "case the joint",
            "definition": "1. Sl. to look over some place to figure out how to break in, what to steal, etc. (Underworld.) _ First of all you gotta case the joint to see where things are. You could see he was casing the joint the way he hung around. 2. Sl. to look a place over.  The dog came in and cased the joint, sniffing out friends and foes.  The old lady entered slowly, casing the joint for someone of her own age, and finally took a seat."
        },
        {
            "id": 157,
            "phrase": "cash flow problem",
            "definition": "a lack of hard currency.  My real estate business has a temporary cash flow problem.  Due to his cash flow problem, he was unable to pay his employees that month."
        },
        {
            "id": 158,
            "phrase": "cash in (on something)",
            "definition": "to earn a lot of money at something; to make a profit at something. This is a good year for drug stocks, and you can cash in on it if you’re smart.  It’s too late to cash in on that particular clothing fad."
        },
        {
            "id": 159,
            "phrase": "Cash is king.",
            "definition": "Prov. It is best to keep one’s investment money in cash. (Said when the prices in the securities markets are too high. It is better to build up cash and wait for a break in the market.) _ Things look a little pricey now. I’d say that cash is king for the moment.  I’m holding a little cash for a little bottom fishing, but I wouldn’t say that cash is king."
        },
        {
            "id": 160,
            "phrase": "Cash is trash.",
            "definition": "Prov. It is unwise to keep one’s investment money in cash. (Said when there are good opportunities in securities and it is foolish not to invest cash.) _If you’ve got money sitting around in savings while the market is steaming ahead, you are losing dollars. Right now cash is trash.  Cash is trash. Get into the market or you stand to lose a bundle."
        },
        {
            "id": 161,
            "phrase": "cash money",
            "definition": "Rur. money in bills and coins.  You could make cash money selling your quilts, you really could.  Joe wants cash money for his old TV set. He won’t let me have it on credit."
        },
        {
            "id": 162,
            "phrase": "cash or credit",
            "definition": "[a purchase made] either by paying cash or by putting the charges on a credit account.  When Fred had all his purchases assembled on the counter, the clerk asked, “Cash or credit?” _That store does not give you a choice of cash or credit. They want cash only."
        },
        {
            "id": 163,
            "phrase": "cash something in†",
            "definition": "to exchange something with cash value for the amount of money it is worth.  I should have cashed my insurance policy in years ago.  It’s time to cash in your U. S. savings bonds."
        },
        {
            "id": 164,
            "phrase": "cash something in† (for something)",
            "definition": "to exchange a security for money; to convert a foreign currency to one’s own currency; to turn gaming tokens or poker chips in for money. in.) _ I cashed the bonds in for a cashier’s check.  I cashed in my bonds for their face value."
        },
        {
            "id": 165,
            "phrase": "cash-and-carry",
            "definition": "a method of buying and selling goods at the retail level where the buyer pays cash for the goods and carries the goods away. (As opposed to paying on credit or with the cost of delivery included.) _ Sorry, we don’t accept credit cards. This is strictly cash-and-carry.  I bought the chair cash-and-carry before I realized that I had no way to get it home."
        },
        {
            "id": 166,
            "phrase": "cast a spell (on someone)",
            "definition": "to enchant someone with a magic spell.  The wizard cast a spell on the frog, turning it into a prince with bad skin."
        },
        {
            "id": 167,
            "phrase": "cast aspersions on someone",
            "definition": "to make a rude and insulting remark.  I resent your casting aspersions on my brother and his ability! _ It is rude to cast aspersions on people in general."
        },
        {
            "id": 168,
            "phrase": "cast doubt(s) (on someone or something)",
            "definition": "to cause someone or something to be doubted.  The police cast doubt on my story.  How can they cast doubt? They haven’t looked into it yet. The city council cast doubt on John and his plan."
        },
        {
            "id": 169,
            "phrase": "cast in the same mold",
            "definition": "[of two or more people or things] very similar.  The two sisters are cast in the same mold—equally mean.  All the members of the family are cast in the same mold and they all had success as entertainers."
        },
        {
            "id": 170,
            "phrase": "cast off (from something)",
            "definition": "[for the crew of a boat or ship] to push away from the dock or pier; to begin the process of navigating a boat or ship.  The crew cast off from the dock.  It’s time to cast off."
        },
        {
            "id": 171,
            "phrase": "Cast one’s bread upon the waters.",
            "definition": "Prov. Act generous because you feel it is right and not because you expect a reward. (Biblical.) _ Joseph is casting his bread upon the waters, supporting Bob while he works on his novel. Cast your bread upon the waters; make a generous contribution to our cause."
        },
        {
            "id": 172,
            "phrase": "cast one’s eyes down†",
            "definition": "to tilt one’s head or gaze downward. (Usually a sign of shame or to appear not to have seen someone.) _ She cast her eyes down as they saw each other again.  He cast down his eyes in shame."
        },
        {
            "id": 173,
            "phrase": "cast one’s lot in† (with someone or something)",
            "definition": "to join in with someone or a group. He cast his lot in with the others. She cast in her lot with the others. She cast in with a questionable crowd."
        },
        {
            "id": 174,
            "phrase": "cast (one’s) pearls before swine",
            "definition": "to waste something good on someone who doesn’t care about it. (From a biblical quotation.) _ To sing for them is to cast pearls before swine.  To serve them French cuisine is like casting one’s pearls before swine."
        },
        {
            "id": 175,
            "phrase": "cast one’s vote",
            "definition": "to vote; to place one’s ballot in the ballot box.  The citizens cast their votes for president.  The wait in line to cast one’s vote was almost an hour."
        },
        {
            "id": 176,
            "phrase": "cast someone as something",
            "definition": "to choose someone to play a particular role in a play, opera, film, etc.  The director cast her as the young singer.  They cast me as a villain."
        },
        {
            "id": 177,
            "phrase": "cast someone or something up†",
            "definition": "[for the waves] to bring up and deposit someone or something on the shore.  The waves cast the wreckage up, and it was found on the shore.  The waves cast up the wreckage of a boat."
        },
        {
            "id": 178,
            "phrase": "cast something back (some place)",
            "definition": "to throw something back somewhere. I cast the fish back in the water. Cast back those stones and all the others you took from the pile."
        },
        {
            "id": 179,
            "phrase": "cast something down†",
            "definition": "to hurl or throw something down. She cast the glass down, breaking it into a thousand pieces.  She cast down the tray and all that was on it."
        },
        {
            "id": 180,
            "phrase": "cast-iron stomach",
            "definition": "a very strong stomach that can withstand bad food or anything nauseating.  If I didn’t have a cast-iron stomach, I couldn’t eat this stuff. Fred— known for his cast-iron stomach—ate ten whole hot peppers."
        },
        {
            "id": 181,
            "phrase": "A cat can look at a king.",
            "definition": "Prov. No one is so important that an ordinary person cannot look at him or her; everyone has the right to be curious about important people. Jane: I get so angry at those people who read tabloid magazines. The private lives of television stars are none of their business. Alan: Don’t be so hard on them. A cat can look at a king. Fred: You shouldn’t stare at me like that. I’m your boss. Jill: A cat can look at a king."
        },
        {
            "id": 182,
            "phrase": "A cat has nine lives.",
            "definition": "Prov. Cats can survive things that are severe enough to kill them. (You can also refer to a particular cat’s nine lives.) _ Jill: My cat fell off a thirdf loor balcony and just walked away. How can he do that? Jane: A cat has nine lives.  I think my cat used up one of her nine lives when she survived being hit by that car."
        },
        {
            "id": 183,
            "phrase": "A cat in gloves catches no mice.",
            "definition": "Prov. Sometimes you cannot get what you want by being careful and polite.  Jill: I’ve hinted to Mary several times that I need her to pay me the money she owes, but she just ignores me. Jane: A cat in gloves catches no mice, Jill. Tell her bluntly that you need the money."
        },
        {
            "id": 184,
            "phrase": "the cat is out of the bag",
            "definition": "the secret has been made known. Now that the cat is out of the bag, there is no sense in pretending we don’t know what’s really happening."
        },
        {
            "id": 185,
            "phrase": "catapult someone or something into something",
            "definition": "to throw someone or something into a place using a catapult.  The soldiers catapulted the huge stone into the fortress."
        },
        {
            "id": 186,
            "phrase": "catch (a)hold of someone or something",
            "definition": "to grasp or seize someone or something.  See if you can catch hold of the rope as it swings back and forth. I couldn’t catch ahold of her."
        },
        {
            "id": 187,
            "phrase": "catch it",
            "definition": "to get into trouble and receive punishment.  I know I’m going to catch it for denting mom’s car when I get home.  Bob hit Billy in the face. He really caught it from the teacher for that."
        },
        {
            "id": 188,
            "phrase": "catch (on) fire",
            "definition": "to ignite and burn with flames.  Keep your coat away from the f lames, or it will catch fire.  The curtains blew against the flame of the candle and caught on fire."
        },
        {
            "id": 189,
            "phrase": "catch on (to something)",
            "definition": "to figure something out.  I finally caught on to what she was talking about.  It takes a while for me to catch on."
        },
        {
            "id": 190,
            "phrase": "catch on (with someone)",
            "definition": "[for something] to become popular with someone.  I hope our new product catches on with children.  I’m sure it will catch on."
        },
        {
            "id": 191,
            "phrase": "catch one’s breath",
            "definition": "to struggle for normal breathing after strenuous activity.  The jogger stopped to catch her breath.  It took Jimmy a minute to catch his breath after being punched in the stomach."
        },
        {
            "id": 192,
            "phrase": "catch one with one’s pants down",
            "definition": "to discover someone in the act of doing something that is normally private or hidden. (Literal uses are possible.) _ Some council members were using tax money as their own. But the press caught them with their pants down and now the district attorney will press charges."
        },
        {
            "id": 193,
            "phrase": "catch onto something",
            "definition": "[for something] to snag on or get grabbed by something else.  This little piece has to catch onto this gear each time it comes around.  A few threads of my shirt caught onto the cactus needles and ruined the whole thing."
        },
        {
            "id": 194,
            "phrase": "catch someone at a bad time",
            "definition": "to attempt to speak or deal with someone at a time inconvenient for that person.  I’m sorry. You look busy. Did I catch you at a bad time?"
        },
        {
            "id": 195,
            "phrase": "catch someone in the act (of doing something)",
            "definition": "to discover someone doing a [bad] deed at the very moment when the deed is being done.  I caught her in the act of stealing the coat.  He was caught in the act of taking money from the cash box."
        },
        {
            "id": 196,
            "phrase": "catch someone or something in something",
            "definition": "to trap someone or something in something.  We caught David in the snare by accident.  My platoon was caught in an enemy ambush."
        },
        {
            "id": 197,
            "phrase": "catch someone out†",
            "definition": "to discover the truth about someone’s deception.  The investigator tried to catch me out, but I stuck to my story. The teacher caught out the student and punished him immediately."
        },
        {
            "id": 198,
            "phrase": "catch someone up in something",
            "definition": "[for excitement or interest] to extend to and engross someone.  The fireworks caught everyone up in the excitement.  The accident caught us all up in the resultant confusion."
        },
        {
            "id": 199,
            "phrase": "catch someone up (on someone or something)",
            "definition": "to tell someone the news of someone or something. (Fixed order.) _ Oh, please catch me up on what your family is doing. Yes, do catch us up! _ I have to take some time to catch myself up on the news."
        },
        {
            "id": 200,
            "phrase": "catch someone with something",
            "definition": "1. to discover or apprehend someone with something—usually something stolen or illicit.  They caught Elizabeth with the earrings she shoplifted. Don’t let them catch you with the money! 2. to apprehend someone with the aid of something.  The state trooper caught the speeder with radar.  The cops caught Lefty with the help of an informer."
        },
        {
            "id": 201,
            "phrase": "catch something from someone",
            "definition": "to get a disease from someone.  I hope my children catch the chicken pox in kindergarten. Better to have it while you are young. I don’t want to catch a cold from you."
        },
        {
            "id": 202,
            "phrase": "catch something on something",
            "definition": "to snag something on something.  I caught the pocket of my trousers on the drawer pull and almost ripped it off.  He caught the sleeve of his uniform on a branch."
        },
        {
            "id": 203,
            "phrase": "catch something up† in something",
            "definition": "to ensnare and capture something in something.  We caught a large number of fish up in the net.  We caught up many fish in the net."
        },
        {
            "id": 204,
            "phrase": "a catch to it",
            "definition": "a hidden problem associated with it.  It sounds good at first, but there’s a catch to it. You have to pay all costs up front."
        },
        {
            "id": 205,
            "phrase": "catch up (on someone or something)",
            "definition": "to learn the news of someone or something.  I need a little time to catch up on the news.  We all need to catch up on what Tony has been doing.  I need some time to catch up."
        },
        {
            "id": 206,
            "phrase": "catch up (on something)",
            "definition": "to bring one’s efforts with something up-to-date; to do the work that one should have done.  I need a quiet time so I can catch up on my work.  He started school late and now has to catch up."
        },
        {
            "id": 207,
            "phrase": "catch-as-catch-can",
            "definition": "the best one can do with whatever is available.  We went hitchhiking for a week and lived catch-as-catch-can.  There were ten children in our family, and every meal was catch-as-catch-can."
        },
        {
            "id": 208,
            "phrase": "cater to someone or something",
            "definition": "to provide for or care for someone or something.  I believe that we can cater to you in this matter. Our company caters to larger firms that do not wish to maintain a service department."
        },
        {
            "id": 209,
            "phrase": "caught short",
            "definition": "1. left without any money temporarily.  I’m caught a little short. Can I borrow a few bucks? 2. pregnant and unmarried.  Both of Jane’s sisters got caught short before they graduated high school."
        },
        {
            "id": 210,
            "phrase": "caught unaware(s)",
            "definition": "surprised and unprepared.  Sorry. You startled me when you came up behind me. I was caught unaware.  The clerk was caught unawares, and the robber emptied out the cash register before the clerk could sound the alarm."
        },
        {
            "id": 211,
            "phrase": "cause (some) tongues to wag",
            "definition": "to cause people to gossip; to give people something to gossip about.  The way John was looking at Mary will surely cause some tongues to wag.  The way Mary was so scantily dressed will also cause tongues to wag."
        },
        {
            "id": 212,
            "phrase": "cave in",
            "definition": "[for a roof or ceiling] to collapse. The roof of the mine caved in when no one was there.  The tunnel caved in on the train."
        },
        {
            "id": 213,
            "phrase": "cave in (to someone or something)",
            "definition": "to give in to someone or something.  Finally, the manager caved in to the customer’s demands.  I refuse to cave in under pressure from my opponent."
        },
        {
            "id": 214,
            "phrase": "cavil at someone",
            "definition": "to find fault with someone; to complain about someone constantly.  Will you never cease caviling at all of us? _ There is no need to cavil at me day and night!"
        },
        {
            "id": 215,
            "phrase": "cease and desist",
            "definition": "to completely stop doing something. (A legal phrase.) _The judge ordered the merchant to cease and desist the deceptive practices.  When they were ordered to cease and desist, they finally stopped."
        },
        {
            "id": 216,
            "phrase": "cede something to someone",
            "definition": "to grant a parcel of land to someone.  We refuse to cede that land to you.  They ceded the land to the city for a park."
        },
        {
            "id": 217,
            "phrase": "celebrate someone for an accomplishment",
            "definition": "to honor someone for having done something.  The people celebrated the astronaut for a successful journey. She was celebrated widely for her discovery."
        },
        {
            "id": 218,
            "phrase": "cement something together",
            "definition": "to fasten something together with glue or household cement. Use this stuff to cement the vase together.  Will you cement these parts together?"
        },
        {
            "id": 219,
            "phrase": "censure someone (for something)",
            "definition": "to criticize someone formally for having done something.  Please don’t censure us for doing our duty.  The legislature proposed to censure one of its members."
        },
        {
            "id": 220,
            "phrase": "center around someone or something",
            "definition": "to make someone or something the central point in something; to be based on someone or something.  Your salary increases center around your ability to succeed at your job.  The success of the picnic centers around the weather next week."
        },
        {
            "id": 221,
            "phrase": "the center of attention",
            "definition": "the focus of people’s attention; the thing or person who monopolizes people’s attention.  She had a way of making herself the center of attention wherever she went."
        },
        {
            "id": 222,
            "phrase": "center on someone or something",
            "definition": "to focus on someone or something in particular. Let us center on the basic problem and try to solve it.  I want to center on Liz and her contributions to the firm."
        },
        {
            "id": 223,
            "phrase": "center something on someone or something",
            "definition": "to base something on someone or something.  Let us center the discussion on Walter.  Our whole meeting was centered on the conservation question."
        },
        {
            "id": 224,
            "phrase": "a certain party",
            "definition": "someone you know but whom I do not wish to name.  I spoke to a certain party about the matter you mentioned. If a certain party finds out about youknow- what, what on earth will you do?"
        },
        {
            "id": 225,
            "phrase": "certain sure",
            "definition": "Rur. very sure.  Tom: Are you sure you saw Bill at work today? Mary: Certain sure. If you keep hanging around with them no-good kids, you’ll get in a heap of trouble for certain sure."
        },
        {
            "id": 226,
            "phrase": "chafe at something",
            "definition": "to be irritated or annoyed at something.  Jane chafed at the criticism for a long time afterward.  Jerry chafed for a while at what Ken had said."
        },
        {
            "id": 227,
            "phrase": "A chain is no stronger than its weakest link.",
            "definition": "Prov. A successful group or team relies on each member doing well.  George is completely out of shape. I don’t want him on our ball team; a chain is only as strong as its weakest link."
        },
        {
            "id": 228,
            "phrase": "the chain of command",
            "definition": "the series or sequence of holders of responsibility in a hierarchy.  The only way to get things done in the military is to follow the chain of command. Never try to go straight to the top."
        },
        {
            "id": 229,
            "phrase": "chain someone or an animal up†",
            "definition": "to bind someone or an animal in chains.  We will have to chain him up until the police get here.  Please chain up your dog."
        },
        {
            "id": 230,
            "phrase": "chain someone or something down†",
            "definition": "to fasten someone or something down with chains.  They chained down the bicycle rack so no one could steal it. We chained the toolshed down so a strong wind would not blow it over."
        },
        {
            "id": 231,
            "phrase": "chain something to something",
            "definition": "to connect things together with chains.  We chained all the bicycles to one another so no one could steal them. We will have to chain the lawn furniture to a tree if we leave it out while we are on vacation."
        },
        {
            "id": 232,
            "phrase": "chain something up†",
            "definition": "to lock or secure a door or gate with chains.  Please chain the gate up again when you come through.  Yes, chain up the gate."
        },
        {
            "id": 233,
            "phrase": "chalk something out†",
            "definition": "to draw a picture of something in chalk, especially to illustrate a plan of some type. The coach chalked the play out so the players could understand what they were to do.  Our team captain chalked out the play."
        },
        {
            "id": 234,
            "phrase": "chalk something up†",
            "definition": "to write something on a chalkboard.  Let me chalk this formula up so you all can see it.  I’ll chalk up the formula."
        },
        {
            "id": 235,
            "phrase": "chalk something up† (against someone)",
            "definition": "to blame someone for something; to register something against someone.  I will have to chalk another fault up against Fred.  She chalked up a mark against Dave."
        },
        {
            "id": 236,
            "phrase": "chalk something up† (to something)",
            "definition": "to recognize something as the cause of something else. We chalked her bad behavior up to her recent illness. I had to chalk up the loss to inexperience."
        },
        {
            "id": 237,
            "phrase": "challenge someone on something",
            "definition": "to dispute someone’s statement, remarks, or position.  I think Fred is wrong, but I won’t challenge him on his estimate."
        },
        {
            "id": 238,
            "phrase": "challenge someone to something",
            "definition": "to dare someone to do something; to invite someone to compete at something.  I challenge you to a round of golf.  Jerry challenged us to a debate of the issues."
        },
        {
            "id": 239,
            "phrase": "chance something",
            "definition": "to risk doing something; to try doing something while being aware of the risk involved.  I don’t usually ride horses, but this time I will chance it.  Bob didn’t have a ticket, but he went to the airport anyway, chancing a cancellation."
        },
        {
            "id": 240,
            "phrase": "chance (up)on someone or something",
            "definition": "to find someone or something by accident; to happen on someone or something. (Upon is formal and less commonly used than on.) _I chanced upon a nice little restaurant on my walk today.  I chanced on an old friend of yours in town today."
        },
        {
            "id": 241,
            "phrase": "chances are",
            "definition": "the likelihood is (followed by a clause stating what is likely). Chances are that she would have been late even if she had left on time."
        },
        {
            "id": 242,
            "phrase": "change back (from something)",
            "definition": "to return to the original form, state, or selection, from some other form, state, or selection. We are going to change back from our position of last month.  We didn’t like our new plumber, so we changed back."
        },
        {
            "id": 243,
            "phrase": "change back ((in)to someone or something)",
            "definition": "to return to the original form.  The crisis in Congress changed back to a minor matter within a week.  Then Superman changed back into mild-mannered Clark Kent."
        },
        {
            "id": 244,
            "phrase": "change hands",
            "definition": "[for something] to be sold or passed from owner to owner. (From the “point of view” of the object that is passed on.) _How many times has this lot changed hands in the last ten years? _ We built this house in 1970, and it has never changed hands."
        },
        {
            "id": 245,
            "phrase": "change into someone or something",
            "definition": "to alter one’s or its state to another state.  The ugly witch changed into a lovely maiden.  An insect larva changes into a cocoon."
        },
        {
            "id": 246,
            "phrase": "the change (of life)",
            "definition": "menopause.  The change of life affects each woman differently.  Jill started the change when she was forty-seven."
        },
        {
            "id": 247,
            "phrase": "a change of pace",
            "definition": "an addition of some variety in one’s life, routine, or abode.  Going to the beach on the weekend will be a change of pace.  The doctor says I need a change of pace from this cold climate."
        },
        {
            "id": 248,
            "phrase": "a change of scenery",
            "definition": "a move to a different place, where the surroundings are different.  I thought I would go to the country for a change of scenery.  A change of scenery would help me relax and organize my life."
        },
        {
            "id": 249,
            "phrase": "change off",
            "definition": "[for people] to alternate in doing something. Tom and I changed off so neither of us had to answer the phone all the time.  Let’s change off every 30 minutes."
        }
    ]
}