{
    "dictionary": [
        {
            "id": 0,
            "phrase": "*in tune with the times",
            "definition": "up-to-date; in fashion. (*Typically: be ~; get ~.) _Look at that old jacket, Bill. You’re not in tune with the times."
        },
        {
            "id": 1,
            "phrase": "in turn",
            "definition": "in the appropriate point in the series or order; when one’s turn comes.  Someone has to wash the dishes after every meal. All of us will have to do it in turn.  All three of them shared the task of carrying water in turn."
        },
        {
            "id": 2,
            "phrase": "in two shakes of a lamb’s tail",
            "definition": "in a very short time; very quickly. Jane returned in two shakes of a lamb’s tail.  Mike was able to solve the problem in two shakes of a lamb’s tail."
        },
        {
            "id": 3,
            "phrase": "in unison",
            "definition": "[of musical notes, instruments, or voices] having the same pitch.  This part of the piece is performed in unison.  The twins sang in unison."
        },
        {
            "id": 4,
            "phrase": "in use",
            "definition": "[of some facility or device] occupied or busy.  Sorry, this room is in use.  How long will it be in use?"
        },
        {
            "id": 5,
            "phrase": "in vain",
            "definition": "for no purpose; [done] as a failure.  They rushed her to the hospital, but they did it in vain.  We tried in vain to get her there on time."
        },
        {
            "id": 6,
            "phrase": "in view of something",
            "definition": "in consideration of something; because of something.  In view of the high cost of gasoline, I sold my car.  I won’t invite John to the meeting in view of his attitude."
        },
        {
            "id": 7,
            "phrase": "*in vogue",
            "definition": "fashionable; faddish. (*Typically: be ~; get ~.) _This style of coat is no longer in vogue. That word isn’t in vogue any longer."
        },
        {
            "id": 8,
            "phrase": "*in writing",
            "definition": "in written form rather that spoken. (*Typically: get something ~; have something ~; put something ~.) _ Be sure to get their salary offer in writing."
        },
        {
            "id": 9,
            "phrase": "inaugurate someone as something",
            "definition": "to install or introduce someone as something.  The club inaugurated Amy as the new president.  We will inaugurate Ken as vice president."
        },
        {
            "id": 10,
            "phrase": "incapacitate someone (for something) (for a period of time)",
            "definition": "to make someone physically unfit for [doing] something for a period of time.  The accident incapacitated Rick for further work for a year.  Sam’s carelessness incapacitated Frank for a month."
        },
        {
            "id": 11,
            "phrase": "incarcerate someone in something",
            "definition": "to imprison someone in something. The sheriff incarcerated Lefty in the county jail.  He had wanted to incarcerate Max in the jail too."
        },
        {
            "id": 12,
            "phrase": "inch along (something)",
            "definition": "to move slowly along something little by little.  The cat inched along the carpet toward the mouse.  Traffic was inching along."
        },
        {
            "id": 13,
            "phrase": "inch back",
            "definition": "to move back very slowly.  The trainer inched back from the angry tiger.  The tiger inched back and sprang."
        },
        {
            "id": 14,
            "phrase": "inch by inch",
            "definition": "one inch at a time; little by little. Traffic moved along inch by inch.  Inch by inch, the snail moved across the stone."
        },
        {
            "id": 15,
            "phrase": "inch forward",
            "definition": "to move forward very slowly.  Inch forward very slowly, and try not to make any noise.  The cat inched forward, taking care not to alert the bird to its presence."
        },
        {
            "id": 16,
            "phrase": "inch over",
            "definition": "to move over a tiny bit.  Could you inch over a little? I need just a little more room.  Please inch over a little."
        },
        {
            "id": 17,
            "phrase": "incite someone to something",
            "definition": "to excite or provoke someone to something. The radicals tried to incite the students to violence. The students were incited to violent behavior by the lecturer."
        },
        {
            "id": 18,
            "phrase": "incline away (from someone or something)",
            "definition": "to lean or slope away from someone or something. I inclined away from her to avoid her alcohol breath.  The land inclined away from the house."
        },
        {
            "id": 19,
            "phrase": "incline forward",
            "definition": "to lean forward; to slant forward. The earthquake-ravaged building inclined forward a little bit more and looked as if it was going to fall.  My chair inclined forward and I kept feeling as if I were going to fall off."
        },
        {
            "id": 20,
            "phrase": "incline something forward",
            "definition": "to lean something forward; to make something slant forward. Incline the light forward a little bit, so you can see better.  The fence had been inclined slightly forward to make it harder to climb."
        },
        {
            "id": 21,
            "phrase": "incline toward someone or something",
            "definition": "1. to lean or slant toward someone or something.  The piece of scenery inclined toward Roger very slowly and he jumped out of the way just in time.  The tree inclined toward the direction of the wind. 2. to favor or “lean” toward choosing someone or something. I don’t know which to choose. I incline toward Terri but I also favor Amy.  I’m inclining toward chocolate."
        },
        {
            "id": 22,
            "phrase": "inclined to do something",
            "definition": "to tend to do something; to lean toward doing something.  Tom is inclined to tell jokes when he is with a group of people.  I’m inclined to go to the beach tomorrow if it doesn’t rain."
        },
        {
            "id": 23,
            "phrase": "include someone in (something)",
            "definition": "to invite someone to participate in something. Let’s include Terri in the planning session.  Without asking, Henry included himself in the group going on a picnic."
        },
        {
            "id": 24,
            "phrase": "include someone or something among something",
            "definition": "to count someone or something as a member of a group or collection.  I am happy to include you among my friends.  Do you include chocolate among your favorite f lavors?"
        },
        {
            "id": 25,
            "phrase": "include someone out (of something)",
            "definition": "to exclude someone from something. (Jocular.) _ I’m not interested in your games. Include me out of them.  Include me out too."
        },
        {
            "id": 26,
            "phrase": "incorporate someone or something in(to) something",
            "definition": "to build someone or something into something; to combine someone or something into something.  We want to incorporate you into our sales force very soon. The prince had incorporated himself into the main governing body."
        },
        {
            "id": 27,
            "phrase": "increase by leaps and bounds",
            "definition": "to increase or grow by large increments. The price of our stock is increasing by leaps and bounds."
        },
        {
            "id": 28,
            "phrase": "increase in something",
            "definition": "to grow or expand in some quality. He increased in stature and wisdom. The tree increased in size every year."
        },
        {
            "id": 29,
            "phrase": "increase something by something",
            "definition": "to enlarge something by an amount or degree. They increased the size of the house by two hundred square feet.  The engine size on the new model has been increased by a small amount."
        },
        {
            "id": 30,
            "phrase": "increase something (from something) (to something)",
            "definition": "to enlarge something from something to something bigger; to enlarge something from one size to a larger size.  We plan to increase sales from four million to six million dollars.  I increased my bid to two thousand from one thousand."
        },
        {
            "id": 31,
            "phrase": "increment something by something",
            "definition": "to increase a sum by a supplement [of a certain figure].  Increment the numbering by ten so that 1, 2, 3 becomes 10, 20, 30.  The base number was incremented by 4."
        },
        {
            "id": 32,
            "phrase": "inculcate someone with something",
            "definition": "to touch or impress someone with some specific knowledge.  The teacher sought to inculcate the students with the knowledge they needed.  Her parents inculcated her with good manners."
        },
        {
            "id": 33,
            "phrase": "inculcate something in(to) someone",
            "definition": "to instill specific knowledge into someone; to teach something to someone so that it will be remembered. They inculcated good manners into their children all their lives.  We tried to inculcate good morals into our students."
        },
        {
            "id": 34,
            "phrase": "incumbent (up)on someone to do something",
            "definition": "obligatory for someone to do something.  It is incumbent upon me to inform you that you are up for review.  It was incumbent on Mary to mail her application before June 1st."
        },
        {
            "id": 35,
            "phrase": "indemnify someone or something against something",
            "definition": "to agree to protect someone or something against something, such as damage or a lawsuit.  Their employer indemnified them against legal action. We indemnified the publisher against legal trouble."
        },
        {
            "id": 36,
            "phrase": "indicate something to someone",
            "definition": "to signify something to someone. (By speech, writing, or some other sign.) _ Karen indicated her agreement to the lawyer.  Fred indicated his assent to me."
        },
        {
            "id": 37,
            "phrase": "indict someone for something",
            "definition": "[for a legal body] to arraign someone for a crime or name someone formally as the one accused of a crime. The grand jury indicted her for murder.  Then they indicted Max for grand larceny."
        },
        {
            "id": 38,
            "phrase": "indoctrinate someone into something",
            "definition": "to teach someone the ways of a group or some activity.  The staff sought to indoctrinate Walter into the ways of office procedure.  Todd indoctrinated Ken into camp life."
        },
        {
            "id": 39,
            "phrase": "indoctrinate someone with something",
            "definition": "to teach someone the official or fundamental knowledge about something. They indoctrinated all their spies with the importance of being loyal to the death. Ken indoctrinated Todd with revolutionary thinking."
        },
        {
            "id": 40,
            "phrase": "induce labor in someone",
            "definition": "to cause the onset of childbirth in a mother-to-be.  They decided to induce labor in the mother-to-be.  They decided not to induce labor in Alice."
        },
        {
            "id": 41,
            "phrase": "induct someone into something",
            "definition": "1. to conscript someone into the armed services; to bring a nonvolunteer into the armed services.  They inducted Wally into the army in a little ceremony. 2. to draft someone into something.  They inducted a number of new members into the group. 3. to install someone in an office or position.  They inducted her into the presidency.  The college inducted a new president into office last week."
        },
        {
            "id": 42,
            "phrase": "indulge in something",
            "definition": "1. to take pleasure in doing something; to do something habitually.  No, I don’t indulge in contact sports anymore. We don’t indulge in strenuous activity. 2. to choose to eat a certain food or drink something, usually alcohol.  I don’t usually indulge in hard spirits, but just this once.  I indulge in chocolate until I can’t hold any more."
        },
        {
            "id": 43,
            "phrase": "indulge someone with something",
            "definition": "to grant someone the favor or privilege of something.  Please indulge me with this one favor.  He always indulged himself with dinner at a nice restaurant when he went into town."
        },
        {
            "id": 44,
            "phrase": "*infatuated with someone or something",
            "definition": "to be in love with someone or something. (*Typically: be ~; become ~.) _ She is infatuated with John.  John is infatuated with chocolate ice cream."
        },
        {
            "id": 45,
            "phrase": "infect someone with something",
            "definition": "1. to transmit diseasecausing organisms to someone. (Someone includes oneself.) _ Please don’t infect me with your cold germs.  Somehow, she infected herself with the virus she was studying. 2. to affect someone with something, such as excitement, joy, desires, etc.  Her explosive laughter infected everyone with good spirits."
        },
        {
            "id": 46,
            "phrase": "infer something from something",
            "definition": "to reach a conclusion from something; to deduce facts from something, such as someone’s words, a situation, etc.  What can we infer from the experience we have just had? _You should not infer anything from Sue’s remarks."
        },
        {
            "id": 47,
            "phrase": "*infested with something",
            "definition": "to be contaminated with a swarm or throng of some pest. (*Typically: be ~; get ~.) _ All the campers are infested with lice.  The dog is infested with ticks."
        },
        {
            "id": 48,
            "phrase": "inflate something with something",
            "definition": "to fill up something with air or some other gas.  Jerry has to inf late all the balloons with helium.  Ken inf lated the balloons with gas."
        },
        {
            "id": 49,
            "phrase": "inflict someone (up)on someone",
            "definition": "to burden someone with the care or keeping of someone else. (Upon is formal and less commonly used than on.) _ Please don’t inf lict Bob upon me.  My brother inf licted his children on us for the weekend. Well, I certainly don’t want to inf lict myself on you for the weekend, but I do need a place to stay."
        },
        {
            "id": 50,
            "phrase": "inflict something (up)on someone or something",
            "definition": "to impose something, such as pain, a burden, a problem, etc., on someone or something. (Upon is formal and less commonly used than on.) _I hate to inf lict an additional burden upon you, but someone has to clean the oven.  Please don’t inf lict that on me."
        },
        {
            "id": 51,
            "phrase": "inform on someone",
            "definition": "to tell the authorities about someone; to tattle on someone.  I am going to have to inform on you.  Liz informed on Ken to their mother."
        },
        {
            "id": 52,
            "phrase": "inform someone about someone or something",
            "definition": "to tell someone about someone or something. How is my friend Tom getting on? I asked you to inform me about him from time to time.  Please inform me about the state of the contract for the book."
        },
        {
            "id": 53,
            "phrase": "inform someone of something",
            "definition": "to tell someone a fact.  Please inform Sally of my decision.  Sally has been informed of your decision."
        },
        {
            "id": 54,
            "phrase": "inform someone on someone",
            "definition": "to tattle (on someone) (to someone).  I will inform the teacher on you! _ Billy informed his mother on Bobby."
        },
        {
            "id": 55,
            "phrase": "infringe (up)on something",
            "definition": "to interfere with the rights of someone or with someone’s property rights; to encroach on something. (Upon is formal and less commonly used than on.) _You are infringing upon my right to free speech. I am not infringing on your property. I’m in my own yard."
        },
        {
            "id": 56,
            "phrase": "infuse someone with something",
            "definition": "to teach someone a body of knowledge or a perspective on a body of knowledge.  The schools sought to infuse the children with a sense of history.  Children should be infused with a respect for the rights of others."
        },
        {
            "id": 57,
            "phrase": "infuse something into someone",
            "definition": "to instill specific knowledge into a person; to teach someone something very well.  The boss infused a lot of company information into the new assistant before she took another job.  The teacher infused a lot of knowledge into the students in a short time."
        },
        {
            "id": 58,
            "phrase": "infuse something into something",
            "definition": "to mix something into something.  You should infuse this mixture into the tea.  The tea was infused into the water very slowly."
        },
        {
            "id": 59,
            "phrase": "infuse something with something",
            "definition": "to make something mix into some liquid.  He infused the mixture with a strong solution of soap.  The chemical mixture was infused with the other solution."
        },
        {
            "id": 60,
            "phrase": "ingratiate oneself into something",
            "definition": "to work hard to bring oneself into the favor of someone.  Oh, how he fawns over the guests! Isn’t it terrible the way he tries to ingratiate himself into their favor? _ You will never succeed in ingratiating yourself into my good graces."
        },
        {
            "id": 61,
            "phrase": "ingratiate oneself with someone",
            "definition": "to work oneself into someone’s favor.  Why do you have to ingratiate yourself with everyone? Don’t you know how to be just plain friends? _ She was very obvious in her effort to ingratiate herself with the boss."
        },
        {
            "id": 62,
            "phrase": "inherit something from someone",
            "definition": "1. to receive something from the estate of a person who has died.  I inherited this silver bowl from my aunt.  Liz inherited her house from her parents. 2. to receive a genetic or behavioral trait from a relative.  I inherited my stubbornness from my father’s side of the family.  My dark hair was inherited from my father."
        },
        {
            "id": 63,
            "phrase": "inhibit someone from doing something",
            "definition": "to keep someone from doing something. We will attempt to inhibit Karen from doing it, but we have no control over her.  A serious case of shyness inhibited Harry from participating in things."
        },
        {
            "id": 64,
            "phrase": "inhibit something from doing something",
            "definition": "to keep something from happening. We need to inhibit the weeds from further growth.  The weeds were inhibited from spreading by the application of a pesticide."
        },
        {
            "id": 65,
            "phrase": "initiate someone into something",
            "definition": "1. to induct someone into an organization or activity, usually in a ceremony. They will initiate me into the fraternity next week.  They initiated all their new members into the club at once. 2. to introduce someone to the activities associated with a job or other situation.  The personnel department will initiate you into our office routines. Our procedures are com- plicated and it takes weeks to initiate a new employee into all our procedures."
        },
        {
            "id": 66,
            "phrase": "inject something into something",
            "definition": "to squirt something, such as oil, water, etc., into something.  The pump injected the oil into the wheel bearings when I squeezed the lever.  The mechanic injected a solvent into the lock."
        },
        {
            "id": 67,
            "phrase": "ink something in†",
            "definition": "1. to fill in an outline with ink.  Please ink the drawing in with care. Ink in the drawing carefully. 2. to write something in ink.  Please ink your name in on the dotted line. Now, ink in your signature on this line right here."
        },
        {
            "id": 68,
            "phrase": "*an inkling (about someone or something)",
            "definition": "an idea about someone or something; a hint about the nature of someone or something. (*Typically: get ~; have ~; give someone ~.) _ I had an inkling about the problems that you were going to run into."
        },
        {
            "id": 69,
            "phrase": "*an inkling (of something)",
            "definition": "a hint about something that is to happen. (*Typically: get ~; have ~; give someone ~.) _ The speeches gave us an inkling of what we could expect from the new president."
        },
        {
            "id": 70,
            "phrase": "inlay something with something",
            "definition": "to decorate something by cutting in a design and filling the cut with some decorative substance.  The workers inlaid the tabletop with bits of polished seashell. The tabletop was inlaid with a lovely design."
        },
        {
            "id": 71,
            "phrase": "inoculate someone against something",
            "definition": "to immunize someone against a disease.  We need to inoculate all the children against whooping cough.  Have you been inoculated against measles?"
        },
        {
            "id": 72,
            "phrase": "inoculate someone with something",
            "definition": "to use a particular substance in immunizing someone against a disease.  Donna inoculated Richard and Nancy with yellow fever vaccine for their trip.  She also inoculated Sam with something to prevent malaria."
        },
        {
            "id": 73,
            "phrase": "inquire about someone or something",
            "definition": "to ask about someone or something.  I inquired about Tom and was told that he doesn’t live here anymore. You will have to inquire about that at the front desk."
        },
        {
            "id": 74,
            "phrase": "inquire after someone",
            "definition": "to ask about the well-being of someone. Jerry inquired after you when I saw him at the store today.  I will inquire after his wife the next time I see him. creature"
        },
        {
            "id": 75,
            "phrase": "inquire for someone",
            "definition": "to ask to see someone.  Mr. Franklin, there is a man out here inquiring for you. What shall I tell him? _ Who is inquiring for me?"
        },
        {
            "id": 76,
            "phrase": "inquire into something",
            "definition": "to look into something; to investigate something by asking questions.  I will inquire into your complaint. It sounds as if something is wrong.  We have not inquired into it yet."
        },
        {
            "id": 77,
            "phrase": "inquire something of someone",
            "definition": "to ask some information of someone.  I need to inquire something of you.  May I inquire something personal of you?"
        },
        {
            "id": 78,
            "phrase": "inquire within",
            "definition": "to ask questions of a person inside [some place, such as a store or office]. (Formula. On a sign posted outside.) _“Help wanted. Inquire within,” read the sign on the door.  If you want to apply, you must inquire within."
        },
        {
            "id": 79,
            "phrase": "the ins and outs (of something)",
            "definition": "the correct and successful way to do something; the special things that one needs to know to do something. I don’t understand the ins and outs of politics.  Jane knows the ins and outs of repairing computers."
        },
        {
            "id": 80,
            "phrase": "inscribe something into something",
            "definition": "to write or engrave a dedication on a gift to someone. (Emphasis is on the act of inscribing.) _ It was a lovely watch. I asked them to inscribe something into the back, so I could remember the occasion.  My initials were inscribed into the wristband."
        },
        {
            "id": 81,
            "phrase": "inscribe something on(to) something",
            "definition": "to write or engrave certain information on something. (Emphasis is on the message that is inscribed.) _ The jeweler inscribed Amy’s good wishes onto the watch.  I inscribed my name on my tools."
        },
        {
            "id": 82,
            "phrase": "inscribe something with something",
            "definition": "to engrave something with a message.  Could you please inscribe this trophy with the information on this sheet of paper? _ I inscribed the bracelet with her name."
        },
        {
            "id": 83,
            "phrase": "insert something between something and something else",
            "definition": "to put something in between things.  Insert this marker between pages ten and eleven.  A marker was inserted between the pages."
        },
        {
            "id": 84,
            "phrase": "insert something in(to) something",
            "definition": "to push or stick something into something.  Insert the card into the slot and pull the lever.  Insert the coins in the machine.  I need to insert another paragraph into this article."
        },
        {
            "id": 85,
            "phrase": "inside a week",
            "definition": "in less than a week. We must get all this sorted out inside a week; all right? _We’ve got inside a week to get it right."
        },
        {
            "id": 86,
            "phrase": "inside information",
            "definition": "information known only by those most involved with the issue; secret information relating to an organization. I have some inside information about the Smith Company."
        },
        {
            "id": 87,
            "phrase": "an inside job",
            "definition": "a crime committed by someone working or living at the scene of the crime.  There was little doubt that it was an inside job, thought the inspector. It’s a particularly cunning way to carry out an inside job."
        },
        {
            "id": 88,
            "phrase": "an inside joke",
            "definition": "a joke that only certain people understand; a joke understood only by people who know certain facts and context.  What you said must be an inside joke. It makes no sense to me."
        },
        {
            "id": 89,
            "phrase": "the inside story",
            "definition": "an explanation known only by those most involved with the issue. Well, I’ve heard the inside story, and it isn’t what you were told at all!"
        },
        {
            "id": 90,
            "phrase": "*the inside track",
            "definition": "an advantage (over someone) gained through special connections, special knowledge, or favoritism. (*Typically: get ~; have ~; give someone ~.) _ If I could get the inside track, I could win the contract. The boss likes me. Since I’ve got the inside track, I’ll probably be the new office manager."
        },
        {
            "id": 91,
            "phrase": "insinuate oneself into something",
            "definition": "to work oneself into a group or situation.  She had sought for years to insinuate herself into Terry’s organization.  Must you always insinuate yourself into my set of friends?"
        },
        {
            "id": 92,
            "phrase": "insinuate something to someone",
            "definition": "to hint at something to someone; to imply something to someone.  You think I am interested in you for your money! Is that what you are insinuating to me? _ I did not insinuate anything to you!"
        },
        {
            "id": 93,
            "phrase": "insist (up)on something",
            "definition": "to demand something. (Upon is formal and less commonly used than on.) _ I want you here now! We all insist upon it! _ I insist on it too."
        },
        {
            "id": 94,
            "phrase": "inspire someone with something",
            "definition": "to use something to inspire someone; to stimulate or encourage someone with something.  The president inspired us all with patriotic speeches.  She inspired us all with her story of heroism."
        },
        {
            "id": 95,
            "phrase": "inspire something in someone",
            "definition": "to stimulate a particular quality in someone. You do not particularly inspire trust in me.  She inspires fear in me."
        },
        {
            "id": 96,
            "phrase": "install someone as something",
            "definition": "to inaugurate or launch someone into the role of something. The board installed Jerry as the new parliamentarian. She installed herself as the boss of the kitchen and wouldn’t allow anyone else in."
        },
        {
            "id": 97,
            "phrase": "install something in someone or something",
            "definition": "to insert or build something into someone or something. We are going to install a trash compactor in our kitchen.  The doctors installed a pacemaker in Donald."
        },
        {
            "id": 98,
            "phrase": "instigate someone to do something",
            "definition": "to prompt someone to do something; to urge or cause someone to do something. Are you the one who instigated Terry to start all this trouble? _ Did you instigate the children to do this?"
        },
        {
            "id": 99,
            "phrase": "instill someone with something",
            "definition": "to imbue or impress someone with something.  Her story instilled us all with courage.  She instilled us with courage."
        },
        {
            "id": 100,
            "phrase": "instill something in(to) someone",
            "definition": "to impress something into someone’s mind.  You need to remember your manners. I want to instill that into you.  Good manners were instilled in me at home."
        },
        {
            "id": 101,
            "phrase": "instill something in(to) something",
            "definition": "to add something to a situation. The presence of the mayor instilled a legitimacy into the proceedings.  Sharon sought to instill a little levity in the meeting."
        },
        {
            "id": 102,
            "phrase": "institute something against someone or something",
            "definition": "to initiate something against someone or something.  The hospital decided to institute proceedings against her for failing to pay her bill. The prosecutor instituted a case against the county board."
        },
        {
            "id": 103,
            "phrase": "instruct someone in something",
            "definition": "to teach someone about something.  Amy will instruct you in the way to hang paper.  The manager instructed Ken in the best method of entering data into the computer."
        },
        {
            "id": 104,
            "phrase": "instrumental in doing something",
            "definition": "playing an important part in doing something.  John was instrumental in getting the contract to build the new building.  Our senator was instrumental in defeating the bill."
        },
        {
            "id": 105,
            "phrase": "insure against something",
            "definition": "to guard or protect against something.  You must insure against theft and fire.  I will insure against all risks."
        },
        {
            "id": 106,
            "phrase": "insure someone or something (against something) (for something)",
            "definition": "to provide insurance for someone or something against certain perils up to a certain amount of money.  I insured my wife against accidental death for $100,000. We insured the car for its current value against all losses."
        },
        {
            "id": 107,
            "phrase": "insure someone or something with something",
            "definition": "to provide insurance for someone or something from a specific company.  I insured Amy with a fine old insurance company.  We insured the car with Acme Insurance in Adamsville."
        },
        {
            "id": 108,
            "phrase": "integrate someone or something into something",
            "definition": "to combine someone or something into something; to work someone or something into something.  We sought to integrate Amy into the everyday affairs of the company. We sought to integrate the new family into the ways of the community."
        },
        {
            "id": 109,
            "phrase": "integrate someone with someone",
            "definition": "to mix people together; to unify people into one group. The new regional YMCA will help Hispanics integrate with others in our community.  They integrated themselves with the people already in attendance."
        },
        {
            "id": 110,
            "phrase": "integrate something with something",
            "definition": "to merge things together; to join things into one.  I want to integrate the accounting department with the auditing department to save a little money. They integrated your department with mine."
        },
        {
            "id": 111,
            "phrase": "intend something as something",
            "definition": "to mean something to serve as something.  We intend this money as a gift. Do not even think about paying it back.  This money is intended as a gift."
        },
        {
            "id": 112,
            "phrase": "intend something for someone or something",
            "definition": "to mean for someone or something to get something. I intended this one for you. I’m sorry I failed to give it to you in time.  Aunt Em intended this cake for the county fair, but you can have it instead."
        },
        {
            "id": 113,
            "phrase": "intent on doing something",
            "definition": "determined to do something.  The children were intent on making a snowman.  The prisoner was intent on escaping."
        },
        {
            "id": 114,
            "phrase": "inter someone in something",
            "definition": "to bury someone in something or in some place.  They chose to inter her in the family burial plot.  She was interred in the vault with the rest of the family."
        },
        {
            "id": 115,
            "phrase": "interact with someone",
            "definition": "to converse with and exchange ideas with someone.  In act two, I want Terri to interact with Amy a little more. They act as if they never even met each other.  The students will interact with one another in their study projects."
        },
        {
            "id": 116,
            "phrase": "interact with something",
            "definition": "to have a reciprocal action with something; to react with something. (Often refers to the negative consequences of interaction.) _ Will this drug interact with coffee? _This drug will not interact with your current medication."
        },
        {
            "id": 117,
            "phrase": "intercede (for someone) (with someone or something)",
            "definition": "to intervene on behalf of someone with someone or a group; to plead someone’s case with someone or a group. I will intercede for Charlotte with the council.  Tom interceded with Fred for Sharon, who was too shy to speak for herself."
        },
        {
            "id": 118,
            "phrase": "interchange someone with someone else",
            "definition": "to exchange one person for another.  I interchanged Sally with Roger for the honor of being first speaker.  Roger has been interchanged with Sally."
        },
        {
            "id": 119,
            "phrase": "interchange something with something",
            "definition": "to exchange one thing for another. Please interchange the orange one with the purple one.  The orange one has been interchanged with the red one."
        },
        {
            "id": 120,
            "phrase": "interest someone in someone or something",
            "definition": "to arouse the interest of someone in someone or something. Yes, I can recommend someone for you to hire. Could I interest you in Tom? He’s one of our best workers.  Can I interest you in checking out a book from the library?"
        },
        {
            "id": 121,
            "phrase": "interest someone in something",
            "definition": "to cause someone to wish to purchase something.  Could I interest you in something with a little more style to it? _ Can I interest you in some additional insurance on your life?"
        },
        {
            "id": 122,
            "phrase": "interface someone or something with someone or something",
            "definition": "to bring about a complex connection of people and things, in any combination. (Originally having to do with computers.) _ Let’s interface Walter with the staff from the main office.  I want to interface my data with Sam, who has some relevant statistics from prior years."
        },
        {
            "id": 123,
            "phrase": "interface with someone or something",
            "definition": "to develop a connection or interaction with someone or something. Call Walter and set up a meeting so we can interface with him. This computer is meant to interface with as many as five others just like it."
        },
        {
            "id": 124,
            "phrase": "interfere in something",
            "definition": "to meddle in something; to become involved in someone else’s business.  Don’t interfere in my business! _ Are you interfering in this matter again?"
        },
        {
            "id": 125,
            "phrase": "interfere with someone or something",
            "definition": "to meddle with something or someone’s affairs.  Please do not interfere with us.  Are you interfering with my project?"
        },
        {
            "id": 126,
            "phrase": "interject someone into something",
            "definition": "to force someone into something, usually into someone else’s business.  I am going to have to interject Fred into this matter before it gets out of hand.  I hate to interject myself into your affairs, but I have something to say."
        },
        {
            "id": 127,
            "phrase": "interject something into something",
            "definition": "to volunteer information or a comment into a conversation.  We can always count on Liz to interject something sensible into our discussions. At last, something sensible has been interjected into our discussions."
        },
        {
            "id": 128,
            "phrase": "interlace something with something",
            "definition": "to weave something into something else.  I will interlace some silver thread with the white yarn.  The manufacturer had interlaced a silver thread into the yarn."
        },
        {
            "id": 129,
            "phrase": "intermarry with someone",
            "definition": "[for members of a group] to marry into another group, race, or clan.  Our people don’t intermarry with people of that clan.  They do not intermarry with other groups on purpose."
        },
        {
            "id": 130,
            "phrase": "intermingle something with something",
            "definition": "to mingle or merge things with things. Don’t intermingle the U.S. mail with the interoffice mail.  The office mail had been intermingled with the regular mail!"
        },
        {
            "id": 131,
            "phrase": "intermingle with someone",
            "definition": "to mingle or merge with people.  The mugger intermingled with the people on the street and could not be recognized. Let’s intermingle with the guests."
        },
        {
            "id": 132,
            "phrase": "intern someone in something",
            "definition": "to detain or imprison a person in something.  The government interned the enemy prisoners in the camps for a few months. He was interned in a prison camp during the war."
        },
        {
            "id": 133,
            "phrase": "interpose someone or something between people or things",
            "definition": "to put someone or something between people or things, in any combination.  I do not wish to interpose Randy between the twins.  We will not interpose our own standards between these two warring factions."
        },
        {
            "id": 134,
            "phrase": "interpose something in(to) something",
            "definition": "to introduce something into something; to put a question into a conversation.  The chairman interposed a question into the discussion.  May I interpose an observation in the proceedings?"
        },
        {
            "id": 135,
            "phrase": "interpret for someone",
            "definition": "to translate speech in a foreign language for someone. (Interpreting is done in real time.) _ Nina interpreted for Michael, since he understood very little Russian.  Is there someone who can interpret for me?"
        },
        {
            "id": 136,
            "phrase": "interpret something as something",
            "definition": "to assume that something means something. Don’t interpret what I just said as criticism.  It will be interpreted as criticism no matter what you say."
        },
        {
            "id": 137,
            "phrase": "interpret something for someone",
            "definition": "1. to translate a foreign language for someone. (Interpreting is done in real time.) _ Could you interpret the ambassador’s address for me? _ Nina interpreted the director’s greetings for the visitors. 2. to explain something unclear to someone. Let me interpret the instructions for you. The instructions have been interpreted for me by the manager."
        },
        {
            "id": 138,
            "phrase": "intersperse something among something",
            "definition": "to place something among things at random.  We interspersed a few chocolate doughnuts among all the plain ones. Some chocolate ones had been interspersed among the plain ones."
        },
        {
            "id": 139,
            "phrase": "intersperse something between something",
            "definition": "to place things between other things, perhaps regularly or in a pattern.  We interspersed an onion plant between each pair of plants.  Onions had been interspersed between every two marigold plants."
        },
        {
            "id": 140,
            "phrase": "intersperse something throughout something",
            "definition": "to put things throughout something.  He interspersed recommendations for a better life throughout the book.  Good advice had been interspersed throughout the book."
        },
        {
            "id": 141,
            "phrase": "intersperse something with something",
            "definition": "to provide or bestow something with something.  You should intersperse some red f lowers with the orange ones.  The book was interspersed with good advice."
        },
        {
            "id": 142,
            "phrase": "intertwine something with something",
            "definition": "to mingle or twist something together with something else.  She intertwined the f lowers with the sprigs of greenery, making a lovely wreath.  The f lowers were intertwined with sprigs of greenery."
        },
        {
            "id": 143,
            "phrase": "intertwine with something",
            "definition": "to twist together with something else.  The vines intertwined with the ropes and cables that had once held the beached raft together.  The cables from the two cranes intertwined with each other, causing a serious accident."
        },
        {
            "id": 144,
            "phrase": "intervene between someone and someone else",
            "definition": "to intercede between someone and someone else.  I decided to intervene between Ralph and his brother, who were arguing endlessly.  There was no point in intervening between Bill and Bob."
        },
        {
            "id": 145,
            "phrase": "intervene in something",
            "definition": "to get involved in something.  I will have to intervene in this matter. It’s getting out of hand. I want to intervene in this before it becomes a major problem."
        },
        {
            "id": 146,
            "phrase": "intervene with someone or something",
            "definition": "to step into a matter concerning someone or something.  Megan said she would intervene with the bank manager on our behalf.  Do I need to intervene with this process?"
        },
        {
            "id": 147,
            "phrase": "interview someone for something",
            "definition": "[for an employer] to discuss employment in a particular job with a person seeking employment. We will interview her for the manager’s job.  We will interview the rest of them for the position tomorrow."
        },
        {
            "id": 148,
            "phrase": "interview with someone for something",
            "definition": "[for a person seeking employment] to discuss employment in a particular job with an employer.  She interviewed with the civic opera company for a job in the business department.  I interviewed with Roger for the job."
        },
        {
            "id": 149,
            "phrase": "intimate apparel",
            "definition": "Euph. women’s underwear.  “You’ll find bras and body shapers in the intimate apparel,” said the salesclerk at the department store.  The catalog features intimate apparel for the grande dame."
        },
        {
            "id": 150,
            "phrase": "intimate something to someone",
            "definition": "to suggest or imply something to someone.  What are you intimating to me? _ I intimated nothing at all to you."
        },
        {
            "id": 151,
            "phrase": "*intimate with someone",
            "definition": "Euph. having sexual intercourse with someone. (*Typically: be ~; get ~.) _ He had never been intimate with a woman before.  They were intimate with each other for the first time that night."
        },
        {
            "id": 152,
            "phrase": "intimidate someone into something",
            "definition": "to threaten or frighten someone into doing something.  Do you think you can intimidate me into working for you? _ We weren’t intimidated into doing it."
        },
        {
            "id": 153,
            "phrase": "intimidate someone with something",
            "definition": "to threaten or frighten someone with something.  Please don’t try to intimidate me with your silly threats! _ We hadn’t been intimidated with their threats."
        },
        {
            "id": 154,
            "phrase": "in(to) a jam",
            "definition": "in(to) a difficult situation. Mary cannot keep track of the many times Dave got himself into a jam. I found myself in a jam when my car overheated on the highway."
        },
        {
            "id": 155,
            "phrase": "into being",
            "definition": "into existence.  The new law brought more problems into being. That idea came into being centuries ago."
        },
        {
            "id": 156,
            "phrase": "in(to) someone’s clutches",
            "definition": "in the control of someone who has power or authority over someone else.  Snow White fell into the clutches of the evil witch.  Once you’re in my clutches, I’ll ruin you."
        },
        {
            "id": 157,
            "phrase": "intoxicate someone with someone or something",
            "definition": "to enthrall or entrance someone with someone or something.  _She intoxicated him with her smiling eyes.  The king intoxicated the dignitaries with his beautiful daughter, whom he offered in marriage to the bravest of them all."
        },
        {
            "id": 158,
            "phrase": "intoxicate someone with something",
            "definition": "to make someone drunk with alcohol.  I think that the plaintiff set out to intoxicate the defendant with liquor and then fake a crime.  Jed set out to intoxicate Max with gin and then rob him.  Alice intoxicated herself with too much whiskey."
        },
        {
            "id": 159,
            "phrase": "intrigue someone with someone or something",
            "definition": "to fascinate someone with someone or something. Walter intrigued the baby with his keys and funny faces. The king intrigued the guests with a seductive dancer who had trained in the Far East."
        },
        {
            "id": 160,
            "phrase": "intrigue (with someone) (against someone)",
            "definition": "to conspire with someone against someone.  You are guilty of intriguing with an enemy against the government.  I did not intrigue against anyone."
        },
        {
            "id": 161,
            "phrase": "introduce someone into something",
            "definition": "to bring someone into something; to launch someone into something.  Tony introduced Wally into his club.  You do not wish me to introduce myself into local social life, do you?"
        },
        {
            "id": 162,
            "phrase": "introduce someone to someone",
            "definition": "to make someone acquainted with someone else. I would like to introduce you to my cousin, Rudolph. Allow me to introduce myself to you."
        },
        {
            "id": 163,
            "phrase": "introduce something into something",
            "definition": "to bring something into something or some place; to bring something into something as an innovation.  The decorator introduced a little bit of bright red into the conference room.  After I introduced the new procedures into the factory, production increased enormously."
        },
        {
            "id": 164,
            "phrase": "intrude into something",
            "definition": "to get involved in something that is someone else’s business.  I don’t want to intrude into your affairs, but I see that you’re short of money.  Please don’t intrude into this matter."
        },
        {
            "id": 165,
            "phrase": "intrude oneself into something",
            "definition": "to work oneself into some matter that is someone else’s business.  I hate to intrude myself into your conversation, but don’t I know you? _ Please do not intrude yourself into this matter."
        },
        {
            "id": 166,
            "phrase": "intrude (up)on someone or something",
            "definition": "to encroach on someone or something or matters that concern only someone or something. (Upon is formal and less commonly used than on.) _ I didn’t mean to intrude upon you.  Please don’t intrude on our meeting. Please wait outside."
        },
        {
            "id": 167,
            "phrase": "inundate someone or something with something",
            "definition": "to flood someone or something with fluid. The river inundated the fields with three feet of water. The storm inundated us with heavy rain."
        },
        {
            "id": 168,
            "phrase": "inure someone or something to something",
            "definition": "to accustom someone to someone or something.  We wanted to inure you to this kind of problem, but here it is and you must face it. The coach inured the team to the thought of losing. She had long ago inured herself to criticism of this type."
        },
        {
            "id": 169,
            "phrase": "invasion of (someone’s) privacy",
            "definition": "an intrusion that results in the loss of someone’s privacy.  Your invasion of my privacy is not welcome! _ The athlete complained about the invasion of his privacy by the press."
        },
        {
            "id": 170,
            "phrase": "inveigh against someone or something",
            "definition": "to attack someone or something verbally.  Why must you always inveigh against Dan whenever I mention his name? _Stop inveighing against the government all the time."
        },
        {
            "id": 171,
            "phrase": "inveigle someone into something",
            "definition": "to coax or trick someone into doing something.  We tried to inveigle her into attending, but she caught on to us.  I was inveigled into doing it."
        },
        {
            "id": 172,
            "phrase": "inveigle someone out of something",
            "definition": "to deceive someone into giving something up.  Are you trying to inveigle me out of my money? _ I was inveigled out of my money by a common thief."
        },
        {
            "id": 173,
            "phrase": "inveigle something out of someone",
            "definition": "to get something away from someone, usually by deception or persuasion.  They inveigled a large donation out of Mrs. Smith.  The crooks tried to inveigle a fortune out of the old lady."
        },
        {
            "id": 174,
            "phrase": "invest in someone or something",
            "definition": "to put resources into someone or something in hopes of increasing the value of the person or thing. (The emphasis is on the act of investing.) _We invested in Tom, and we have every right to expect a lot from him.  She invested in junk bonds heavily."
        },
        {
            "id": 175,
            "phrase": "invest someone’s time in something",
            "definition": "to put one’s time, effort, or energy into a project.  Mary invests her time in charity work.  I invested five weeks of my time building this model ship."
        },
        {
            "id": 176,
            "phrase": "invest someone with something",
            "definition": "to endow someone with something, such as power or privilege. The constitution invests the vice president with the authority to act on the president’s behalf in certain conditions.  The state has invested me with the authority to unite this couple in marriage."
        },
        {
            "id": 177,
            "phrase": "invest something in someone or something",
            "definition": "1. to put money, time, effort, etc., into someone or something, hoping for a return. We will invest time and effort in Fred and make him into a recording star. Sharon invested a lot of money in the stock market. 2. to place power or authority under control of someone or something. The constitution has invested certain powers in the federal government and left the rest to the states.  The law invests the power to arrest criminals in the sheriff ’s department."
        },
        {
            "id": 178,
            "phrase": "invite someone out†",
            "definition": "to ask someone out on a date.  I would love to invite you out sometime. If I did, would you go? _ Has he ever invited out a girl on a date?"
        },
        {
            "id": 179,
            "phrase": "invite someone over† (for something)",
            "definition": "to bid or request someone to come to one’s house for something, such as a meal, party, chat, cards, etc.  Let’s invite Tony and Nick over for dinner.  Let’s invite over some new people."
        },
        {
            "id": 180,
            "phrase": "invite someone to something",
            "definition": "to bid or request someone to come to an event.  Shall we invite Sally to the party? _ I didn’t invite her. She invited herself to this affair."
        },
        {
            "id": 181,
            "phrase": "invoke something (up)on someone or something",
            "definition": "to call something, such as judgment, power, wrath of God, etc., to deal with someone or something. (Upon is formal and less commonly used than on.) _ The duke invoked the wrath of God upon his enemies—to no avail.  Walter invoked divine assistance on the proceedings, which weren’t going very well."
        },
        {
            "id": 182,
            "phrase": "involve someone in something",
            "definition": "to draw someone into a matter or problem.  Please don’t involve me in this mess.  I do not wish to involve myself in Alice’s business. I didn’t want to involve you in the problem we are having with the police."
        },
        {
            "id": 183,
            "phrase": "involve someone with someone or something",
            "definition": "1. to cause someone to associate with someone or something.  Don’t try to involve me with John. I can’t stand him.  We will try to involve all the teachers with the new association.  I will not involve myself with such goings-on. 2. to connect someone or someone’s name to activity (often wrongdoing) associated with someone or something.  Don’t try to involve Amy with the crime. She is innocent.  We involved the committee with the intense lobbying effort, and everyone began to see the extent of its inf luence."
        },
        {
            "id": 184,
            "phrase": "*involved (with someone)",
            "definition": "1. associated with someone romantically. (*Typically: be ~; get ~.) _ Sally is getting involved with Bill. They’ve been seeing a lot of each other.  I hope they don’t get too involved with each other. 2. having established a romantic association with something. (*Typically: be ~; get ~.) _Bill is involved with Jane, and it’s looking serious. Mary is very much involved with Tom."
        },
        {
            "id": 185,
            "phrase": "*involved with something",
            "definition": "established in an association with something or some organization. (*Typically: be ~; get ~; become ~.) _ Bill got involved with a volunteer organization.  Mary is very much involved with her club activities."
        },
        {
            "id": 186,
            "phrase": "iron something out†",
            "definition": "to use a flatiron to make cloth flat or smooth.  I will iron the drapes out, so they will hang together.  I ironed out the drapes."
        },
        {
            "id": 187,
            "phrase": "(Is) anything going on?",
            "definition": "Inf. Is there anything exciting or interesting happening here? _Andrew: Hey, man! Anything going on? Henry: No. This place is dull as can be.  Bob: Come in, Tom. Tom: Is anything going on? Bob: No. You’ve come on a very ordinary day."
        },
        {
            "id": 188,
            "phrase": "(Is) everything okay?",
            "definition": "Inf. How are you?; How are things? _ John: Hi, Mary. Is everything okay? Mary: Sure. What about you? John: I’m okay.  Waiter: Is everything okay? Bill: Yes, it’s fine."
        },
        {
            "id": 189,
            "phrase": "(Is it) cold enough for you?",
            "definition": "Inf. a greeting inquiry made during very cold weather.  Bob: Hi, Bill! Is it cold enough for you? Bill: It’s unbelievable! _ John: Glad to see you. Is it cold enough for you? Bill: Oh, yes! This is awful!"
        },
        {
            "id": 190,
            "phrase": "(Is it) hot enough for you?",
            "definition": "Inf. a greeting inquiry made during very hot weather.  Bob: Hi, Bill! Is it hot enough for you? Bill: Yup.  John: Nice to see you here! Is it hot enough for you? Bill: Good grief, yes! This is awful!"
        },
        {
            "id": 191,
            "phrase": "Is there any truth to something?",
            "definition": "Is something true?; Is what I have heard true? (no truth to in the negative.) _ Is there any truth to the gossip that Harry is leaving school? _ No, there is no truth to that at all."
        },
        {
            "id": 192,
            "phrase": "(Is) this (seat) taken?",
            "definition": "an inquiry made by a person in a theater, auditorium, etc., asking someone already seated whether an adjacent seat is available or already taken.  Finally, Bill came to a row where there was an empty seat. Bill leaned over to the person sitting beside the empty seat and whispered, “Is this seat taken?” _Fred: ’Scuse me. This taken? Alice: No. Help yourself."
        },
        {
            "id": 193,
            "phrase": "isolate someone or something from someone or something",
            "definition": "to keep people or things separated from one another, in any combination. They isolated everyone from Sam, who was ill with malaria. We isolated the children from the source of the disease."
        },
        {
            "id": 194,
            "phrase": "issue a call for something",
            "definition": "to make a public invitation or request for something.  The prime minister issued a call for peace.  The person who organized the writing contest issued a call for entries."
        },
        {
            "id": 195,
            "phrase": "issue (forth) from some place",
            "definition": "to go out or come out of a place.  The news releases issued forth from the pressroom on a regular basis.  Clear water issued from the side of the hill."
        },
        {
            "id": 196,
            "phrase": "issue from something",
            "definition": "to come out or flow out of something. A delicious perfume issued from Sally’s hair as she passed. A wonderful aroma issued from the kitchen as the bread baked."
        },
        {
            "id": 197,
            "phrase": "issue someone with something",
            "definition": "to provide someone with something; to distribute something to someone.  We issued them with the clothes they needed for the trip.  Everyone was issued with supplies."
        },
        {
            "id": 198,
            "phrase": "issue something as something",
            "definition": "to release or send out something as something.  They issued this month’s magazine as a special double issue. The publisher issued this month’s magazine as the very last one."
        },
        {
            "id": 199,
            "phrase": "issue something to someone",
            "definition": "to distribute or dispense something to someone.  The front office issued new assignments to everyone today.  New keys were issued to everyone."
        },
        {
            "id": 200,
            "phrase": "It ain’t fittin’.",
            "definition": "Rur. It is not right; It is inappropriate.  It ain’t fittin’ for the bridegroom to see his bride before the ceremony.  Young folks shouldn’t talk back to their elders. It ain’t fittin’."
        },
        {
            "id": 201,
            "phrase": "it behooves one to do something",
            "definition": "Cliché it is necessary for one to do something; it is incumbent (up)on someone to do something.  It behooves me to report the crime.  It behooves you to pay for the window that you broke."
        },
        {
            "id": 202,
            "phrase": "It blows my mind!",
            "definition": "Sl. It really amazes and shocks me.  Bill: Did you hear about Tom’s winning the lottery? Sue: Yes, it blows my mind! _ John: Look at all that paper! What a waste of trees! Jane: It blows my mind!"
        },
        {
            "id": 203,
            "phrase": "It cuts two ways.",
            "definition": "Inf. There are two sides to the situation.  You have to help, too. It cuts two ways.  It cuts two ways, you know. It can’t always all be my fault."
        },
        {
            "id": 204,
            "phrase": "(It) don’t bother me none.",
            "definition": "Inf. It does not affect me one way or the other.; It doesn’t bother me any. (Familiar and ungrammatical. Sometimes used for effect.) _ John: Mind if I sit here? Bob: It don’t bother me none.  Mary: Can I smoke? Bill: Don’t bother me none."
        },
        {
            "id": 205,
            "phrase": "It figures.",
            "definition": "It makes sense.; It confirms what one might have guessed.; I’m not surprised.  Bob: Tom was the one who broke the window. Bill: It figures. He’s very careless.  Ann: Mary was the last one to arrive. Sally: It figures. She’s always late."
        },
        {
            "id": 206,
            "phrase": "It has someone’s name on it.",
            "definition": "It belongs to someone.; It is meant for someone. A: Is that an extra piece of cake? B: Yes, and it has your name on it."
        },
        {
            "id": 207,
            "phrase": "It is a long lane that has no turning.",
            "definition": "Prov. Bad times cannot continue forever.; Things will soon improve.  Nancy: It’s been six months, and neither one of us can find work. I’m afraid we’re going to lose everything. Bill: Don’t despair, honey. It is a long lane that has no turning. Your luck has been bad for a long time, but it is a long lane that has no turning. I’m sure things will change soon."
        },
        {
            "id": 208,
            "phrase": "It is a wise child that knows its own father.",
            "definition": "Prov. You can never have certain proof that a certain man is your father. (Implies that the child in question might be illegitimate.) _ It is a wise child that knows its own father, but Emily is so much like her dad that there’s very little uncertainty."
        },
        {
            "id": 209,
            "phrase": "It is better to be born lucky than rich.",
            "definition": "Prov. If you are born rich, you may lose your money, but if you are born lucky, you will always get what you need or want just by chance.  Maybe your family doesn’t have a lot of money, but you are lucky, you know. And it’s better to be born lucky than rich."
        },
        {
            "id": 210,
            "phrase": "It is better to travel hopefully than to arrive.",
            "definition": "Prov. You should enjoy the process of doing something, rather than anticipate the result of doing it.  Bill: I can’t wait till I get my high school diploma. Fred: You should concentrate on enjoying high school instead. It is better to travel hopefully than to arrive."
        },
        {
            "id": 211,
            "phrase": "It is better to wear out than to rust out.",
            "definition": "Prov. It is better to work until you die than to be idle just because you are old.  Nancy: Grandma, you shouldn’t work so hard. You’re not young anymore, you know. Grandmother: Thanks for your concern, dear, but I plan to keep working. It’s better to wear out than to rust out.  Bill: You really ought to relax. I’m afraid you’ll kill yourself with too much work. Nancy: So what? It’s better to wear out than to rust out."
        },
        {
            "id": 212,
            "phrase": "It is easier to tear down than to build up.",
            "definition": "Prov. Destroying things is easier than building them. Jill: That poor politician—he served honestly and well for all those years and now his career is ruined by one little scandal. Jane: It is easier to tear down than to build up."
        },
        {
            "id": 213,
            "phrase": "It is easy to be wise after the event.",
            "definition": "Prov. After you see the consequences of a decision, it is easy to tell if the decision was good, but it is also too late, since the consequences have already happened. Jill: I should never have invited Aunt Betsy to stay with me; I haven’t had a peaceful moment since she got here. Jane: Well, it’s easy to be wise after the event."
        },
        {
            "id": 214,
            "phrase": "It is never too late to mend.",
            "definition": "Prov. It is never too late to apologize for something you have done or try to repair something you have done wrong.  Sue: I still miss Tony, but it’s been a year since our big fight and we haven’t spoken to each other since. Mother: Well, it’s never too late to mend; why don’t you call him up and apologize?"
        },
        {
            "id": 215,
            "phrase": "It is not work that kills, but worry.",
            "definition": "Prov. Working hard will not hurt you, but worrying too much is bad for your health.  Nancy: You’ve been working so many hours every day, I’m afraid you’ll get sick. Bill: It’s not work that kills, but worry."
        },
        {
            "id": 216,
            "phrase": "It is the pace that kills.",
            "definition": "Prov. Trying to do too much too fast is bad for you.  Nancy: I hate college. Bill: Why? Is the subject material too difficult? Nancy: No, they just expect me to learn too much of it too fast. It is the pace that kills."
        },
        {
            "id": 217,
            "phrase": "It isn’t worth it.",
            "definition": "1. Its value does not justify the action you propose. Mary: Should I write a letter in support of your request? Sue: No, don’t bother. It isn’t worth it. John: Do you suppose we should report that man to the police? Jane: No, it isn’t worth it. 2. Its importance does not justify the concern you are showing.  Tom: I’m so sorry about your roses all dying. Mary: Not to worry. It isn’t worth it. They were sort of sickly anyway.  John: Should I have this coat cleaned? The stain isn’t coming out. Sue: It isn’t worth it. I only wear it when I shovel snow anyway."
        },
        {
            "id": 218,
            "phrase": "It isn’t worth the trouble.",
            "definition": "Don’t bother. It isn’t worth it.  Tom: Shall I wrap all this stuff back up? Mary: No. It’s not worth the trouble. Just stuff it in a paper bag. Jane: Do you want me to try to save this little bit of cake? John: Oh, no! It’s not worth the trouble. I’ll just eat it."
        },
        {
            "id": 219,
            "phrase": "(It) just goes to show (you) (something).",
            "definition": "That incident or story has an important moral or message.  Tom: The tax people finally caught up with Henry. Sally: See! It just goes to show. Angry at the young grocery clerk, Sally muttered, “Young people. They expect too much. It just goes to show you how society has broken down.”"
        },
        {
            "id": 220,
            "phrase": "(It) (just) goes without saying.",
            "definition": "Cliché [something] is so obvious that it need not be said.  It goes without saying that you are to wear formal clothing to the White House dinner.  Of course you must be on time. That goes without saying."
        },
        {
            "id": 221,
            "phrase": "It never rains but it pours.",
            "definition": "Prov. Good (or bad) things do not just happen a few at a time, but in large numbers all at once.  Fred: I can’t believe this. This morning I had a f lat tire. When I went to the garage to get the tire patched, I discovered I didn’t have any money, and I couldn’t even charge it because my credit card’s expired. Jane: It never rains but it pours."
        },
        {
            "id": 222,
            "phrase": "It (only) stands to reason.",
            "definition": "It is only reasonable to hold a certain opinion.  It stands to reason that most people will not buy a new car if they don’t think they can pay for it.  I think he will come back to pick up his check. It only stands to reason."
        },
        {
            "id": 223,
            "phrase": "(It) (really) doesn’t matter to me.",
            "definition": "I do not care.  Andrew: What shall I do? What shall I do? Alice: Do whatever you like. Jump off a bridge. Go live in the jungle. It really doesn’t matter to me.  Tom: I’m leaving you. Mary and I have decided that we’re in love. Sue: So, go ahead. It doesn’t matter to me. I don’t care what you do."
        },
        {
            "id": 224,
            "phrase": "It’s a (dead) cinch.",
            "definition": "It’s a very easy task. (Dead means absolutely.) _ Tom: Did you figure out how to change the tire? Jane: Yep! It was a cinch.  Altering clothes patterns is difficult for me, but for Mary, it’s a dead cinch."
        },
        {
            "id": 225,
            "phrase": "It’s a deal.",
            "definition": "Okay.; It is agreed.  You want to sell me your stereo for $100? It’s a deal. Bill: Let’s go to dinner together tonight. Mary: It’s a deal."
        },
        {
            "id": 226,
            "phrase": "It’s a jungle out there.",
            "definition": "The real world is severe.; It’s hard to get by in everyday life.  A: Gee, people are so rude in this town. B: Yup, it’s a jungle out there."
        },
        {
            "id": 227,
            "phrase": "It’s a snap.",
            "definition": "Inf. It’s really easy to do.  Nothing to it. It’s a snap. A baby could do it."
        },
        {
            "id": 228,
            "phrase": "It’s a toss-up.",
            "definition": "Inf. It’s hard to tell the winner, and it could be won by either player or either team.  The game’s almost over, and it’s a toss-up."
        },
        {
            "id": 229,
            "phrase": "It’s about time!",
            "definition": "Inf. It is almost too late!; I’ve been waiting a long time! (Said with impatience.) _ So you finally got here! It’s about time! _They finally paid me my money. It’s about time!"
        },
        {
            "id": 230,
            "phrase": "It’s all over but the shouting.",
            "definition": "Cliché It is decided and concluded.; It is essentially decided and finished. (Meaning that though there may be more to some process, the outcome is clear. An elaboration of all over, which means “finished.”) _ The last goal was made with only 4 seconds to go in the game. “Well, it’s all over but the shouting,” said the coach. Tom worked hard in college and passed his last test with an A. When he saw the grade, he said, “It’s all over but the shouting.”"
        },
        {
            "id": 231,
            "phrase": "It’s an ill bird that fouls its own nest.",
            "definition": "Prov. Only a foolish or dishonorable person would bring dishonor to his or her self or his or her surroundings.; Only a bad person would ruin the place where he or she lives.  I don’t like my new neighbor. Not only does he never mow his lawn, he covers it with all kinds of trash. It’s an ill bird that fouls its own nest."
        },
        {
            "id": 232,
            "phrase": "It’s an ill wind that blows nobody (any) good.",
            "definition": "Prov. Even misfortune can benefit someone or something.; A calamity for one person usually benefits somebody else. The tremendous hailstorm left gaping holes in most of the roofs in town, so many families were homeless. The roofing companies, however, made plenty of money fixing those holes. It’s an ill wind that blows nobody any good."
        },
        {
            "id": 233,
            "phrase": "It’s anybody’s guess",
            "definition": "No one knows, so anyone’s guess is as good as anyone else’s.  A: When will the messenger be here? B: It’s anybody’s guess."
        },
        {
            "id": 234,
            "phrase": "It ’s been.",
            "definition": "Inf. a phrase said on leaving a party or other gathering. (A shortening of It’s been lovely or some similar expression.) _ Mary: Well, it’s been. We really have to go, though. Andy: So glad you could come over. Bye.  Fred: Bye, you guys. See you. Sally: It’s been. Really it has. Toodle-oo."
        },
        {
            "id": 235,
            "phrase": "It ’s been a slice!",
            "definition": "Sl. It’s been good.  Good-bye and thank you. It’s been a slice! _ It’s been a slice. I hope to see you again some day."
        },
        {
            "id": 236,
            "phrase": "(It’s) better than nothing.",
            "definition": "Having something that is not satisfactory is better than having nothing at all.  John: How do you like your dinner? Jane: It’s better than nothing. John: That bad, huh? _ John: Did you see your room? How do you like it? Jane: Well, I guess it’s better than nothing."
        },
        {
            "id": 237,
            "phrase": "It ’s for a fact.",
            "definition": "Rur. It is true.  Charlie: I can’t believe that Bill’s selling his house. Tom: It’s for a fact! _ It’s for a fact that chocolate is poison to cats."
        },
        {
            "id": 238,
            "phrase": "It’s for you.",
            "definition": "This telephone call is for you. Henry: Hello? Fred: Hello. Is Bill there? Henry: Hey, Bill! It’s for you. Bill: Thanks. Hello? _“It’s for you,” said Mary, handing the telephone receiver to Sally."
        },
        {
            "id": 239,
            "phrase": "(It ’s) good to hear your voice.",
            "definition": "a polite phrase said upon beginning or ending a telephone conversation.  Bob: Hello? Bill: Hello, it’s Bill. Bob: Hello, Bill. It’s good to hear your voice.  Bill: Hello, Tom. This is Bill. Tom: Hi, Bill. It’s good to hear your voice. What’s cooking?"
        },
        {
            "id": 240,
            "phrase": "(It ’s) good to see you (again).",
            "definition": "a polite phrase said when greeting someone whom one has met before. Bill: Hi, Bob. Remember me? I met you last week at the Wilsons’. Bob: Oh, hello, Bill. Good to see you again. Fred: Hi. Good to see you again! Bob: Nice to see you, Fred."
        },
        {
            "id": 241,
            "phrase": "it’s high time",
            "definition": "Rur. it is about the right time for something. It’s high time we were leaving. It’s high time you started thinking about saving for your old age."
        },
        {
            "id": 242,
            "phrase": "It’s ill waiting for dead men’s shoes.",
            "definition": "Prov. You should not be eager for someone to die so that you inherit something.  Phil: Why should I bother to learn some kind of trade? I’ll be rich when Grandpa dies and leaves me all his money. Alan: It’s ill waiting for dead men’s shoes."
        },
        {
            "id": 243,
            "phrase": "It ’s just one of those things.",
            "definition": "It is something that couldn’t have been prevented.; It is an unfortunate thing caused by fate.  I’m sorry, too. It’s not your fault. It’s just one of those things. I feel terrible that I didn’t pass the bar exam. I guess it was just one of those things."
        },
        {
            "id": 244,
            "phrase": "(It ’s) nice to meet you.",
            "definition": "an expression said just after being introduced to someone.  Tom: Sue, this is my sister, Mary. Sue: It’s nice to meet you, Mary. Mary: How are you, Sue? _ Bob: I’m Bob. Nice to see you here. Jane: Nice to meet you, Bob."
        },
        {
            "id": 245,
            "phrase": "(It’s) nice to see you.",
            "definition": "an expression said when greeting or saying good-bye to someone. Mary: Hi, Bill. It’s nice to see you. Bill: Nice to see you, Mary. How are things? _ John: Come on in, Jane. Nice to see you. Jane: Thanks, and thank you for inviting me."
        },
        {
            "id": 246,
            "phrase": "It’s no picnic!",
            "definition": "Inf. There is nothing easy or pleasant about it.  I was on welfare for a year, and it’s no picnic."
        },
        {
            "id": 247,
            "phrase": "(It ’s) no trouble (at all).",
            "definition": "Do not worry, this is not a problem.  Mary: Do you mind carrying all this up to my apartment? Tom: It’s no trouble.  Bob: Would it be possible for you to get this back to me today? Bill: Sure. No trouble at all."
        },
        {
            "id": 248,
            "phrase": "(It’s) none of your business!",
            "definition": "It is nothing that you need to know. It is none of your concern. (Not very polite.) _ Alice: How much does a little diamond like that cost? Mary: None of your business! _ John: Do you want to go out with me Friday night? Mary: Sorry, I don’t think so. John: Well, what are you doing then? Mary: None of your business!"
        },
        {
            "id": 249,
            "phrase": "(It ’s) not half bad.",
            "definition": "It’s not as bad as one might have thought. Mary: How do you like this play? Jane: Not half bad. Jane: Well, how do you like college? Fred: It’s not half bad."
        }
    ]
}