{
    "dictionary": [
        {
            "id": 0,
            "phrase": "play one’s trump card",
            "definition": "[in certain card games] to play a card that, according to the rules of the game, outranks certain other cards and is thus able to take any card of another suit. Bob played his trump card and ended the game as the winner."
        },
        {
            "id": 1,
            "phrase": "play out",
            "definition": "[for a process] to run out; to finish.  The whole incident is about to play out. Then it all will be forgotten.  When the event plays out, everything will return to normal."
        },
        {
            "id": 2,
            "phrase": "play politics",
            "definition": "to negotiate politically.  Everybody at city hall is playing politics as usual. If you’re elected as a member of a political party, you’ll have to play politics."
        },
        {
            "id": 3,
            "phrase": "play possum",
            "definition": "to pretend to be inactive, unobservant, asleep, or dead. (The possum refers to an opossum.) _ I knew that Bob wasn’t asleep. He was just playing possum.  I can’t tell if this animal is dead or just playing possum."
        },
        {
            "id": 4,
            "phrase": "play second fiddle (to someone)",
            "definition": "to be in a subordinate position to someone.  I’m tired of playing second fiddle to John. I’m better trained than he, and I have more experience. I shouldn’t always play second fiddle."
        },
        {
            "id": 5,
            "phrase": "play someone against someone else",
            "definition": "to cause someone to dispute with someone else.  Don tried to play George against David, but they figured out what he was up to.  Alice never managed to play Tom against Fred."
        },
        {
            "id": 6,
            "phrase": "play someone for a fool",
            "definition": "to treat someone like a fool; to assume someone is naive or stupid.  Don’t play me for a fool. I won’t have it.  You are playing me for a fool! Stop it!"
        },
        {
            "id": 7,
            "phrase": "play someone off against someone else",
            "definition": "to scheme in a manner that pits two of your adversaries against one another.  Bill wanted to beat me up and so did Bob. I did some fast talking, and they ended up fighting with each other. I really played Bill off against Bob.  The president played the House off against the Senate and ended up getting his own way."
        },
        {
            "id": 8,
            "phrase": "play someone or something down†",
            "definition": "to lessen the effect or importance of someone or something. John is a famous actor, but the director tried to play him down as just another member of the cast.  Her lawyer tried to play down her earlier arrest."
        },
        {
            "id": 9,
            "phrase": "play someone or something up†",
            "definition": "to make someone or something seem to be more important.  The director tried to play Ann up, but she was not really a star.  Try to play up the good qualities of our product."
        },
        {
            "id": 10,
            "phrase": "play something as something",
            "definition": "to deal with something as if it were something else.  I will play this matter as a simple case of mistaken identity.  We will play this lapse as an instance of forgetfulness and not make too much of it."
        },
        {
            "id": 11,
            "phrase": "play something back† (to someone)",
            "definition": "to play a recording to someone.  Can you play the speech back to me? _ Please play back the speech to me, so I can hear how I sound."
        },
        {
            "id": 12,
            "phrase": "play something off†",
            "definition": "to play a game to break a tied score.  They decided not to play the tie off because it had grown so late.  They went ahead and played off the tie after all."
        },
        {
            "id": 13,
            "phrase": "play something on someone or something",
            "definition": "to aim a light or a hose on someone or something.  The fireman played water on the burning building.  The stagehand played a spotlight on the singer."
        },
        {
            "id": 14,
            "phrase": "play something out†",
            "definition": "1. to play something, such as a game, to the very end.  I was bored with the game, but I felt I had to play it out.  She played out the rest of the game. 2. to unwind, unfold, or unreel something.  Please play some more rope out.  They played out many feet of cable."
        },
        {
            "id": 15,
            "phrase": "play something over",
            "definition": "to replay something, such as a game, a videotape, an audio recording, etc. There was an objection to the way the referee handled the game, so they played it over.  Let’s play that song over again."
        },
        {
            "id": 16,
            "phrase": "play something through†",
            "definition": "to play something, such as a piece of recorded music, all the way through.  I played the album through, hoping to find even one song I liked.  As I played through the album, I didn’t hear anything I liked."
        },
        {
            "id": 17,
            "phrase": "play something up†",
            "definition": "to emphasize something; to be a booster of something.  The press played the scandal up so much that everyone became bored with it.  They really played up the scandal."
        },
        {
            "id": 18,
            "phrase": "play something with someone or something",
            "definition": "1. to play a game with someone or a group.  Do you want to play checkers with me? _ Fran played ball with the dog for a while. 2. to assume a particular role with someone or some group.  Don’t play the fool with me! _Don always tried to play the successful entrepreneur with the board of directors."
        },
        {
            "id": 19,
            "phrase": "play (the) devil’s advocate",
            "definition": "to put forward arguments against or objections to a proposition—which one may actually agree with—purely to test the validity of the proposition. (The devil’s advocate opposes the canonization of a saint in order to prove that the grounds for canonization are sound.) _ I agree with your plan. I’m just playing the devil’s advocate so you’ll know what the opposition will say.  Mary offered to play devil’s advocate and argue against our case so that we would find out any f laws in it."
        },
        {
            "id": 20,
            "phrase": "play the devil with something",
            "definition": "to cause disruption with something; to foul something up.  Your being late really played the devil with my plans for the day.  This weather is really playing the devil with my arthritis."
        },
        {
            "id": 21,
            "phrase": "play the field",
            "definition": "to date many different people rather than just one.  When Tom told Ann good-bye, he said he wanted to play the field.  He said he wanted to play the field while he was still young."
        },
        {
            "id": 22,
            "phrase": "play the fool",
            "definition": "to act in a silly manner in order to amuse other people.  The teacher told Tom to stop playing the fool and sit down.  Fred likes playing the fool, but we didn’t find him funny last night."
        },
        {
            "id": 23,
            "phrase": "play the heavy",
            "definition": "to act the part of a mean person; to do the unpleasant tasks that no one else wants to do. (Refers originally to playing the role of someone evil in a movie, etc.) _ I’m a nice guy, but at work, I am required to play the heavy. The boss makes me do all the cruel things."
        },
        {
            "id": 24,
            "phrase": "play the (stock) market",
            "definition": "to invest in the stock market. (As if it were a game or as if it were gambling.) _ Would you rather put your money in the bank or play the market? _ I’ve learned my lesson playing the market. I lost a fortune."
        },
        {
            "id": 25,
            "phrase": "play through",
            "definition": "[for golfers] to pass someone on the golf course.  Do you mind if we play through? We have to get back to the courtroom by two o’clock.  We let them play through because they were moving so fast."
        },
        {
            "id": 26,
            "phrase": "play to someone or something",
            "definition": "1. to perform something for someone or a group. The cast played to one of their classmates who was confined to the hospital.  Gerald Watson will play to a small gathering of wealthy socialites this Saturday evening. 2. to aim one’s performance only toward a particular person, group, or a particular taste.  The comedian was playing only to the juveniles in the audience.  It was clear that she was playing to the people in the cheaper seats."
        },
        {
            "id": 27,
            "phrase": "play tricks on someone",
            "definition": "to pull pranks on someone.  You had better not play any tricks on me! _ Stop playing tricks on people!"
        },
        {
            "id": 28,
            "phrase": "play up to someone",
            "definition": "to flatter someone; to try to gain influence with someone.  It won’t do any good to play up to me. I refuse to agree to your proposal.  I played up to him and he still wouldn’t give in to me."
        },
        {
            "id": 29,
            "phrase": "play (up)on something",
            "definition": "to make music on a musical instrument. (Upon is formal and less commonly used than on.) _ Can you play upon this instrument, or only the one you are holding? _ I can’t play on this! It’s broken."
        },
        {
            "id": 30,
            "phrase": "play with a full deck",
            "definition": "to play cards with a complete deck, containing all the cards. Are we playing with a full deck or did some card drop on the f loor? I haven’t seen the three of hearts all evening!"
        },
        {
            "id": 31,
            "phrase": "play with fire",
            "definition": "to use fire as a toy; to experiment with flames and fire.  Jimmy! I’ve told you never to play with fire!"
        },
        {
            "id": 32,
            "phrase": "play with someone or something",
            "definition": "1. to play games with someone or a group.  I love to play Ping-Pong. Will you play with me? _ They won’t play with our team. We are too good. 2. to toy with someone or something. You are just playing with me. Can’t you take me seriously? _Please don’t play with that crystal vase."
        },
        {
            "id": 33,
            "phrase": "play-by-play description",
            "definition": "a description of an event given as the event is taking place. (Usually in reference to a sporting event.) _And now here is Bill Jones with a playby- play description of the baseball game.  John was giving me a play-by-play description of the argument going on next door."
        },
        {
            "id": 34,
            "phrase": "played out",
            "definition": "too exhausted to continue. At the end of the race, Donna was played out.  After the race, we were played out for the rest of the day."
        },
        {
            "id": 35,
            "phrase": "plead for someone",
            "definition": "to beg for someone to be spared. Tom pleaded for Dave, but it was no use. Dave was found guilty. She pleaded for her husband, but the judge sentenced him to ten years in prison."
        },
        {
            "id": 36,
            "phrase": "plead for something",
            "definition": "to beg for something.  I don’t want to have to plead for what’s already mine.  The children were pleading for ice cream, so we got some for them."
        },
        {
            "id": 37,
            "phrase": "plead guilty to something",
            "definition": "to state that one is guilty of a crime before a court of law.  Gerald refused to plead guilty to the crime and had to stand trial.  Max pleaded guilty to the charge and then f led town."
        },
        {
            "id": 38,
            "phrase": "plead to something",
            "definition": "to enter an admission of guilt to a specific crime.  Max pleaded to the lesser charge of larceny.  Lefty pleaded to the grand larceny charge."
        },
        {
            "id": 39,
            "phrase": "plead with someone",
            "definition": "to beg something of someone; to make an emotional appeal to someone.  Do I have to plead with you to get you to do it? _You can plead with me as much as you want. I won’t permit you to go."
        },
        {
            "id": 40,
            "phrase": "(Please) don’t get up.",
            "definition": "Please, there is no need to rise to greet me or in deference to me.  Mary approached the table to speak to Bill. Bill started to push his chair back as if to rise. Mary said, “Don’t get up. I just want to say hello.” _ Tom (rising): Hello, Fred. Good to see you. Fred (standing): Don’t get up. How are you?"
        },
        {
            "id": 41,
            "phrase": "*pleased as Punch",
            "definition": "delighted; very pleased. (*Also: as ~.) (This refers to Punch from the “Punch and Judy” shows.) _ Child: Do you think Grandma will like the picture I’m making for her? Father: I think she’ll be as pleased as Punch. Fred was pleased as Punch to discover that Ellen was making lemon pie, his favorite, for dessert."
        },
        {
            "id": 42,
            "phrase": "pleased for someone or something",
            "definition": "happy for someone or a group.  I am very pleased for you.  We were all pleased for the committee. The members got all the praise they deserved.  Everyone could see how pleased Sam was for himself and his whole family."
        },
        {
            "id": 43,
            "phrase": "*pleased with someone or something",
            "definition": "happy and satisfied with someone or something. (*Typically: be ~; become ~.) _ I am quite pleased with you. You did a fine job.  We are pleased with your work."
        },
        {
            "id": 44,
            "phrase": "pledge something to someone",
            "definition": "to promise something to someone.  I pledged one hundred dollars to Ralph for his cause. We pledged a lot of money to our favorite charity."
        },
        {
            "id": 45,
            "phrase": "plenty of something",
            "definition": "lots of something; an abundance of something; enough of something. I have plenty of candy. Do you want some? _ This project is giving me plenty of trouble."
        },
        {
            "id": 46,
            "phrase": "plight one’s troth to someone",
            "definition": "to become engaged to be married to someone. (Literary or jocular.) _ I chose not to plight my troth to anyone who acts so unpleasant to my dear aunt.  Alice plighted her troth to Scott."
        },
        {
            "id": 47,
            "phrase": "plod along",
            "definition": "to move along slowly but deliberately.  I’m just plodding along, but I am getting the job done.  The old man plodded along, hardly able to stand.  The movie plodded along putting most of the audience to sleep."
        },
        {
            "id": 48,
            "phrase": "plod away at something",
            "definition": "to keep trying to do something.  He continues to plod away at writing his novel. It’s been three years now.  How long have you been plodding away at that book?"
        },
        {
            "id": 49,
            "phrase": "plod through something",
            "definition": "to work one’s way through something laboriously. I just plodded through my work today. I had no energy at all.  This is certainly a lot of papers to have to plod through."
        },
        {
            "id": 50,
            "phrase": "plonk something down†",
            "definition": "to slap something down; to plop something down.  He plonked a dollar down and demanded a newspaper.  He plonked down his beer mug on the bar."
        },
        {
            "id": 51,
            "phrase": "plot against someone or something",
            "definition": "to make a scheme against someone or something.  All the counselors plotted against the czar.  We plotted against the opposing party."
        },
        {
            "id": 52,
            "phrase": "plot something on something",
            "definition": "to draw a route or outline on something.  He plotted the course they would be taking on a map of the area.  The captain plotted the course on a chart of the upper reaches of the Nile."
        },
        {
            "id": 53,
            "phrase": "plot something out†",
            "definition": "to map something out; to outline a plan for something. I have an idea about how to remodel this room. Let me plot it out for you.  I plotted out my ideas for the room."
        },
        {
            "id": 54,
            "phrase": "The plot thickens.",
            "definition": "Things are becoming more complicated or interesting. The police assumed that the woman was murdered by her ex-husband, but he has an alibi. The plot thickens. John is supposed to be going out with Mary, but I saw him last night with Sally. The plot thickens."
        },
        {
            "id": 55,
            "phrase": "plot with someone",
            "definition": "to scheme with someone. Mary looks as though she is plotting with Jerry to make some sort of mischief. I am not plotting with anyone. I am planning everything myself."
        },
        {
            "id": 56,
            "phrase": "plow into someone or something",
            "definition": "to crash into someone or something; to bump hard into someone or something.  The car plowed into the ditch.  The runner plowed into another player."
        },
        {
            "id": 57,
            "phrase": "plow something in†",
            "definition": "to work something into soil by plowing.  Lay the fertilizer down and plow it in.  Plow in the fertilizer as soon as you can."
        },
        {
            "id": 58,
            "phrase": "plow something under (something)",
            "definition": "to turn something under the surface of soil by plowing. The farmer plowed the wheat stubble under the surface of the soil. The farmer plowed the stubble under."
        },
        {
            "id": 59,
            "phrase": "plow something up†",
            "definition": "to uncover something by plowing.  The farmer plowed some old coins up and took them to the museum to find out what they were.  He plowed up some valuable coins."
        },
        {
            "id": 60,
            "phrase": "plow through something",
            "definition": "to move through something such as snow or mud with a plow. The huge truck plowed through the snow-covered streets so traffic could move again."
        },
        {
            "id": 61,
            "phrase": "pluck at someone or something",
            "definition": "to pull or pick at someone or something.  Kelly plucked at Ed, picking off the burrs that had caught on his clothing.  Kelly plucked at the strings of the guitar."
        },
        {
            "id": 62,
            "phrase": "pluck something from someone or something",
            "definition": "to pick, grab, or snatch something from someone. Sally plucked a chocolate from the box and popped it into her mouth.  He stooped over and plucked a rose from the bush."
        },
        {
            "id": 63,
            "phrase": "pluck up someone’s courage",
            "definition": "to bolster someone’s, including one’s own, courage.  I hope you are able to pluck up your courage so that you can do what has to be done.  Some good advice from a friend helped pluck up my courage."
        },
        {
            "id": 64,
            "phrase": "plug (oneself) in(to something)",
            "definition": "to become attached to something; to become attached to some sort of network or system.  As soon as I have plugged my laptop into the local network, I will have access to the Internet. I plugged myself into the computer network and began to communicate quickly and efficiently."
        },
        {
            "id": 65,
            "phrase": "plug something up†",
            "definition": "to stop or fill up a hole, crack, or gap.  Take out the nail and plug the hole up with something.  You have to plug up the cracks to keep out the cold."
        },
        {
            "id": 66,
            "phrase": "plumb loco",
            "definition": "Rur. completely crazy. (Loco is from a Spanish word meaning “mad.”) _You’re plumb loco if you think I’ll go along with that.  All those people were running around like they were plumb loco."
        },
        {
            "id": 67,
            "phrase": "plummet to earth",
            "definition": "to fall rapidly to earth from a great height.  The rocket plummeted to earth and exploded as it struck.  As the plane plummeted to earth, all the people on the ground were screaming."
        },
        {
            "id": 68,
            "phrase": "plummet to something",
            "definition": "to drop or fall to some level or low point. Stock prices plummeted to record low levels. The rock plummeted to the river at the base of the cliff."
        },
        {
            "id": 69,
            "phrase": "plump for someone or something",
            "definition": "to support or promote someone or something.  Henry spent a lot of energy plumping for Bill, who was running for vice president.  She spent a lot of time plumping for our candidate."
        },
        {
            "id": 70,
            "phrase": "plump something down†",
            "definition": "1. to drop a heavy load of something.  She plumped the load of groceries onto the bench and looked through her purse for the keys.  Jill plumped down her packages. 2. to drop something as if it were a heavy load. He plumped the potatoes down on each plate, making a loud noise each time.  Dave plumped down a huge slab of meat onto the grill."
        },
        {
            "id": 71,
            "phrase": "plump something up†",
            "definition": "to pat or shake something like a pillow into a fuller shape. Todd plumped his pillow up and finished making the bed.  He plumped up his pillow."
        },
        {
            "id": 72,
            "phrase": "plunge down something",
            "definition": "to run or fall down something.  The car plunged down the hill and ran into a tree at the bottom. The bicyclist plunged down the side of the hill at a great speed."
        },
        {
            "id": 73,
            "phrase": "plunge from something",
            "definition": "to fall or flee from something or some place.  The eagle plunged from the sky to the lake to capture its prey. Lily plunged from the room in embarrassment."
        },
        {
            "id": 74,
            "phrase": "plunge in(to something)",
            "definition": "to dive or rush into something; to immerse oneself in something. Ned took off his shoes and plunged into the river, hoping to rescue Frank.  He plunged into his work and lost track of time."
        },
        {
            "id": 75,
            "phrase": "plunge to something",
            "definition": "1. to fall or drop down to something. The temperature plunged to zero last night. The burning car plunged to the f loor of the canyon. 2. to dive or fall to one’s death. She walked straight to the edge of the cliff and plunged to her death. The burro slipped and plunged to an untimely end."
        },
        {
            "id": 76,
            "phrase": "plunk (oneself) down",
            "definition": "to sit or fall down hard.  Nancy pulled up a chair and plunked herself down.  She pulled the chair up and plunked down.  She plunked herself down in the middle of the kids and began to sing."
        },
        {
            "id": 77,
            "phrase": "plunk someone or something down†",
            "definition": "to place, drop, or plop someone or something down hard.  He picked her up and plunked her down in a chair and began to shout at her.  Sally plunked down the book in anger."
        },
        {
            "id": 78,
            "phrase": "ply between something and something else",
            "definition": "to travel between things or places regularly or constantly. There are a number of small craft that ply between Santerem and Manaus on a regular basis.  Our little ship was unable to ply the entire distance between the two islands."
        },
        {
            "id": 79,
            "phrase": "ply someone with something else",
            "definition": "to try to supply or give something to someone. (Implies an attempt to influence or fawn upon someone.) _ We plied the mayor with gifts and favors, but it got us nowhere.  Don’t try to ply the police officer with gifts. That is considered a bribe."
        },
        {
            "id": 80,
            "phrase": "pock something with something",
            "definition": "to cause dents or small craters by shooting or throwing something at something. The hail pocked the roof of the car with dents. The side of the house was pocked with tiny dents where the hail had struck."
        },
        {
            "id": 81,
            "phrase": "a pocket of resistance",
            "definition": "a small group of people who resist change or domination.  The accounting department seems to be a pocket of resistance when it comes to automating."
        },
        {
            "id": 82,
            "phrase": "poetic justice",
            "definition": "appropriate, ideal, or ironic punishment.  It was poetic justice that Jane won the race after Mary tried to get her banned from the race. The car thieves tried to steal a car with no gas. That’s poetic justice."
        },
        {
            "id": 83,
            "phrase": "poetic license",
            "definition": "liberties or license of the type taken by artists, especially poets, to violate patterns of rhyme, harmony, structure, etc. I couldn’t tell whether he kept making spelling mistakes or if it was just poetic license."
        },
        {
            "id": 84,
            "phrase": "point at someone or something",
            "definition": "1. [for someone] to direct an extended finger at someone or something; to point one’s finger at someone or something.  You should not point at people. Harry pointed at the mess Jerry had made and scowled. 2. [for something] to aim at someone or something.  The gun pointed directly at him. He was frightened.  The sign pointed at a small roadside cafe, populated by truck drivers."
        },
        {
            "id": 85,
            "phrase": "point down to something",
            "definition": "to aim downward to something.  The sign pointed down to the little bell sitting on the counter.  The room clerk pointed down the stairs to a little cafe on the lower level."
        },
        {
            "id": 86,
            "phrase": "the point of no return",
            "definition": "the halfway point; the point at which it is too late to turn back. (Often with past.) _The f light was past the point of no return, so we had to continue to our destination.  The entire project is past the point of no return; we will have to continue with it."
        },
        {
            "id": 87,
            "phrase": "point of view",
            "definition": "a way of thinking about something; [someone’s] viewpoint; an attitude or expression of self-interest.  From my point of view, all this talk is a waste of time.  I can understand her point of view. She has made some good observations about the problem."
        },
        {
            "id": 88,
            "phrase": "point someone or something out†",
            "definition": "to select or indicate someone or something (from a group). Everyone pointed the error out.  She pointed out the boy who took her purse."
        },
        {
            "id": 89,
            "phrase": "point something at someone or something",
            "definition": "to aim or direct something at someone or something.  Don’t ever point a gun at anyone! _Point the rif le at the target and pull the trigger."
        },
        {
            "id": 90,
            "phrase": "point something up†",
            "definition": "1. Fig. to emphasize something; to emphasize one aspect of something.  This is a very important thing to learn. Let me point it up one more time by drawing this diagram on the board.  This points up what I’ve been telling you. 2. Fig. to tuck-point something; to repair the joints in masonry. I hired someone to point the chimney up.  Carl pointed up the brick wall."
        },
        {
            "id": 91,
            "phrase": "point the finger at someone",
            "definition": "to blame someone; to identify someone as the guilty person.  Don’t point the finger at me! I didn’t take the money.  The manager refused to point the finger at anyone in particular and said that everyone was sometimes guilty of being late."
        },
        {
            "id": 92,
            "phrase": "point to someone or something",
            "definition": "to aim at someone or something.  Who is she pointing to? _ He pointed to the door."
        },
        {
            "id": 93,
            "phrase": "point to something",
            "definition": "to indicate, reveal, or suggest something.  All the evidence seems to point to his guilt.  The signs point to a very cold winter."
        },
        {
            "id": 94,
            "phrase": "point to something as something",
            "definition": "to identify something as something.  All the indications pointed to Jill as the next president."
        },
        {
            "id": 95,
            "phrase": "point toward someone or something",
            "definition": "to direct an extended finger toward someone or something.  The teacher pointed toward Laura and asked her to come to the front of the room.  Randy pointed toward the door and frowned at the dog."
        },
        {
            "id": 96,
            "phrase": "poise oneself for something",
            "definition": "to get ready for something.  She poised herself for her dive.  Fred poised himself for a fall, but everything worked out all right."
        },
        {
            "id": 97,
            "phrase": "poise over someone or something",
            "definition": "to hover or hang over someone or something.  She spent the entire afternoon poised over her desk, pouting.  The dog poised over the downed duck, waiting for the hunter."
        },
        {
            "id": 98,
            "phrase": "poised for something",
            "definition": "ready for something; in the right position and waiting for something.  The cat stared at the mouse, poised for action.  The army was poised for battle."
        },
        {
            "id": 99,
            "phrase": "poised to do something",
            "definition": "ready to do something; in the right position to do something.  The cat is poised to jump on the mouse.  The army is poised to attack at dawn."
        },
        {
            "id": 100,
            "phrase": "poison someone against someone or something",
            "definition": "to cause someone to have negative or hateful thoughts about someone, a group, or something. You have done nothing more than poison Gerald against all of us! Stop talking to him! _ Your negative comments poisoned everyone against the proposal."
        },
        {
            "id": 101,
            "phrase": "poison someone or an animal with something",
            "definition": "to render someone or an animal sick or dead with a poison.  He intended to poison his wife with arsenic.  Barry wanted to poison the cat with something that left no trace.  He poisoned himself with the cleaning compound."
        },
        {
            "id": 102,
            "phrase": "poison something with something",
            "definition": "to render something poisonous with something.  She poisoned the soup with arsenic. They are poisoning our water supply with pollutants."
        },
        {
            "id": 103,
            "phrase": "poke along",
            "definition": "to move along slowly; to lag or tarry.  Get moving. Stop poking along.  I was just poking along, taking my time, not paying attention to what was going on around me."
        },
        {
            "id": 104,
            "phrase": "poke at someone or something",
            "definition": "to thrust or jab at someone or something.  Stop poking at me! _ Don’t poke at the turtle. It might bite you."
        },
        {
            "id": 105,
            "phrase": "poke fun at someone or something",
            "definition": "to make fun of someone or something.  You shouldn’t poke fun at me for my mistakes.  They are just poking fun at the strange architecture."
        },
        {
            "id": 106,
            "phrase": "poke out (of something)",
            "definition": "to stick out of something; to extend out of something.  The bean sprouts were beginning to poke out of the soil of the garden.  I knew there were little birds in the birdhouse, because a little head poked out now and then."
        },
        {
            "id": 107,
            "phrase": "poke someone in something",
            "definition": "to strike or jab someone in some body part.  Billy poked Bobby in the tummy and made him cry.  She poked herself in the eye accidentally."
        },
        {
            "id": 108,
            "phrase": "poke something at someone or something",
            "definition": "to jab or thrust something at someone or something.  Don’t poke that thing at me! _ The hunter poked his spear at the pig one more time and decided it was dead."
        },
        {
            "id": 109,
            "phrase": "poke something through someone or something",
            "definition": "to jab or stab something through someone or something.  The evil knight poked his weapon through Arthur and withdrew it again.  Danny poked his finger through the plastic pool liner by mistake."
        },
        {
            "id": 110,
            "phrase": "poke through (something)",
            "definition": "to stick through something; to extend through something.  The tips of Tommy’s toes poked through his sneakers and looked very cold. The end of the lost spoon poked through the piecrust on the freshly baked pie. Now we knew where it had disappeared to."
        },
        {
            "id": 111,
            "phrase": "polarize something into something",
            "definition": "to divide a group into two segments.  Your actions have just polarized the students into two opposing groups! _ We polarized the entire population into two factions."
        },
        {
            "id": 112,
            "phrase": "*poles apart",
            "definition": "very different; far from coming to an agreement. (Alludes to the distance between the north and south poles. *Typically: be ~; become ~; grow ~.) _ Mr. and Mrs. Jones don’t get along well. They are poles apart.  They’ll never sign the contract because they are poles apart."
        },
        {
            "id": 113,
            "phrase": "polish something off†",
            "definition": "to eat, consume, exhaust, or complete all of something.  Who polished the cake off ? _ Who polished off the cake?"
        },
        {
            "id": 114,
            "phrase": "polish something up†",
            "definition": "to rub something until it shines.  Polish the silver up and make it look nice and shiny.  If you will polish up the silver, I will put it away."
        },
        {
            "id": 115,
            "phrase": "a political football",
            "definition": "an issue that becomes politically divisive; a problem that doesn’t get solved because the politics of the issue get in the way.  The question of campaign contributions has become a political football. All the politicians who accept questionable money are pointing fingers at each other."
        },
        {
            "id": 116,
            "phrase": "Politics makes strange bedfellows.",
            "definition": "Prov. People who would normally dislike and avoid one another will work together if they think it is politically useful to do so. Jill: I never would have thought that genteel, aristocratic candidate would pick such a rabble-rousing, rough-mannered running mate. Jane: Politics makes strange bedfellows."
        },
        {
            "id": 117,
            "phrase": "pollute something with something",
            "definition": "to adulterate something with something; to dirty something with something.  You should not pollute the stream with chemicals. Someone polluted the sewer with automotive oil."
        },
        {
            "id": 118,
            "phrase": "ponder (up)on something",
            "definition": "to think on something; to consider something. (Upon is formal and less commonly used than on.) _ Ponder upon this awhile. See what you come up with.  I need to ponder on this."
        },
        {
            "id": 119,
            "phrase": "pontificate on something",
            "definition": "to speak and act dogmatically and pompously.  Must you pontificate on your own virtues so much? _ The speaker was pontificating on the virtues of a fat-free diet."
        },
        {
            "id": 120,
            "phrase": "pooch out",
            "definition": "to stick or bulge out, as with a belly.  His chubby tummy pooched out when he relaxed."
        },
        {
            "id": 121,
            "phrase": "poop out",
            "definition": "Inf. to quit; to wear out and stop.  He pooped out after about an hour of hard work.  I think I’m going to poop out pretty soon."
        },
        {
            "id": 122,
            "phrase": "poop someone or something out",
            "definition": "Inf. to cause someone to become exhausted or give out.  All that exercise really pooped everyone out.  A full day of play at the beach had pooped the dog out.  The activity pooped out the dog."
        },
        {
            "id": 123,
            "phrase": "pooped (out)",
            "definition": "1. Inf. [of a person or an animal] exhausted; worn out. I’m really pooped out. The horse looked sort of pooped in the final stretch. 2. Inf. intoxicated. How much of that stuff does it take to get pooped? _He’s been drinking all night and is totally pooped out."
        },
        {
            "id": 124,
            "phrase": "poor but clean",
            "definition": "Cliché having little money but clean and of good habits, nonetheless. (Either extremely condescending or jocular. Some people would consider it offensive.) _ My salary isn’t very high, and I only have one old car. Anyway, I’m poor but clean.  When Fred uttered the phrase “poor but clean” in reference to some of the people working in the yard, Ellen went into a rage."
        },
        {
            "id": 125,
            "phrase": "pop back (for something)",
            "definition": "to come back to a place for just a moment.  Okay, I think I can pop back for a minute.  I have to pop back for something I forgot."
        },
        {
            "id": 126,
            "phrase": "pop down (for a visit)",
            "definition": "to come or go to someone’s home that is downstairs or in a place on a lower level. You simply must pop down for a visit whenever you get a chance.  I’ll try to pop down tomorrow evening after dinner."
        },
        {
            "id": 127,
            "phrase": "pop for something",
            "definition": "Inf. to pay for a treat (for someone).  Let’s have some ice cream. I’ll pop for it.  It’s about time you popped for coffee."
        },
        {
            "id": 128,
            "phrase": "pop in(to something)",
            "definition": "Inf. to come or go into some place, such as a store, shop, etc., for a moment.  Let me pop into the bakery for a minute.  I have to pop into the drugstore for some shampoo."
        },
        {
            "id": 129,
            "phrase": "pop off",
            "definition": "1. Sl. to make an unnecessary remark; to interrupt with a remark; to sound off.  Please don’t pop off all the time.  Bob keeps popping off when he should be listening. 2. Sl. to lose one’s temper.  Now, don’t pop off. Keep your cool.  I don’t know why she popped off at me. All I did was say hello. 3. Sl. to die. My uncle popped off last week. I hope I’m asleep when I pop off. 4. Sl. to leave; to depart in haste.  Bye, I must pop off.  Got to pop off. I’m late."
        },
        {
            "id": 130,
            "phrase": "pop one’s cork",
            "definition": "1. Fig. to suddenly become mentally disturbed; to go crazy.  I was so upset that I nearly popped my cork. They put him away because he popped his cork. 2. Fig. to become very angry.  My mother popped her cork when she heard about my low grades.  Calm down! Don’t pop your cork."
        },
        {
            "id": 131,
            "phrase": "pop out (of something)",
            "definition": "to jump out of something; to burst out of something.  Suddenly, a little mouse popped out of the drawer.  I opened the drawer and a mouse popped out."
        },
        {
            "id": 132,
            "phrase": "pop (some) tops",
            "definition": "Sl. to drink beer.  Wanna go out tonight and pop some tops? _We are going to pop tops and watch the B-ball game."
        },
        {
            "id": 133,
            "phrase": "pop someone off†",
            "definition": "Inf. to kill someone.  Max was told to pop Lefty off because he was trying to muscle in on the gang’s turf.  Max intended to pop off Lefty."
        },
        {
            "id": 134,
            "phrase": "pop someone on something",
            "definition": "Inf. to strike someone on some body part. If you don’t sit down, I’ll pop you on the chin! _ Max popped Lefty on the nose."
        },
        {
            "id": 135,
            "phrase": "pop something up†",
            "definition": "to remove something by making it jump or burst upwards.  Henry popped the lid up and helped himself to the strawberry preserves.  He popped up the lid and cleaned out the jam jar."
        },
        {
            "id": 136,
            "phrase": "pop the question",
            "definition": "[for a man] to ask a woman to marry him. (Could also be used by a woman asking a man.) _ She waited for years for him to pop the question.  Finally she popped the question."
        },
        {
            "id": 137,
            "phrase": "pop up",
            "definition": "1. [for a baseball batter] to hit a baseball that goes high upward rather than outward.  The catcher came to bat and popped up. I hope I don’t pop up this time. 2. [for a baseball] to fly high upward rather than outward. The ball popped up and went foul.  The ball will always pop up if you hit it in a certain way. 3. to arise suddenly; to appear without warning. New problems keep popping up all the time.  Billy popped up out of nowhere and scared his mother."
        },
        {
            "id": 138,
            "phrase": "pop up (some place)",
            "definition": "to appear suddenly and unexpectedly some place.  I never know where Henry is going to pop up next.  A new problem has popped up."
        },
        {
            "id": 139,
            "phrase": "pore over something",
            "definition": "to look over something carefully.  She pored over the reports, looking for errors.  I need to take a few hours to pore over these contracts and see if they are ready to be signed."
        },
        {
            "id": 140,
            "phrase": "pork out (on something)",
            "definition": "Inf. to overeat on something; to become fat as a pig from eating something. (A play on pig out.) _I pork out on french fries whenever I get the chance.  I wish I didn’t pork out all the time."
        },
        {
            "id": 141,
            "phrase": "portion something out†",
            "definition": "to give out shares of something.  Who will portion the cake out? _ She portioned out the chocolate carefully, making sure everyone got an equal share."
        },
        {
            "id": 142,
            "phrase": "portray someone as someone or something",
            "definition": "to represent or describe someone as someone or a type of person. Fred portrayed his political opponent as an evil man. She tried to portray herself as a grand lady, but she fooled no one."
        },
        {
            "id": 143,
            "phrase": "portray someone or something as someone",
            "definition": "to develop a character that one is playing in a dramatic production as a kind of person or someone having certain characteristics or a particular personality.  Tom portrayed Scrooge as an evil old man.  Randy hopes to portray his character as a sympathetic friend."
        },
        {
            "id": 144,
            "phrase": "pose a question",
            "definition": "to ask a question; to imply the need for asking a question.  Genetic research poses many ethical questions. My interviewer posed a hypothetical question."
        },
        {
            "id": 145,
            "phrase": "pose as someone",
            "definition": "to pretend to be someone else.  The impostor posed as the president of the company. My twin posed as me while I went on vacation."
        },
        {
            "id": 146,
            "phrase": "pose as someone or something",
            "definition": "to pretend to be someone or a type of person.  I posed as Gerald and got the job.  I posed as a nurse and got a job at a summer camp."
        },
        {
            "id": 147,
            "phrase": "pose for someone or something",
            "definition": "to assume a posture appropriate to the subject of a photograph or painting.  Paul wanted me to pose for him, but I declined. Will you pose for my painting?"
        },
        {
            "id": 148,
            "phrase": "*possessed by something",
            "definition": "obsessed or driven by something. (*Typically: be ~; become ~.) _ Ned was possessed by a desire to become the best at everything he did.  Jan acts as if she is possessed by the need to be right all the time."
        },
        {
            "id": 149,
            "phrase": "*possessed of something",
            "definition": "having something; possessing something. (*Typically: be ~; become ~.) _ She is possessed of a large amount of money.  Todd wishes he were possessed of a large car and a fine house."
        },
        {
            "id": 150,
            "phrase": "Possession is nine-tenths of the law.",
            "definition": "Prov. If you actually possess something, you have a stronger legal claim to owning it than someone who merely says it belongs to him or her.  Dana may say he owns this house, but we actually live in it, and possession is nine-tenths of the law."
        },
        {
            "id": 151,
            "phrase": "post someone somewhere",
            "definition": "to place someone, as if on guard, at something or some place.  The police chief posted a guard at the hospital door. The boss posted himself at the water cooler to catch up on the gossip."
        },
        {
            "id": 152,
            "phrase": "post something on something",
            "definition": "to fasten a notice onto something. Please post this notice on the door where everyone will see it.  I will post this photo on the bulletin board."
        },
        {
            "id": 153,
            "phrase": "post something to someone",
            "definition": "to mail something to someone. I posted it to him over a month ago. I can’t imagine where it is now.  The letter was posted last week."
        },
        {
            "id": 154,
            "phrase": "post something up†",
            "definition": "to record a transaction in an account. I’ll post this charge up right away, and then you can check out.  Please post up the charges a little later."
        },
        {
            "id": 155,
            "phrase": "postage and handling",
            "definition": "charges for shipping [something] and for wrapping and handling the item. The cost of the book was quite reasonable, but the postage and handling was outrageous.  They did not charge postage and handling because I prepaid the order."
        },
        {
            "id": 156,
            "phrase": "a poster child (for something)",
            "definition": "someone who is a classic example of a state or type of person.  She is a poster child for soccer moms."
        },
        {
            "id": 157,
            "phrase": "postpone something until something",
            "definition": "to delay something until something happens or until a later time.  Can we postpone our meeting until tomorrow? _ The picnic was postponed until Saturday."
        },
        {
            "id": 158,
            "phrase": "posture as someone or something",
            "definition": "to pretend to be someone or a particular type of person.  Why is the secretary posturing as the manager and giving out assignments? _ Carla entered the ballroom, posturing as a grand duchess of somewhere or another."
        },
        {
            "id": 159,
            "phrase": "a pot of gold",
            "definition": "a container filled with gold, as in myth guarded by a leprechaun.  I was hoping to find a pot of gold in the cellar, but there were only cobwebs."
        },
        {
            "id": 160,
            "phrase": "pot something up†",
            "definition": "to put plants into pots.  If you would like one of these tomato plants, I’ll pot one up for you. Jan potted up a plant for me."
        },
        {
            "id": 161,
            "phrase": "pounce (up)on someone or something",
            "definition": "to spring or swoop upon someone or something; to seize someone or something. (Upon is formal and less commonly used than on.) _As Gerald came into the room, his friend Daniel pounced on him and frightened him to death.  The cat pounced upon a mouse."
        },
        {
            "id": 162,
            "phrase": "pound a beat",
            "definition": "to walk a regular route.  The cop pounded the same beat for years and years.  Pounding a beat will wreck your feet."
        },
        {
            "id": 163,
            "phrase": "pound along something",
            "definition": "1. Fig. to walk or run along something awkwardly or heavily. As the horse pounded along the street, the rider tried hard to get it to slow down. Tom pounded along the pavement, looking a bit angry. 2. Fig. to tap or hammer along something. The worker pounded along the edge of the roof, looking for rotten places.  I pounded along the wall, looking for a stud to nail into."
        },
        {
            "id": 164,
            "phrase": "pound away (at someone or something)",
            "definition": "to hammer or batter constantly on someone or something.  The cops pounded away at the poor guy, and then they put him in handcuffs.  The jackhammer kept pounding away at the pavement."
        },
        {
            "id": 165,
            "phrase": "pound for pound",
            "definition": "[Usually of value, quality, strength, etc.] considering the amount of weight involved. Pound for pound, a dog fed properly is much stronger than a dog that has to fend for itself.  Pound for pound, there is more food value in beef than in chicken."
        },
        {
            "id": 166,
            "phrase": "*a pound of flesh",
            "definition": "a payment or punishment that involves suffering and sacrifice on the part of the person being punished. (*Typically: give someone ~; owe someone ~; pay someone ~; take ~.) _ He wants revenge. He won’t be satisfied until he takes his pound of f lesh."
        },
        {
            "id": 167,
            "phrase": "pound on someone or something",
            "definition": "to beat or hammer on someone or something. She kept pounding on him until he released her.  Will you please stop pounding on that drum?"
        },
        {
            "id": 168,
            "phrase": "pound one’s ear",
            "definition": "Sl. to sleep.  I’ve got to spend more time pounding my ear.  She went home to pound her ear an hour or two before work."
        },
        {
            "id": 169,
            "phrase": "pound someone’s head in†",
            "definition": "to beat someone, especially about the head.  Fred looked like he wanted to pound Mike’s head in; he was so mad! _ You want me to pound in your head?"
        },
        {
            "id": 170,
            "phrase": "pound something down†",
            "definition": "to hammer, flatten, or batter something.  Please pound that nail down so that no one gets hurt on it.  Yes, please pound down that nail!"
        },
        {
            "id": 171,
            "phrase": "pound something on someone or something",
            "definition": "to hit or strike someone or something with something. Sarah pounded the vase on the robber until it broke.  Betty stood pounding her shoe on the radiator, hoping the racket would magically bring heat."
        },
        {
            "id": 172,
            "phrase": "pound something out†",
            "definition": "to flatten something by pounding. He pounded the gold leaf out very thin. He pounded out the gold leaf."
        },
        {
            "id": 173,
            "phrase": "pound something up†",
            "definition": "to break something up by pounding.  Pound the crackers up into crumbs and use them to coat the chicken before you fry it.  Pound up the crackers and put the crumbs in a jar."
        },
        {
            "id": 174,
            "phrase": "pound the pavement",
            "definition": "to walk through the streets looking for a job. I spent two months pounding the pavement after the factory I worked for closed. Hey, Bob. You’d better get busy pounding those nails unless you want to be out pounding the pavement."
        },
        {
            "id": 175,
            "phrase": "pour (all) over someone or something",
            "definition": "to flood over someone or something. (Compare this with pore over something.) _ The water from the broken dam poured all over the rocks standing at its base. The spilled milk poured over my lap."
        },
        {
            "id": 176,
            "phrase": "pour along something",
            "definition": "to rush along something in great numbers or in a great amount.  Hundreds of people poured along the street during the lunch hour.  The rainwater poured along the gutter, heading toward the sewer basin."
        },
        {
            "id": 177,
            "phrase": "pour down (on someone or something)",
            "definition": "[for water, as with rain] to shower down on someone.  The rain poured down on us, soaking us to the bone."
        },
        {
            "id": 178,
            "phrase": "pour forth",
            "definition": "to gush out; to gush forth.  The milk gushed out of the hole in the container. A tremendous amount of water poured forth when the fire hydrant was knocked over."
        },
        {
            "id": 179,
            "phrase": "pour in(to something)",
            "definition": "to flow or flood into something. The rain poured into the open window. I left the window open and the rain just poured in."
        },
        {
            "id": 180,
            "phrase": "pour money down the drain",
            "definition": "to waste money; to throw money away.  What a waste! Buying that old car is just pouring money down the drain.  Don’t buy any more of that low-quality merchandise. That’s just throwing money down the drain."
        },
        {
            "id": 181,
            "phrase": "pour oil on troubled water(s)",
            "definition": "to calm someone or something down. (A thin layer of oil will actually calm a small area of a rough sea.) _Don can calm things down. He’s good at pouring oil on troubled waters.  Alice is very good at pouring oil on troubled water."
        },
        {
            "id": 182,
            "phrase": "pour oneself into something",
            "definition": "1. Fig. to get deeply involved with something.  He distracted himself from his grief by pouring himself into his work. She poured herself into the project and got it done on time. 2. Fig. to fit oneself into clothing that is very tight. (Usually jocular.) _ Marilyn didn’t put that dress on, she poured herself in! _ She looks as if she poured herself into those jeans."
        },
        {
            "id": 183,
            "phrase": "pour out (of something)",
            "definition": "[for something] to stream, fall, or gush out of something or some place. The water poured out of the broken pipe and f looded the basement.  The pipe split and the water just poured out."
        },
        {
            "id": 184,
            "phrase": "pour out one’s soul",
            "definition": "to confess something [to someone]; to reveal one’s deepest concerns.  Every time she calls me up, she takes an hour or more to pour out her soul."
        },
        {
            "id": 185,
            "phrase": "pour something back† (in(to something))",
            "definition": "to replace a liquid into something.  Larry poured the extra glass of orange juice back into the pitcher. Lily took too much and poured some back.  Pour back the extra juice into the pitcher."
        },
        {
            "id": 186,
            "phrase": "pour something on(to) something",
            "definition": "to discharge a vessel of something onto something.  Don broke open the piggy bank and poured the money onto the kitchen table.  Don spread out a towel on the table and poured the money on it."
        },
        {
            "id": 187,
            "phrase": "pour something over someone or something",
            "definition": "to cover or douse someone or something with something.  As I poured the cooling water over myself, I felt relaxed for the first time since I began the long hike. Mary poured some milk over her cereal."
        },
        {
            "id": 188,
            "phrase": "pour something through something",
            "definition": "to cause something to flow through something, such as a filter.  The chemist poured the mixture through the filter or opening.  I can’t get the syrup into the bottle without pouring it through a funnel."
        },
        {
            "id": 189,
            "phrase": "pour through something",
            "definition": "to flow freely through something. The water poured through the leak in the window frame.  The rain poured through the hole in the roof."
        },
        {
            "id": 190,
            "phrase": "pour with rain",
            "definition": "to rain heavily. (Said of the sky, day, morning, night, the weather, etc.) _ The sky was pouring with rain and the sun never shone from dawn to dusk.  It poured with rain the entire night."
        },
        {
            "id": 191,
            "phrase": "pouring rain",
            "definition": "very heavy rain. The children’s clothes were soaked after they played out in the pouring rain. I waited in the pouring rain for the next bus."
        },
        {
            "id": 192,
            "phrase": "pout about someone or something",
            "definition": "to be sullen about someone or something. There is no need to pout about the cat. She’ll come back.  Sally is pouting about her lost dog."
        },
        {
            "id": 193,
            "phrase": "powder up",
            "definition": "Sl. to drink heavily; to get drunk.  Let’s go out and powder up.  He’s at the tavern powdering up."
        },
        {
            "id": 194,
            "phrase": "the power behind the throne",
            "definition": "the person who actually controls the person who is apparently in charge.  Mr. Smith appears to run the shop, but his brother is the power behind the throne. They say that the vice president is the power behind the throne."
        },
        {
            "id": 195,
            "phrase": "a power play",
            "definition": "a strategy using one’s power or authority to carry out a plan or to get one’s way.  In a blatant power play, the manager claimed he had initiated the sales campaign."
        },
        {
            "id": 196,
            "phrase": "power something up†",
            "definition": "to start something, such as an engine.  You should power the engine up and let it run awhile before you drive away. Power up the engine and mow the grass."
        },
        {
            "id": 197,
            "phrase": "power something with something",
            "definition": "to provide something as the source of energy for something to operate. The government decided to power its vans with natural gas engines.  We will power the generators with coal as long as it is cheap."
        },
        {
            "id": 198,
            "phrase": "power up",
            "definition": "to start an engine.  Well, let’s power up so we will be ready to leave with the others.  It’s time to power up and get going."
        },
        {
            "id": 199,
            "phrase": "the powers that be",
            "definition": "the people who are in authority.  The powers that be have decided to send back the immigrants.  I have applied for a license, and the powers that be are considering my application."
        },
        {
            "id": 200,
            "phrase": "A pox on someone or something!",
            "definition": "A curse on someone or something! (Old. Now usually jocular.) _A pox on you, you creep! _ I’ve been trying to make this computer work all day. A pox on it!"
        },
        {
            "id": 201,
            "phrase": "Practice makes perfect.",
            "definition": "Prov. Cliché Doing something over and over again is the only way to learn to do it well.  Jill: I’m not going to try to play the piano anymore. I always make so many mistakes. Jane: Don’t give up. Practice makes perfect.  Child: How come you’re so good at peeling potatoes? Father: I did it a lot in the army, and practice makes perfect."
        },
        {
            "id": 202,
            "phrase": "practice (up)on someone or something",
            "definition": "to train or drill on someone or something. (In preparation for the real thing. Upon is formal and less commonly used than on.) _ I do not want a dental student practicing upon me.  I want to learn how to braid hair. Can I practice on you?"
        },
        {
            "id": 203,
            "phrase": "Practice what you preach.",
            "definition": "Prov. Cliché You yourself should do the things you advise other people to do. Dad always told us we should only watch an hour of television every day, but we all knew he didn’t practice what he preached."
        },
        {
            "id": 204,
            "phrase": "praise someone or something to the skies",
            "definition": "to give someone or something much praise.  He wasn’t very good, but his friends praised him to the skies.  They liked your pie. Everyone praised it to the skies."
        },
        {
            "id": 205,
            "phrase": "prance around",
            "definition": "to dance, jump, or strut around.  The little deer were prancing around, enjoying the spring air.  Stop prancing around and get to work."
        },
        {
            "id": 206,
            "phrase": "prance around something",
            "definition": "to dance or jump in celebration around something or throughout some place. (Compare this with waltz around something.) _ The kids pranced around the room, celebrating.  They pranced around the table that held the ice cream and cake."
        },
        {
            "id": 207,
            "phrase": "prattle (away) about someone or something",
            "definition": "to chatter idly and endlessly about someone or something.  The little girl prattled away for an hour about her school, her friends, and her toys.  I wish you would stop prattling about your friends."
        },
        {
            "id": 208,
            "phrase": "pray for someone or something",
            "definition": "1. to beseech God, or some other deity, on behalf of someone or something.  I will pray for you to recover from your illness quickly.  As the fire spread throughout the old church, the congregation prayed for its preservation. 2. to ask God, or some other deity, to grant something. The family prayed for David’s safety.  All the people prayed for peace."
        },
        {
            "id": 209,
            "phrase": "pray over something",
            "definition": "1. to say grace over a meal. Do you pray over your meals? _ We prayed over dinner just after we sat down to eat. 2. to seek divine guidance about something through prayer.  I will have to think about it and pray over it awhile. I’ll have an answer next week.  She prayed over the problem for a while and felt she had a solution."
        },
        {
            "id": 210,
            "phrase": "pray to someone or something",
            "definition": "to utter prayers of praise or supplication to some divine or supernatural being or something.  I pray to God that all this works out.  The high priest prayed to the spirits of his ancestors that the rains would come."
        },
        {
            "id": 211,
            "phrase": "pray to the porcelain god",
            "definition": "Sl. to kneel at the toilet bowl and vomit from drunkenness. Wally spent a while praying to the porcelain god last night.  I think I have to go pray to the porcelain god."
        },
        {
            "id": 212,
            "phrase": "preach about something",
            "definition": "to give a moral or stern discourse on something. Please don’t preach about the evils of fried food. I like the stuff, and people eat it all the time and don’t die! _ She was preaching about the value of a fat-free diet."
        },
        {
            "id": 213,
            "phrase": "preach against someone or something",
            "definition": "to exhort against someone or something. The evangelist preached against the operator of the town’s only saloon. The principal kept preaching against drinking and drugs."
        },
        {
            "id": 214,
            "phrase": "preach at someone",
            "definition": "to lecture or moralize at someone.  Don’t preach at me! I don’t need any of your moralizing.  I really don’t wish to be preached at."
        },
        {
            "id": 215,
            "phrase": "preach to someone",
            "definition": "to give a moral discourse to someone.  Please don’t preach to me. I know that I did wrong.  When you preach to us like that, we don’t pay any attention to you."
        },
        {
            "id": 216,
            "phrase": "*precedence over someone or something",
            "definition": "the right to come before someone or something else; greater importance than someone or something else. (*Typically: take ~; have ~; be given ~.) _ Ambulances have precedence over regular cars at intersections. My manager’s concerns take precedence over mine."
        },
        {
            "id": 217,
            "phrase": "precipitate into something",
            "definition": "[for a chemical] to go out of solution into solid form. The sodium chloride precipitated into a salt. Will this compound precipitate into anything if I cool it?"
        },
        {
            "id": 218,
            "phrase": "precipitate something into something",
            "definition": "to cause a chemical to go out of a solution into a solid form.  Adding just one salt grain at the right time will precipitate the salt dissolved into the water into large crystals.  One grain precipitated the dissolved salt into crystals."
        },
        {
            "id": 219,
            "phrase": "preclude someone or something from something",
            "definition": "to prevent someone or something from being included in something; to eliminate someone from something in advance. Your remarks do not preclude me from trying again, do they? _ These facts do not preclude my company from consideration, do they?"
        },
        {
            "id": 220,
            "phrase": "predicate something (up)on something",
            "definition": "to base something on something.  There is no need to predicate my promotion upon the effectiveness of my secretary! _ You can hardly predicate the picnic on the weather, can you?"
        },
        {
            "id": 221,
            "phrase": "predispose someone or something to(ward) something",
            "definition": "to make someone or something susceptible to something.  Your comments will not predispose me toward a favorable treatment of your case.  Do you think that this weather will predispose me to catching a cold?"
        },
        {
            "id": 222,
            "phrase": "preface something by something",
            "definition": "to begin something by saying, writing, or reading something. I would like to preface my prepared remarks by making a personal observation.  Her remarks were prefaced by the reading of a poem."
        },
        {
            "id": 223,
            "phrase": "preface something with something",
            "definition": "to begin something with a particular message.  She prefaced her speech with a recitation of one of her favorite poems. Alice prefaced her remarks with a few personal comments."
        },
        {
            "id": 224,
            "phrase": "prefer someone or something to someone or something else",
            "definition": "to rank the desirability of someone or something over someone or something else.  For the post of treasurer, I prefer Don to Jill.  I prefer missing a meal to Jill’s cooking."
        },
        {
            "id": 225,
            "phrase": "prefer something against someone",
            "definition": "to file legal charges against someone [with the police]; to file a complaint or a charge against someone.  The neighbors preferred charges against the driver of the car who ruined their lawns.  I will not prefer charges against the driver, since it was partly my fault."
        },
        {
            "id": 226,
            "phrase": "prefix something to something",
            "definition": "to place something at the beginning of a word or part of a word.  If you prefix a re- to some verbs, you get an entirely different meaning.  You can’t prefix anything to some verbs."
        },
        {
            "id": 227,
            "phrase": "prejudice someone or something against someone or something",
            "definition": "to turn someone or a group against someone or something.  I believe that the lawyer was trying to prejudice the jury against the defendant. The discussion about how calves are raised prejudiced me against eating veal."
        },
        {
            "id": 228,
            "phrase": "a prelude to something",
            "definition": "an act or event that comes before and signals another act or event. Her rudeness to her boss was a prelude to her resignation.  The Munich Pact was a prelude to World War II."
        },
        {
            "id": 229,
            "phrase": "prepare someone for something",
            "definition": "to build someone up for shocking news. I went in and had a talk with her to prepare her for the report.  You should prepare yourself for the worst."
        },
        {
            "id": 230,
            "phrase": "prepare someone or something for something",
            "definition": "to get someone or something ready for something.  I prepared her for her trip by going over her itinerary. I prepared the garden for planting."
        },
        {
            "id": 231,
            "phrase": "prescribe something for someone",
            "definition": "to order a medication to be given to or sold to someone. I asked the doctor to prescribe a painkiller for me. What can you prescribe for me for this illness?"
        },
        {
            "id": 232,
            "phrase": "prescribe something for something",
            "definition": "to suggest or recommend something for a particular disease. Could you prescribe something for my cold? _What can you prescribe for this illness?"
        },
        {
            "id": 233,
            "phrase": "present someone (to someone) (at something)",
            "definition": "to introduce someone to someone at some event. They presented him to the queen at her birthday party.  I will present you to the rest of the committee."
        },
        {
            "id": 234,
            "phrase": "preserve someone or something against something",
            "definition": "to guard or protect someone or something against something. (Stilted or old-fashioned in reference to people.) _I hope that the vaccine will preserve us against inf luenza. There is nothing in the jam to preserve it against spoilage."
        },
        {
            "id": 235,
            "phrase": "preserve someone or something from someone or something",
            "definition": "to protect or guard someone or something from someone or something.  Please help preserve our people from the attacks of our enemies.  Is there any way to preserve my skin against the harmful rays of the sun?"
        },
        {
            "id": 236,
            "phrase": "preserve something for someone or something",
            "definition": "to save, maintain, or protect something for someone or some- thing.  Try to preserve some of these memories for your grandchildren.  We learned how to preserve leaves for future reference."
        },
        {
            "id": 237,
            "phrase": "preside at something",
            "definition": "to manage or act as chair at a meeting or a ceremony.  The mayor presided at the meeting, assuring that the speeches would be very short.  She presided at the ceremony."
        },
        {
            "id": 238,
            "phrase": "preside over something",
            "definition": "to be in control of the order and procedures of a meeting or ceremony.  The vice president will have to preside over the next meeting.  I will be glad to preside over the discussion."
        },
        {
            "id": 239,
            "phrase": "press against someone or something",
            "definition": "to push or bear upon someone or something.  I pressed against Henry, trying gently to get him to move out of the way.  Don’t press against the glass door!"
        },
        {
            "id": 240,
            "phrase": "press down on someone or something",
            "definition": "to push down on someone or something. The weight of all the covers was pressing down on me, and I couldn’t sleep.  Press down on this lever and the recorder will start."
        },
        {
            "id": 241,
            "phrase": "press for something",
            "definition": "1. to urge for something to be done; to request something. The mayor is pressing for an early settlement to the strike.  I will press her for an answer.  The citizens are pressing for an investigation of the incident. 2. to press a button for service.  If you need any help, just press for service.  Here is the steward’s button. Just press for immediate service."
        },
        {
            "id": 242,
            "phrase": "press forward",
            "definition": "to move forward; to struggle forward; to continue. Do not be discouraged. Let us press forward.  We must press forward and complete this work on time."
        },
        {
            "id": 243,
            "phrase": "press on something",
            "definition": "to push or depress something, such as a button, catch, snap, etc.  Press on this button if you require room service.  Don’t press on this because it rings a loud bell."
        },
        {
            "id": 244,
            "phrase": "press on(ward)",
            "definition": "to continue; to continue to try.  Don’t give up! Press onward! _ I have lots to do. I must press on."
        },
        {
            "id": 245,
            "phrase": "press someone or something into service",
            "definition": "to force someone or something to serve or function. I don’t think you can press him into service just yet. He isn’t trained. I think that in an emergency, we could press this machine into service."
        },
        {
            "id": 246,
            "phrase": "press something against someone or something",
            "definition": "to push or force something against someone or something.  The person in line behind Betty kept pressing his elbow against her.  I pressed my hand against the door and it opened."
        },
        {
            "id": 247,
            "phrase": "press something together",
            "definition": "to use pressure to close or unite things.  He pressed his lips together and would say no more.  Why are his lips pressed together so tightly?"
        },
        {
            "id": 248,
            "phrase": "press something (up)on someone",
            "definition": "to urge or force something on someone; to try to get someone to accept something. (Upon is formal and less commonly used than on.) _He always presses second helpings upon his guests. She pressed a gift on us that we could not refuse."
        },
        {
            "id": 249,
            "phrase": "press (the) flesh",
            "definition": "Sl. to shake hands.  Hey, chum! Glad to press f lesh with you! _ He wanted to press the f lesh, but I refused even to touch him."
        }
    ]
}