{
    "dictionary": [
        {
            "id": 0,
            "phrase": "the balls of one’s feet",
            "definition": "the bottom part of the feet just behind the toes. Mary got blisters on the balls of her feet from playing tennis.  The dancer balanced on the balls of his feet."
        },
        {
            "id": 1,
            "phrase": "ban someone from something",
            "definition": "1. to prohibit someone from doing something. We banned everyone from smoking.  Everyone has been banned from smoking. 2. to prohibit someone from entering something or some place. (The same as bar someone from some place.) _ They banned us from the building. The manager banned the children from the theater."
        },
        {
            "id": 2,
            "phrase": "band together (against someone or something)",
            "definition": "to unite in opposition to someone or something; to unite against someone or something.  We must band together against the enemy.  Everyone banded together to finish the cleanup work."
        },
        {
            "id": 3,
            "phrase": "bandage someone or something up†",
            "definition": "to wrap bandages on someone or on someone’s wounds.  We should bandage the wounds up first.  We should bandage up the wounds first.  I have to bandage him up before we can move him. She bandaged herself up with the supplies she kept in her backpack."
        },
        {
            "id": 4,
            "phrase": "bandy something about†",
            "definition": "to spread something, such as someone’s good name, around in an unfavorable context; to toss words around in a gossipy fashion. (Bandy means to toss or hit something back and forth.) _ Just stop bandying words about and start telling the truth! _ There is no need to keep bandying about those rumors."
        },
        {
            "id": 5,
            "phrase": "bandy with someone",
            "definition": "to argue [with someone]; to argue by “playing catch with words.” (Bandy means to toss or hit something back and forth.) _ Why are you bandying with me? _ She has been bandied with enough. Give her a straight answer."
        },
        {
            "id": 6,
            "phrase": "bang against someone or something",
            "definition": "to knock or strike against someone or something.  The shutter banged against the side of the house.  The board banged against me and hurt my shin."
        },
        {
            "id": 7,
            "phrase": "bang (away) at something",
            "definition": "to hit at something repeatedly, causing harm or making noise.  Someone is banging away at the door.  Stop banging at the door."
        },
        {
            "id": 8,
            "phrase": "(bang) dead to rights",
            "definition": "in the act; (guilty) without question.  We caught her dead to rights with the loot still on her.  There he was, bang dead to rights with the smoking gun still in his hands."
        },
        {
            "id": 9,
            "phrase": "bang for the buck",
            "definition": "value for the money spent; excitement for the money spent; a favorable cost-to-benefit ratio. (Expressed as an amount of bang for the buck.) _I didn’t get anywhere near the bang for the buck I expected. How much bang for the buck did you really think you would get from a twelve-year-old car—at any price?"
        },
        {
            "id": 10,
            "phrase": "bang into someone or something",
            "definition": "to knock or bump into someone or something. Why did you bang into me with your car? _ I banged into the door by accident."
        },
        {
            "id": 11,
            "phrase": "bang on someone or something",
            "definition": "to strike someone or something repeatedly. (Especially to beat on a person or a drum.) _ Please stop banging on that drum! _ Max was banging on Lefty when the cops arrived."
        },
        {
            "id": 12,
            "phrase": "bang someone or something around†",
            "definition": "to knock someone or something about; to beat or strike someone or something.  Let’s bang him around a little and see if that will change his mind.  Why are you banging around my friend? _ Don’t bang those pans around. He banged himself around badly in the car wreck."
        },
        {
            "id": 13,
            "phrase": "bang someone up†",
            "definition": "to beat someone up; to assault someone; to damage someone.  The crooks banged him up a little bit.  The crash banged up the passengers in the car.  She banged herself up badly."
        },
        {
            "id": 14,
            "phrase": "bang something against someone or something",
            "definition": "to strike something against someone or something. (Usually refers to striking with something that can make a banging noise.) _ She banged the spoon against the pan to call everyone to dinner.  He banged the pan against me and made me very angry."
        },
        {
            "id": 15,
            "phrase": "bang something in†",
            "definition": "to crush something; to dent or collapse something. Who banged the side of the washing machine in? _ Who banged in the side of the washing machine?"
        },
        {
            "id": 16,
            "phrase": "bang something into someone or something",
            "definition": "to strike someone or something with something. Mark banged his fist into the cushion and swore.  He banged the pole into Liz by accident."
        },
        {
            "id": 17,
            "phrase": "bang something out†",
            "definition": "to play something on the piano, loudly, banging on the keys; to type something on a keyboard by pounding on the keys. Let me bang this melody out and see if you can guess who wrote it.  Please bang out the school song good and loud. I banged out the newspaper story and just barely made my deadline."
        },
        {
            "id": 18,
            "phrase": "bang something up†",
            "definition": "to crash or wreck something; to damage something.  Don’t bang my best skillet up! _ Who banged up my best skillet?"
        },
        {
            "id": 19,
            "phrase": "banish someone or something from some place",
            "definition": "to ban or evict someone or something from some place. The town council banished motorcycles from all the parks in town.  The new law banished vagrants from the train station."
        },
        {
            "id": 20,
            "phrase": "bank on something",
            "definition": "to be so sure of something that one can trust it as one might trust a bank with one’s money.  I will be there on time. You can bank on it.  I need a promise of your help. I hope I can bank on it."
        },
        {
            "id": 21,
            "phrase": "bank something up† (against something)",
            "definition": "1. to heap or mound up something so that it presses against something.  Walter banked the coals up against the side of the furnace.  He banked up the coals against the side.  Tim banked the coals up. 2. to heap or mound up something to guard against something.  They had to build barriers to hide behind. They banked dirt and rubble up against the oncoming attackers. Who banked up this dirt against the f lood? _ The river was rising, so we banked some dirt up."
        },
        {
            "id": 22,
            "phrase": "banker’s hours",
            "definition": "short work hours: 10:00 a.m. to 3:00 p.m. When did you start keeping banker’s hours? _There aren’t many bankers who keep banker’s hours these days."
        },
        {
            "id": 23,
            "phrase": "baptism of fire",
            "definition": "a first experience of something, usually something difficult or unpleasant. My son’s just had his first visit to the dentist. He stood up to this baptism of fire very well. Mary’s had her baptism of fire as a teacher. She was assigned to the worst class in the school."
        },
        {
            "id": 24,
            "phrase": "bar none",
            "definition": "with no exceptions. (Follows an assertion.) _ This is the best of all, bar none."
        },
        {
            "id": 25,
            "phrase": "bar someone from some place",
            "definition": "to prevent someone from entering some place.  Please don’t bar me from the movie theater. I will be quiet from now on.  They were barred from the concert for smoking."
        },
        {
            "id": 26,
            "phrase": "bare one’s soul (to someone)",
            "definition": "to reveal one’s innermost thoughts to someone; to tell another person exactly how one feels about someone or something. Mary bared her soul to Jane and Jane told Mary her problems also.  You don’t have to bare your soul to me. Just tell me why you are crying."
        },
        {
            "id": 27,
            "phrase": "the bare something",
            "definition": "the smallest or least possible.  Bob did the bare minimum of work to pass the class.  Food, clothing, and shelter are the bare necessities of life."
        },
        {
            "id": 28,
            "phrase": "bare something to someone",
            "definition": "to reveal or disclose something to someone. I have to know a guy pretty well before I will bare my innermost thoughts to him.  Our criminal involvement was bared to the judge."
        },
        {
            "id": 29,
            "phrase": "bare-bones",
            "definition": "Cliché limited; stripped down; lacking refinements or extras. This one is the bare-bones model. It has no accessories at all."
        },
        {
            "id": 30,
            "phrase": "barf out",
            "definition": "Sl. to become deranged, to a greater or lesser degree.  Terry barfed out when he heard about the damage Nick had done to his car.  Yuck! I thought I was going to barf out."
        },
        {
            "id": 31,
            "phrase": "barf someone out",
            "definition": "Sl. to disgust someone. (Fixed order.) _ You just barf me out! _ I barf myself out every time I look in the mirror."
        },
        {
            "id": 32,
            "phrase": "bargaining chip",
            "definition": "something to be used (traded) in negotiations. I want to use their refusal to meet our terms as a bargaining chip in future negotiations. I need to have a few bargaining chips ready when we get down to drawing up the contract."
        },
        {
            "id": 33,
            "phrase": "barge in (on someone or something)",
            "definition": "to break in on someone or something; to interrupt someone or something.  Oh! I’m sorry. I didn’t mean to barge in on you.  They barged in on the church service and caused a commotion.  Please don’t interrupt me! You can’t just barge in like that!"
        },
        {
            "id": 34,
            "phrase": "barge in(to some place)",
            "definition": "to go or come rudely into some place.  He just barged right in without knocking.  Don’t barge in like that, without letting us know you’re here!"
        },
        {
            "id": 35,
            "phrase": "barge into someone or something",
            "definition": "to bump or crash into someone or something, possibly on purpose.  She just barged into me and nearly knocked me over. Tom tripped, barged into the water cooler, and hurt his knee."
        },
        {
            "id": 36,
            "phrase": "bark at someone",
            "definition": "to speak harshly to someone. Don’t bark at me like that over such a trivial mistake! _ Ken barked at the children for being noisy."
        },
        {
            "id": 37,
            "phrase": "bark at someone or something",
            "definition": "[for a dog] to make a characteristic sharp sound at someone or something.  The dog is barking at the traffic again.  Their guard dog was barking at me."
        },
        {
            "id": 38,
            "phrase": "bark up the wrong tree",
            "definition": "to make the wrong choice; to ask the wrong person; to follow the wrong course. (Alludes to a dog in pursuit of an animal, where the animal is in one tree and the dog is barking at another tree.) _ If you think I’m the guilty person, you’re barking up the wrong tree.  The hitters blamed the team’s bad record on the pitchers, but they were barking up the wrong tree."
        },
        {
            "id": 39,
            "phrase": "A barking dog never bites.",
            "definition": "Prov. Someone who makes threats all the time seldom carries out the threats.  Old Mrs. Smith keeps saying she’ll call the police if we walk on her lawn, but don’t worry. A barking dog never bites. My boss threatens to fire me at least once a week, but a barking dog never bites."
        },
        {
            "id": 40,
            "phrase": "barrel along",
            "definition": "to move along rapidly.  The car was barreling along at a fairly rapid clip.  Don’t barrel along so fast that you miss the turn."
        },
        {
            "id": 41,
            "phrase": "barrel in(to some place)",
            "definition": "to move into a place rapidly and with great force.  Tony barreled into the room and interrupted the card game.  He just barreled in without knocking."
        },
        {
            "id": 42,
            "phrase": "a barrel of fun",
            "definition": "a tremendous amount of fun.  Jill is just a barrel of fun in class.  We had a barrel of fun at your party."
        },
        {
            "id": 43,
            "phrase": "barrel out (of some place)",
            "definition": "to move rapidly out of a place; to burst out of a place.  The kids barreled out of town as fast as they could go.  They heard the police siren and quickly barreled out."
        },
        {
            "id": 44,
            "phrase": "barter something away†",
            "definition": "to trade something away; to lose something of value in a trade. Don’t barter my car away! _ Don’t barter away anything of such high value."
        },
        {
            "id": 45,
            "phrase": "barter something for something else",
            "definition": "to trade something for something else.  He sought to barter the car for a large computer.  She bartered the piano for a settee."
        },
        {
            "id": 46,
            "phrase": "barter something off†",
            "definition": "to get rid of something by trading it for something else.  See if you can barter that old desk off.  She bartered off the used bookshelf."
        },
        {
            "id": 47,
            "phrase": "barter with someone",
            "definition": "to enter into trading with someone without using money; to bargain with someone. Are you willing to barter with me, or is this strictly a cash transaction?"
        },
        {
            "id": 48,
            "phrase": "base one’s opinion on something",
            "definition": "to make a judgment or form an opinion from something.  You must not base your opinion on one bad experience.  I base my opinion on many years of studying the problem."
        },
        {
            "id": 49,
            "phrase": "base something (up)on someone or something",
            "definition": "to ground something, such as one’s opinion, decision, or thinking, on someone or something; to found one’s ideas or attitude on something. (Upon is more formal and less commonly used than on.) _ I base my opinion on many, many facts.  I based my opinion upon my own seasoned judgment."
        },
        {
            "id": 50,
            "phrase": "bash someone or something around†",
            "definition": "to treat someone or something roughly (physically or figuratively); to beat on or abuse someone or something (physically or otherwise).  Stop bashing me around, and let’s talk.  The robber acted as though he was about to bash around his victims."
        },
        {
            "id": 51,
            "phrase": "bash something against someone or something",
            "definition": "to strike something against someone or something. He accidentally bashed his head against a beam. She bashed her sore elbow against Ted’s forehead and both of them were hurt."
        },
        {
            "id": 52,
            "phrase": "bash something in†",
            "definition": "to crush something inward or to the inside.  Don’t bash the door in! _ It sounds like someone is bashing in the door."
        },
        {
            "id": 53,
            "phrase": "bash something up†",
            "definition": "to crash something; to strike something and damage it. She bashed the car up badly. How did she bash up the car?"
        },
        {
            "id": 54,
            "phrase": "bask in something",
            "definition": "to enjoy or revel in something, such as praise, fame, etc. (Alludes to a person or animal resting in the warming rays of the sun.) _Alice enjoyed basking in her newfound fame.  Lily loves basking in praise."
        },
        {
            "id": 55,
            "phrase": "a basket case",
            "definition": "a person who is a nervous wreck. (Formerly referred to a person who is physically disabled in all four limbs because of paralysis or amputation.) _ After that all-day meeting, I was practically a basket case.  My weeks of worry were so intense that I was a real basket case afterwards."
        },
        {
            "id": 56,
            "phrase": "bat something around†",
            "definition": "to knock something around with a bat or something similar. Terry spent a little time batting a ball around, then he went home.  Let’s bat around some balls before we go home."
        },
        {
            "id": 57,
            "phrase": "ba(t)ch (it)",
            "definition": "to live alone like a bachelor.  I tried to bach it for a while, but I got too lonely.  I didn’t want to batch, but I had to."
        },
        {
            "id": 58,
            "phrase": "bathe someone or something in something",
            "definition": "to cleanse someone or something in something; to coat someone or something all over with some liquid. (In a container of liquid or the liquid itself.) _ She bathed the baby in warm water.  Liz bathed her injured hand in cold water.  She bathed herself in the warm spring water and took a long nap under a tree."
        },
        {
            "id": 59,
            "phrase": "batten down the hatches",
            "definition": "to prepare for difficult times. (From a nautical expression meaning, literally, to seal the hatches against the arrival of a storm. The word order is fixed.) _ Here comes that contentious Mrs. Jones. Batten down the hatches! _Batten down the hatches, Congress is in session again."
        },
        {
            "id": 60,
            "phrase": "batter someone or something up†",
            "definition": "to damage or harm someone or something.  Max threatened to batter Lefty up within an inch of his life.  Who battered up this desk?"
        },
        {
            "id": 61,
            "phrase": "batter something down†",
            "definition": "to smash or break down something, such as a wall, door, or any defensive structure.  Do they have to batter anything down as part of the construction project? _ They battered down the wall as a first step in enlarging the house."
        },
        {
            "id": 62,
            "phrase": "battle against someone or something",
            "definition": "to wage a fight against someone or something; to attempt to defeat someone or something.  The army battled against the enemy until both sides were exhausted."
        },
        {
            "id": 63,
            "phrase": "battle for something",
            "definition": "to fight to gain something.  The army battled for the town until they had defeated its defenders."
        },
        {
            "id": 64,
            "phrase": "battle of the bulge",
            "definition": "the attempt to keep one’s waistline slim. (Jocular. Alludes to a World War II battle.) _ She appears to have lost the battle of the bulge. I’ve been fighting the battle of the bulge ever since I turned 35."
        },
        {
            "id": 65,
            "phrase": "a battle royal",
            "definition": "a classic, hard-fought battle or argument.  The meeting turned into a battle royal and everyone left angry."
        },
        {
            "id": 66,
            "phrase": "battle something out†",
            "definition": "to fight about something to a conclusion.  They battled the matter out and came to an agreement.  The two young toughs went into the alley to battle out their differences."
        },
        {
            "id": 67,
            "phrase": "battle (with someone) (over someone or something)",
            "definition": "to argue or struggle with someone over someone or something. (Not meant to involve physical fighting.) _Why do you always have to battle with me over practically nothing? _ You shouldn’t battle over just anything for the sake of argument!"
        },
        {
            "id": 68,
            "phrase": "bawl someone out†",
            "definition": "to scold someone in a loud voice.  The teacher bawled the student out for arriving late. Principals don’t usually bawl out students."
        },
        {
            "id": 69,
            "phrase": "bay at something",
            "definition": "to howl at something. (Usually said of a dog, wolf, or coyote.) _The dogs were baying at the moon.  We heard a coyote in the distance, baying at the moon."
        },
        {
            "id": 70,
            "phrase": "Be careful.",
            "definition": "1. an instruction to take care in a particular situation.  Bill: I’m going to the beach tomorrow. Sally: Be careful. Use lots of sunscreen! _ Jane: Well, we’re off to the Amazon. Mary: Heavens! Be careful! 2. a way of saying good-bye while cautioning someone to take care.  John: See you around, Fred. Fred: Be careful. Alice: Well, I’m off. John: Bye, Alice, be careful."
        },
        {
            "id": 71,
            "phrase": "be game",
            "definition": "to be ready for action; to be agreeable to participating in something.  “I’m game,” David replied when I suggested we go for a long hike. We’re going to the park to play football. Are you game?"
        },
        {
            "id": 72,
            "phrase": "be in aid of",
            "definition": "to be intended to help, cure, or resolve.  What is all this in aid of ? _ I don’t understand what your comments are in aid of."
        },
        {
            "id": 73,
            "phrase": "Be just before you’re generous.",
            "definition": "Prov. Do what you ought to do before you do things that you want to do; pay your debts before you give money away. Jill: It’s payday! I can’t wait to go out and buy my niece that nice toy train set for her birthday. Jane: But, Jill, we have bills to pay. Be just before you’re generous."
        },
        {
            "id": 74,
            "phrase": "Be my guest.",
            "definition": "Help yourself.; After you. (A polite way of indicating that someone else should go first, help himself or herself to something, or take the last one of something.) _Mary: I would just love to have some more cake, but there is only one piece left. Sally: Be my guest. Mary: Wow! Thanks! _ Jane: Here’s the door. Who should go in first? Bill: Be my guest. I’ll wait out here. Jane: You’re so polite!"
        },
        {
            "id": 75,
            "phrase": "be one’s brother’s keeper",
            "definition": "to be responsible for someone else. (Used of others besides just real brothers.) _ I can’t force these kids to go to school and get an education so they can get jobs. I am not my brother’s keeper. You can’t expect me to be my brother’s keeper. Each of us should be responsible for himself!"
        },
        {
            "id": 76,
            "phrase": "Be quiet!",
            "definition": "Stop talking or making noise. (Regarded as a bit harsh or overbearing, but made polite with please.) _ Bill (entering the room): Hey, Tom! Tom: Please be quiet! I’m on the phone.  Tom: Hey, Bill! Bill: Be quiet! You’re too loud. Tom: Sorry."
        },
        {
            "id": 77,
            "phrase": "be that as it may",
            "definition": "Cliché even if what you say is true.  I am sorry to hear about your troubles, but, be that as it may, you still must carry out your responsibilities.  Be that as it may, I still cannot help you."
        },
        {
            "id": 78,
            "phrase": "be the last person (to do something)",
            "definition": "to be the most unlikely person of whom one could think in a particular situation; to be the most unlikely person to do something. (Also literal.) _ Mary is the last person you should ask to chair the meeting—she’s so shy."
        },
        {
            "id": 79,
            "phrase": "Be there or be square.",
            "definition": "Sl. Attend or be at some event or place or be considered uncooperative or not “with it.” _ There’s a bunch of people going to be at John’s on Saturday. Be there or be square."
        },
        {
            "id": 80,
            "phrase": "Beam me up, Scotty!",
            "definition": "Get me out of here!; Take me away from this mess! (From the late 1960s television program Star Trek.) _This place is really crazy! Beam me up, Scotty! _ I’ve heard enough! Beam me up, Scotty!"
        },
        {
            "id": 81,
            "phrase": "beam someone or something up† (to some place)",
            "definition": "to transport someone or something (up) to something. (Originally in the context of a Star Trek adventure, but also used jocularly.) _The captain asked the first mate to beam him up.  Please beam up the crew, Roger.  Beam me up so I can see your penthouse suite!"
        },
        {
            "id": 82,
            "phrase": "beam up",
            "definition": "Sl. to die. (Alluding to the television program Star Trek.) _ Pete Dead? I didn’t think he was old enough to beam up. I was so exhausted after climbing four f lights that I was afraid I would beam up."
        },
        {
            "id": 83,
            "phrase": "bear a resemblance to someone or something",
            "definition": "to have a degree of similarity to someone or something. This wallet bears a strong resemblance to the one I lost last month. Do you think that Wally bears any resemblance to his sister Mary?"
        },
        {
            "id": 84,
            "phrase": "bear down (on someone or something)",
            "definition": "to press down on someone or something. Bear down on the pen. You have to make a lot of copies. Don’t bear down too hard or you’ll break it."
        },
        {
            "id": 85,
            "phrase": "bear fruit",
            "definition": "[for a plant or tree] to yield fruit.  Our apple tree didn’t bear fruit this year."
        },
        {
            "id": 86,
            "phrase": "bear in mind that...",
            "definition": "to remember [something]; to consider [something].  Bear in mind that the trip will be expensive.  I asked the teacher to bear in mind that I am just a beginner."
        },
        {
            "id": 87,
            "phrase": "bear off (of something)",
            "definition": "to turn off a road or course.  Bear off the main road to the left.  Don’t bear off too sharply."
        },
        {
            "id": 88,
            "phrase": "bear someone or something up†",
            "definition": "to hold someone or something up; to support someone or something.  Will this bench bear me up? _ This bench is so sturdy it would bear up an elephant."
        },
        {
            "id": 89,
            "phrase": "bear someone up†",
            "definition": "to sustain or encourage someone. Your encouragement bore me up through a very hard time.  I will bear up the widow through the funeral service as well as I can."
        },
        {
            "id": 90,
            "phrase": "bear something out†",
            "definition": "[for facts or evidence] to support or confirm a story or explanation. The facts don’t bear this out.  Her story bears out exactly what you said."
        },
        {
            "id": 91,
            "phrase": "bear the brunt (of something)",
            "definition": "to withstand the worst part or the strongest part of something, such as an attack.  I had to bear the brunt of her screaming and yelling.  Why don’t you talk with her the next time she complains? I’m tired of bearing the brunt of her objections."
        },
        {
            "id": 92,
            "phrase": "bear up (against something)",
            "definition": "to withstand something.  She was unable to bear up against the criticism. Ken bore up against the challenge of his disabling injury well."
        },
        {
            "id": 93,
            "phrase": "bear up (under something)",
            "definition": "to hold up under something; to sustain the weight of something.  How is the new beam bearing up under the weight of the f loor? _ It isn’t bearing up. It broke."
        },
        {
            "id": 94,
            "phrase": "bear (up)on something",
            "definition": "[for information or facts] to concern something or be relevant to something. (Upon is formal and less commonly used than on.) _ How do those facts bear on this matter? _They do not bear upon this matter at all."
        },
        {
            "id": 95,
            "phrase": "bear watching",
            "definition": "to need close, attentive observation or monitoring.  This problem will bear watching.  This is a very serious disease, and it will bear watching for further developments."
        },
        {
            "id": 96,
            "phrase": "bear with someone or something",
            "definition": "to be patient with someone or something; to wait upon someone or something. (Especially through difficulties.) _ Please bear with me for a moment while I try to get this straightened out. Can you bear with the committee until it reaches a decision?"
        },
        {
            "id": 97,
            "phrase": "beat a (hasty) retreat",
            "definition": "to withdraw from a place very quickly.  We went out into the cold weather, but beat a retreat to the warmth of our fire.  The dog beat a hasty retreat to its own yard."
        },
        {
            "id": 98,
            "phrase": "beat a path to someone’s door",
            "definition": "[for people] to arrive (at a person’s place) in great numbers. (The image is that so many people will wish to come that they will wear down a pathway to the door.) _ I have a new product so good that everyone will beat a path to my door.  If you really become famous, people will beat a path to your door."
        },
        {
            "id": 99,
            "phrase": "beat against someone or something",
            "definition": "to strike against someone or something. The wind beat against the sides of the house.  Max beat against Lefty’s jaw with his quick jabs."
        },
        {
            "id": 100,
            "phrase": "beat at something",
            "definition": "to strike out at something.  He beat at his attacker to no avail.  Lily beat at the snake, but didn’t harm it."
        },
        {
            "id": 101,
            "phrase": "beat down (on someone or something)",
            "definition": "to fall on someone or something.  The rain beat down on us for an hour.  The rock slide beat down on the car and totally ruined the body."
        },
        {
            "id": 102,
            "phrase": "Beat it!",
            "definition": "Inf. Go away!; Get out! _ Bill: Sorry I broke your radio. Bob: Get out of here! Beat it! _ “Beat it, you kids! Go play somewhere else!” yelled the storekeeper."
        },
        {
            "id": 103,
            "phrase": "beat on someone or something",
            "definition": "to pound or hammer on someone or something.  She beat on him until he let her go.  Stop beating on that drum!"
        },
        {
            "id": 104,
            "phrase": "beat one’s brains out† (to do something)",
            "definition": "to try very hard to do something. If you think I’m going to beat my brains out to do this, you are crazy.  I beat out my brains to do this for you! _ I won’t beat my brains out again for you!"
        },
        {
            "id": 105,
            "phrase": "beat one’s gums",
            "definition": "to waste time talking a great deal without results. (As if one were toothless.) _I’m tired of beating my gums about this over and over.  You’re just beating your gums. No one is listening."
        },
        {
            "id": 106,
            "phrase": "beat oneself up",
            "definition": "to be overly critical of one’s behavior or actions; to punish oneself with guilt and remorse over past actions. (Not a physical beating. Fixed order.) _ It’s over and done with. There’s no need to beat yourself up.  He’s beating himself up over his role in the accident."
        },
        {
            "id": 107,
            "phrase": "beat someone down†",
            "definition": "to defeat or demoralize someone.  The constant bombing finally beat them down.  The attackers beat down the defenders."
        },
        {
            "id": 108,
            "phrase": "beat someone into (doing) something",
            "definition": "to beat a person until the person agrees to do something or to assume a particular attitude.  They had to beat John into submission before he gave up. Max threatened to beat Lefty into helping him rob the candy store."
        },
        {
            "id": 109,
            "phrase": "beat someone into something",
            "definition": "to beat a person until the person turns into a particular physical state, such as a pulp, a mess, etc.  Fred threatened to beat Mike into a pulp if he didn’t do as he was asked.  Mike beat Fred into a bloody mess."
        },
        {
            "id": 110,
            "phrase": "beat someone or something back†",
            "definition": "to drive someone or something back to where it came from.  We beat them back to where they were before the war started. The army beat back the defenders and saved the town.  They were able to beat the wolves back and make an escape."
        },
        {
            "id": 111,
            "phrase": "beat someone or something off†",
            "definition": "to drive someone or something away by beating.  They beat the enemy off.  The army beat off the savage attack, saving the town.  I was able to beat off the intruder."
        },
        {
            "id": 112,
            "phrase": "beat someone or something out†",
            "definition": "to beat someone or something; to win over someone or something.  The other team beat us out readily.  They beat out every other team in the league, too.  I will win! You will not beat me out!"
        },
        {
            "id": 113,
            "phrase": "beat someone out†",
            "definition": "to outdistance someone; to perform better than someone. We have to beat the other company out, and then we’ll have the contract.  I beat out Walter in the foot race."
        },
        {
            "id": 114,
            "phrase": "beat someone’s brains out",
            "definition": "1. to hit or batter someone severely.  She threatened to beat my brains out.  Those thugs nearly beat his brains out. 2. to drive oneself hard (to accomplish something). I beat my brains out all day to clean this house, and you come in and get dirt on the carpet! _ Don’t beat your brains out. Just give it a good try."
        },
        {
            "id": 115,
            "phrase": "beat someone to something",
            "definition": "to get to something before someone else; to claim something before someone else does.  You beat me to it and took the last cookie.  Ken beat John to the door."
        },
        {
            "id": 116,
            "phrase": "beat someone up†",
            "definition": "to harm or subdue a person by striking him.  The robber beat me up and took my money.  I really wanted to beat up that intruder."
        },
        {
            "id": 117,
            "phrase": "beat something down†",
            "definition": "1. to break something in; to break through something. Don’t beat the door down! I’m coming! _Please don’t beat down the door! 2. to flatten something.  Sam beat the veal down to the thickness of a half an inch. First you beat down the meat to a very thin layer."
        },
        {
            "id": 118,
            "phrase": "beat something into something",
            "definition": "to beat or whip something with a utensil, until it changes into something else. Beat the white of the egg into stiff peaks.  Beat the batter into a smooth consistency."
        },
        {
            "id": 119,
            "phrase": "beat something up†",
            "definition": "1. to whip up something, such as an egg.  Beat the egg up and pour it in the skillet.  Beat up another egg and do the same. 2. to ruin something; to damage something.  The banging of the door has really beat this wall up. The frequent pounding of the door handle beat up the wall."
        },
        {
            "id": 120,
            "phrase": "beat the clock",
            "definition": "to do something before a deadline; to finish before the time is up. (Alludes to accomplishing something before a clock reaches a specific time.) _ Sam beat the clock, arriving a few minutes before the doors were locked.  They were afraid they would be late and hurried in order to beat the clock."
        },
        {
            "id": 121,
            "phrase": "beat the gun",
            "definition": "to manage to do something before the ending signal. (Originally from sports, referring to scoring in the last seconds of a game just before the referee fires a gun to signal the end of the game.) _The field goal beat the gun and was in the air just in time. Tom tried to beat the gun, but he was one second too slow."
        },
        {
            "id": 122,
            "phrase": "beat the rap",
            "definition": "Sl. to evade conviction and punishment (for a crime). He was charged with drunk driving, but he beat the rap.  The police hauled Tom in and charged him with a crime. His lawyer helped him beat the rap."
        },
        {
            "id": 123,
            "phrase": "beat up on someone",
            "definition": "to batter someone, usually physically.  Lefty beat up on Max and made a mess of him.  Don’t beat up on me, you bully!"
        },
        {
            "id": 124,
            "phrase": "Beauty is in the eye of the beholder.",
            "definition": "Prov. Different people have different ideas about what is beautiful. Bob: I can’t believe Ted bought that ugly old car. Fred: He loves it. Beauty is in the eye of the beholder. Jill: Have you seen Mary’s pictures of her new baby? He looks pretty ugly, to my eyes. Jane: Beauty is in the eye of the beholder."
        },
        {
            "id": 125,
            "phrase": "Beauty is only skin-deep.",
            "definition": "Prov. A person who looks beautiful may not have a pleasing personality; a person’s good looks may not last.  Fred: I hope Nancy will go out with me. She’s so beautiful! Jane: I hate to disappoint you, but in Nancy’s case, beauty is definitely only skin-deep.  Don’t be so proud of your pretty face. Beauty is only skindeep."
        },
        {
            "id": 126,
            "phrase": "beckon to someone",
            "definition": "to signal someone to come.  Wally beckoned to Sally, and she came over to him.  Lily beckoned to Max and he turned his back on her."
        },
        {
            "id": 127,
            "phrase": "become of someone or something",
            "definition": "to happen or occur to someone or something. Whatever became of Joe and his friends? _I don’t know what became of my other plaid sock."
        },
        {
            "id": 128,
            "phrase": "*becoming on someone",
            "definition": "[of clothing] complimentary to someone; [of clothing] enhancing one’s good looks. (*Typically: be ~; look ~.) _ The dress you wore last night is not becoming on you.  That color is very becoming on you."
        },
        {
            "id": 129,
            "phrase": "bed down (for something)",
            "definition": "to lie down to sleep for a period of time. After she had bedded down for the night, the telephone rang.  All the chickens bedded down hours ago."
        },
        {
            "id": 130,
            "phrase": "bed down some place",
            "definition": "to sleep somewhere; to find a place to sleep somewhere.  I need to bed down somewhere for the night.  Can I bed down here with you?"
        },
        {
            "id": 131,
            "phrase": "a bed of roses",
            "definition": "a luxurious situation; an easy life.  Who said life would be a bed of roses? _If I had a million bucks, I would be in a bed of roses."
        },
        {
            "id": 132,
            "phrase": "bed (someone or something) down† (some place)",
            "definition": "to put someone or something into a bed or on bedding some place.  We bedded the kids down on mattresses on the f loor.  We bedded down the horses for the night."
        },
        {
            "id": 133,
            "phrase": "bed-and-breakfast",
            "definition": "a type of lodging for travelers or tourists offering a place to sleep and breakfast the next morning, typically in a small inn or private home.  We visited six European countries and stayed in a bed-andbreakfast every night.  I had to take a bed-and-breakfast because the hotels in the city were much too expensive."
        },
        {
            "id": 134,
            "phrase": "bedeck someone or something with something",
            "definition": "to decorate someone or something with something.  She bedecked herself with garlands of daisies. Karen bedecked the room with f lowers."
        },
        {
            "id": 135,
            "phrase": "*a bee in one’s bonnet",
            "definition": "a single idea or a thought that remains in one’s mind; an obsession. (*Typically: get ~; have ~; give one ~.) _ I have a bee in my bonnet over that cool new car I saw, and I can’t stop thinking about it.  I got a bee in my bonnet about swimming. I just wanted to go swimming all the time."
        },
        {
            "id": 136,
            "phrase": "beef about someone or something",
            "definition": "Sl. to complain about someone or something. Stop beefing about Karen. He is always beefing about his working conditions."
        },
        {
            "id": 137,
            "phrase": "beef something up†",
            "definition": "to add strength or substance to something.  Let’s beef this music up with a little more on the drums.  They beefed up the offer with another thousand dollars."
        },
        {
            "id": 138,
            "phrase": "beer up",
            "definition": "Sl. to drink a lot of beer. Those guys are out there beering up like mad.  Stop beering up and go home!"
        },
        {
            "id": 139,
            "phrase": "before long",
            "definition": "soon. Billy will be grown-up before long.  If we keep spending so much, before long we’ll be without any money."
        },
        {
            "id": 140,
            "phrase": "*before someone’s time",
            "definition": "happening before someone was born or old enough to know what was going on. (*Typically: be ~; happen ~; occur ~.) _Of course I don’t remember it. It was before my time.  All that happened before your time."
        },
        {
            "id": 141,
            "phrase": "before you know it",
            "definition": "almost immediately.  I’ll be there before you know it. If you keep spending money like that, you’ll be broke before you know it."
        },
        {
            "id": 142,
            "phrase": "beg for someone or something",
            "definition": "to plead to be given someone or something. He missed Jane a lot and was just begging for her to return to him.  Jane begged for another helping of ice cream."
        },
        {
            "id": 143,
            "phrase": "beg of someone",
            "definition": "to request earnestly of someone. (Usually added to a request.) _ Please help me. I beg of you.  I beg of you to help me."
        },
        {
            "id": 144,
            "phrase": "beg off (on something)",
            "definition": "to ask to be released from something; to refuse an invitation.  I’m sorry, but I’ll be out of town on the day of your party. I’ll have to beg off on your invitation.  I have an important meeting, so I’ll have to beg off."
        },
        {
            "id": 145,
            "phrase": "beg something from someone",
            "definition": "to plead for something from someone. She begged the amount of a telephone call from someone who walked by.  I begged a dollar from a kind lady who went by."
        },
        {
            "id": 146,
            "phrase": "beg something of someone",
            "definition": "to request earnestly that someone do something or grant something.  Please help me. I beg it of you.  She begged a favor of Max."
        },
        {
            "id": 147,
            "phrase": "beg something off†",
            "definition": "to decline an invitation politely.  She begged the trip to the zoo off.  We all begged off the dinner invitation."
        },
        {
            "id": 148,
            "phrase": "beg the question",
            "definition": "1. to carry on a false argument where one assumes as proved the very point that is being argued, or more loosely, to evade the issue at hand. (Essentially a criticism of someone’s line of argument.) _ Stop arguing in circles. You’re begging the question. A: Why do two lines that are equidistant from one another never meet? B: Because they are parallel. A: You are begging the question. 2. to invite the (following) question. (This reinterpretation of beg the question is incorrect but is currently in widespread use.) _ His complaints beg the question: Didn’t he cause all of his problems himself ?"
        },
        {
            "id": 149,
            "phrase": "beg to differ (with someone)",
            "definition": "to disagree with someone; to state one’s disagreement with someone in a polite way. (Usually used in a statement made to the person being disagreed with.) _ I beg to differ with you, but you have stated everything exactly backwards.  If I may beg to differ, you have not expressed my position as well as you seem to think."
        },
        {
            "id": 150,
            "phrase": "beggar (all) description",
            "definition": "to defy description; to be unable to be described.  The house was a horrible mess. The place beggared description.  Our reaction to the proposal beggars description. We were deeply disturbed for days."
        },
        {
            "id": 151,
            "phrase": "Beggars can’t be choosers.",
            "definition": "Prov. If someone gives you something you asked for, you should not complain about what you get.  I asked Joe to lend me his bicycle, and he sent me this old, rusty one. But beggars can’t be choosers.  Jill: Let me wear your green dress; I don’t like the blue one you lent me. Jane: Beggars can’t be choosers."
        },
        {
            "id": 152,
            "phrase": "begin by doing something",
            "definition": "to start out by doing something first.  We will begin by painting the house.  She began by opening the door."
        },
        {
            "id": 153,
            "phrase": "begin to see daylight",
            "definition": "to begin to see the end of a long task.  I’ve been working on my thesis for two years, and at last I’m beginning to see daylight. I’ve been so busy. Only in the last week have I begun to see daylight."
        },
        {
            "id": 154,
            "phrase": "begin to see the light",
            "definition": "to begin to understand something.  My algebra class has been hard for me, but I’m beginning to see the light.  I was totally confused, but I began to see the light after your explanation."
        },
        {
            "id": 155,
            "phrase": "begin with someone or something",
            "definition": "to start off a sequence with someone or something.  Let’s have dinner begin with a nice clear soup.  I will begin with Liz and take Frank next."
        },
        {
            "id": 156,
            "phrase": "beginner’s luck",
            "definition": "absolute luck; the luck of an inexperienced person. (Referring to surprisingly good luck.) _ I could never have accomplished this if I had practiced a lot. My win was just beginner’s luck."
        },
        {
            "id": 157,
            "phrase": "the beginning of the end",
            "definition": "the start of the termination of something or of someone’s death.  When he stopped coughing and grew still, I knew it was the beginning of the end.  The enormous debt we ran up marked the beginning of the end as far as our standard of living was concerned."
        },
        {
            "id": 158,
            "phrase": "beguile someone into something",
            "definition": "to charm someone into doing something.  You can’t beguile me into stealing for you! _ I beguiled Tom into driving me to the airport."
        },
        {
            "id": 159,
            "phrase": "beguile someone out of something",
            "definition": "1. to charm someone out of doing something. I will try to beguile them out of doing it.  He beguiled her out of leaving. 2. to charm something away from someone.  She’s trying to beguile the old man out of a substantial amount of his money.  Max beguiled the old lady out of her rings."
        },
        {
            "id": 160,
            "phrase": "beguile someone with something",
            "definition": "to charm or fascinate someone with something.  She beguiled her date with tales of her luxurious lifestyle.  He spent the evening beguiling her with stories of the Old West."
        },
        {
            "id": 161,
            "phrase": "*behind bars",
            "definition": "in jail. (*Typically: be ~; put someone ~.) _ Very soon, you will be behind bars for your crimes. Max should be behind bars soon for his conviction on burglary charges."
        },
        {
            "id": 162,
            "phrase": "behind closed doors",
            "definition": "in secret; away from observers, reporters, or intruders, usually in a closed room.  They held the meeting behind closed doors, as the law allowed.  Every important issue was decided behind closed doors."
        },
        {
            "id": 163,
            "phrase": "*behind schedule",
            "definition": "having failed to do something by the appointed time, especially the time given on a written plan. (*Typically: be ~; fall ~; get ~.) _We have to hurry and finish soon or we will fall behind schedule. The project is behind schedule by six months."
        },
        {
            "id": 164,
            "phrase": "behind someone’s back",
            "definition": "without someone’s knowledge; secret from someone. Please don’t talk about me behind my back.  She sold the car behind his back, while he was away on vacation."
        },
        {
            "id": 165,
            "phrase": "*behind the eight ball",
            "definition": "1. Fig. in trouble; in a weak or losing position. (Alludes to the eight ball in pool, which in certain games cannot be touched without penalty. *Typically: be ~; get ~; have someone ~; put someone ~.) _I’m behind the eight ball again and can’t see how to relieve my dilemma.  John is behind the eight ball because he started writing his term paper far too late. 2. Fig. broke. Sorry, I’m really behind the eight ball this month. I can’t make a contribution. (*Typically: be ~; get ~; have someone ~; put someone ~.) _ I was behind the eight ball again and couldn’t make my car payment."
        },
        {
            "id": 166,
            "phrase": "behind the scenes",
            "definition": "without receiving credit or fame; out of public view. (Referring originally to those who worked on a theatrical piece but do not appear on the stage.) _ The people who worked behind the scenes are the real heroes of this project.  I worked behind the scenes in the play.  We should thank the people who are behind the scenes of our success."
        },
        {
            "id": 167,
            "phrase": "behind the times",
            "definition": "old-fashioned.  Sarah is a bit behind the times. Her clothes are quite old-fashioned.  Our 90- year-old state senator is a bit behind the times."
        },
        {
            "id": 168,
            "phrase": "Behind you!",
            "definition": "Look behind you!; There is danger behind you! _ “Behind you!” shouted Tom just as a car raced past and nearly knocked Mary over.  Alice shouted, “Behind you!” just as the pickpocket made off with Fred’s wallet."
        },
        {
            "id": 169,
            "phrase": "behoove one to do something",
            "definition": "Cliché [for someone] to be obliged to do something.  It behooves you to apologize to her for how you insulted her.  It behooves me to make up for all the help you have given me."
        },
        {
            "id": 170,
            "phrase": "belabor the point",
            "definition": "to spend too much time on one item of discussion.  I don’t want to belabor the point, but the sooner we get this matter settled, the better. If the speaker would agree not to belabor the point further, I will place it on the agenda for resolution at the next meeting."
        },
        {
            "id": 171,
            "phrase": "belch out",
            "definition": "to burst, billow, or gush out.  Smoke belched out of the chimney."
        },
        {
            "id": 172,
            "phrase": "belch something up†",
            "definition": "to cause the release of something that goes upward.  The fire belched flames and smoke up.  The volcano belched up clouds of poison gasses."
        },
        {
            "id": 173,
            "phrase": "believe in someone or something",
            "definition": "to trust or have faith in someone or something; to accept a fact or what someone says as truth.  You must believe in your own abilities.  I believe in myself and my talent."
        },
        {
            "id": 174,
            "phrase": "believe it or not",
            "definition": "(you may) choose to accept something as true or not; it may seem amazing but it’s true.  It’s late, but believe it or not, I just got home from work.  I’m over fifty years old, believe it or not."
        },
        {
            "id": 175,
            "phrase": "Believe nothing of what you hear, and only half of what you see.",
            "definition": "Prov. Rumors are usually false, and sometimes the things you see can be misleading as well; be very skeptical until there is proof.  Jill: I heard the football team is losing its best player. He has not been at practice for two days. Jane: Believe nothing of what you hear, and only half of what you see.  The paper reported that the city government is going bankrupt, but I believe nothing of what I hear, and only half of what I see."
        },
        {
            "id": 176,
            "phrase": "believe something of someone",
            "definition": "to accept a statement about someone as truth.  What a terrible thing for Jill to do. I can’t believe it of her. I can believe anything of Max. He’s such a conniving person."
        },
        {
            "id": 177,
            "phrase": "Believe you me!",
            "definition": "Inf. You really should believe me!; You’d better take my word for it! _ Alice: Is it hot in that room? Fred: It really is. Believe you me! _ Sue: How do you like my cake? John: Believe you me, this is the best cake I’ve ever eaten!"
        },
        {
            "id": 178,
            "phrase": "bell, book, and candle",
            "definition": "things that are miraculous or that signal that something unusual or bizarre may soon happen. (Alluding originally to the items used when performing the rite of excommunication from the Roman Catholic Church.) _ Look, I can’t work miracles! Do you expect me to show up at your house with bell, book, and candle, and make everything right? You have to take charge of your own destiny! _ On the top shelf of the tiny used-book store, Jim saw a bell, book, and candle sitting in a row, and he knew he was going to find some very interesting reading material."
        },
        {
            "id": 179,
            "phrase": "bellow something out†",
            "definition": "to cry something out loudly with great force.  Don’t just say it. Bellow it out! _ Bellow out your name so we know who you are!"
        },
        {
            "id": 180,
            "phrase": "bells and whistles",
            "definition": "extra, fancy add-ons or gadgets.  I like cars that are loaded with all the bells and whistles.  All those bells and whistles add to the cost."
        },
        {
            "id": 181,
            "phrase": "belly out",
            "definition": "[for a sheet of fabric, such as a ship’s sail] to fill out in the wind.  The sails bellied out as the ship turned to catch the wind.  When the sails bellied out, we began to move forward."
        },
        {
            "id": 182,
            "phrase": "belly up",
            "definition": "1. intoxicated by alcohol.  Fred was boiled— belly up—glassy-eyed. After four beers, I was belly up, for sure. 2. Sl. (of a business) bankrupt; dead. (Like a dead fish that floats belly up.) _ That’s the end. This company is belly up.  After the fire the firm went belly up."
        },
        {
            "id": 183,
            "phrase": "belly up (to something)",
            "definition": "to move up to something, often a bar. (Usually in reference to nudging one’s way to a bar.) _ The man swaggered in and bellied up to the counter and demanded my immediate attention.  As he bellied up, he said, “Do you know who I am?”"
        },
        {
            "id": 184,
            "phrase": "belong to someone or something",
            "definition": "to be owned by someone or something.  This one belongs to me.  This desk belongs to the company. You can’t take it home!"
        },
        {
            "id": 185,
            "phrase": "belong under something",
            "definition": "to be classified under some general category. This one belongs under the other category.  This file belongs under A."
        },
        {
            "id": 186,
            "phrase": "below average",
            "definition": "lower or worse than average.  Tom’s strength is below average for a child his size.  Dad asked why my grades are below average."
        },
        {
            "id": 187,
            "phrase": "below par",
            "definition": "not as good as average or normal. I feel a little below par today. I think I am getting a cold.  His work is below par, and he is paid too much money."
        },
        {
            "id": 188,
            "phrase": "below someone",
            "definition": "ranking below someone.  I am below Terri, but my scores are better than Carol’s.  I am below everyone in the class."
        },
        {
            "id": 189,
            "phrase": "*below someone or something",
            "definition": "positioned under or lower than someone or something. (*Typically: be ~; lie ~; sink ~; sit ~.) _ The sun is below the horizon.  The swimming hole is below the dam."
        },
        {
            "id": 190,
            "phrase": "belt a drink down†",
            "definition": "to drink an alcoholic drink rapidly.  She belted a couple of drinks down and went out to face her guests.  How many drinks did Gloria belt down?"
        },
        {
            "id": 191,
            "phrase": "belt someone or something down†",
            "definition": "to secure someone or something with a belt or strap. Please belt the child’s seat down and put the child in it. Did you belt down the kids?"
        },
        {
            "id": 192,
            "phrase": "belt someone up†",
            "definition": "to secure someone with a belt, such as a seat belt in a car. I had to belt her up because the seat belt was so complicated.  We belted up the kids securely."
        },
        {
            "id": 193,
            "phrase": "belt something out†",
            "definition": "to sing or play a song loudly and with spirit. When she’s playing the piano, she really belts the music out.  She really knows how to belt out a song."
        },
        {
            "id": 194,
            "phrase": "belt the grape",
            "definition": "Sl. to drink wine or liquor heavily and become intoxicated.  He has a tendency to belt the grape—every afternoon after work. She’s been belting the grape more than her husband wants."
        },
        {
            "id": 195,
            "phrase": "bend back",
            "definition": "to lean or bend backwards.  He bent back to pick up the book, and he fell.  When she bent back, she ripped something."
        },
        {
            "id": 196,
            "phrase": "bend before something",
            "definition": "to bend under the pressure of moving air.  The trees bent before the wind.  Our roses bent gracefully before the breeze."
        },
        {
            "id": 197,
            "phrase": "bend down",
            "definition": "to curve downward; [for someone] to lean down.  Please bend down and pick up the little bits of paper you just dropped.  The snow-laden bushes bent down."
        },
        {
            "id": 198,
            "phrase": "bend forward",
            "definition": "to lean forward; to curve forward.  The tree bent forward in the wind.  I bent forward to pick up the pencil."
        },
        {
            "id": 199,
            "phrase": "bend in",
            "definition": "to curve or turn inward. The shore bent in about a mile to the west.  The side of the shed bent in under the force of the wind."
        },
        {
            "id": 200,
            "phrase": "bend over",
            "definition": "[for someone] to bend down at the waist.  I bent over and picked up the coin.  When he bent over, something ripped."
        },
        {
            "id": 201,
            "phrase": "bend over backwards (to do something) (for someone)",
            "definition": "to work very hard to accomplish something for someone; to go out of one’s way (to do something) (for someone).  He will bend over backwards to help you.  I bent over backwards for you, and you showed no thanks!"
        },
        {
            "id": 202,
            "phrase": "bend someone or something back†",
            "definition": "to curve or arch someone or something backward.  We bent the child back a little so we could examine the spider bite.  Ouch! Don’t bend back my hand! _ Bend the branch back so we can get a better view."
        },
        {
            "id": 203,
            "phrase": "bend someone out of shape",
            "definition": "to make someone angry.  The cheating that was going on really bent Joe out of shape.  Why do you let yourself get bent out of shape? Chill, man, chill."
        },
        {
            "id": 204,
            "phrase": "bend someone’s ear",
            "definition": "to talk to someone, perhaps annoyingly. (As if talking so much that the other person’s ear is moved back.) _ Tom is over there, bending Jane’s ear about something.  I’m sorry. I didn’t mean to bend your ear for an hour."
        },
        {
            "id": 205,
            "phrase": "bend something out of shape",
            "definition": "to distort something by twisting or bending.  Jill bent the spring out of shape.  I bent the coat hanger out of shape by hanging my leather jacket on it."
        },
        {
            "id": 206,
            "phrase": "beneath contempt",
            "definition": "exceedingly contemptible.  What you have done is beneath contempt.  Your rude behavior is beneath contempt."
        },
        {
            "id": 207,
            "phrase": "beneath one’s dignity",
            "definition": "too rude or coarse for a polite person to do.  That kind of thing is beneath my dignity, and I hope yours as well. I would have thought something like that to be beneath your dignity."
        },
        {
            "id": 208,
            "phrase": "beneath someone",
            "definition": "too shameful for a polite person to do.  That kind of thing is beneath Fred. I’m appalled that he did it.  That sort of foul language is beneath you!"
        },
        {
            "id": 209,
            "phrase": "*beneath something",
            "definition": "under something. (*Typically: be ~; sit ~.) _ What is that beneath the table? _ The cat is beneath the piano."
        },
        {
            "id": 210,
            "phrase": "*the benefit of the doubt",
            "definition": "a judgment in one’s favor when the evidence is neither for one nor against one. (*Typically: get ~; have ~; give someone ~.) _I was right between a B and an A. I got the benefit of the doubt— an A. I thought I should have had the benefit of the doubt, but the judge made me pay a fine."
        },
        {
            "id": 211,
            "phrase": "bent on doing something",
            "definition": "determined to do something.  I believe you are bent on destroying the entire country.  I am bent on saving the planet."
        },
        {
            "id": 212,
            "phrase": "bent out of shape",
            "definition": "1. Fig. angry; insulted. Man, there is no reason to get so bent out of shape. I didn’t mean any harm.  I got bent out of shape because of the way I was treated. 2. intoxicated by alcohol or drugs. I was so bent out of shape I thought I’d never recover.  I’ve been polluted, but never as bent out of shape as this."
        },
        {
            "id": 213,
            "phrase": "bequeath something to someone",
            "definition": "to will something to someone; to leave something to someone.  My uncle bequeathed some furniture to me.  I will bequeath this watch to my grandson."
        },
        {
            "id": 214,
            "phrase": "bereft of someone or something",
            "definition": "left without someone or something. (Bereft is the past participle of bereave, functioning here as an adjective.) _Tom was bereft of all hope.  The child was bereft of his parents."
        },
        {
            "id": 215,
            "phrase": "beset someone with something",
            "definition": "to surround someone with harassment; to harass someone with something. Please do not beset them with problem after problem. They beset us with requests for money."
        },
        {
            "id": 216,
            "phrase": "beside oneself (with something)",
            "definition": "in an extreme state of some emotion.  I was beside myself with joy.  Sarah could not speak. She was beside herself with anger."
        },
        {
            "id": 217,
            "phrase": "besiege someone or something with something",
            "definition": "to attack someone or a group with something. We besieged the enemy with bombs and bullets."
        },
        {
            "id": 218,
            "phrase": "besmirch someone or something with something",
            "definition": "to dirty or soil someone or someone’s reputation with something.  Please don’t continue to besmirch Alice with that gossip. You have besmirched my reputation with your comments.  He besmirched her with vile gossip in order to turn people against her."
        },
        {
            "id": 219,
            "phrase": "The best defense is a good offense.",
            "definition": "Prov. If you attack your opponents, they will be so busy fighting off your attack that they will not be able to attack you. (Often associated with sports. Often pronounced with the accent on the first syllable, similar to offense.) _The team mostly practiced offensive moves because the coach believed that the best defense is a good offense.  Jim thought that the best defense is a good offense, so he always tried to pass other drivers before they could pass him."
        },
        {
            "id": 220,
            "phrase": "The best is the enemy of the good.",
            "definition": "Prov. If you are too ambitious and try to make something better than you are capable of, you may ruin it.  Bob: After I revise it a few more times, my novel will be the best ever written. Alan: I don’t think you should revise it any more. Remember, the best is the enemy of the good.  In fund-raising as in other areas, the best is the enemy of the good. If you ask someone for a larger contribution than he can possibly give, he may give you nothing at all."
        },
        {
            "id": 221,
            "phrase": "*the best of both worlds",
            "definition": "a situation wherein one can enjoy two different opportunities. (*Typically: enjoy ~; have ~; live in ~.) _ When Don was a fellow at the university, he had the privileges of a professor and the freedom of a student. He had the best of both worlds. Donna hated to have to choose between retirement and continuing working. She wanted to do both so she could live in the best of both worlds."
        },
        {
            "id": 222,
            "phrase": "the best part of something",
            "definition": "almost all of something; a large part of something; the major part of something.  The discussion took the best part of an hour.  The best part of the meeting was taken up by budgetary matters."
        },
        {
            "id": 223,
            "phrase": "The best things in life are free.",
            "definition": "Prov. The most satisfying experiences do not cost any money.  Don’t be gloomy because you’re broke. The best things in life are free.  Yesterday I took my children to the zoo. We didn’t spend a penny, but we had a wonderful time. The best things in life are free."
        },
        {
            "id": 224,
            "phrase": "the best-case scenario",
            "definition": "Cliché the optimum outcome being considered. (Compare this with the worst-case scenario.) _ Now that we’ve seen the negative angle, let’s look at the best-case scenario.  In the best-case scenario, we’re all dead eventually—but then that’s true of the worstcase scenario also."
        },
        {
            "id": 225,
            "phrase": "bestow something on someone",
            "definition": "to give something to someone; to present something to someone.  The mere presence of the queen bestowed wisdom and grace on the court.  Fine gifts were bestowed on the visiting prince."
        },
        {
            "id": 226,
            "phrase": "bet on someone or something",
            "definition": "to wager on someone or something.  Are you really going to bet on that horse? _ I bet on Paul. He is the fastest runner."
        },
        {
            "id": 227,
            "phrase": "bet someone dollars to doughnuts",
            "definition": "to bet something of value against something worth considerably less.  I bet you dollars to doughnuts that she is on time.  He bet me dollars to doughnuts that it would snow today."
        },
        {
            "id": 228,
            "phrase": "bet something on someone or something",
            "definition": "to wager something on someone or something. I bet one thousand dollars on that horse! _ Fred bet a few bucks on his favorite football team."
        },
        {
            "id": 229,
            "phrase": "bet with someone",
            "definition": "to make a bet or wager with someone. No, I won’t bet with you. That’s not my style. Max will bet with anyone."
        },
        {
            "id": 230,
            "phrase": "betroth someone to someone",
            "definition": "to promise someone in marriage to someone else.  The king betrothed his daughter to a prince from the neighboring kingdom. She betrothed herself to one of the peasant boys from the village."
        },
        {
            "id": 231,
            "phrase": "Better be an old man’s darling than a young man’s slave.",
            "definition": "Prov. A young woman should prefer to marry an old man who dotes on her rather than a young man who may treat her badly.  When Mr. Nash proposed to me, I thought he was too old, but my mother advised me, “Better be an old man’s darling than a young man’s slave.” _When Marion’s friends objected that her fiancé was much too old for her, she said, “Better be an old man’s darling than a young man’s slave.”"
        },
        {
            "id": 232,
            "phrase": "Better (be) safe than sorry.",
            "definition": "Prov. Cliché You should be cautious—if you are not, you may regret it.  It may be time-consuming to check the oil in your car every time you buy gasoline, but better safe than sorry.  Bob: I don’t need a tetanus shot just because I stepped on a nail. Mary: I still think you should get one. Better be safe than sorry."
        },
        {
            "id": 233,
            "phrase": "Better be the head of a dog than the tail of a lion.",
            "definition": "Prov. It is better to be the leader of a less prestigious group than to be a subordinate in a more prestigious one. Joe: I can be the headmaster of a small secondary school, or I can be a teacher at a famous university. Which job offer do you think I should take? Nancy: Better be the head of a dog than the tail of a lion.  A professional writing workshop had asked Bob to join, but he elected to stay with his amateur group, since he thought it better to be the head of a dog than the tail of a lion."
        },
        {
            "id": 234,
            "phrase": "Better late than never.",
            "definition": "Prov. Cliché Doing something late is better than not doing it.  I’m sorry I’m late to the party. Better late than never, right? _ Jill: Lisa’s birthday was two weeks ago. Should I send her a card now? Jane: Better late than never."
        },
        {
            "id": 235,
            "phrase": "better left unsaid",
            "definition": "[refers to a topic that] should not be discussed; [refers to a thought that] everyone is thinking, but would cause difficulty if talked about in public. (A typical beginning for this phrase might be It is, That is, The details are, or even Some things are. See the examples.) _Mary: I really don’t know how to tell you this. Bob: Then don’t. Maybe it’s better left unsaid. Bill: I had such a terrible fight with Sally last night. I can’t believe what I said. Bob: I don’t need to hear all about it. Some things are better left unsaid."
        },
        {
            "id": 236,
            "phrase": "Better luck next time.",
            "definition": "1. an expression that comforts someone for a minor failure. (Said with a pleasant tone of voice.) _Bill: That does it! I can’t run any farther. I lose! Bob: Too bad. Better luck next time.  Mary: Well, that’s the end of my brand new weight lifting career. Jane: Better luck next time. 2. an expression that ridicules someone for a failure. (Said with rudeness or sarcasm. The tone of voice distinguishes Wfrom Q.) _ Sally: I lost out to you, but I think you cheated. Mary: Better luck next time. Sue: You thought you could get ahead of me, you fool! Better luck next time! Joan: I still think you cheated."
        },
        {
            "id": 237,
            "phrase": "Better the devil you know than the devil you don’t know.",
            "definition": "Prov. If you have to choose between a familiar but unpleasant situation and an unfamiliar situation, choose the familiar one because the unfamiliar situation may turn out to be worse.  Jill: I hate my job so much that I’m thinking of asking for a transfer. Jane: I’d advise against it. Better the devil you know than the devil you don’t know.  Although she was unhappy in her marriage, Donna never considered pursuing romances with other men. “Better the devil you know than the devil you don’t know,” was her philosophy."
        },
        {
            "id": 238,
            "phrase": "between life and death",
            "definition": "in a position where living or dying is an even possibility. (Especially with caught or hovering.) _ And there I was on the operating table, hovering between life and death. The mountain climber hung by his rope, caught between life and death."
        },
        {
            "id": 239,
            "phrase": "betwixt and between",
            "definition": "between (people or things). I liked the soup and the dessert and all that came betwixt and between.  I sat betwixt and between all the actors who weren’t on stage."
        },
        {
            "id": 240,
            "phrase": "a bevy of beauties",
            "definition": "Cliché a group of very attractive women, as found in a beauty contest.  A whole bevy of beauties waltzed past the old man, but he didn’t even notice."
        },
        {
            "id": 241,
            "phrase": "Beware of Greeks bearing gifts.",
            "definition": "Prov. Do not trust an opponent who offers to do something nice for you. (A line from the story of the Trojan horse, as told in Vergil’s Aeneid.) _ Jill: I can’t believe Melanie brought me cookies today, when we’ve been fighting for weeks. Jane: Beware of Greeks bearing gifts. She probably has ulterior motives.  When the rival company invited all his employees to a Christmas party, Tom’s first impulse was to beware of Greeks bearing gifts, but then he upbraided himself for being paranoid."
        },
        {
            "id": 242,
            "phrase": "beware of someone or something",
            "definition": "to be cautious and watchful about someone or something.  Beware of Ted. He’s acting irrational.  You should beware of the dog."
        },
        {
            "id": 243,
            "phrase": "beyond a reasonable doubt",
            "definition": "almost without any doubt. (A legal phrase.) _ The jury decided beyond a reasonable doubt that she had committed the crime.  He was also found guilty beyond a reasonable doubt."
        },
        {
            "id": 244,
            "phrase": "beyond me",
            "definition": "completely missing or surpassing my understanding.  I’m confused. All this is beyond me."
        },
        {
            "id": 245,
            "phrase": "beyond measure",
            "definition": "in an account or to an extent more than can be quantified; in a very large amount.  They brought in hams, turkeys, and roasts, and then they brought vegetables and salads beyond measure.  They thanked all of us beyond measure."
        },
        {
            "id": 246,
            "phrase": "beyond one’s depth",
            "definition": "in water that is too deep.  Sally swam out from the beach until she was beyond her depth.  Jane swam out to get her even though it was beyond her depth, too."
        },
        {
            "id": 247,
            "phrase": "beyond one’s ken",
            "definition": "outside the extent of one’s knowledge or understanding. Why she married that shiftless drunkard is beyond our ken. His mean attitude to others is quite beyond my ken."
        },
        {
            "id": 248,
            "phrase": "beyond one’s means",
            "definition": "more than one can afford.  I’m sorry, but this house is beyond our means. Please show us a cheaper one.  They feel that a Caribbean cruise is beyond their means."
        },
        {
            "id": 249,
            "phrase": "beyond some emotional response",
            "definition": "in too extreme a state to feel or care.  Do what you want. You have hurt me so much, I am beyond caring.  The dying patient is beyond feeling. It doesn’t matter now."
        }
    ]
}