{
    "dictionary": [
        {
            "id": 0,
            "phrase": "not touch someone or something with a ten-foot pole",
            "definition": "Cliché not to have anything to do with someone or something. (Always negative.) _ No, I won’t hire Fred. I wouldn’t touch him with a ten-foot pole. I wouldn’t touch that job with a ten-foot pole."
        },
        {
            "id": 1,
            "phrase": "not trouble one’s (pretty) (little) head about something",
            "definition": "Rur. not to worry about something. (Considered demeaning by many.) _ Don’t you trouble your little head about that. I’ll take care of it.  You shouldn’t trouble your head about it. Everything will turn out fine."
        },
        {
            "id": 2,
            "phrase": "not with it",
            "definition": "not able to think clearly; not able to understand things. Lisa’s mother is not really with it anymore. She’s going senile.  Tom’s not with it yet. He’s only just come around from the anesthetic."
        },
        {
            "id": 3,
            "phrase": "not worth a damn",
            "definition": "Inf. worthless. This pen is not worth a damn.  When it comes to keeping score, she’s not worth a damn."
        },
        {
            "id": 4,
            "phrase": "not worth mentioning",
            "definition": "1. not important enough to require a comment.  There are others, but they are not worth mentioning.  A small number of books hint at the phenomenon, but they aren’t worth mentioning. 2. [of an error or wrong] not worth apologizing for.  This isn’t a problem at all. It’s not worth mentioning.  No need to apologize to me. No harm done. It’s not worth mentioning."
        },
        {
            "id": 5,
            "phrase": "not worth one’s while",
            "definition": "not worth bothering with; not worth spending time on.  It’s not worth my while to discuss it with you. Don’t bother trying to collect money from them. It isn’t worth your while."
        },
        {
            "id": 6,
            "phrase": "not worth the trouble",
            "definition": "not important enough to require a comment or any effort.  Don’t bother with it. It isn’t worth the trouble.  There is no point in trying to get the spot out of the carpet. It isn’t worth the trouble."
        },
        {
            "id": 7,
            "phrase": "a notch below (someone or something)",
            "definition": "a little lower in quality than someone or something.  I believe that this wine is a notch below the one we had with the fish."
        },
        {
            "id": 8,
            "phrase": "notch something up†",
            "definition": "to count up something; to add up or score something.  We notched yet another victory up in our efforts to regain the trophy.  Well, it looks like we notched up another victory."
        },
        {
            "id": 9,
            "phrase": "note something down†",
            "definition": "to write down a note about something.  Please note these words down.  Note down the following facts."
        },
        {
            "id": 10,
            "phrase": "*noted for something",
            "definition": "famed for something; memorable for something. (*Typically: be ~; become ~.) _We were all noted for our polite manners.  The restaurant was noted for its traditional fare. Tom was noted far and wide for his excellent pies and cakes."
        },
        {
            "id": 11,
            "phrase": "nothing but",
            "definition": "only; just.  Jane drinks nothing but milk.  Dave buys nothing but expensive clothes."
        },
        {
            "id": 12,
            "phrase": "Nothing comes of nothing.",
            "definition": "Prov. If you contribute nothing, you will get nothing.  Jill: Why are you so depressed today? Jane: No reason. Jill: There has to be a reason. Nothing comes of nothing. I’m not surprised you did so poorly in school; you haven’t been putting in any effort. Nothing comes of nothing."
        },
        {
            "id": 13,
            "phrase": "Nothing doing!",
            "definition": "Inf. I will not permit it!; I will not participate in it! _ John: Can I put this box in your suitcase? Bill: Nothing doing! It’s too heavy now.  Sue: We decided that you should drive us to the airport. Do you mind? Jane: Nothing doing! I’ve got work to do."
        },
        {
            "id": 14,
            "phrase": "nothing down",
            "definition": "requiring no down payment.  You can have this car for nothing down and $140 a month.  I bought a winter coat for nothing down and no payments due until February."
        },
        {
            "id": 15,
            "phrase": "Nothing for me, thanks.",
            "definition": "I do not want any of what was offered. (Typically to decline a serving of food or drink.) _Waiter: Would you care for dessert? Bob: Nothing for me, thanks.  Bob: We have beer and wine. Which would you like? Mary: Nothing for me, thanks."
        },
        {
            "id": 16,
            "phrase": "Nothing is certain but death and taxes.",
            "definition": "Prov. Everything in life is unpredictable, except that you can be sure you will die and you will have to pay taxes. (You can also refer to death and taxes as the only certain things in life.) _ Son: I can’t believe how much tax money is being withheld from my paycheck! Father: Welcome to adult life, where nothing is certain but death and taxes."
        },
        {
            "id": 17,
            "phrase": "Nothing is certain but the unforeseen.",
            "definition": "Prov. You cannot foresee what will happen.  Jill: Now that we’ve got a new boss, this is certain to be a nicer place to work. Jane: Nothing is certain but the unforeseen."
        },
        {
            "id": 18,
            "phrase": "Nothing is given so freely as advice.",
            "definition": "Prov. People will give you advice more willingly than they give you anything else.  Although no one in my family was willing to give me a loan, they all had suggestions about how I could get the money from elsewhere. Nothing is given so freely as advice.  Don’t hesitate to ask people what they think you ought to do. Nothing is given so freely as advice."
        },
        {
            "id": 19,
            "phrase": "Nothing much.",
            "definition": "Inf. not much; hardly anything; nothing of importance. (Often a reply to a greeting asking what one has been doing.) _John: Hey, man! How’s by you? Bob: Hiya! Nothing much.  Bill: What have you been doing? Tom: Nothing much."
        },
        {
            "id": 20,
            "phrase": "nothing of the kind",
            "definition": "1. no; absolutely not. I didn’t tear your jacket—nothing of the kind! _ Did I break your vase? Nothing of the kind! 2. nothing like that. That’s not true. We did nothing of the kind! _ She did nothing of the kind! She wasn’t even there!"
        },
        {
            "id": 21,
            "phrase": "nothing short of something",
            "definition": "more or less the same as something bad; as bad as something.  His behavior was nothing short of criminal.  Climbing those mountains alone is nothing short of suicide."
        },
        {
            "id": 22,
            "phrase": "Nothing so bad but (it) might have been worse.",
            "definition": "Prov. Although bad things do happen, they are not as bad as other things you can imagine that might have happened.  Joan: This is like a nightmare! My house burned down—I lost everything! Nancy: At least you and your family are safe. Nothing so bad but might have been worse.  My bicycle tire blew out, but at least it blew out within walking distance of a repair shop. Nothing so bad but it might have been worse."
        },
        {
            "id": 23,
            "phrase": "Nothing succeeds like success.",
            "definition": "Prov. If you have succeeded in the past, you will continue to be successful in the future.  After Alan’s brilliant courtroom victory, everyone wanted to be his client. Nothing succeeds like success."
        },
        {
            "id": 24,
            "phrase": "nothing to boast about",
            "definition": "not worth bragging about; mediocre. In high school, my grades were acceptable, but they were nothing to boast about. Jill: Does this town have a good library? Nancy: It’s nothing to boast about."
        },
        {
            "id": 25,
            "phrase": "nothing to choose from",
            "definition": "no choice; no choice in the selection; not enough of something to make a choice.  I went to the store looking for new shoes, but there was nothing to choose from.  By the time I got around to selecting a team of helpers, there was nothing to choose from."
        },
        {
            "id": 26,
            "phrase": "Nothing to it!",
            "definition": "It is very easy! _ Look, anybody can do it! Nothing to it! _ Changing a lightbulb is easy. Nothing to it!"
        },
        {
            "id": 27,
            "phrase": "nothing to speak of",
            "definition": "not many; not much.  John: What’s happening around here? Bill: Nothing to speak of.  Mary: Has there been any rain in the last week? Sally: Nothing to speak of."
        },
        {
            "id": 28,
            "phrase": "nothing to write home about",
            "definition": "mediocre; not as good as you expected. I went to that new restaurant last night. It’s nothing to write home about.  Jill: I went to see a movie last night. Jane: How was it? Jill: Nothing to write home about."
        },
        {
            "id": 29,
            "phrase": "nothing upstairs",
            "definition": "no brains; stupid.  Tom is sort of stupid. You know—nothing upstairs. I know what’s wrong with you. Nothing upstairs."
        },
        {
            "id": 30,
            "phrase": "Nothing ventured, nothing gained.",
            "definition": "If you do not take risks, you will never accomplish anything.  Bill: Should I ask my boss for a promotion? Jane: Nothing ventured, nothing gained. I think I’ll audition for a part in that play. Nothing ventured, nothing gained."
        },
        {
            "id": 31,
            "phrase": "notify someone about someone or something",
            "definition": "to inform someone about someone or something. Please notify the insurance company about the accident.  I have to notify the doctor about Ed, who is ill."
        },
        {
            "id": 32,
            "phrase": "notify someone of something",
            "definition": "to inform someone about something.  Can you notify my parents of my arrival at the airport? _ We were notified of it last night."
        },
        {
            "id": 33,
            "phrase": "now and then",
            "definition": "sometimes; occasionally. now and then.) _ I like to go to a movie now and then.  We visit my parents now and then, but we rarely see our other relatives."
        },
        {
            "id": 34,
            "phrase": "Now hear this!",
            "definition": "Pay attention to what is going to be said! (In the manner of an announcement over a public address system, especially in the military.) _ Now hear this! You have to turn off the television and go to bed! _ Now hear this! Now hear this! Everyone is ordered to abandon ship."
        },
        {
            "id": 35,
            "phrase": "now, now",
            "definition": "Inf. a calming and consoling phrase that introduces good advice.  “Now, now, don’t cry,” said the mother to the tiny baby.  Jane: I’m so upset! Andy: Now, now, everything will work out all right."
        },
        {
            "id": 36,
            "phrase": "*now or never",
            "definition": "at this time and no other. (*Typically: be ~; become ~.) _ This is your only chance, John. It’s now or never.  I decided that it was now or never, and jumped."
        },
        {
            "id": 37,
            "phrase": "now then",
            "definition": "a sentence opener indicating that a new topic is being opened or that the speaker is getting down to business. (Expressions such as this often use intonation to convey the connotation of the sentence that is to follow. The brief intonation pattern accompanying the expression may indicate sarcasm, disagreement, caution, consolation, sternness, etc.) _ “Now then, where’s the pain?” asked the doctor.  Mary: Now then, let’s talk about you and your interests. Bob: Oh, good. My favorite subject.  Sue: Now then, what are your plans for the future? Alice: I want to become a pilot.  “Now then, what did you have in mind when you took this money?” asked the police investigator."
        },
        {
            "id": 38,
            "phrase": "(Now,) where was I?",
            "definition": "I was interrupted, so please help me remember what I was talking about. (The emphasis is on was.) _ Now, where was I! I think I lost my place.  Q: Where was I? A: You had just described the War of 1812."
        },
        {
            "id": 39,
            "phrase": "Now you’re cooking (with gas)!",
            "definition": "Inf. Fig. Now you are doing what you should be doing! _As Bob came to the end of the piece, the piano teacher said, “Now you’re cooking with gas!” _ Tom (painting a fence): How am I doing with this painting? Any better? Jane: Now you’re cooking. Tom: Want to try it?"
        },
        {
            "id": 40,
            "phrase": "Now you’re talking!",
            "definition": "Inf. Now you are saying the right things. Tom: I won’t put up with her behavior any longer. I’ll tell her exactly what I think of it. Bill: Now you’re talking! _ John: When I get back to school, I’m going to study harder than ever. Mother: Now you’re talking!"
        },
        {
            "id": 41,
            "phrase": "nowhere near",
            "definition": "not nearly.  We have nowhere near enough wood for the winter. They’re nowhere near ready for the game."
        },
        {
            "id": 42,
            "phrase": "no-win situation",
            "definition": "a situation where there is no correct or satisfactory solution.  The general was too weak to fight and too proud to surrender. It was a no-win situation.  The huge dog my father gave us as a gift eats too much. If we get rid of the dog, my father will be insulted. If we keep it, we will go broke buying food for it. This is a classic nowin situation."
        },
        {
            "id": 43,
            "phrase": "nudge someone or something aside†",
            "definition": "to push or bump someone or something out of the way.  We nudged the old man aside and went on ahead.  She nudged aside the cat to make room on the sofa."
        },
        {
            "id": 44,
            "phrase": "null and void",
            "definition": "Cliché without legal force; having no legal effect.  The court declared the law to be null and void.  The millionaire’s will was null and void because it was unsigned."
        },
        {
            "id": 45,
            "phrase": "number in something",
            "definition": "to total up to a certain figure. The birds numbered in the thousands. These pesky ants number in the hundreds. Let’s move to another picnic table."
        },
        {
            "id": 46,
            "phrase": "a number of things or people",
            "definition": "some things or people, in an indefinite amount.  I subscribe to a number of different magazines.  A number of people are here now."
        },
        {
            "id": 47,
            "phrase": "number off (by something)",
            "definition": "to say a number in a specified sequence when it is one’s turn.  Please number off by tens.  Come on, number off!"
        },
        {
            "id": 48,
            "phrase": "number someone or something among something",
            "definition": "to include someone or something in a group of something. I number her among my best friends.  I number this product among the most popular developed during the past year."
        },
        {
            "id": 49,
            "phrase": "number someone with something",
            "definition": "to include someone in a list of people.  I number Clara Wilson with the all-time greats.  Todd numbered himself with the top athletes at the school."
        },
        {
            "id": 50,
            "phrase": "nurse a grudge (against someone)",
            "definition": "to keep resenting and disliking someone over a period of time. (Usually implies that it has been an unreasonably long time.) _ Sally is still nursing a grudge against Mary.  How long can anyone nurse a grudge?"
        },
        {
            "id": 51,
            "phrase": "nurse someone back to health",
            "definition": "to care for a sick person until good health returns.  Sally was glad to help nurse her mother back to health.  She nursed her children back to health when they all had the f lu."
        },
        {
            "id": 52,
            "phrase": "nurse someone or an animal along†",
            "definition": "to aid or encourage the well-being or return to health of someone or an animal.  She nursed the old man along for a few years until he died. She nursed along the invalid.  The vet nursed the horse along for the rest of the night.  He nursed himself along with chicken noodle soup and hot baths until the virus ran its course."
        },
        {
            "id": 53,
            "phrase": "nurse someone through (something)",
            "definition": "to care for a sick person during the worst part of a sickness or recovery.  There was no one there to nurse him through the worst part of his illness. It was a horrible ordeal, but John nursed her through."
        },
        {
            "id": 54,
            "phrase": "nurse something along†",
            "definition": "to manage something with care and thrift.  The board of directors agreed to nurse the firm along for a while and then sell it.  She nursed along the failing business until it was showing a profit."
        },
        {
            "id": 55,
            "phrase": "a nut case",
            "definition": "a crazy person; an irrational person. Bob is acting stranger and stranger. He is turning into a real nut case."
        },
        {
            "id": 56,
            "phrase": "nut up",
            "definition": "Sl. to go crazy. I knew I would nut up if I didn’t quit that job.  I almost nutted up at the last place I worked."
        },
        {
            "id": 57,
            "phrase": "nuts and bolts",
            "definition": "1. Fig. the mundane workings of something; the basics of something.  I want you to learn how to write well. You have to know the nuts and bolts of writing.  She’s got a lot of good, general ideas, but when it comes to the nuts and bolts of getting something done, she’s no good. 2. Sl. the subject of psychology in college.  I took a class in nuts and bolts and didn’t learn anything at all about what makes me tick.  Tom is f lunking nuts and bolts because he won’t participate in the required “experiments.”"
        },
        {
            "id": 58,
            "phrase": "Nuts to you!",
            "definition": "Inf. Go away!; Drop dead! _ Well, nuts to you! You are just plain rude! _Nuts to you! I will NOT lend you money!"
        },
        {
            "id": 59,
            "phrase": "object to someone or something",
            "definition": "to disapprove of someone or something.  I object to him as your choice.  I object to your opinion."
        },
        {
            "id": 60,
            "phrase": "obligate someone to someone or something",
            "definition": "to force someone to do something for someone or something.  This contract obligates you to the company for five years! _ I don’t wish to obligate myself to anyone."
        },
        {
            "id": 61,
            "phrase": "oblige someone by something",
            "definition": "to accommodate someone by doing something.  Please oblige me by closing the window.  Would you oblige me by accompanying me to the dance?"
        },
        {
            "id": 62,
            "phrase": "oblige someone to do something",
            "definition": "to require someone to do something.  You are obliged to arrive on time and enter by the side door.  The lateness of the hour obliged Tony to enter by the back door."
        },
        {
            "id": 63,
            "phrase": "oblige someone with something",
            "definition": "to accommodate someone with something.  He obliged her with a willing attitude.  Please oblige me with a big piece of cake."
        },
        {
            "id": 64,
            "phrase": "obliterate someone or something from something",
            "definition": "to destroy or wipe out someone or something from something.  Karen obliterated the writing from the wall. Max set out to obliterate Lefty “Fingers” Moran from the face of the earth."
        },
        {
            "id": 65,
            "phrase": "*obsessed with someone or something",
            "definition": "preoccupied with someone or something. (*Typically: be ~; become ~.) _Kathy was obsessed with the kitten. Roger was obsessed with Kathy."
        },
        {
            "id": 66,
            "phrase": "obtain something for someone or something",
            "definition": "to get or receive something for someone or something.  I promised I would obtain a pet for Becky.  I obtained a new part for the vacuum cleaner."
        },
        {
            "id": 67,
            "phrase": "occupy oneself by something",
            "definition": "to keep busy by doing something.  Don’t worry. I can occupy myself by knitting or sewing.  While waiting, I occupied myself by knitting a scarf."
        },
        {
            "id": 68,
            "phrase": "occupy someone with something",
            "definition": "to keep someone busy with something. Can you occupy the child with this toy? _ Here, occupy yourself with this crossword puzzle."
        },
        {
            "id": 69,
            "phrase": "occur to someone",
            "definition": "[for an idea or thought] to come into someone’s mind.  It occurred to me that you might be hungry after your long journey.  Would it ever occur to you that I want to be left alone?"
        },
        {
            "id": 70,
            "phrase": "odd man out",
            "definition": "an unusual or atypical person or thing.  I’m odd man out because I’m not wearing a tie.  You had better learn to use the new system software unless you want to be odd man out."
        },
        {
            "id": 71,
            "phrase": "the odd something",
            "definition": "an extra or spare something; a chance something.  The tailor repaired the odd loose button on my shirt.  When I travel, I might buy the odd trinket or two, but I never spend much money."
        },
        {
            "id": 72,
            "phrase": "odds and ends",
            "definition": "miscellaneous things.  There were lots of odds and ends in the attic, but nothing of real value.  I had the whole house cleaned out except for a few odds and ends that you might want to keep."
        },
        {
            "id": 73,
            "phrase": "the odds are against one",
            "definition": "[for fate] to be against one generally.  You can give it a try, but the odds are against you.  I know the odds are against me, but I wish to run in the race anyway."
        },
        {
            "id": 74,
            "phrase": "the odds-on favorite",
            "definition": "the most popular choice of a wager.  Fred is the odds-on favorite for president of the board of trustees."
        },
        {
            "id": 75,
            "phrase": "odor of sanctity",
            "definition": "an atmosphere of excessive holiness or piety. I hate their house. There’s such an odor of sanctity with Bibles and holy pictures everywhere.  The huge, medieval Gothic cathedral had a distinct odor of sanctity."
        },
        {
            "id": 76,
            "phrase": "*of age",
            "definition": "old enough to marry, buy alcohol, or to sign legal agreements. (*Typically: be ~; come ~.) _ Now that Mary is of age, she can buy her own car. When I’m of age, I’m going to get married and move to the city."
        },
        {
            "id": 77,
            "phrase": "Of all things!",
            "definition": "Can you imagine?; Imagine that! (Usually said about something very strange.) _ She wore jeans to the dance. Of all things! _Billy, stop eating the houseplant! Of all things!"
        },
        {
            "id": 78,
            "phrase": "of benefit (to someone)",
            "definition": "serving someone well; to the good of someone.  I can’t believe that this proposal is of benefit to anyone. Oh, I’m sure you’ll find the new health plan to be of benefit."
        },
        {
            "id": 79,
            "phrase": "of course",
            "definition": "yes; certainly; for sure.  Sally: Are you ready to go? Bob: Of course. Sally: Then let’s go.  Jane: Are you coming with us? John: Of course. I wouldn’t miss this for the world.  “And you’ll be there, of course?” asked Alice.  “I would be happy to help, of course,” confided Tom, a little insincerely."
        },
        {
            "id": 80,
            "phrase": "of interest (to someone)",
            "definition": "interesting to someone. These archived files are no longer of any interest.  This is of little interest to me."
        },
        {
            "id": 81,
            "phrase": "of late",
            "definition": "lately.  Have you seen Sally of late? _ We haven’t had an opportunity to eat out of late."
        },
        {
            "id": 82,
            "phrase": "of mature years",
            "definition": "Euph. old.  My employer is a man of mature years.  The professor, a woman of mature years, is planning to retire at the end of the school term."
        },
        {
            "id": 83,
            "phrase": "of service (to someone)",
            "definition": "helping someone; serving someone.  Good morning, madam. May I be of service to you? _ Welcome to the Warwick Hotel. May I be of service?"
        },
        {
            "id": 84,
            "phrase": "of the first water",
            "definition": "of the finest quality.  This is a very fine pearl—a pearl of the first water.  Tom is of the first water—a true gentleman."
        },
        {
            "id": 85,
            "phrase": "of the persuasion that...",
            "definition": "holding a belief that something is true or is in existence. Anne is of the persuasion that supports that candidate for mayor. The paranoid was of the persuasion that aliens lived among us."
        },
        {
            "id": 86,
            "phrase": "of two minds (about someone or something)",
            "definition": "holding conflicting opinions about someone or something; being undecided about someone or something.  I am of two minds about whether I should go to the convention."
        },
        {
            "id": 87,
            "phrase": "off and running",
            "definition": "[of horses, dogs, or people] having started racing.  It’s a beautiful day at the races, and, yes, they’re off and running!"
        },
        {
            "id": 88,
            "phrase": "*off base",
            "definition": "[of a runner in baseball] not having a foot touching the base. (*Typically: be ~; get ~.) _ The runner was off base but the first baseman didn’t tag him out."
        },
        {
            "id": 89,
            "phrase": "*off campus",
            "definition": "not located or present on the grounds of a college or university. (*Typically: be ~; live ~; move ~.) _ Tom has an apartment off campus.  The dean is off campus and cannot be reached."
        },
        {
            "id": 90,
            "phrase": "off center",
            "definition": "not exactly in the center or middle. The arrow hit the target a little off center.  The picture hanging over the chair is a little off center."
        },
        {
            "id": 91,
            "phrase": "off chance",
            "definition": "slight possibility. I need your phone number on the off chance I need more help.  There’s an off chance that we might be hiring next month."
        },
        {
            "id": 92,
            "phrase": "*off course",
            "definition": "not going in the right direction. (*Typically: be ~; drift ~; get ~.) _ The ship is off course and may strike the reef!"
        },
        {
            "id": 93,
            "phrase": "off duty",
            "definition": "not working at one’s job. (The opposite of on duty.) _ I’m sorry, I can’t talk to you until I’m off duty.  The police officer couldn’t help me because he was off duty."
        },
        {
            "id": 94,
            "phrase": "off like a shot",
            "definition": "away [from a place] very quickly.  He finished his dinner and was off like a shot.  The thief grabbed the lady’s purse and was off like a shot."
        },
        {
            "id": 95,
            "phrase": "*off on a sidetrack",
            "definition": "on a digression; discussing a topic that is not the main topic. (Alludes to a train waiting on a siding. *Typically: be ~; get ~; get someone ~.) _ Anne got off on a sidetrack and never returned to her topic.  The ineffective committee got off on one sidetrack after another."
        },
        {
            "id": 96,
            "phrase": "off on someone or something",
            "definition": "in a rage about someone or something; on a tirade about someone or something.  Are you off on Sally again? Why can’t you leave her alone?"
        },
        {
            "id": 97,
            "phrase": "*off one’s game",
            "definition": "not able to play a sport as well as normal. (*Typically: be ~; put one ~; throw one ~.) _ I’m a little tired, and that generally puts me off my game."
        },
        {
            "id": 98,
            "phrase": "off season",
            "definition": "not in the busy time of the year.  We don’t have much to do off season. Things are very quiet around here off season."
        },
        {
            "id": 99,
            "phrase": "off someone or something goes",
            "definition": "someone or something is leaving. (Said on the departure of someone or something.) _ It’s time to leave. Off I go.  Sally looked at the airplane taking off and said, “Off it goes.”"
        },
        {
            "id": 100,
            "phrase": "off the air",
            "definition": "not broadcasting (a radio or television program). The radio audience won’t hear what you say when you’re off the air.  When the performers were off the air, the director told them how well they had done."
        },
        {
            "id": 101,
            "phrase": "*off the hook",
            "definition": "freed from an obligation. (Alludes to a fish freeing itself from a fishhook. *Typically: be ~; get ~; get someone ~; let someone ~.) _ Thanks for getting me off the hook. I didn’t want to attend that meeting.  I couldn’t get myself off the hook no matter what I tried."
        },
        {
            "id": 102,
            "phrase": "off the mark",
            "definition": "not quite exactly right.  Her answer was a little off the mark.  You were off the mark when you said we would be a little late to the party. It was yesterday, in fact!"
        },
        {
            "id": 103,
            "phrase": "off the record",
            "definition": "unofficial; informal. (Of comments to the press that one does not want reported.) _ This is off the record, but I disagree with the mayor on this matter.  Although her comments were off the record, the newspaper published them anyway."
        },
        {
            "id": 104,
            "phrase": "off the shelf",
            "definition": "ready made for purchase; not custommade. (Hyphenated when prenominal.) _I generally buy off-the-shelf clothing. I am a perfect size eight."
        },
        {
            "id": 105,
            "phrase": "off the subject",
            "definition": "not concerned with the subject being discussed.  I got off the subject and forgot what I was supposed to be talking about.  The speaker was off the subject, telling about his vacation in Hawaii."
        },
        {
            "id": 106,
            "phrase": "off the track",
            "definition": " Fig. [of comments] irrelevant and immaterial. I’m afraid you’re off the track, John. Try again.  I’m sorry. I was thinking about dinner, and I got off the track."
        },
        {
            "id": 107,
            "phrase": "*off the wagon",
            "definition": "1. Fig. drinking liquor after a period of abstinence. (*Typically: be ~; fall ~; get ~.) _ Poor John fell off the wagon again. Drunk as a skunk.  He was off the wagon for a year the last time before he sobered up. 2. Fig. back on drugs after a period of abstinence. (*Typically: be ~; fall ~; get ~.) _Wilbur is off the wagon and shooting up again. He can’t be off the wagon, because he has never stopped using, even for a day."
        },
        {
            "id": 108,
            "phrase": "off to a running start",
            "definition": "with a good, fast beginning, possibly a head start. I got off to a running start in math this year.  The horses got off to a running start."
        },
        {
            "id": 109,
            "phrase": "off to one side",
            "definition": "beside something; (moved) slightly away from something. Our garden has roses in the middle and a spruce tree off to one side. He took me off to one side to tell me the bad news."
        },
        {
            "id": 110,
            "phrase": "off to the races",
            "definition": "an expression characterizing the activity or excitement that is just beginning; [we are] leaving for something interesting or exciting.  The tour bus is out in front waiting and we’ve said goodbye to everyone. Looks like we’re off to the races."
        },
        {
            "id": 111,
            "phrase": "*off (to the side) with someone",
            "definition": "moving aside with someone to discuss something. (*Typically: get ~; go ~; move ~; step ~.) _ I got off with Charles and we discussed the contract.  I moved off to the side with the client and explained the offer a little better."
        },
        {
            "id": 112,
            "phrase": "*off topic",
            "definition": "not on the topic of discussion; far from the general subject of a discussion; not part of the purpose of a particular communication channel, such as an Internet newsgroup. (*Typically: be ~; get ~; get someone ~.) _ The boys in the back of the room just love to get the teacher off topic."
        },
        {
            "id": 113,
            "phrase": "Off with you!",
            "definition": "Go away!; Get going! (Formal or pompous.) _ Off with you! We’ve had enough of your banter!"
        },
        {
            "id": 114,
            "phrase": "offend against someone or something",
            "definition": "to anger or affront someone or something. We do not wish to offend against anyone.  He didn’t realize that he offended against their cultural values."
        },
        {
            "id": 115,
            "phrase": "offend someone with something",
            "definition": "to anger or affront someone with something. Don’t offend us with your bad jokes.  I offended Ralph with my constant niggling."
        },
        {
            "id": 116,
            "phrase": "*an offer one cannot refuse",
            "definition": "Cliché a very attractive offer. (*Typically: give one ~; make ~; make one ~.) _ He made me an offer I could not refuse, so I sold him my car."
        },
        {
            "id": 117,
            "phrase": "offer something for something",
            "definition": "to suggest a certain amount of money as a purchase price for something.  I’ll offer you ten bucks for that watch.  They offered me very little for my car."
        },
        {
            "id": 118,
            "phrase": "offer something to someone (as something)",
            "definition": "to propose giving something to someone as a gift, peace offering, payment, etc.  They offered us a bunch of f lowers as a peace offering.  As an apology, I offered a gift to the hostess."
        },
        {
            "id": 119,
            "phrase": "offer something up† (to someone or something)",
            "definition": "to give something to someone or something as a mark of devotion, thanks, etc. We offered our gratitude up to the ruler.  We offered up our gratitude to the queen."
        },
        {
            "id": 120,
            "phrase": "off-key",
            "definition": "[of music or singing] off pitch; out of tune. She always sings off-key and makes the rest of the choir sound like baying hounds."
        },
        {
            "id": 121,
            "phrase": "off-line",
            "definition": "not connected to a computer, by direct connection or via the telephone system, etc. (Compare this with online.) _ When he’s off-line he’s sort of lost.  The system was off-line all day, so we could get nothing done."
        },
        {
            "id": 122,
            "phrase": "off-the-cuff",
            "definition": "spontaneous; without preparation or rehearsal.  Her remarks were off-the-cuff, but very sensible.  I’m not very good at making speeches off-the-cuff."
        },
        {
            "id": 123,
            "phrase": "off-the-wall",
            "definition": "odd; silly; unusual. Why are you so offthe- wall today? _ This book is strange. It’s really off-thewall."
        },
        {
            "id": 124,
            "phrase": "ogle (at) someone or something",
            "definition": "to stare at someone or something, usually with amorous or erotic relish.  Don’t just stand there and ogle at me! _ Stop ogling at those magazines."
        },
        {
            "id": 125,
            "phrase": "Oh, boy.",
            "definition": "1. Inf. Wow! (Usually Oh, boy! An exclamation. It has nothing to do with boys.) _ Bill: Oh, boy! An old-fashioned circus! _ “Oh, boy!” shouted John. “Dinner smells great! When do we eat?” 2. Inf. I dread this!; This is going to be awful! _ “Oh, boy!” moaned Fred, as his old car stalled out, “Here we go again.” _ Doctor: It looks like something fairly serious. Jane: Oh, boy. Doctor: But nothing modern medicine can’t handle."
        },
        {
            "id": 126,
            "phrase": "Oh, sure (someone or something will)!",
            "definition": "Inf. a sarcastic expression claiming that someone or something will do something or that something will happen.  Andy: Don’t worry. I’ll do it. Rachel: Oh, sure you will. That’s what you always say.  Bob: I’ll fix this fence the first chance I get. Mary: Oh, sure. When will that be? Next year?"
        },
        {
            "id": 127,
            "phrase": "Oh, ye of little faith.",
            "definition": "You who trust no one. (Jocular; the word ye is an old form of you used in the Bible.) _ You thought I wouldn’t show up on time? Oh, ye of little faith."
        },
        {
            "id": 128,
            "phrase": "Oh, yeah?",
            "definition": "Inf. Is that what you think? (Rude and hostile.) _ Tom: You’re getting to be sort of a pest. Bill: Oh, yeah? Tom: Yeah. Bob: This sauce tastes bad. I think you ruined it. Bill: Oh, yeah? What makes you think so? Bob: My tongue tells me!"
        },
        {
            "id": 129,
            "phrase": "oink out",
            "definition": "Sl. to overeat. I oink out every time we have chocolate cake.  This Thursday starts a four-day weekend, and I plan to oink out every day."
        },
        {
            "id": 130,
            "phrase": "*old as Methuselah",
            "definition": "very old. (Of a person; refers to a biblical figure held to have lived to be 969. *Also: as ~.) _ Old Professor Stone is as old as Methusehah but still gets around with a cane."
        },
        {
            "id": 131,
            "phrase": "*old as the hills",
            "definition": "very old; ancient. (*Also: as ~.) _ That’s not a new joke; it’s as old as the hills! _ Our family custom of eating black-eyed peas on New Year’s Day is old as the hills."
        },
        {
            "id": 132,
            "phrase": "old battle-axe",
            "definition": "a bossy old woman.  She is such an old battle-axe. I’ll bet she’s hell to live with."
        },
        {
            "id": 133,
            "phrase": "old college try",
            "definition": "a valiant effort.  Will made the old college try, but that wasn’t enough to get the job done."
        },
        {
            "id": 134,
            "phrase": "Old habits die hard.",
            "definition": "Prov. People find it difficult to change their accustomed behavior. Joan retired last year, but she still gets up as early as she used to when she had to go to work. Old habits die hard."
        },
        {
            "id": 135,
            "phrase": "an old hand at doing something",
            "definition": "someone who is experienced at doing something.  The maid was an old hand at polishing silver.  Bob is an old hand at training dogs."
        },
        {
            "id": 136,
            "phrase": "old hat",
            "definition": "old-fashioned; outmoded. That’s a silly idea. It’s old hat.  Hardly anybody uses typewriters anymore. That’s just old hat."
        },
        {
            "id": 137,
            "phrase": "*the (old) heave-ho",
            "definition": "the act of throwing someone out; the act of firing someone. (From nautical use, where sailors used heave-ho to coordinate hard physical labor. One sailor called “Heave-ho,” and all the sailors would pull at the same time on the ho. *Typically: get ~; give someone ~.) _ I wanted to complain to the management, but they called a security guard and I got the old heave-ho. That’s right. They threw me out! _ They fired a number of people today, but I didn’t get the heave-ho."
        },
        {
            "id": 138,
            "phrase": "the old one-two",
            "definition": "a series of two punches delivered quickly, one after another. Tom gave Bill the old one-two, and the argument was ended right there. Watch out for Tom. He’s a master of the old one-two."
        },
        {
            "id": 139,
            "phrase": "An old poacher makes the best gamekeeper.",
            "definition": "Prov. The best person to guard something is someone who knows all about how to steal it, so he or she can anticipate what thieves might do. We should hire the computer hacker to design computer security systems. An old poacher makes the best gamekeeper."
        },
        {
            "id": 140,
            "phrase": "*an old warhorse",
            "definition": "a performance piece that is performed often. (*Typically: be ~; become ~; perform ~; play ~.) _ The symphony orchestra played a few old warhorses and then some ghastly contemporary stuff that will never again see the light of day."
        },
        {
            "id": 141,
            "phrase": "an old wives’ tale",
            "definition": "a myth or superstition.  You really don’t believe that stuff about starving a cold do you? It’s just an old wives’ tale."
        },
        {
            "id": 142,
            "phrase": "omit someone or something from something",
            "definition": "to leave someone or something out of something.  You omitted Carol from the list. I think that you omitted our company from the bidding.  She omitted herself from the list of participants."
        },
        {
            "id": 143,
            "phrase": "*on a diet",
            "definition": "trying to lose weight by eating less food or specific foods. (*Typically: be ~; go ~; put someone ~; stay ~.) _ I didn’t eat any cake because I’m on a diet.  I’m getting too heavy. I’ll have to go on a diet.  I have a lot of trouble staying on a diet."
        },
        {
            "id": 144,
            "phrase": "*on a first-name basis (with someone)",
            "definition": "knowing someone very well; good friends with someone. (*Typically: be ~; get ~.) _I’m on a first-name basis with John. John and I are on a first-name basis."
        },
        {
            "id": 145,
            "phrase": "*on a fool’s errand",
            "definition": "involved in a useless journey or task. (*Typically: be ~; go ~.) _Bill went for an interview, but he was on a fool’s errand. The job had already been filled.  I was sent on a fool’s errand to buy some flowers. I knew the shop would be closed by then."
        },
        {
            "id": 146,
            "phrase": "*on a pedestal",
            "definition": "elevated to a position of honor or reverence. (Alludes to honoring someone on display on a pedestal like a statue. *Typically: place someone ~; put someone ~.) _ He puts his wife on a pedestal. She can do no wrong in his opinion.  I was just doing my job. There is no point in placing me on a pedestal!"
        },
        {
            "id": 147,
            "phrase": "*on a power trip",
            "definition": "exercising power and authority, especially unduly. (*Typically: be ~; be off ~; go ~; have ~.) _ Old Molly is off on a power trip again. She loves ordering everyone about."
        },
        {
            "id": 148,
            "phrase": "on a roll",
            "definition": "in the midst of a series of successes. Don’t stop me now. I’m on a roll.  Things are going great for Larry. He’s on a roll now."
        },
        {
            "id": 149,
            "phrase": "on a shoestring",
            "definition": "with a very small amount of money.  We lived on a shoestring for years before I got a goodpaying job.  John traveled to Florida on a shoestring."
        },
        {
            "id": 150,
            "phrase": "*on a silver platter",
            "definition": "using a presentation [of something] that is appropriate for a very formal setting. (*Typically: give something to someone ~; present something ~; serve something ~; want something ~.) _ Aren’t paper plates good enough for you? You want dinner maybe on a silver platter?"
        },
        {
            "id": 151,
            "phrase": "*on a string",
            "definition": "under control, as one would control a marionette. (*Typically: get someone ~; have someone ~; keep someone ~.) _ She keeps him on a string so he won’t get involved with other women."
        },
        {
            "id": 152,
            "phrase": "on a tight leash",
            "definition": "[of an animal] on a leash, held tightly and close to its owner.  I keep my dog on a tight leash so it won’t bother people."
        },
        {
            "id": 153,
            "phrase": "*on a wing and a prayer",
            "definition": "to arrive or fly in with one’s plane in very bad condition. (Sometimes used fig. of other vehicles. *Typically: come (in) ~; arrive ~.) _ Finally we could see the plane through the smoke, coming in on a wing and a prayer."
        },
        {
            "id": 154,
            "phrase": "on account",
            "definition": "[money paid or owed] on a debt.  I paid twelve dollars on account last month. Wasn’t that enough? _ I still have $100 due on account."
        },
        {
            "id": 155,
            "phrase": "on active duty",
            "definition": "in battle or ready to go into battle. (Military.) _ The soldier was on active duty for ten months.  That was a long time to be on active duty."
        },
        {
            "id": 156,
            "phrase": "on all fours",
            "definition": "on one’s hands and knees. I dropped a contact lens and spent an hour on all fours looking for it. The baby can walk, but is on all fours most of the time anyway."
        },
        {
            "id": 157,
            "phrase": "on any account",
            "definition": "for any purpose; for any reason; no matter what.  On any account, I’ll be there on time.  This doesn’t make sense on any account."
        },
        {
            "id": 158,
            "phrase": "on approval",
            "definition": "for examination, with the privilege of return.  I ordered the merchandise on approval so I could send it back if I didn’t like it.  Sorry, you can’t buy this on approval. All sales are final."
        },
        {
            "id": 159,
            "phrase": "on bended knee",
            "definition": "kneeling, as in supplication. (The verb form is obsolescent and occurs now only in this phrase.) _ Do you expect me to come to you on bended knee and ask you for forgiveness? _The suitors came on bended knee and begged the attention of the princess."
        },
        {
            "id": 160,
            "phrase": "on board",
            "definition": "aboard (on or in) a ship, bus, airplane, etc.  Is there a doctor on board? We have a sick passenger.  When everyone is on board, we will leave."
        },
        {
            "id": 161,
            "phrase": "on Broadway",
            "definition": "located in the Broadway theater district in New York City; performed in the Broadway theater district. (Regarded as having the best of American stage productions.) _ Our musical is the best thing on Broadway! _ I want to be a star on Broadway someday."
        },
        {
            "id": 162,
            "phrase": "on call",
            "definition": "ready to serve when called. I live a very hard life. I’m on call twenty hours a day.  I’m sorry, but I can’t go out tonight. I’m on call at the hospital."
        },
        {
            "id": 163,
            "phrase": "on campus",
            "definition": "located or being on the grounds of a college or university.  Do you live on campus or off campus? _ I don’t think that Lisa is on campus right now."
        },
        {
            "id": 164,
            "phrase": "on cloud nine",
            "definition": "very happy.  When I got my promotion, I was on cloud nine. When the check came, I was on cloud nine for days."
        },
        {
            "id": 165,
            "phrase": "on consignment",
            "definition": "[of goods] having been placed in a store for sale, with payments made for the goods by the operator of the store only if they are sold.  The artist placed his work in a gallery on consignment.  I will attempt to sell your clothing on consignment."
        },
        {
            "id": 166,
            "phrase": "*on course",
            "definition": "going in the right direction or on the right route. (*Typically: be ~; get ~; stay ~.) _ We are on course and should arrive at our port about noon."
        },
        {
            "id": 167,
            "phrase": "on credit",
            "definition": "using credit; buying something using credit.  I tried to buy a new suit on credit, but I was refused.  The Smiths buy everything on credit and are very much in debt."
        },
        {
            "id": 168,
            "phrase": "on dead center",
            "definition": "at the exact center of something. The arrow hit the target on dead center. When you put the f lowers on the table, put them on dead center."
        },
        {
            "id": 169,
            "phrase": "on deck",
            "definition": "on the deck of a boat or a ship.  Everyone except the cook was on deck when the storm hit.  Just pull up the anchor and leave it on deck."
        },
        {
            "id": 170,
            "phrase": "on duty",
            "definition": "at work; currently doing one’s work. (The opposite of off duty.) _I can’t help you now, but I’ll be on duty in about an hour. Who is on duty here? I need some help."
        },
        {
            "id": 171,
            "phrase": "on easy street",
            "definition": "in a state of financial independence and comfort.  I want to live on easy street when I grow up.  When I get this contract signed, I’ll be on easy street."
        },
        {
            "id": 172,
            "phrase": "on edge",
            "definition": "on something’s own edge. Can you stand a dime on edge? _ You should store these crates on edge, not lying f lat."
        },
        {
            "id": 173,
            "phrase": "on fire",
            "definition": "burning; being burned with flames. Help! My car is on fire! _ That house on the corner is on fire!"
        },
        {
            "id": 174,
            "phrase": "on foot",
            "definition": "[running or walking] using the feet.  My car won’t work so I have to travel on foot.  We go everywhere around the campus on foot."
        },
        {
            "id": 175,
            "phrase": "on good terms (with someone)",
            "definition": "friendly with someone; able to interact well and be friends with someone.  Bill is on good terms with the people he works with.  We are not on very good terms and don’t speak to each other much."
        },
        {
            "id": 176,
            "phrase": "on hold",
            "definition": "waiting; temporarily halted.  The building project is on hold while we try to find money to complete it.  We put our wedding plans on hold until we finished school."
        },
        {
            "id": 177,
            "phrase": "on horseback",
            "definition": "on the back of a horse.  Anne rode on horseback across the field.  Because they loved horses, the couple decided to marry on horseback."
        },
        {
            "id": 178,
            "phrase": "on ice",
            "definition": "stored or preserved on ice or under refrigeration.  I have a lot of root beer on ice for the picnic.  All the soft drinks are on ice."
        },
        {
            "id": 179,
            "phrase": "on impulse",
            "definition": "after having had an impulse or sudden thought. On impulse, Bob decided to buy a car. I didn’t need a cellular telephone. I just bought it on impulse."
        },
        {
            "id": 180,
            "phrase": "*on its feet",
            "definition": "organized and functioning; started up and functioning. (*Typically: get something ~; have something ~; put something ~.) _Trying to get this company on its feet is harder than I thought. What will it take to put this company on its feet again?"
        },
        {
            "id": 181,
            "phrase": "on land",
            "definition": "on the ground; on the land and not at sea or in the air.  The f light was rough and I feel better now that I am back on land.  When I am at sea, I feel more relaxed than when I am on land."
        },
        {
            "id": 182,
            "phrase": "on loan (from someone or something)",
            "definition": "[of possession] temporarily granted by someone or some group. This lovely painting is on loan from the Kimble Museum for the rest of the year."
        },
        {
            "id": 183,
            "phrase": "on location",
            "definition": "[of a movie] being filmed in a place distant from the studio.  This movie was shot on location in Ontario.  The actress went on location in Spain for her latest film."
        },
        {
            "id": 184,
            "phrase": "on medication",
            "definition": "taking medicine for a current medical problem.  I can’t drive the car since I am on medication.  He is on medication and hopes to be well soon."
        },
        {
            "id": 185,
            "phrase": "on moral grounds",
            "definition": "considering reasons of morality.  He complained about the television program on moral gounds. There was too much ridicule of his religion."
        },
        {
            "id": 186,
            "phrase": "on occasion",
            "definition": "occasionally.  I like to go to the movies on occasion. On occasion, Mary would walk her dog through the park."
        },
        {
            "id": 187,
            "phrase": "on one’s best behavior",
            "definition": "being as polite as possible.  When we went out, the children were on their best behavior.  I try to be on my best behavior all the time."
        },
        {
            "id": 188,
            "phrase": "on one’s deathbed",
            "definition": "while one is in bed and dying. While he lay on his deathbed, he told his lawyer that he wanted to give all his money to charity."
        },
        {
            "id": 189,
            "phrase": "on one’s feet",
            "definition": "standing up.  Get on your feet. They are playing the national anthem. I’ve been on my feet all day, and they hurt."
        },
        {
            "id": 190,
            "phrase": "*on (one’s) guard (against someone or something)",
            "definition": "alert against someone or something. (*Typically: be ~; keep ~; remain ~; stay ~.) _ Try to stay on guard against pickpockets.  I am always on my guard.  Be on guard when you go into the city."
        },
        {
            "id": 191,
            "phrase": "on one’s high horse",
            "definition": "in a haughty manner or mood.  Larry is on his high horse again, bossing people around.  The boss is on her high horse about the cost of office supplies."
        },
        {
            "id": 192,
            "phrase": "on one’s honor",
            "definition": "on one’s solemn oath; sincerely. On my honor, I’ll be there on time. He promised on his honor that he’d pay me back next week."
        },
        {
            "id": 193,
            "phrase": "on one’s mind",
            "definition": "occupying one’s thoughts; currently being thought about.  You’ve been on my mind all day.  Do you have something on your mind? You look so serious."
        },
        {
            "id": 194,
            "phrase": "on one’s own",
            "definition": "independently. Our baby can now walk on his own.  I have lived on my own since I was 18."
        },
        {
            "id": 195,
            "phrase": "on one’s own hook",
            "definition": "all by oneself. I don’t need any help. I can do it on my own hook.  She did it on her own hook without having to call on anyone."
        },
        {
            "id": 196,
            "phrase": "on one’s own time",
            "definition": "not while one is at work.  The boss made me write the report on my own time. That’s not fair.  Please make your personal telephone calls on your own time."
        },
        {
            "id": 197,
            "phrase": "on one’s person",
            "definition": "[of something] carried with one.  Always carry identification on your person.  I’m sorry, I don’t have any money on my person."
        },
        {
            "id": 198,
            "phrase": "*on one’s toes",
            "definition": "alert. (*Typically: be ~; keep ~; keep one ~; stay ~.) _ You have to be on your toes if you want to be in this business.  I have to stay on my toes to keep from getting fired."
        },
        {
            "id": 199,
            "phrase": "*on one’s way ((to) some place)",
            "definition": "leaving one place for another; en route to a place. (*Typically: be ~; get ~.) _ I have to leave. I am on my way to the bank.  I will be there soon. I’m on my way now."
        },
        {
            "id": 200,
            "phrase": "on order",
            "definition": "ordered with delivery expected.  Your car is on order. It’ll be here in a few weeks. I don’t have the part in stock, but it’s on order."
        },
        {
            "id": 201,
            "phrase": "on par (with someone or something)",
            "definition": "equal to someone or something.  Your effort is simply not on par with what’s expected from you.  These two departments are right on par in productivity."
        },
        {
            "id": 202,
            "phrase": "on pins and needles",
            "definition": "anxious; in suspense.  I’ve been on pins and needles all day, waiting for you to call with the news.  We were on pins and needles until we heard that your plane had landed safely."
        },
        {
            "id": 203,
            "phrase": "on probation",
            "definition": "serving a period of probation, typically after conviction for a crime.  While Anne was on probation, she reported to the police regularly.  John was on probation for a year."
        },
        {
            "id": 204,
            "phrase": "on purpose",
            "definition": "intentionally; in a way that is meant or intended; not an accident.  The bully stepped on my foot on purpose.  Jealously, Jimmy destroyed Billy’s sand castle on purpose."
        },
        {
            "id": 205,
            "phrase": "on sale",
            "definition": "available for sale at a reduced price. (Always implies lower than usual sale price.) _ These pots are on sale for $20.  I bought these pants on sale for half price."
        },
        {
            "id": 206,
            "phrase": "on schedule",
            "definition": "at the expected or desired time. The plane came in right on schedule.  Things have to happen on schedule in a theatrical performance."
        },
        {
            "id": 207,
            "phrase": "on second thought",
            "definition": "having given something more thought; having reconsidered something.  On second thought, maybe you should sell your house and move into an apartment. On second thought, let’s not go to a movie."
        },
        {
            "id": 208,
            "phrase": "on short notice",
            "definition": "quickly and without a timely notification of other people; with very little lead time. She called the meeting on such short notice that we had no time to prepare."
        },
        {
            "id": 209,
            "phrase": "on someone’s account",
            "definition": "because of someone.  Don’t do it on my account.  They were late on Jane’s account."
        },
        {
            "id": 210,
            "phrase": "on someone’s head",
            "definition": "[for something negative] belonging only to one person or group.  All the blame fell on their heads.  I don’t think that all the criticism should be on my head."
        },
        {
            "id": 211,
            "phrase": "*on someone’s heels",
            "definition": "following someone very closely; following very closely at someone’s heels. (*Typically: hard ~; hot ~; right ~. See also on someone’s tail.) _ I ran as fast as I could, but the dog was still hard on my heels.  Here comes Sally, and John is hot on her heels."
        },
        {
            "id": 212,
            "phrase": "*on someone’s nerves",
            "definition": "annoying someone. (*Typically: be ~; get ~.) _ Our noisy neighbors are beginning to get on my nerves.  That radio is getting on my nerves."
        },
        {
            "id": 213,
            "phrase": "on someone’s or something’s last legs",
            "definition": "for someone or something to be almost worn out or finished.  This building is on its last legs. It should be torn down.  I feel as if I’m on my last legs. I’m really tired."
        },
        {
            "id": 214,
            "phrase": "on someone’s say-so",
            "definition": "on someone’s authority; with someone’s permission. I can’t do it on your say-so. I’ll have to get a written request.  Bill: I canceled the contract with the A.B.C. Company. Bob: On whose say-so?"
        },
        {
            "id": 215,
            "phrase": "*on someone’s shoulders",
            "definition": "on someone’s own self. (*Typically: be ~; carry something ~; fall ~; have something ~; leave something ~; put something ~.) _ Why should all the responsibility fall on my shoulders? _ She carries a tremendous amount of responsibility on her shoulders."
        },
        {
            "id": 216,
            "phrase": "on someone’s tail",
            "definition": "Inf. Fig. following someone closely.  There is a huge truck on my tail. What should I do? _ Keep on her tail and don’t let her out of your sight."
        },
        {
            "id": 217,
            "phrase": "on someone’s watch",
            "definition": "while someone is on duty; while someone is supposed to be in charge of a situation.  I am not responsible since it didn’t happen on my watch.  I guess I have to bear the blame since it happened on my watch."
        },
        {
            "id": 218,
            "phrase": "on speaking terms (with someone)",
            "definition": "on friendly terms with someone. (Often with the negative.) _ I’m not on speaking terms with Mary. We had a serious disagreement.  We’re not on speaking terms."
        },
        {
            "id": 219,
            "phrase": "on spec",
            "definition": "1. using money risked in the hope of profit; on speculation. He lives by buying and selling houses on spec.  I think it might be an idea to build a few yachts on spec just now. 2. as specified; right on specifications.  This has been built exactly on spec—just as you asked.  It’s important to make sure the design is on spec or the customer will not pay."
        },
        {
            "id": 220,
            "phrase": "on standby",
            "definition": "waiting for one’s turn, especially describing the status of travelers who wait at a soon-to-depart train, plane, or bus, hoping that a seat will become available.  The passenger waited on standby for an available seat.  The agent was able to seat all of the passengers on standby."
        },
        {
            "id": 221,
            "phrase": "on tap",
            "definition": "having to do with beer served from a barrel or keg.  Do you have any imported beers on tap here? _ I like beer on tap. The canned stuff tastes funny to me."
        },
        {
            "id": 222,
            "phrase": "on target",
            "definition": "on schedule; exactly as predicted.  Your estimate of the cost was right on target.  My prediction was not on target."
        },
        {
            "id": 223,
            "phrase": "on the air",
            "definition": "broadcasting (a radio or television program).  The radio station came back on the air shortly after the storm.  We were on the air for two hours."
        },
        {
            "id": 224,
            "phrase": "on the alert (for someone or something)",
            "definition": "watchful and attentive for someone or something.  Be on the alert for pickpockets.  You should be on the alert when you cross the street in heavy traffic."
        },
        {
            "id": 225,
            "phrase": "*on the back burner",
            "definition": "[of something] on hold or suspended temporarily. (Alludes to putting a pot that needs less active attention on a back burner of a stove, leaving space for pots that need to be stirred. Compare this with on the front burner. *Typically: be ~; put something ~.) _ The building project is on the back burner for now.  This matter was on the back burner for a long time."
        },
        {
            "id": 226,
            "phrase": "on the ball",
            "definition": "Inf. knowledgeable; competent; attentive.  This guy is really on the ball.  If you were on the ball, this wouldn’t have happened."
        },
        {
            "id": 227,
            "phrase": "*on the bandwagon",
            "definition": "on the popular side (of an issue); taking a popular position. (*Typically: be ~; climb ~; get ~; hop ~; jump ~.) _ You really should get on the bandwagon. Everyone else is.  Jane has always had her own ideas about things. She’s not the kind of person to jump on the bandwagon."
        },
        {
            "id": 228,
            "phrase": "on the beam",
            "definition": "exactly right; thinking along the correct lines. That’s the right idea. Now you’re on the beam! _ She’s not on the beam yet. Explain it to her again."
        },
        {
            "id": 229,
            "phrase": "on the bench",
            "definition": "1. [of a judge] directing a session of court.  I have to go to court tomorrow. Who’s on the bench? _ It doesn’t matter who’s on the bench. You’ll get a fair hearing. 2. sitting, waiting for a chance to play in a game. (In sports, such as basketball, football, soccer, etc.) _ Bill is on the bench now. I hope he gets to play. John played during the first quarter, but now he’s on the bench."
        },
        {
            "id": 230,
            "phrase": "on the bias",
            "definition": "on a diagonal line; on a diagonal pathway or direction.  The panels of the dress were cut on the bias.  The seamstress sewed the fabric on the bias."
        },
        {
            "id": 231,
            "phrase": "on the bird",
            "definition": "available on satellite television.  There is a whole lot of good stuff on the bird, but you need a receiving dish to get it.  I get a huge book every month listing what programs are on the bird."
        },
        {
            "id": 232,
            "phrase": "on the block",
            "definition": "on a city or suburban block.  John is the biggest kid on the block. We had a party on the block last weekend."
        },
        {
            "id": 233,
            "phrase": "on the borderline",
            "definition": "in an uncertain position between two statuses; undecided.  Bill was on the borderline between an A and a B in biology.  Jane was on the borderline of joining the navy."
        },
        {
            "id": 234,
            "phrase": "on the bright side",
            "definition": "[ignoring the bad for a moment] considering the positive aspects of a situation.  On the bright side, the car you wrecked was covered by insurance."
        },
        {
            "id": 235,
            "phrase": "on the brink (of doing something)",
            "definition": "on the verge of doing something; almost to the point of doing something.  I was on the brink of selling my car to make ends meet when the tax refund came in the mail."
        },
        {
            "id": 236,
            "phrase": "on the button",
            "definition": "exactly right; in exactly the right place; at exactly the right time.  That’s it! You’re right on the button.  He got here at one o’clock on the button."
        },
        {
            "id": 237,
            "phrase": "on the cusp (of something)",
            "definition": "at the point in time that marks the beginning of something.  The transistor was on the cusp of a new age in electronics."
        },
        {
            "id": 238,
            "phrase": "on the cutting edge",
            "definition": "[for someone] to be trendy and very up-to-date; [for something] to be of the latest design. (Akin to on the bleeding edge.) _ This technology is right on the cutting edge. It’s so new, it’s not available to the public yet."
        },
        {
            "id": 239,
            "phrase": "on the defensive",
            "definition": "weary and ready to defend oneself.  John goes on the defensive when his athletic ability is questioned.  The child was on the defensive when questioned about cheating."
        },
        {
            "id": 240,
            "phrase": "on the dole",
            "definition": "receiving welfare money. I spent six months on the dole, and believe me, it’s no picnic."
        },
        {
            "id": 241,
            "phrase": "*on the dot",
            "definition": "at exactly the right time. (*Typically: be somewhere ~; arrive (somewhere) ~; get somewhere ~; see someone ~; show up ~.) _ I’ll be there at noon on the dot.  I expect to see you here at eight o’clock on the dot."
        },
        {
            "id": 242,
            "phrase": "on the double",
            "definition": "very fast; twice as fast as normal. (Originally military. Alludes to “double time” in marching.) _ Get over here right now—on the double! _ She wants to see you in her office on the double."
        },
        {
            "id": 243,
            "phrase": "*on the edge",
            "definition": "very anxious and about to become distraught; on the verge of becoming irrational. (*Typically: be ~; live ~. See also on edge.) _ After the horrible events of the last week, we are all on the edge."
        },
        {
            "id": 244,
            "phrase": "on the edge of one’s seat",
            "definition": "[of a member of an audience] closely following the action and excitement of a performance.  We sat on the edge of our seats during the entire play."
        },
        {
            "id": 245,
            "phrase": "on the eve of something",
            "definition": "just before something, possibly the evening before something. John decided to leave school on the eve of his graduation. The team held a party on the eve of the tournament."
        },
        {
            "id": 246,
            "phrase": "on the face of it",
            "definition": "superficially; from the way it looks. This looks like a serious problem on the face of it. It probably is minor, however.  On the face of it, it seems worthless."
        },
        {
            "id": 247,
            "phrase": "on the fast track",
            "definition": "following an expedited procedure; being acted upon sooner or more quickly than is typical.  Let’s put this project on the fast track and maybe we’ll see results sooner."
        },
        {
            "id": 248,
            "phrase": "*on the fence (about something)",
            "definition": "undecided about something. (*Typically: be ~; sit ~.) _ Ann is on the fence about going to Mexico.  I wouldn’t be on the fence. I’d love to go."
        },
        {
            "id": 249,
            "phrase": "on the fly",
            "definition": "[done] while something or someone is operating or moving.  I’ll try to capture the data on the f ly.  Please try to buy some aspirin somewhere on the f ly today."
        }
    ]
}