{
    "dictionary": [
        {
            "id": 0,
            "phrase": "trap someone or something in something",
            "definition": "to catch someone or something in a trap.  Jed accidentally trapped Tex in his bear trap.  Jerry trapped a rabbit in his trap."
        },
        {
            "id": 1,
            "phrase": "travel across something",
            "definition": "to make a journey across something or some place.  We have to travel across the desert to get there.  I do not want to travel across that rickety bridge on the way back."
        },
        {
            "id": 2,
            "phrase": "Travel broadens the mind.",
            "definition": "Prov. When you travel, you learn things about the people and places you see. Marie: I never realized how well-off most Americans are until I visited India. Jane: So it’s true that travel broadens the mind, huh? _ Everyone who gets the chance should go abroad. Travel broadens the mind."
        },
        {
            "id": 3,
            "phrase": "travel by something",
            "definition": "1. to make a journey, using a particular conveyance.  I will go by train, since I don’t like to travel by plane. We traveled by car, since that is the cheapest. 2. to make a journey under particular conditions.  I don’t ever travel by night. We like to travel by day so we can see the scenery."
        },
        {
            "id": 4,
            "phrase": "travel for someone or something",
            "definition": "to go from place to place selling for someone or a company. Walter travels for his uncle, who runs a toy factory.  She travels for a company that makes men’s clothing."
        },
        {
            "id": 5,
            "phrase": "travel on something",
            "definition": "1. to make a journey on a particular conveyance.  Do you like to travel on the train? _ I do not care to travel on the bus. 2. to travel having certain bodily states, such as on an empty stomach, on a full stomach. I hate traveling on a full stomach. I can’t stand to travel on a full stomach."
        },
        {
            "id": 6,
            "phrase": "travel over something",
            "definition": "1. to go over something as part of a journey.  We had to travel over an old bridge over the Mississippi to get to my sister’s house. We will travel over a long narrow strip of land to get to the marina. 2. to travel widely over a great area.  She spent the summer traveling over Europe.  I have traveled over the entire country and never failed to find someone I could talk to."
        },
        {
            "id": 7,
            "phrase": "travel through something",
            "definition": "1. to make a journey through some area or country.  We will have to travel through Germany to get there.  Do you want to travel through the desert or through the mountains? 2. to make a journey through some kind of weather condition. I hate to travel through the rain.  I refuse to travel through a snowstorm."
        },
        {
            "id": 8,
            "phrase": "travel with someone",
            "definition": "1. to associate with someone; to move about in association with someone.  She travels with a sophisticated crowd.  I am afraid that Walter is traveling with the wrong group of friends. 2. to make a journey with someone.  Do you mind if I travel with you? _ Who are you going to travel with?"
        },
        {
            "id": 9,
            "phrase": "travel with something",
            "definition": "to have something with one as one travels.  I always travel with extra money.  I hate to travel with three suitcases. That is more than I can handle."
        },
        {
            "id": 10,
            "phrase": "a travesty of justice",
            "definition": "a miscarriage of justice; an act of the legal system that is an insult to the system of justice. The jury’s verdict was a travesty of justice. The lawyer complained that the judge’s ruling was a travesty of justice."
        },
        {
            "id": 11,
            "phrase": "tread (up)on someone or something",
            "definition": "to walk or step on someone or something. (Upon is formal and less commonly used than on. Step is more common than tread.) _ Don’t tread on Sam, who is napping under the tree.  Please don’t tread on the freshly shampooed carpeting on the stairs."
        },
        {
            "id": 12,
            "phrase": "treat someone (for something) (with something)",
            "definition": "to attempt to cure someone’s illness, injury, or disease with something.  The doctor treated me for the flu with aspirin. It didn’t work, but it was cheap.  They treated him for his broken bones. Ann treated him with the appropriate therapy."
        },
        {
            "id": 13,
            "phrase": "treat someone or something as something",
            "definition": "to deal with someone or something as something.  Please don’t treat me as a guest. You treat the editorial board as a needless barrier."
        },
        {
            "id": 14,
            "phrase": "treat someone or something like someone or something",
            "definition": "to deal with someone or something as if the person or thing were really someone, a type of a person, or something. I like him. He treats me like a king. He treats Jane like Mary— he ignores them both."
        },
        {
            "id": 15,
            "phrase": "treat someone to something",
            "definition": "to provide and pay for something for someone as a gift or as entertainment.  I will be delighted to treat you to dinner.  After the play, they treated themselves to pie and coffee."
        },
        {
            "id": 16,
            "phrase": "The tree is known by its fruit.",
            "definition": "Prov. People judge your character by what you do. (Biblical.) _The politician may say she believes in more spending on child care, but the tree is known by its fruit; she hasn’t voted for a single measure that would help."
        },
        {
            "id": 17,
            "phrase": "trek across something",
            "definition": "to hike or march across something.  The scouts trekked across the fields of the small farming community.  I don’t look forward to trekking across the desert."
        },
        {
            "id": 18,
            "phrase": "trek to some place",
            "definition": "to hike or march to some place. I have to trek all the way to the store because my car is in the shop.  We trekked to the cabin and made that our base camp for the whole two weeks."
        },
        {
            "id": 19,
            "phrase": "tremble at something",
            "definition": "to shake with fear or anticipation at the thought of something.  David trembled at the thought of having to go to Russia by himself.  Carl trembled at the idea of winning first place."
        },
        {
            "id": 20,
            "phrase": "tremble from something",
            "definition": "to shake or vibrate in response to something like an explosion or an earthquake.  The house trembled from the blast.  I could feel the bridge trembling from the minor earthquake that I was hearing about on the radio."
        },
        {
            "id": 21,
            "phrase": "tremble with something",
            "definition": "to tremble because of something.  The children trembled with fear during the storm.  David trembled with rage when he saw his slashed tires."
        },
        {
            "id": 22,
            "phrase": "trend toward something",
            "definition": "to move gradually toward something. Fashions are trending toward the gaudy and flamboyant.  Attitudes are trending toward the more conservative."
        },
        {
            "id": 23,
            "phrase": "trespass (up)on something",
            "definition": "to intrude or encroach onto a restricted or private area. (Upon is formal and less commonly used than on.) _ You had better not trespass upon Mr. Green’s land.  I wouldn’t trespass on that fenced-off land!"
        },
        {
            "id": 24,
            "phrase": "trial and error",
            "definition": "trying repeatedly for success.  I finally found the right key after lots of trial and error.  Sometimes trial and error is the only way to get something done."
        },
        {
            "id": 25,
            "phrase": "trial balloon",
            "definition": "a test of someone’s or the public’s reaction. It was just a trial balloon, and it didn’t work. The trial balloon was a great success."
        },
        {
            "id": 26,
            "phrase": "trials and tribulations",
            "definition": "Cliché problems and tests of one’s courage or perseverance. I suppose I have the normal trials and tribulations for a person of my background, but some days are just a little too much for me.  I promise not to tell you of the trials and tribulations of my day if you promise not to tell me yours!"
        },
        {
            "id": 27,
            "phrase": "Trick or treat!",
            "definition": "Give me a treat of some kind or I will play a trick on you! (The formulaic expression said by children after they ring someone’s doorbell and the door is answered on Halloween. It is now understood to mean simply that the child is requesting a treat of some kind— candy, fruit, popcorn, etc.) _“Trick or treat!” cried Jimmy when the door opened.  Mr. Franklin opened the door to find four very small children dressed like f lowers standing silently on his doorstep. After a moment, he said, “Isn’t anyone going to say ‘Trick or treat’?”"
        },
        {
            "id": 28,
            "phrase": "trick someone into (doing) something",
            "definition": "to fool someone; to deceive someone; to cheat someone.  The thief tricked John into giving him $10.  Mary tricked her friends into paying for her dinner."
        },
        {
            "id": 29,
            "phrase": "trickle away",
            "definition": "[for a liquid] to seep or dribble away.  All the water trickled away down the drain.  After the last of the spilled milk had trickled away, Timmy began to cry."
        },
        {
            "id": 30,
            "phrase": "trickle down (to someone or something)",
            "definition": "[for a liquid] to seep or dribble downward to reach someone or something. The water trickled down the wall to the f loor.  It trickled down very slowly."
        },
        {
            "id": 31,
            "phrase": "trickle in(to something)",
            "definition": "[for a liquid] to seep or dribble into something or a place.  Some of the rainwater trickled into my car through a leak. It trickled in during the night."
        },
        {
            "id": 32,
            "phrase": "trickle out (of something)",
            "definition": "[for a liquid] to leak or dribble out of something or a place. The oil trickled out of the engine little by little.  It trickled out and made a puddle on the f loor."
        },
        {
            "id": 33,
            "phrase": "trickle through (something)",
            "definition": "[for a liquid] to seep through something.  The water trickled through the cracked windowpane. They taped the glass, but the water trickled through anyway."
        },
        {
            "id": 34,
            "phrase": "*the tricks of the trade",
            "definition": "special skills and knowledge associated with any trade or profession. (*Typically: know ~; learn ~; show someone ~; teach someone ~.) _I know a few tricks of the trade that make things easier.  I learned the tricks of the trade from my uncle."
        },
        {
            "id": 35,
            "phrase": "tried and true",
            "definition": "trustworthy; dependable. (Hyphenated before nominals.) _ The method I use to cure the hiccups is tried and true.  Finally, her old tried-and-true methods failed because she hadn’t fine-tuned them to the times."
        },
        {
            "id": 36,
            "phrase": "trifle something away† (on someone or something)",
            "definition": "to waste something, such as money, on someone or something, little by little.  Don’t trif le all your money away on your friends.  Don’t trif le away any more money on silly purchases."
        },
        {
            "id": 37,
            "phrase": "trifle with someone or something",
            "definition": "to act without seriousness or respect toward someone or something.  Don’t talk that way to me! I am not to be trifled with.  I wish that Ann wouldn’t trif le with our efforts at reform."
        },
        {
            "id": 38,
            "phrase": "trigger someone off†",
            "definition": "to cause someone to become angry. (Fig. on trigger something off.) _Your rude comments triggered her off.  Your comments triggered off Bob’s temper."
        },
        {
            "id": 39,
            "phrase": "trigger something off†",
            "definition": "to set something off, such as an explosion. We were afraid that the sparks from the engine would trigger an explosion off.  The sparks triggered off an explosion."
        },
        {
            "id": 40,
            "phrase": "trim (oneself) down",
            "definition": "to take action to become slimmer or lose weight.  I need to trim myself down before I go on vacation.  I decided to trim down, but I never got around to it.  You really need to trim down and stay at a lower weight."
        },
        {
            "id": 41,
            "phrase": "trim something away† (from something)",
            "definition": "to cut something away (from something).  The butcher trimmed the fat away from the steak.  Please trim away the fat from the meat."
        },
        {
            "id": 42,
            "phrase": "trim something down†",
            "definition": "to reduce the size of something.  You will have to trim the picture down to get it into the frame.  Trim down the picture before you frame it."
        },
        {
            "id": 43,
            "phrase": "trim something from something",
            "definition": "to cut something away from something. I trimmed the fat from the steaks. We had to trim a lot of the fat from the meat after we got it home."
        },
        {
            "id": 44,
            "phrase": "trim something with something",
            "definition": "to decorate something with something.  She trimmed the dress with lace.  Bobby and Timmy trimmed the tree with colorful ornaments."
        },
        {
            "id": 45,
            "phrase": "trip along",
            "definition": "to move along happily. The kids tripped along on their way to school.  We were just tripping along, not having any notion of what was about to happen."
        },
        {
            "id": 46,
            "phrase": "trip someone up†",
            "definition": "to cause someone to trip; to entangle someone’s feet. (Someone includes oneself.) _The rope strewn about the deck tripped him up.  The lines tripped up the crew."
        },
        {
            "id": 47,
            "phrase": "trip the light fantastic",
            "definition": "Jocular to dance.  Shall we go trip the light fantastic?"
        },
        {
            "id": 48,
            "phrase": "triumph over someone or something",
            "definition": "to achieve victory over someone or something. Our team triumphed over all the others.  Our army triumphed over theirs."
        },
        {
            "id": 49,
            "phrase": "troop across someone or something",
            "definition": "[for a mass of creatures] to move across someone or something. The huge herds of wildebeest began to troop across the plain in search of food.  The ants trooped across Karen as she lay in the sand."
        },
        {
            "id": 50,
            "phrase": "troop in(to something)",
            "definition": "to flock or march into something or some place in numbers.  The scouts trooped into the mess hall and sat down.  They trooped in and sat down."
        },
        {
            "id": 51,
            "phrase": "trot after someone",
            "definition": "to follow along after someone, as done by a small dog.  The puppy trotted along after the kids wherever they went. My little brother would always come trotting after us, annoying us a lot."
        },
        {
            "id": 52,
            "phrase": "trot along",
            "definition": "to step along in a lively fashion.  The horses trotted along in time with the music. The horses were trotting along, going exactly where we led them."
        },
        {
            "id": 53,
            "phrase": "trot someone or something out†",
            "definition": "to bring out and display someone or something.  The boss trotted the new vice president out for us to meet.  The boss trotted out his daughter and introduced her as a new vice president. Fred trotted out his favorite project for everyone to see."
        },
        {
            "id": 54,
            "phrase": "trot something out†",
            "definition": "to mention something regularly or habitually, without giving it much thought. (Fig. on the image of trotting out a pony for display.) _ When James disagreed with Mary, she simply trotted her same old political arguments out. Bob always trots out the same excuses for being late."
        },
        {
            "id": 55,
            "phrase": "trouble one’s head about someone or something",
            "definition": "to worry about someone or something.  Please don’t trouble your head about me. I’ll get along.  I wish you wouldn’t trouble your head about the problem. We can solve it."
        },
        {
            "id": 56,
            "phrase": "trouble oneself about someone or something",
            "definition": "to worry oneself about someone or something. (Usually in the negative.) _ Please don’t trouble yourself about me. I’m doing fine.  I can’t take time to trouble myself about this matter. Do it yourself."
        },
        {
            "id": 57,
            "phrase": "trouble oneself (to do something)",
            "definition": "to bother oneself to do something. He didn’t even trouble himself to turn off the light when he left.  No, thank you. I don’t need any help. Please don’t trouble yourself."
        },
        {
            "id": 58,
            "phrase": "A trouble shared is a trouble halved.",
            "definition": "Prov. If you tell someone about a problem you are having, or request someone’s help with a problem, the problem will not seem so daunting. (Can be used to encourage someone to confide in you or ask for your help.) _Jill: Is something wrong? You’ve seemed so depressed lately. Jane: Oh, I wouldn’t want to bother you with it. Jill: Don’t be silly. A trouble shared is a trouble halved, remember."
        },
        {
            "id": 59,
            "phrase": "trouble someone about someone or something",
            "definition": "to bother someone by asking about someone or something. Please don’t trouble me about Larry.  Can I trouble you about a billing problem?"
        },
        {
            "id": 60,
            "phrase": "trouble someone for something",
            "definition": "to ask someone to pass something or give something. (Usually a question.) _ Could I trouble you for the salt? _ Could I trouble you for some advice?"
        },
        {
            "id": 61,
            "phrase": "trouble someone to do something",
            "definition": "to ask someone to do something. (Usually a question.) _Could I trouble you to pass the salt? _Could I trouble you to give me some advice?"
        },
        {
            "id": 62,
            "phrase": "trouble someone with something",
            "definition": "to bother someone with something, such as a question or a problem.  I hate to trouble you with this, but could you help me adjust my binoculars? _ Don’t trouble yourself with this matter."
        },
        {
            "id": 63,
            "phrase": "trudge along",
            "definition": "to plod along on foot.  It seemed as if we trudged along for miles.  As we trudged along, we forgot how cold it was."
        },
        {
            "id": 64,
            "phrase": "trudge through something",
            "definition": "to walk through snow, sand, or something similar. We trudged through the hot sand all the way down the beach. I used to have to trudge through snow like this all winter to get to school."
        },
        {
            "id": 65,
            "phrase": "*true as steel",
            "definition": "very loyal and dependable. (*Also: as ~.) _ Through all my troubles, my husband has been as true as steel.  Pedro was a staunch friend, true as steel."
        },
        {
            "id": 66,
            "phrase": "true something up†",
            "definition": "to straighten something up; to put something into true plumb.  Please true this door frame up better before you hang the door.  Can you true up this wall a little?"
        },
        {
            "id": 67,
            "phrase": "true to form",
            "definition": "exactly as expected; following the usual pattern. (Often with running, as in the example.) _As usual, John is late. At least he’s running true to form.  And true to form, Mary left before the meeting was adjourned."
        },
        {
            "id": 68,
            "phrase": "true to one’s word",
            "definition": "keeping one’s promise.  True to his word, Tom showed up at exactly eight o’clock.  We’ll soon know if Jane is true to her word. We’ll see if she does what she promised."
        },
        {
            "id": 69,
            "phrase": "trump something up†",
            "definition": "1. to promote or boost something.  They think they have to trump something up to get people to see it.  They trumped up the movie so much that many people were disappointed when it finally came out. 2. to think something up; to contrive something.  Do you just sit around trumping charges up against innocent people? _ They trumped up the charges in an effort to disgrace me."
        },
        {
            "id": 70,
            "phrase": "trumped up",
            "definition": "1. heavily promoted; overly praised. (Hyphenated before nominal.) _I don’t care for trumpedup stuff like that movie.  That movie was so trumped up. I expected to see something much better than it turned out to be. 2. made-up; contrived.  They put Larry in the slammer on some trumped-up charge.  It was a silly, trumped-up idea. Just forget it."
        },
        {
            "id": 71,
            "phrase": "truss someone or something up†",
            "definition": "to bind, tie, or bundle someone or something up. The attendants trussed Walter up and took him to a padded cell.  They trussed up Walter tightly.  Ann trussed the bundle up and sent it off."
        },
        {
            "id": 72,
            "phrase": "trust in someone or something",
            "definition": "to believe in someone or something. Trust in me. I know what I am saying. Can I trust in the figures in this report?"
        },
        {
            "id": 73,
            "phrase": "Trust me!",
            "definition": "I am telling you the truth. Please believe me.  Tom said with great conviction, “Trust me! I know exactly what to do!” _ Mary: Do you really think we can keep this party a secret until Thursday? Sally: Trust me! I know how to plan a surprise party."
        },
        {
            "id": 74,
            "phrase": "trust someone for something",
            "definition": "to depend on someone for payment for something. I will lend you one hundred dollars. I know I can trust you for it.  I loaned Ted a lot of money. It’s all right. I can trust him for it."
        },
        {
            "id": 75,
            "phrase": "trust someone or something to someone",
            "definition": "to leave someone or something in the possession of someone whom you assume will take good care of someone or something.  Can I trust my little Jimmy to you? _ I am perfectly comfortable trusting this money to you."
        },
        {
            "id": 76,
            "phrase": "trust someone to do something",
            "definition": "to believe that someone can be relied on to do something.  You can trust her to be here on time.  I can’t trust myself to eat wisely."
        },
        {
            "id": 77,
            "phrase": "trust someone with someone or something",
            "definition": "to leave someone in the care of someone or something.  Can I trust you with my uncle? He needs to have his medicine right on time.  I am sure I can trust you with the money.  Don’t leave that cake with me. I can’t trust myself with it."
        },
        {
            "id": 78,
            "phrase": "The truth will out.",
            "definition": "Prov. The truth will always be discovered. (Can be used to remark that someone who had been concealing the truth is now revealing it, as in the second example.) _ The embezzler may think that someone else will be blamed for his crime, but the truth will out.  Ellen: Remember last week, when I told you I bought some shoes? Fred: Yes. . . . Ellen: Well, before you look at the bill from the shoe store, I ought to tell you that I bought ten pairs. Fred: Aha. The truth will out."
        },
        {
            "id": 79,
            "phrase": "try for something",
            "definition": "to try to win or achieve something.  I am going to try for the silver trophy in this year’s race.  Will you try for a place on the team?"
        },
        {
            "id": 80,
            "phrase": "Try me.",
            "definition": "Ask me.; Give me a chance.  A: I don’t suppose you know what the Achaean League is. B: Try me."
        },
        {
            "id": 81,
            "phrase": "try one’s hand (at something)",
            "definition": "to take a try at something. Someday I’d like to try my hand at f lying a plane. Give me a chance. Let me try my hand!"
        },
        {
            "id": 82,
            "phrase": "try one’s luck (at something)",
            "definition": "to attempt to do something (where success requires luck).  My great-grandfather came to California to try his luck at finding gold.  I went into a gambling casino to try my luck."
        },
        {
            "id": 83,
            "phrase": "try one’s wings (out†)",
            "definition": "to try to do something one has recently become qualified to do. (Fig. on the image of a young bird trying to fly.) _ I recently learned to snorkel, and I want to go to the seaside to try my wings.  You’ve read about it enough. It’s time to try out your wings."
        },
        {
            "id": 84,
            "phrase": "try out (for something)",
            "definition": "to audition for a part in some performance or other activity requiring skill.  I intend to try out for the play.  I’m going to try out, too."
        },
        {
            "id": 85,
            "phrase": "try someone back (again)",
            "definition": "to try to return someone’s telephone call again.  She’s not in, so I’ll try her back later.  Jan will try her back."
        },
        {
            "id": 86,
            "phrase": "try someone for something",
            "definition": "to put someone through a court trial for some crime or wrongdoing.  The prosecutor wanted to try Harry for fraud.  Anne was tried for shoplifting."
        },
        {
            "id": 87,
            "phrase": "try someone or something out†",
            "definition": "to test someone or something for a while; to sample the performance of someone or something.  We will try her out in the editorial department and see how she does. We will try out this employee in another department for a while."
        },
        {
            "id": 88,
            "phrase": "try someone’s patience",
            "definition": "to strain someone’s patience; to bother someone as if testing the person’s patience. (Try means test here.) _ My loud neighbors are trying my patience today.  You really try my patience with all your questions!"
        },
        {
            "id": 89,
            "phrase": "try something on with someone",
            "definition": "to get someone’s opinion about an idea or plan.  Let me try this idea on with you.  She tried the new idea on with the boss, but the response was not good."
        },
        {
            "id": 90,
            "phrase": "try something out† on someone",
            "definition": "to see how someone responds to something or some idea. Let me try this idea out on you and see what you think.  Let me try out this new medicine on her."
        },
        {
            "id": 91,
            "phrase": "tub of lard",
            "definition": "a fat person. (Insulting.) _ Who’s that tub of lard who just came in? _ That tub of lard can hardly get through the door."
        },
        {
            "id": 92,
            "phrase": "tuck into something",
            "definition": "to begin eating something vigorously.  The kids really tucked into the stew.  I could see from the way that they tucked into their meal that they were really hungry."
        },
        {
            "id": 93,
            "phrase": "tuck something around someone or something",
            "definition": "to wrap something snugly around someone or something.  I tucked crumpled newspapers around the cups in the box to keep them from breaking.  Molly-Jo tucked the covers around the baby."
        },
        {
            "id": 94,
            "phrase": "tuck something away†",
            "definition": "to hide or store something away.  Tuck this away where you can find it later.  Can you tuck away this money somewhere?"
        },
        {
            "id": 95,
            "phrase": "tuck something up†",
            "definition": "to raise up some part of one’s clothing and attach it temporarily.  She tucked her skirt up and waded through the f looded basement.  She tucked up her skirt."
        },
        {
            "id": 96,
            "phrase": "tuck something up† (under something)",
            "definition": "to place or push something, such as cloth, up under something. Tuck the sheet up under the mattress when you make the bed. Tuck up the sheet under the mattress when you make the bed."
        },
        {
            "id": 97,
            "phrase": "tucker someone out",
            "definition": "to tire someone out.  All this work has tuckered me out.  The heavy work tuckered the staff out early in the day."
        },
        {
            "id": 98,
            "phrase": "tug at someone or something",
            "definition": "to pull at someone or something.  Stop tugging at me! I’ll talk to you in a minute.  The dog tugged at my pants cuff."
        },
        {
            "id": 99,
            "phrase": "tug away (at something)",
            "definition": "to pull hard at something; to haul something.  She tugged away at the rope, but the anchor would not budge. No matter how much she tugged away, it didn’t move."
        },
        {
            "id": 100,
            "phrase": "tumble along",
            "definition": "to roll or bounce along. The ball tumbled along, across the lawn and into the street.  As the boulder tumbled along, it crushed everything in its path."
        },
        {
            "id": 101,
            "phrase": "tumble down",
            "definition": "to fall down; to topple. The old barn was so rickety that it almost tumbled down on its own.  The pile of books tumbled down all over the f loor."
        },
        {
            "id": 102,
            "phrase": "tumble from something",
            "definition": "to fall from something. The food tumbled from the tray and fell to the f loor.  The books tumbled from the shelf during the earthquake."
        },
        {
            "id": 103,
            "phrase": "tumble into bed",
            "definition": "to get into or fall into bed.  Liz went home and tumbled into bed."
        },
        {
            "id": 104,
            "phrase": "tumble into someone or something",
            "definition": "to fall down and roll into someone or something. (Either accidentally or on purpose.) _ Liz tripped and tumbled into the table.  She tumbled into Ken."
        },
        {
            "id": 105,
            "phrase": "tumble out of something",
            "definition": "to fall, topple, or drop out of something.  Don’t let the baby tumble out of the chair! _The children tumbled out of the car and ran for the school building."
        },
        {
            "id": 106,
            "phrase": "tumble over",
            "definition": "to fall over.  The vase tumbled over and broke.  I held Timmy up to keep him from tumbling over."
        },
        {
            "id": 107,
            "phrase": "tumble over someone or something",
            "definition": "to trip or stumble over someone or something and fall down.  I tumbled over Fred, who was napping under the tree.  I tumbled over a chair and fell down."
        },
        {
            "id": 108,
            "phrase": "tumble over (something)",
            "definition": "to fall over the edge of something.  Stay away from the edge. I don’t want any of you tumbling over it.  Don’t go too close. You’ll tumble over."
        },
        {
            "id": 109,
            "phrase": "tumble someone or something down something",
            "definition": "to tip or push someone or something down something.  Timmy tumbled his brother down the hill. Ann tumbled her laundry down the chute."
        },
        {
            "id": 110,
            "phrase": "tune out",
            "definition": "to cease paying attention to anything at all. I wasn’t interested, so I just tuned out. I think that most of the audience tuned out during the last part of the lecture."
        },
        {
            "id": 111,
            "phrase": "tune someone or something out†",
            "definition": "to put someone or something out of one’s consciousness; to cease paying attention to someone or something. I had to tune the radio out in order to concentrate.  I tuned out what the speaker was saying and daydreamed for a while."
        },
        {
            "id": 112,
            "phrase": "tune something in†",
            "definition": "to adjust a radio or television set so that something can be received. Could you tune the newscast in? _ Please tune in the station a little better."
        },
        {
            "id": 113,
            "phrase": "tune something up†",
            "definition": "to adjust an engine to run the best and most efficiently.  You need to tune this engine up.  Please tune up this engine so it will run more economically."
        },
        {
            "id": 114,
            "phrase": "tune up",
            "definition": "[for one or more musicians] to bring their instruments into tune.  You could hear the orchestra behind the curtain, tuning up. We have to tune up before the concert."
        },
        {
            "id": 115,
            "phrase": "tuned in",
            "definition": "aware; up-to-date.  Jan is tuned in and alert to what is going on around her.  Hey, Jill! Get tuned in, why don’t you?"
        },
        {
            "id": 116,
            "phrase": "tunnel through something",
            "definition": "to make a tunnel or passageway through something or a group of people. Roger had to tunnel through the crowd to get to the rest room.  The workers tunneled through the soft soil to reach the buried cable."
        },
        {
            "id": 117,
            "phrase": "tunnel under someone or something",
            "definition": "to dig a tunnel under someone or something. All the time she was standing in the yard talking about the moles, they were tunneling under her. They took many months to tunnel under the English Channel."
        },
        {
            "id": 118,
            "phrase": "tunnel vision",
            "definition": "a visual impairment wherein one can only see what is directly ahead of oneself.  I have tunnel vision, so I have to keep looking from side to side."
        },
        {
            "id": 119,
            "phrase": "turn a blind eye (to someone or something)",
            "definition": "to ignore something and pretend you do not see it.  The usher turned a blind eye to the little boy who sneaked into the theater.  How can you turn a blind eye to all those starving children?"
        },
        {
            "id": 120,
            "phrase": "turn a deaf ear (to someone or something)",
            "definition": "to ignore what someone says; to ignore a cry for help.  How can you just turn a deaf ear to their cries for food and shelter? _Jack turned a deaf ear to our pleading."
        },
        {
            "id": 121,
            "phrase": "turn a place upside down",
            "definition": "to search a place thoroughly. The cops turned the whole house upside down but never found the gun. I had to turn the place upside down to find my car keys."
        },
        {
            "id": 122,
            "phrase": "turn a profit",
            "definition": "to earn a profit. The company plans to turn a profit two years from now."
        },
        {
            "id": 123,
            "phrase": "turn a trick",
            "definition": "Sl. to perform an act of prostitution. (Use caution with the topic.) _ She can turn a trick and be on the streets again in six minutes f lat. She’s upstairs, turning a trick."
        },
        {
            "id": 124,
            "phrase": "turn back (from some place)",
            "definition": "to stop one’s journey and return. We turned back from the amusement park so we could go home and get the tickets we had forgotten.  We turned back at the last minute."
        },
        {
            "id": 125,
            "phrase": "turn in",
            "definition": "1. [for something] to fold or point inward.  Do my toes turn in too much? _ The legs of the table turned in at the bottom, giving a quaint appearance to the piece of furniture. 2. [for someone] to go to bed.  It’s time to turn in. Good night.  I want to turn in early tonight."
        },
        {
            "id": 126,
            "phrase": "turn in (up)on oneself",
            "definition": "to become introverted. Over the years, she had turned in upon herself and was quiet and alone. The death of his wife caused Jed to turn in on himself."
        },
        {
            "id": 127,
            "phrase": "turn in((to) some place)",
            "definition": "to walk or steer one’s vehicle into a place.  Turn into the next service station for some gas. I’ll turn in for gas now. She walked down the street and turned into the drugstore."
        },
        {
            "id": 128,
            "phrase": "turn into someone or something",
            "definition": "to change into someone or something.  After work is over, he turns into a fairly nice person. The room turned into a very pleasant place when the lights were dimmed."
        },
        {
            "id": 129,
            "phrase": "the turn of the century",
            "definition": "the time when the year changes to one with two final zeros, such as from 1899 to 1900. (Although technically incorrect—a new century begins with the year ending in 01—most people ignore this.) _ My family moved to America at the turn of the century.  My uncle was born before the turn of the last century."
        },
        {
            "id": 130,
            "phrase": "turn off",
            "definition": "[for something] to go off; to switch off.  All the lights turn off automatically."
        },
        {
            "id": 131,
            "phrase": "turn off something",
            "definition": "to walk or turn a vehicle one way or another so that one leaves the road or route to another.  You are supposed to turn off the highway at the yellow mailbox."
        },
        {
            "id": 132,
            "phrase": "turn off (something) onto something",
            "definition": "to walk or steer one’s vehicle from one route to another. I turned off the main highway onto a side road. Ann turned off onto the shoulder."
        },
        {
            "id": 133,
            "phrase": "turn off (something) (some place)",
            "definition": "to walk or steer one’s vehicle off a route at a particular place.  Turn off the highway at the first exit after the city.  Let’s turn off here.  We turned off the path just past the big oak tree."
        },
        {
            "id": 134,
            "phrase": "turn on",
            "definition": "[for something] to switch on and start running. The lights turned on right at dusk. At what time do the street lights turn on?"
        },
        {
            "id": 135,
            "phrase": "turn on a dime",
            "definition": "[for a vehicle] to turn in a very tight turn. This car can turn on a dime. I need a vehicle that can turn on a dime."
        },
        {
            "id": 136,
            "phrase": "turn on someone",
            "definition": "to attack someone. I thought the strange dog was friendly, but suddenly it turned on me and bit me.  Bob knows a lot about lions, and he says that no matter how well they are trained, there is always the danger that they’ll turn on you."
        },
        {
            "id": 137,
            "phrase": "turn on the waterworks",
            "definition": "to begin to cry.  Every time Billy got homesick, he turned on the waterworks.  Sally hurt her knee and turned on the waterworks for about twenty minutes."
        },
        {
            "id": 138,
            "phrase": "Turn on, tune in, drop out.",
            "definition": "A slogan (popularized by Dr. Timothy Leary) promoting the use of LSD among young people.  The key phrase in the heyday of acid was “turn on, tune in, drop out.” _ Millions heard “turn on, tune in, drop out” and did just that."
        },
        {
            "id": 139,
            "phrase": "turn one’s back (on someone or something)",
            "definition": "to turn one’s body so that one’s back faces someone or something.  I turned my back on the dead horse and walked slowly away. I turned my back on the shouting man and left the room."
        },
        {
            "id": 140,
            "phrase": "turn one’s hand to something",
            "definition": "to begin to or to be able to do something.  I would like to turn my hand to Chinese cooking.  He gave up accounting and turned his hand to writing poetry."
        },
        {
            "id": 141,
            "phrase": "turn one’s nose up† at someone or something",
            "definition": "to raise one’s head and therefore one’s nose slightly as a sign of rejection. I never turn my nose up at food. I never turn up my nose at dessert, no matter what it is."
        },
        {
            "id": 142,
            "phrase": "turn onto something",
            "definition": "to walk or steer one’s vehicle onto a road, highway, or path. Turn onto the main road and go west about a mile.  As she turned onto the familiar highway, she realized that she had left her purse in the store."
        },
        {
            "id": 143,
            "phrase": "turn out",
            "definition": "[for something] to aim outward.  Her toes turned out just right for a ballet dancer.  The legs of the chair turned out just a little, adding a bit of stability."
        },
        {
            "id": 144,
            "phrase": "turn out (for something)",
            "definition": "[for people, especially an audience] to [leave home to] attend some event. A lot of people turned out for our meeting.  Almost all the residents turned out for the meeting."
        },
        {
            "id": 145,
            "phrase": "turn out somehow",
            "definition": "to end in a particular way, such as well, badly, all right, etc. I hope everything turns out all right.  The party did not turn out well."
        },
        {
            "id": 146,
            "phrase": "turn out (that)",
            "definition": "to happen; to end up; to result.  After it was all over, it turned out that both of us were pleased with the bargain.  Have you heard how the game turned out?"
        },
        {
            "id": 147,
            "phrase": "turn out to be someone or something",
            "definition": "to develop or become someone or something in the end. In the end, he turned out to be a handsome prince in disguise.  The previous prince turned out to be a frog."
        },
        {
            "id": 148,
            "phrase": "turn over a new leaf",
            "definition": "to begin again, fresh; to reform and begin again. (Fig. on turning to a fresh page. The leaf is a page—a fresh, clean page.) _ I have made a mess of my life. I’ll turn over a new leaf and hope to do better.  Why don’t you turn over a new leaf and surprise everyone with your good characteristics?"
        },
        {
            "id": 149,
            "phrase": "turn some place inside out",
            "definition": "to search some place thoroughly.  I will find that book if I have to turn this place inside out! _ I turned the room inside out and still didn’t find it."
        },
        {
            "id": 150,
            "phrase": "turn someone aside†",
            "definition": "to divert someone from the flow of people.  The attendant turned the poorly dressed man aside.  The attendant turned aside all the persons who arrived late."
        },
        {
            "id": 151,
            "phrase": "turn someone down†",
            "definition": "to issue a refusal to someone.  We had to turn Joan down, even though her proposal was okay.  We turned down Joan, even though her credentials were good."
        },
        {
            "id": 152,
            "phrase": "turn someone off†",
            "definition": "to dull someone’s interest in someone or something.  The boring prof turned me off to the subject.  The preacher set out to turn off the congregation to sin."
        },
        {
            "id": 153,
            "phrase": "turn someone on†",
            "definition": "to excite or interest someone.  Fast music with a good beat turns me on.  That stuff doesn’t turn on anyone."
        },
        {
            "id": 154,
            "phrase": "turn someone or something against someone or something",
            "definition": "to cause someone to defy or revolt against someone or something; to make someone antagonistic toward someone or something. He turned the whole board against Molly.  She turned the city council against the proposed law."
        },
        {
            "id": 155,
            "phrase": "turn someone or something back†",
            "definition": "to cause someone or something to stop and go back; to cause someone or something to retreat.  The border guards turned us back because we had no passports.  They turned back the bus because the bridge was down."
        },
        {
            "id": 156,
            "phrase": "turn someone or something in† (to someone or something)",
            "definition": "to submit or refer someone or something to someone or a group, especially in some official capacity. The good citizen turned his neighbor in for watering his lawn during the wrong hours.  I turned in the report to the treasurer."
        },
        {
            "id": 157,
            "phrase": "turn someone or something inside out",
            "definition": "to evert someone or something; to pull the inside of someone or something out to become the outside. (With people, this refers to mutilation.) _I felt like the explosion was going to turn me inside out.  Ken turned his pockets inside out."
        },
        {
            "id": 158,
            "phrase": "turn someone or something into someone or something",
            "definition": "to change someone or something into someone or something else.  The magician tried to turn Ginny into a robin.  She turned the parrot into a dove."
        },
        {
            "id": 159,
            "phrase": "turn someone or something over†",
            "definition": "to rotate someone or something so that the side that was on the bottom is now on the top.  The nurses turned the patient over so they could give her some medicine.  They turned over the unconscious patient."
        },
        {
            "id": 160,
            "phrase": "turn someone or something over† to someone or something",
            "definition": "to release or assign someone or something to someone or something; to transfer or deliver someone or something to someone or something.  The deputy turned the bank robber over to the sheriff. I turned over the money I found to the police."
        },
        {
            "id": 161,
            "phrase": "turn someone or something to something",
            "definition": "to aim someone or something to face something.  The nurse turned the old man to the sun so he could get warm.  Ken turned the plant to the light."
        },
        {
            "id": 162,
            "phrase": "turn someone or something toward someone or something",
            "definition": "to turn someone or something to face someone or something.  The nurse turned the old man toward his daughter, who had come to visit him.  Ken turned the microphone toward the speaker."
        },
        {
            "id": 163,
            "phrase": "turn someone or something up†",
            "definition": "to increase the volume of a device emitting the sound of someone or something.  I can’t hear the lecturer. Turn her up.  Turn up the radio, please."
        },
        {
            "id": 164,
            "phrase": "turn someone or something upside down",
            "definition": "to invert someone or something.  The wrestler turned his opponent upside down and dropped him on his head. I turned the bottle upside down, trying to get the last drop out."
        },
        {
            "id": 165,
            "phrase": "turn someone out†",
            "definition": "to send someone out of somewhere.  I didn’t pay my rent, so the manager turned me out. I’m glad it’s not winter. I’d hate to turn out someone in the snow."
        },
        {
            "id": 166,
            "phrase": "turn someone’s head",
            "definition": "[for flattery or success] to distract someone; to cause someone not to be sensible.  Don’t let our praise turn your head. You’re not perfect! _ Her successes had turned her head. She was now quite arrogant."
        },
        {
            "id": 167,
            "phrase": "turn someone’s stomach",
            "definition": "to upset one’s stomach.  The violent movie turned my stomach.  The rich, creamy food turned John’s stomach."
        },
        {
            "id": 168,
            "phrase": "turn someone’s water off†",
            "definition": "Sl. to deflate someone; to silence someone.  He said you were stupid, huh? Well, I guess that turns your water off! _That really turned off her water."
        },
        {
            "id": 169,
            "phrase": "turn something aside†",
            "definition": "to evade something.  Ann turned the awkward questions aside.  She turned aside the questions she didn’t want to answer."
        },
        {
            "id": 170,
            "phrase": "turn something down†",
            "definition": "1. to bend or fold something down.  He turned his coat collar down when he got inside the house. Timmy had turned down his cuffs and caught one of them in his bicycle chain. 2. to decrease the volume of something. Please turn the radio down. Can’t you turn down that stereo? 3. to reject something; to deny someone’s request. The board turned our request down. She had turned down John’s offer of help, too."
        },
        {
            "id": 171,
            "phrase": "turn something off†",
            "definition": "to switch something off so that it stops running or operating.  Please turn the light off.  Turn off the lights as you leave."
        },
        {
            "id": 172,
            "phrase": "turn something on†",
            "definition": "to switch on something to make it run.  I turned the microwave oven on and cooked dinner.  I turned on the lights when the sun went down."
        },
        {
            "id": 173,
            "phrase": "turn something out†",
            "definition": "1. to manufacture or produce something in numbers.  The factory turns too few cars out.  The factory turns out about seventy-five cars a day. 2. to turn off a light.  Please turn the hall light out.  Turn out the light."
        },
        {
            "id": 174,
            "phrase": "turn something over† in one’s mind",
            "definition": "to think about something.  I have to turn your suggestion over in my mind a bit before I decide what to do.  After Alice had turned the matter over in her mind, she gave us her verdict.  Please take some time to turn over this matter in your mind."
        },
        {
            "id": 175,
            "phrase": "turn something to good account",
            "definition": "to use something in such a way that it is to one’s advantage; to make good use of a situation, experience, etc. Pam turned her illness to good account and did a lot of reading.  Many people turn their retirement time to good account and take up interesting hobbies."
        },
        {
            "id": 176,
            "phrase": "turn something to one’s advantage",
            "definition": "to make an advantage for oneself out of something (which might otherwise be a disadvantage).  Sally found a way to turn the problem to her advantage.  The ice cream store manager was able to turn the hot weather to her advantage."
        },
        {
            "id": 177,
            "phrase": "turn something under (something)",
            "definition": "to fold something underneath something.  Please turn the frayed edge of the sheet under so that it does not show.  Please turn the edge under."
        },
        {
            "id": 178,
            "phrase": "turn something up†",
            "definition": "1. to bend or fold something up.  Please turn your cuffs up. They are getting muddy. He turned up his coat collar to keep the rain off his neck. 2. to turn playing cards face up. Please turn all the cards up.  Sally turned up the cards one at a time."
        },
        {
            "id": 179,
            "phrase": "turn something upside down",
            "definition": "to throw things all about in a thorough search for someone or something.  We turned this place upside down, looking for the lost ring.  Please don’t turn everything upside down, looking for your book."
        },
        {
            "id": 180,
            "phrase": "turn tail (and run)",
            "definition": "to flee; to run away in fright.  I couldn’t just turn tail and run, but I wasn’t going to fight that monster, either.  Sometimes turning tail is the only sensible thing to do."
        },
        {
            "id": 181,
            "phrase": "turn the corner",
            "definition": "to pass a critical point in a process. The patient turned the corner last night. She should begin to show improvement now.  The project has turned the corner. The rest should be easy."
        },
        {
            "id": 182,
            "phrase": "turn the heat up† (on someone)",
            "definition": "to use force to persuade someone to do something; to increase the pressure on someone to do something.  Management is turning the heat up to increase production.  The teacher really turned up the heat on the students by saying that everyone would be punished if the real culprit was not found."
        },
        {
            "id": 183,
            "phrase": "turn the other cheek",
            "definition": "to ignore abuse or an insult.  When Bob got mad at Mary and yelled at her, she just turned the other cheek.  Usually I turn the other cheek when someone is rude to me."
        },
        {
            "id": 184,
            "phrase": "turn the other way",
            "definition": "to look away and ignore someone or something. When I tried to talk to her, she turned the other way and made it clear that she was angry."
        },
        {
            "id": 185,
            "phrase": "turn the tables (on someone)",
            "definition": "to cause a reversal in someone’s plans; to make one’s plans turn back on one.  I went to Jane’s house to help get ready for a surprise party for Bob. It turned out that the surprise party was for me! Jane really turned the tables on me! _ Turning the tables like that requires a lot of planning and a lot of secrecy."
        },
        {
            "id": 186,
            "phrase": "turn the tide",
            "definition": "to cause a reversal in the direction of events; to cause a reversal in public opinion.  It looked as if the team were going to lose, but near the end of the game, our star player turned the tide. At first, people were opposed to our plan. After a lot of discussion, we were able to turn the tide."
        },
        {
            "id": 187,
            "phrase": "turn thumbs down (on someone or something)",
            "definition": "to reject someone or something; to grow to reject someone or something.  The boss turned thumbs down on Tom. They would have to find someone else.  The minute I saw it, I turned thumbs down."
        },
        {
            "id": 188,
            "phrase": "turn thumbs up (on someone or something)",
            "definition": "to accept someone or something; to approve someone or something.  The board of directors turned thumbs up on my proposal and voted to fund the project.  The committee turned thumbs up on Carl as the new manager. When the boss turned thumbs up, I knew everything was okay."
        },
        {
            "id": 189,
            "phrase": "turn to",
            "definition": "to begin to get busy. Come on, you guys! Turn to! Let’s get to work. If you people will turn to, we can finish this work in no time at all."
        },
        {
            "id": 190,
            "phrase": "turn to someone or something (for something)",
            "definition": "to seek or expect something from someone or something. I turned to Sally for advice.  I turn to my dictionary for help two or three times a day."
        },
        {
            "id": 191,
            "phrase": "turn turtle",
            "definition": "to turn upside down.  The sailboat turned turtle, but the sailors only got wet.  The car ran off the road and turned turtle in the ditch."
        },
        {
            "id": 192,
            "phrase": "turn up",
            "definition": "1. [for part of something] to point upward. The ends of the elf ’s funny little shoes turned up. 2. Fig. to happen.  Something always turns up to prevent their meeting. I am sorry I was late. Something turned up at the last minute. 3. Fig. to appear; to arrive and attend.  We’ll send out invitations and see who turns up.  Guess who turned up at my door last night?"
        },
        {
            "id": 193,
            "phrase": "turn up one’s toes",
            "definition": "Sl. to die.  When I turn up my toes, I want a big funeral with lots of f lowers.  Our cat turned up his toes during the night. He was nearly ten years old."
        },
        {
            "id": 194,
            "phrase": "turn up (somewhere)",
            "definition": "[for someone or something] to appear in a place.  Her name is always turning up in the gossip columns.  He turned up an hour late."
        },
        {
            "id": 195,
            "phrase": "turn up† the heat (on someone or something)",
            "definition": "to put pressure on someone or something; apply additional pressure to someone or something. The FBI turned the heat up on the gang. The police turned up the heat on the people who park illegally every day."
        },
        {
            "id": 196,
            "phrase": "turn (up)on someone or something",
            "definition": "to attack or oppose someone or something, especially the person or group in charge. (Upon is formal and less commonly used than on.) _ I never thought that my own dog would turn on me! _ The treasurer turned on the entire board of directors."
        },
        {
            "id": 197,
            "phrase": "Turnabout is fair play.",
            "definition": "Prov. It is fair for one to suffer whatever one has caused others to suffer.  So, you don’t like being made fun of! Well, turnabout is fair play."
        },
        {
            "id": 198,
            "phrase": "turned off",
            "definition": "uninterested.  I’m sort of turned off to stuff like that these days. Part of getting older, I guess.  I can’t pay attention if I’m turned off, now can I?"
        },
        {
            "id": 199,
            "phrase": "*a turning point",
            "definition": "a time when things may change; a point at which a change of course is possible or desirable. (Originally nautical. Fig. on the image of a ship approaching a point where a change of course has been planned. (*Typically: be at ~; come to ~; reach ~.) _Things are at to a turning point. Bob can no longer afford the payments on his car. I think we have come to a turning point and there ought to be some improvement henceforth."
        },
        {
            "id": 200,
            "phrase": "tussle with someone or something",
            "definition": "1. to struggle or battle with someone or something. Tim tussled with Roger for a while, and then they made peace.  I tussled with the trunk, trying to get it into the attic. 2. Fig. to argue or contend with someone, a group, or something. (Fig. on Q.) _I tussled with my conscience all night. We tussled with the committee and won our point."
        },
        {
            "id": 201,
            "phrase": "twelve good men and true",
            "definition": "a jury composed of trustworthy men.  He was convicted by a jury of twelve good men and true. Not a wino in the lot."
        },
        {
            "id": 202,
            "phrase": "twiddle one’s thumbs",
            "definition": "to pass the time by twirling one’s thumbs.  What am I supposed to do while waiting for you? Sit here and twiddle my thumbs? _Don’t sit around twiddling your thumbs. Get busy!"
        },
        {
            "id": 203,
            "phrase": "twiddle with something",
            "definition": "to play with something; to play with something, using one’s fingers; to fiddle with something.  I asked Jason to stop twiddling with the pencils.  Someone is twiddling with the stereo controls."
        },
        {
            "id": 204,
            "phrase": "twilight years",
            "definition": "the last years before death.  In his twilight years, he became more mellow and stopped yelling at people."
        },
        {
            "id": 205,
            "phrase": "twine around something",
            "definition": "to weave or coil around something.  The snake twined around the branch.  As the vine grew, it twined around the lamppost."
        },
        {
            "id": 206,
            "phrase": "twinkle with something",
            "definition": "[for someone’s eyes] to sparkle because of something.  Her eyes twinkled with laughter. Tom’s eyes twinkled with recognition when he saw Gwen again."
        },
        {
            "id": 207,
            "phrase": "twist around",
            "definition": "to turn around part way at the waist, without moving one’s feet or legs.  Nancy twisted around to get a better look at who was sitting behind her.  I had to twist around to see who was there."
        },
        {
            "id": 208,
            "phrase": "twist (slowly) in the wind",
            "definition": "to suffer the agony of some humiliation or punishment. (Alludes to an execution by hanging.) _I’ll see you twist in the wind for trying to frustrate this investigation.  The prosecutor was determined that Richard would twist slowly in the wind for the crime."
        },
        {
            "id": 209,
            "phrase": "twist someone’s arm",
            "definition": "to pressure someone. (Fig. on the image of hurting someone until they agree to cooperate.) _I had to twist her arm a little, but she agreed. Do I have to twist your arm, or will you cooperate?"
        },
        {
            "id": 210,
            "phrase": "twist someone’s words (around)",
            "definition": "to restate someone’s words inaccurately; to misrepresent what someone has said. Stop twisting my words around! Listen to what I am telling you! _ You are twisting my words again. That is not what I said!"
        },
        {
            "id": 211,
            "phrase": "twist something around someone or something",
            "definition": "to wrap something around someone or something. Max twisted the wire around Lefty, and totally immobilized him.  I twisted the rope around the post and tied a knot."
        },
        {
            "id": 212,
            "phrase": "twist something into something",
            "definition": "to change or distort something into something else, as if by twisting. Kelly twisted the balloons into the shape of a dog.  Ann twisted the silver wires into an earring."
        },
        {
            "id": 213,
            "phrase": "twist something out of something",
            "definition": "to remove something from something by twisting.  Flo twisted the cork out of the bottle and smelled the wine.  Roger twisted the bulb out of its socket and replaced it with a good one."
        },
        {
            "id": 214,
            "phrase": "twist up",
            "definition": "1. to move upward in a twisting path.  The smoke twisted up into the sky.  As the car twisted up the narrow path, we got a good view of the valley. 2. to become twisted.  The rope twisted up and had to be unwound."
        },
        {
            "id": 215,
            "phrase": "Two can play (at) this game (as well as one).",
            "definition": "Both competitors—not just one—can compete in this manner or with this strategy.  You are not the only one who knows how to cheat and lie. Two can play this game."
        },
        {
            "id": 216,
            "phrase": "Two heads are better than one.",
            "definition": "Prov. Two people working together have a better chance of solving a problem than one person working alone. Come over here and help me balance my checkbook. Two heads are better than one.  Jane: Can you figure out what this insurance document means? Alan: Why ask me? I don’t know anything about insurance. Jane: Neither do I, but two heads are better than one."
        },
        {
            "id": 217,
            "phrase": "two jumps ahead of someone",
            "definition": "a good way ahead of someone. Her market research kept her two jumps ahead of her competitors.  I was just starting to think of vacation plans, not realizing that my wife was two jumps ahead of me. She had already made hotel reservations."
        },
        {
            "id": 218,
            "phrase": "two of a kind",
            "definition": "people or things of the same type or that are similar in character, attitude, etc. Jack and Tom are two of a kind. They’re both ambitious.  The companies are two of a kind. They both pay their employees badly."
        },
        {
            "id": 219,
            "phrase": "two shakes of a lamb’s tail",
            "definition": "quickly; rapidly. I’ll be there in two shakes of a lamb’s tail.  In two shakes of a lamb’s tail, the entire pile of bricks had collapsed."
        },
        {
            "id": 220,
            "phrase": "*two strikes against one",
            "definition": "1. two strikes on a baseball batter, three being the number that will put the batter “out.” (Such a player is in a vulnerable position. *Typically: get ~; have ~.) _Sammy has two strikes against him and might just strike out. 2. Fig. a critical number of things against one; a position wherein success is unlikely or where the success of the next move is crucial. (Fig. on Q. *Typically: get ~; have ~.) _ Poor Bob had two strikes against him when he tried to explain where he was last night.  I can’t win. I’ve got two strikes against me before I start."
        },
        {
            "id": 221,
            "phrase": "two (w)hoops and a holler",
            "definition": "Rur. a short distance.  Lexington? That’s just two whoops and a holler from here.  We’re just two hoops and a holler from the downtown."
        },
        {
            "id": 222,
            "phrase": "Two wrongs do not make a right.",
            "definition": "Prov. Someone else may do something bad and not be punished, but that does not mean you are allowed to do bad things. Jill: I’d really like to humiliate Fred, after he made fun of me in front of everyone at lunch. Jane: Now, now, Jill. Two wrongs don’t make a right."
        },
        {
            "id": 223,
            "phrase": "two-fisted",
            "definition": "[of a male] aggressive and feisty.  Perry is a real, two-fisted cowboy, always ready for a fight or a drunken brawl."
        },
        {
            "id": 224,
            "phrase": "a two-time loser",
            "definition": "a confirmed loser.  Poor Richard is a two-time loser.  Martin is a two-time loser, or at least he looks like one."
        },
        {
            "id": 225,
            "phrase": "two-time someone",
            "definition": "Sl. to cheat on or betray one’s spouse or lover by dating or seeing someone else.  When Mrs. Franklin learned that Mr. Franklin was two-timing her, she left him.  Ann told Bob that if he ever two-timed her, she would cause him a lot of trouble."
        },
        {
            "id": 226,
            "phrase": "a two-way street",
            "definition": "a reciprocal situation.  This is a twoway street, you know. You will have to help me someday in return.  Friendship is a two-way street."
        },
        {
            "id": 227,
            "phrase": "type over something",
            "definition": "to type one letter over another. Just type over the o with an e. No one will notice."
        },
        {
            "id": 228,
            "phrase": "type something out†",
            "definition": "to make some information presentable by typing or keying it.  Please type this out before you submit it to the board for approval. Can you type out this report before quitting time?"
        },
        {
            "id": 229,
            "phrase": "type something up†",
            "definition": "to type a handwritten document; to type a document, perhaps using a computer. I will give this to you as soon as I type it up. Please type up this document."
        },
        {
            "id": 230,
            "phrase": "*ugly as a toad",
            "definition": "[of a living creature] very ugly. (*Also: as ~.) _Maria may be a beautiful woman, but when she was a child she was as ugly as a toad.  The shopkeeper was ugly as a toad, but he was kind and generous, and everyone loved him."
        },
        {
            "id": 231,
            "phrase": "*ugly as sin",
            "definition": "Cliché extremely ugly. (*Also: as ~.) _Why would anyone want to buy that dress? It’s as ugly as sin! _ Harold is ugly as sin, but his personality is very charming."
        },
        {
            "id": 232,
            "phrase": "unaccustomed to someone or something",
            "definition": "not used to someone or something.  The poor family was unaccustomed to going to fancy restaurants.  Bill was unaccustomed to mailing his own letters."
        },
        {
            "id": 233,
            "phrase": "unbosom oneself to someone",
            "definition": "to reveal one’s inner thoughts and secrets to someone.  He unbosomed himself to his best friend. Todd unbosomed himself to almost everyone he met."
        },
        {
            "id": 234,
            "phrase": "unburden oneself to someone",
            "definition": "to tell someone about one’s trouble or anxiety.  I didn’t mean to unburden myself to you. I’m just so upset.  She unburdened herself to her mother."
        },
        {
            "id": 235,
            "phrase": "under a cloud (of suspicion)",
            "definition": "suspected of something.  Someone stole some money at work, and now everyone is under a cloud of suspicion. Even the manager is under a cloud."
        },
        {
            "id": 236,
            "phrase": "*under a spell",
            "definition": "enchanted; under the control of magic. (*Typically: be ~; have someone ~; put someone ~.) _ Her soft voice and faint perfume put Buxton under a spell. Then enchantment was broken when he found his wallet missing."
        },
        {
            "id": 237,
            "phrase": "*under arrest",
            "definition": "arrested and in the custody of the police in preparation for the filing of a charge. (*Typically: be ~; put someone ~.) _Stop where you are! You are under arrest! _ Am I under arrest, officer? What did I do?"
        },
        {
            "id": 238,
            "phrase": "*under (close) scrutiny",
            "definition": "being watched or examined closely. (*Typically: be ~; have someone or something ~; keep someone or something ~.) _ The suspect was kept under scrutiny throughout the investigation."
        },
        {
            "id": 239,
            "phrase": "under construction",
            "definition": "being built or repaired.  We cannot travel on this road because it’s under construction.  Our new home has been under construction all summer. We hope to move in next month."
        },
        {
            "id": 240,
            "phrase": "*under control",
            "definition": "manageable; restrained and controlled; not out of control. (*Typically: be ~; bring someone or something ~; get someone or something ~; have someone or something ~; keep someone or something ~.) _ We finally got things under control and functioning smoothly.  The doctor felt she had the disease under control and that I would get well soon."
        },
        {
            "id": 241,
            "phrase": "*under fire",
            "definition": "during an attack; being attacked. (*Typically: be ~; resign ~; think ~.) _There was a scandal in city hall, and the mayor was forced to resign under fire.  John is a good lawyer because he can think under fire."
        },
        {
            "id": 242,
            "phrase": "under normal circumstances",
            "definition": "normally; usually; typically.  “We’d be able to keep the dog at home under normal circumstances,” said Mary to the vet. “Under normal circumstances you’d be able to return to work in a week,” explained the doctor."
        },
        {
            "id": 243,
            "phrase": "under oath",
            "definition": "bound by an oath; having taken an oath.  You must tell the truth because you are under oath.  I was placed under oath before I could testify in the trial."
        },
        {
            "id": 244,
            "phrase": "*under one’s belt",
            "definition": "1. Fig. eaten or drunk and in one’s stomach. (Fig. on the image of swallowed food ending up under one’s belt. *Typically: get something ~; have something ~.) _ I need to have something filling under my belt. I’ve had it with just soup. I want to get a nice juicy steak under my belt. 2. Fig. achieved; counted or scored. (Fig. on Q. *Typically: have something ~.) _ Minnie has over four hundred wins under his belt.  This fighter pilot has over 20 kills under his belt. 3. Fig. learned; mastered. (Fig. on Q. *Typically: get something~.) _ Finally, she got good painting techniques under her belt.  When I get the right procedures under my belt, I will be more efficient."
        },
        {
            "id": 245,
            "phrase": "*under one’s breath",
            "definition": "[spoken] so softly that almost no one can hear it. (*Typically: curse ~; curse someone or something ~; mutter ~; mutter something ~; say something ~.) _John was muttering something under his breath, and I don’t think it was very pleasant. I’m glad he said it under his breath. If he had said it out loud, it would have caused an argument."
        },
        {
            "id": 246,
            "phrase": "under one’s own steam",
            "definition": "by one’s own power or effort. I missed my ride to class, so I had to get there under my own steam.  John will need some help with this project. He can’t do it under his own steam."
        },
        {
            "id": 247,
            "phrase": "*under someone’s thumb",
            "definition": "under someone’s control and management. (*Typically: get someone ~; have someone ~; hold someone ~; keep someone ~.) _You can’t keep your kids under your thumb all their lives.  I don’t want to have these people under my thumb. I’m not the manager type."
        },
        {
            "id": 248,
            "phrase": "*under someone’s wing(s)",
            "definition": "receiving someone’s care and nurturing. (*Typically: get someone ~; have someone ~; take someone ~.) _ John wasn’t doing well in geometry until the teacher took him under her wing.  I had a number of the new workers under my wing for a few weeks."
        },
        {
            "id": 249,
            "phrase": "under the circumstances",
            "definition": "in a particular situation; because of the circumstances.  I’m sorry to hear that you’re ill. Under the circumstances, you may take the day off.  We won’t expect you to come to work for a few days, under the circumstances."
        }
    ]
}