{
    "dictionary": [
        {
            "id": 0,
            "phrase": "tie someone or something up†",
            "definition": "to bind someone or something securely.  The sheriff tied the crooks up and took them to a cell.  He tied up the bandit.  I tied the package up and put a label on it."
        },
        {
            "id": 1,
            "phrase": "tie someone’s hands",
            "definition": "to use rope or string to tie someone’s hands together. The robber tied my hands and I couldn’t call the police."
        },
        {
            "id": 2,
            "phrase": "tie someone to something",
            "definition": "to associate someone with something; to make a connection between someone and something.  The police are trying to tie Lefty to the burglary.  They’ll never tie me to that bunch of crooks!"
        },
        {
            "id": 3,
            "phrase": "tie someone (up) in knots",
            "definition": "to become anxious or upset. John tied himself in knots worrying about his wife during her operation.  This waiting and worrying really ties me up in knots."
        },
        {
            "id": 4,
            "phrase": "tie something back†",
            "definition": "to bind or fasten something back out of the way.  George tied the curtains back to let a little more light in.  Let me tie back the vines out of the way."
        },
        {
            "id": 5,
            "phrase": "tie something in a knot",
            "definition": "to bend something, such as a rope, upon itself to make a knot.  I ended up tying the rope in a knot.  The rope was tied in a knot and no one could get it undone."
        },
        {
            "id": 6,
            "phrase": "tie something off†",
            "definition": "to tie the ends of something losing fluid, as blood vessels to prevent bleeding.  The surgeons tied all the blood vessels off—one by one—as they were exposed.  They tied off all the vessels very quickly."
        },
        {
            "id": 7,
            "phrase": "tie something up†",
            "definition": "to tie strings or cords on something in order to close or contain it. Please tie this pack- age up securely so I can mail it. Tie up your shoes!"
        },
        {
            "id": 8,
            "phrase": "tie the knot",
            "definition": "1. Fig. to marry a mate.  We tied the knot in a little chapel on the Arkansas border. They finally tied the knot. 2. Fig. [for a cleric or other authorized person] to unite a couple in marriage.  It was hard to find somebody to tie the knot at that hour.  It only took a few minutes for the ship’s captain to tie the knot."
        },
        {
            "id": 9,
            "phrase": "tie traffic up†",
            "definition": "to cause road traffic to stop.  If you tie traffic up for too long, you’ll get a traffic ticket. Please don’t stop on the roadway. It’ll tie up traffic."
        },
        {
            "id": 10,
            "phrase": "tie up (some place)",
            "definition": "[for a skipper] to moor a ship or boat some place.  We need to tie up some place for the night.  The captain tied up at the dock and sent the first mate for fuel."
        },
        {
            "id": 11,
            "phrase": "tie (with someone) (for something)",
            "definition": "to have the same score as someone for the prize in some contest. I tied with Joel for first place.  I tied for the trophy with Joel."
        },
        {
            "id": 12,
            "phrase": "tied down",
            "definition": "restricted by responsibilities.  I love my home, but sometimes I don’t like being tied down. I don’t feel tied down, even though I have a lot of responsibility."
        },
        {
            "id": 13,
            "phrase": "tied to one’s mother’s apron strings",
            "definition": "dominated by one’s mother; dependent on one’s mother. Tom is still tied to his mother’s apron strings.  Isn’t he a little old to be tied to his mother’s apron strings?"
        },
        {
            "id": 14,
            "phrase": "tied up",
            "definition": "busy.  How long will you be tied up? _ I will be tied up in a meeting for an hour."
        },
        {
            "id": 15,
            "phrase": "*tight as a tick",
            "definition": "1. very tight. (Fig. on the image of a tick swollen tight with blood or of a tick stuck tightly in someone’s skin. *Also: as ~.) _ This lid is screwed on tight as a tick. The windows were closed—tight as a tick—to keep the cold out. 2. intoxicated. (Fig. on full as a tick. *Also: as ~.) _The old man was tight as a tick but still lucid.  The host got tight as a tick and fell in the pool. 3. [of a race] close, as if the racers are moving very closely together. (*Also: as ~.) _This election is as tight as a tick. 4. very friendly and close; as thick as thieves. (*Also: as ~.) _ Those two are tight as a tick. They are always together."
        },
        {
            "id": 16,
            "phrase": "*tight as Dick’s hatband",
            "definition": "very tight. (*Also: as ~.) _ I’ve got to lose some weight. My belt is as tight as Dick’s hatband.  This window is stuck tight as Dick’s hatband."
        },
        {
            "id": 17,
            "phrase": "a tight race",
            "definition": "a close race.  It was a tight race right up to the final turn when my horse pulled ahead and won easily."
        },
        {
            "id": 18,
            "phrase": "tighten one’s belt",
            "definition": "to manage to spend less money; to use less of something.  Things are beginning to cost more and more. It looks like we’ll all have to tighten our belts.  Times are hard, and prices are high. I can tighten my belt for only so long."
        },
        {
            "id": 19,
            "phrase": "tighten something on(to) something",
            "definition": "to make something more tightly attached to something.  Will you please tighten this nut onto the bolt? _ I tightened the lid on the pickle jar."
        },
        {
            "id": 20,
            "phrase": "tighten something up†",
            "definition": "to make something tighter.  Tighten your seat belt up. It looks loose.  Can you tighten up all the bolts?"
        },
        {
            "id": 21,
            "phrase": "tighten up",
            "definition": "[for something] to get tighter.  The door hinges began to tighten up, making the door hard to open and close.  His grip around the handle tightened up and he refused to let go."
        },
        {
            "id": 22,
            "phrase": "till hell freezes over",
            "definition": "Inf. forever. (Use caution with hell.) _ That’s all right, boss; I can wait till hell freezes over for your answer.  I’ll be here till hell freezes over."
        },
        {
            "id": 23,
            "phrase": "till kingdom come",
            "definition": "until the end of the world; forever.  Do I have to keep assembling these units till kingdom come? _ I’ll hate her guts till kingdom come."
        },
        {
            "id": 24,
            "phrase": "tilt at windmills",
            "definition": "to fight battles with imaginary enemies; to fight against unimportant enemies or issues. (As with the fictional character, Don Quixote, who attacked windmills.) _ Aren’t you too smart to go around tilting at windmills? _ I’m not going to fight this issue. I’ve wasted too much of my life tilting at windmills."
        },
        {
            "id": 25,
            "phrase": "tilt something back†",
            "definition": "to move something so it leans back.  Alice tilted her chair back and nearly fell over.  She tilted back her chair and relaxed."
        },
        {
            "id": 26,
            "phrase": "tilt to something",
            "definition": "to lean or slant toward something or in a particular direction.  The picture tilts to the left.  Her head was tilted to the left because she was trying to see around the corner."
        },
        {
            "id": 27,
            "phrase": "tilt toward someone or something",
            "definition": "1. Lit to lean toward someone or something. The table is tilting toward Roger.  The old shed tilted toward the west. 2. Fig. to favor choosing someone or something; to lean toward doing something.  I am tilting toward Roger for my assistant.  I am tilting toward the red car, not the black one."
        },
        {
            "id": 28,
            "phrase": "Time and tide wait for no man.",
            "definition": "Prov. Things will not wait for you when you are late.  Hurry up or we’ll miss the bus! Time and tide wait for no man.  Ellen: It’s time to leave. Aren’t you finished dressing yet? Fred: I can’t decide which necktie looks best with this shirt. Ellen: Time and tide wait for no man, dear."
        },
        {
            "id": 29,
            "phrase": "time flies (when you’re having fun)",
            "definition": "time passes very quickly. (From the Latin tempus fugit.) _ I didn’t really think it was so late when the party ended. Doesn’t time f ly? _ Time simply f lew while the old friends exchanged news."
        },
        {
            "id": 30,
            "phrase": "*time for someone or something",
            "definition": "the time to deal with someone or something. (Often with the negative. *Typically: get ~; have ~; give someone ~; make ~; find ~.) _I’m sorry, I don’t have time for you today. I don’t think I have time for a game of chess.  I have time for one short game."
        },
        {
            "id": 31,
            "phrase": "Time hangs heavy on someone’s hands.",
            "definition": "Prov. Time seems to go slowly when one has nothing to do. (Note the variations in the examples.) _ I don’t like it when time hangs so heavily on my hands.  John looks so bored. Time hangs heavy on his hands."
        },
        {
            "id": 32,
            "phrase": "time in",
            "definition": "to record one’s arrival time.  Did you remember to time in this morning? _ When did she time in?"
        },
        {
            "id": 33,
            "phrase": "Time is a great healer.",
            "definition": "Prov. Emotional pain will grow less as time passes.  You may think your heart is broken and you can never possibly love again, but time is a great healer."
        },
        {
            "id": 34,
            "phrase": "Time is money.",
            "definition": "(My) time is valuable, so don’t waste it. I can’t afford to spend a lot of time standing here talking. Time is money, you know! _ People who keep saying time is money may be working too hard."
        },
        {
            "id": 35,
            "phrase": "Time is of the essence.",
            "definition": "Timing and meeting all the deadlines are essential and required. (Often seen in contractual agreements.) _ The final payment is due on the first day of December, by midnight. Time is of the essence."
        },
        {
            "id": 36,
            "phrase": "The time is ripe.",
            "definition": "Prov. It is the most favorable time to do something.  You ought to buy a house this year. Prices are so low, and you have enough money saved for a down payment. The time is ripe. Since Joe was in a good mood, I judged that the time was ripe to ask him for the favor I needed."
        },
        {
            "id": 37,
            "phrase": "Time is up.",
            "definition": "The allotted time has run out. You must stop now. Your time is up.  Time’s up! Turn in your tests whether you’re finished or not."
        },
        {
            "id": 38,
            "phrase": "*time off",
            "definition": "a period of time that is free from employment. (*Typically: get ~; have ~; give someone ~; take (some)~.) _I’ll have to get time off for jury duty. I have time off to go downtown and shop."
        },
        {
            "id": 39,
            "phrase": "*time off for good behavior",
            "definition": "a reduction in one’s prison sentence because of good behavior. (*Typically: get ~; have ~; give someone ~.) _ Bob will get out of jail tomorrow rather than next week. He got time off for good behavior."
        },
        {
            "id": 40,
            "phrase": "time out",
            "definition": "1. to record one’s departure time.  Did you remember to time out when you left work? _I timed out at the regular time. 2. a call for officially stopping the clock in a game.  Time out! Wally is injured!"
        },
        {
            "id": 41,
            "phrase": "time’s a-wastin’",
            "definition": "Rur. Time is running out.; It is getting late. Hurry up! Time’s a-wastin’! _How come you’re still in bed? Time’s a-wastin’!"
        },
        {
            "id": 42,
            "phrase": "time someone in†",
            "definition": "to record someone’s arrival time.  I timed you in at noon. Where were you? _My job is to time in people."
        },
        {
            "id": 43,
            "phrase": "time someone out†",
            "definition": "to record someone’s departure time.  Harry had to time everyone out because the time clock was broken.  I had to time out everyone."
        },
        {
            "id": 44,
            "phrase": "Time to call it a day.",
            "definition": "It’s time to quit for the day. Jane: Well, I’m done. Time to call it a day. Sue: Yes, let’s get out of here.  Jane: Well, I’ve finished all my work. Sue: Yes, it’s late. Time to call it a day."
        },
        {
            "id": 45,
            "phrase": "Time to call it a night.",
            "definition": "It’s time to quit one’s activities for the night. (Can refer to work or partying.) _ Bob: Wow, it’s late! Time to call it a night. Mary: Yes, it’s really dark! Good night.  Fred: Gee, I’m tired. Look at the time! Jane: Yes, it’s time to call it a night."
        },
        {
            "id": 46,
            "phrase": "*time to catch one’s breath",
            "definition": "enough time to relax or behave normally. (*Typically: get ~; have ~; give one ~.) _When things slow down around here, I’ll get time to catch my breath. Sally was so busy she didn’t even have time to catch her breath."
        },
        {
            "id": 47,
            "phrase": "time was (when)",
            "definition": "there was a time when; at a time in the past.  Time was when old people were taken care of at home.  Time was when people didn’t travel around so much."
        },
        {
            "id": 48,
            "phrase": "Time will tell.",
            "definition": "Something will become known in the course of time. I don’t know if things will improve. Time will tell. Who knows what the future will bring? Only time will tell."
        },
        {
            "id": 49,
            "phrase": "Time works wonders.",
            "definition": "Prov. The passing of time can resolve many problems.  I thought I would never forgive my ex-husband for leaving me, but now, ten years later, I feel pretty well disposed toward him. Time works wonders. You’ll change your mind eventually. Time works wonders."
        },
        {
            "id": 50,
            "phrase": "Times are changing.",
            "definition": "a response to a surprising piece of news from someone. Sue: They paid nearly five hundred thousand for their first house! Rachel: Well, I shouldn’t be so surprised. Times are changing, I guess.  “Times are changing,” warned Mary. “You can’t expect the world to stand still.”"
        },
        {
            "id": 51,
            "phrase": "Times change and we with time.",
            "definition": "Prov. As time passes, people and situations change. Jill: Linda was such a conservative when we were in school; I don’t understand how she can be so liberal now. Jane: Times change and we with time."
        },
        {
            "id": 52,
            "phrase": "Times change(, people change).",
            "definition": "Prov. As time passes, different things become acceptable.  Grandmother: In my day, no decent young woman would wear anything as immodest as what you’ve got on. Granddaughter: Times change, Grandma.  Alan: When I was in business school, the practices you call good business were called dishonest. Fred: Yeah, well, times change, people change."
        },
        {
            "id": 53,
            "phrase": "a tin ear",
            "definition": "a poor ear for music; a poor hearing ability when it comes to music and distinguishing pitches.  I think I had better not try to sing along with you. I have a tin ear and would ruin your performance."
        },
        {
            "id": 54,
            "phrase": "tinge something with something",
            "definition": "to give something a bit of the character, color, state of mind, light, etc., of something.  The dust in the air had tinged the sunset with orange.  The evening air was tinged with the smell of jasmine."
        },
        {
            "id": 55,
            "phrase": "tinker (around) (with something)",
            "definition": "to meddle with something; to play with something, trying to get it to work or work better. Let me tinker around with it for a while and see if I can get it to work. Please don’t tinker with the controls."
        },
        {
            "id": 56,
            "phrase": "the tip of the iceberg",
            "definition": "only the part of something that can be easily observed, but not the rest of it, which is hidden. (Referring to the fact that the majority of an iceberg is below the surface of the water.) _ The problems that you see here now are just the tip of the iceberg. There are numerous disasters waiting to happen."
        },
        {
            "id": 57,
            "phrase": "tip one’s hand",
            "definition": "to reveal what one is going to do; to reveal one’s secrets. (From card playing.) _ I didn’t tip my hand at all. I left them guessing.  They tried to get me to tip my hand."
        },
        {
            "id": 58,
            "phrase": "tip over",
            "definition": "to topple over and fall.  Roger shook the table slightly, and the vase tipped over.  The truck was overloaded and looked so heavy that I thought it would tip over."
        },
        {
            "id": 59,
            "phrase": "tip someone over",
            "definition": "to cause someone to fall.  Oh! You almost tipped me over! _ Todd fell against Maggie and tipped her over."
        },
        {
            "id": 60,
            "phrase": "tip someone with something",
            "definition": "to pay a tip of a certain amount to someone.  I tipped the headwaiter with a twenty or we would still be waiting. How much did you tip the waitress with?"
        },
        {
            "id": 61,
            "phrase": "tip something over†",
            "definition": "to cause something to fall over.  Did you tip this chair over? _ Who tipped over the chair?"
        },
        {
            "id": 62,
            "phrase": "tip something up†",
            "definition": "to tilt something so it dumps.  Jason tipped the wheelbarrow up and dumped the dirt out.  He tipped up the glass, dumping the orange juice on the table."
        },
        {
            "id": 63,
            "phrase": "tip the scales at something",
            "definition": "to weigh a particular weight. Albert tips the scales at nearly 200 pounds. The champ weighed in and tipped the scales at 180."
        },
        {
            "id": 64,
            "phrase": "tire of someone or something",
            "definition": "to grow weary of someone or something. She tired of him and left him. I am beginning to tire of the furniture in the living room."
        },
        {
            "id": 65,
            "phrase": "tire out",
            "definition": "to become exhausted.  I tire out easily.  When I had the f lu, I found that I tired out easily."
        },
        {
            "id": 66,
            "phrase": "tire someone out†",
            "definition": "to exhaust someone.  The extra work tired him out a lot. Too much work will tire out the horses."
        },
        {
            "id": 67,
            "phrase": "‘Tis better to have loved and lost than never to have loved at all.",
            "definition": "Prov. Love is such an important experience that even the pain of losing someone you love is better than not having loved that person. (A line from Alfred Lord Tennyson’s poem, “In Memoriam A. H. H.”) _ Tom: I’ve been so miserable since Nancy and I broke up. I wish I’d never met her. Fred: Come on, now—’tis better to have loved and lost than never to have loved at all."
        },
        {
            "id": 68,
            "phrase": "tits and ass",
            "definition": "a public display of [the human female] breasts and buttocks. (Referring to television, film, and stage performances in which women breasts and buttocks or in which these body parts are emphasized or made prominent. Use caution with the expression. Fixed order.) _We have a really fine choice on television tonight. There is brutal violence on channel 2, bloody horror on channel 5, and tits and ass on channel 10.  Without tits and ass, many Broadway musicals would f lop."
        },
        {
            "id": 69,
            "phrase": "to a great extent",
            "definition": "Cliché mainly; largely.  To a great extent, Mary is the cause of her own problems.  I’ve finished my work to a great extent. There is nothing important left to do."
        },
        {
            "id": 70,
            "phrase": "to and fro",
            "definition": "[of movement] toward and away from something. The puppy was very active—running to and fro— wagging its tail.  The lion in the cage moved to and fro, watching the people in front of the cage."
        },
        {
            "id": 71,
            "phrase": "to be on the safe side",
            "definition": "to be safe; to be cautious; [to do something just] in case it is necessary; to be very well prepared.  To be on the safe side, carry some extra money in your shoe. I like to be on the safe side and stay in my hotel room at night."
        },
        {
            "id": 72,
            "phrase": "to be safe",
            "definition": "to be cautious; to be careful; [to do something just] in case it is necessary; to be very well prepared.  Just to be safe, you should take some extra water with you.  Other people like to drive over the speed limit, but I prefer to be safe."
        },
        {
            "id": 73,
            "phrase": "to beat the band",
            "definition": "very briskly; very fast.  He’s selling computers to beat the band since he started advertising.  She worked to beat the band to get ready for this."
        },
        {
            "id": 74,
            "phrase": "to boot",
            "definition": "in addition. For graduation, I got a new suit and a coat to boot. She got an F on her term paper and flunked the final to boot."
        },
        {
            "id": 75,
            "phrase": "to date",
            "definition": "up to the present time.  How much have you accomplished to date? _ I’ve done everything I’m supposed to have done to date."
        },
        {
            "id": 76,
            "phrase": "to die for",
            "definition": "Sl. important or desirable enough to die for; worth dying for.  This chocolate cake is to die for! _ We had a beautiful room at the hotel and the service was to die for."
        },
        {
            "id": 77,
            "phrase": "To each his own.",
            "definition": "Prov. Each person has the right to make choices.  A: Bob likes chopped prunes on ice cream! B: To each his own."
        },
        {
            "id": 78,
            "phrase": "To err is human(, to forgive divine).",
            "definition": "Prov. You should not be too harsh with someone who makes a mistake, because all human beings make mistakes. (Often used as a roundabout way to ask someone to forgive you for making a mistake.) _ Jill: How could you let my dog get out when I told you a hundred times that he should stay in the house! Ellen: To err is human, to forgive divine."
        },
        {
            "id": 79,
            "phrase": "to have a hollow leg",
            "definition": "to have a great capacity or need for food or drink. Bobby can drink more beer than I can afford. I think he has a hollow leg!"
        },
        {
            "id": 80,
            "phrase": "to hell and gone",
            "definition": "Inf. very much gone; lost completely. (Use hell with caution.) _ All my hard work is to hell and gone. When you see everything you’ve planned to hell and gone, you get kind of angry. "
        },
        {
            "id": 81,
            "phrase": "(To) hell with that!",
            "definition": "Inf. I reject that! (Very stern or angry. Use hell with caution.) _ Mary: I think we ought to go to the dance Friday night. Tom: To hell with that! _ Fred: Don’t you want to drive me down to school? John: To hell with that!"
        },
        {
            "id": 82,
            "phrase": "to one’s heart’s content",
            "definition": "as much as one wants.  John wanted a week’s vacation so he could go to the lake and fish to his heart’s content.  I just sat there, eating chocolate to my heart’s content."
        },
        {
            "id": 83,
            "phrase": "to say nothing of someone or something",
            "definition": "not to even mention the importance of someone or something. John and Mary had to be taken care of, to say nothing of Bill, who would require even more attention.  I’m having enough difficulty painting the house, to say nothing of the garage that is very much in need of paint."
        },
        {
            "id": 84,
            "phrase": "to say the least",
            "definition": "at the very least; without overemphasizing the subject; to put it mildly.  We were not at all pleased with her work—to say the least.  When they had an accident, they were upset to say the least."
        },
        {
            "id": 85,
            "phrase": "to some extent",
            "definition": "to some degree; in some amount; partly.  I’ve solved this problem to some extent.  I can help you understand this to some extent."
        },
        {
            "id": 86,
            "phrase": "to someone’s liking",
            "definition": "fitting someone’s personal preferences. I had my house painted, but the job was not to my liking.  Large meals with lots of fat are not to Bob’s liking."
        },
        {
            "id": 87,
            "phrase": "to someone’s way of thinking",
            "definition": "in someone’s opinion.  This isn’t satisfactory to my way of thinking.  To my way of thinking, this is the perfect kind of vacation."
        },
        {
            "id": 88,
            "phrase": "to the best of one’s ability",
            "definition": "as well as one is able. I did the work to the best of my ability. You should always work to the best of your ability."
        },
        {
            "id": 89,
            "phrase": "to the core",
            "definition": "all the way through; basically and essentially. (Usually with some negative sense, such as evil, rotten, etc.) _ Bill said that John is evil to the core.  This organization is rotten to the core."
        },
        {
            "id": 90,
            "phrase": "to the ends of the earth",
            "definition": "to the remotest and most inaccessible points on the earth.  I’ll pursue him to the ends of the earth. We’ve explored almost the whole world. We’ve traveled to the ends of the earth trying to learn about our world."
        },
        {
            "id": 91,
            "phrase": "to the last",
            "definition": "to the very end; to the conclusion.  All of us kept trying to the last.  It was a very boring play, but I sat through it to the last."
        },
        {
            "id": 92,
            "phrase": "to the letter",
            "definition": "exactly as instructed; exactly as written.  I didn’t make an error. I followed your instruction to the letter. We didn’t prepare the recipe to the letter, but the cake still turned out very well."
        },
        {
            "id": 93,
            "phrase": "to the max",
            "definition": "Sl. as much as possible, maximally.  She is happy to the max.  They worked to the max their whole shift."
        },
        {
            "id": 94,
            "phrase": "to the nth degree",
            "definition": "to the maximum amount.  Jane is a perfectionist and tries to be careful to the nth degree. This scientific instrument is accurate to the nth degree."
        },
        {
            "id": 95,
            "phrase": "to the tune of some amount of money",
            "definition": "to a certain amount of money. My checking account is overdrawn to the tune of $340. My wallet was stolen, and I’m out to the tune of $70."
        },
        {
            "id": 96,
            "phrase": "To the victors belong the spoils.",
            "definition": "Prov. The winners achieve power over people and property.  The mayor took office and immediately fired many workers and hired new ones. Everyone said, “To the victors belong the spoils.”"
        },
        {
            "id": 97,
            "phrase": "to whom it may concern",
            "definition": "Cliché to the person to whom this applies. (A form of address used when you do not know the name of the person who handles the kind of business you are writing about.) _ The letter started out, “To whom it may concern.” _ When you don’t know who to write to, just say, “To whom it may concern.”"
        },
        {
            "id": 98,
            "phrase": "to wit",
            "definition": "namely; that is; that is to say.  The criminal was punished; to wit, he received a 20-year sentence.  Many students, to wit Mary, Bill, Sue, and Anne, complained about their teacher."
        },
        {
            "id": 99,
            "phrase": "toady (up) to someone",
            "definition": "to fawn over someone; to try to flatter and impress someone. Carl is always toadying up to people.  He has never toadied to me!"
        },
        {
            "id": 100,
            "phrase": "Today here, tomorrow the world.",
            "definition": "Prov. Successful in this location now, with later recognition in the rest of the world. (Describes something whose influence seems certain to spread. The name of an appropriate locality is usually substituted for here.) _ I thought that silly fashion in clothes was unique to California, but it seems to be spreading. Today Los Angeles, tomorrow the world."
        },
        {
            "id": 101,
            "phrase": "toddle along",
            "definition": "1. to walk along in an unconcerned manner.  Kathleen was just toddling along, minding her own business. 2. to walk away.  Why don’t you toddle along now and let me get some work done?"
        },
        {
            "id": 102,
            "phrase": "toil for someone",
            "definition": "1. to work on behalf of someone or for someone’s benefit. I don’t mind toiling for her as long as she thanks me.  I don’t know why I toil for you. You are totally ungrateful. 2. to do someone else’s work.  I don’t know why I should have to toil for you. Do your own work! _ I won’t toil for him. He can do his own work."
        },
        {
            "id": 103,
            "phrase": "toil for something",
            "definition": "1. to work toward a particular goal or ideal.  I am willing to toil for something I believe in.  She spent the afternoon toiling for her favorite charity. 2. to work for a certain rate of pay.  It’s hard to toil for slave’s wages. Do you expect me to toil endlessly for such low pay?"
        },
        {
            "id": 104,
            "phrase": "toil over someone or something",
            "definition": "to work hard on someone or something.  The doctors toiled over the patient for hours. Ken toiled over his model plane well into the night."
        },
        {
            "id": 105,
            "phrase": "toil up something",
            "definition": "to work hard to climb something steep.  The hikers toiled up the slope slowly.  As the bus toiled up the hill, we worried that the engine might be overheating."
        },
        {
            "id": 106,
            "phrase": "toing and froing (on something)",
            "definition": "moving back and forth on an issue, first deciding one way and then changing to another.  The boss spent most of the afternoon toing and froing on the question of who was to handle the Wilson account. I wish you would stop toing and froing and make up your mind."
        },
        {
            "id": 107,
            "phrase": "a token gesture",
            "definition": "an action or a decision that is so small or inconsequential as to be only symbolic.  Offering to pay for my dinner was only a token gesture. That does little to make up for my inconvenience."
        },
        {
            "id": 108,
            "phrase": "tol(er)able (well)",
            "definition": "Rur. pretty well; okay. Tom: How are you feeling? Jane: Tolerable well. Charlie: How’s the work coming? Tom: Tolable well. Mary: How’s your aunt after her surgery? Jane: She’s getting along tolable."
        },
        {
            "id": 109,
            "phrase": "toll for someone",
            "definition": "[for a bell] to ring for someone.  Who are the bells tolling for? _The bells are tolling for Mr. Green, who died last night."
        },
        {
            "id": 110,
            "phrase": "Tomorrow is another day.",
            "definition": "Prov. Things may improve tomorrow; tomorrow you will have a chance to solve the problems that are upsetting you today. (Often used to encourage someone to relax and wait until tomorrow to do or worry about something.) _Child: This math homework is horrible! I can’t do it! Mother: Put it away for tonight and go to bed. You’ll be able to think more clearly when you’ve had some sleep, and tomorrow is another day."
        },
        {
            "id": 111,
            "phrase": "Tomorrow never comes.",
            "definition": "Prov. When the day arrives that you are now calling “tomorrow,” you will call that day “today” and a different day will be called “tomorrow.” (Therefore, you should not resolve to do something tomorrow, since that day will never arrive.) _ Jill: When are you going to go to lunch with me? Jane: Tomorrow. Jill: Tomorrow never comes."
        },
        {
            "id": 112,
            "phrase": "tone someone or something up†",
            "definition": "to make someone or something stronger or more fit, muscularly.  I suggested an exercise that would tone him up and make him feel better.  The exercises toned up his tummy muscles.  I need to get busy and tone myself up."
        },
        {
            "id": 113,
            "phrase": "tone something down†",
            "definition": "to cause something to have less of an impact on the senses of sight or sound; to lessen the impact of something prepared for public performance or consumption.  This is rather shocking. You had better tone it down a bit.  Tone down this paragraph."
        },
        {
            "id": 114,
            "phrase": "tongue-in-cheek",
            "definition": "insincere; joking.  Ann made a tongue-in-cheek remark to John, and he got mad because he thought she was serious.  The play seemed very serious at first, but then everyone saw that it was tongue-in-cheek, and they began laughing."
        },
        {
            "id": 115,
            "phrase": "*a tongue-lashing",
            "definition": "a severe scolding. (*Typically: get ~; have ~; give someone ~.) _ I really got a tonguelashing when I got home.  Ted will have a tongue-lashing at home."
        },
        {
            "id": 116,
            "phrase": "tons of something",
            "definition": "lots of something. We got tons of fried chicken, so help yourself.  You are in tons of trouble."
        },
        {
            "id": 117,
            "phrase": "too big for one’s britches",
            "definition": "Rur. too haughty for one’s status or age.  Bill’s getting a little too big for his britches, and somebody’s going to straighten him out.  You’re too big for your britches, young man! You had better be more respectful."
        },
        {
            "id": 118,
            "phrase": "too close for comfort",
            "definition": "Cliché [for a misfortune or a threat] to be dangerously close.  That car nearly hit me! That was too close for comfort.  When I was in the hospital, I nearly died from pneumonia. Believe me, that was too close for comfort."
        },
        {
            "id": 119,
            "phrase": "*too funny for words",
            "definition": "extremely funny. (*Typically: be ~; get ~.) _ Tom is usually too funny for words at parties.  The joke Tom told was really too funny for words."
        },
        {
            "id": 120,
            "phrase": "*too good to be true",
            "definition": "almost unbelievable; so good as to be unbelievable. (*Typically: be ~; become ~; get ~.) _ The news was too good to be true.  When I finally got a big raise, it was too good to be true."
        },
        {
            "id": 121,
            "phrase": "too little, too late",
            "definition": "Prov. Not enough help to save the situation, and arriving too late. After a lifetime of bad diet and no exercise, Lorna tried to save her health by improving her habits, but it was too little, too late.  Fred: I know how to keep my business from going bankrupt. I’ll invest all my savings in it. Bill: I’m sorry, Fred; even that much would be too little, too late."
        },
        {
            "id": 122,
            "phrase": "Too many chiefs and not enough Indians.",
            "definition": "Prov. Too many people want to be the leader, and not enough people are willing to follow to do the detail work.  Everyone on that committee wants to be in charge. Too many chiefs and not enough Indians. We’ll never finish this project if everyone keeps trying to give orders. There are too many chiefs and not enough Indians."
        },
        {
            "id": 123,
            "phrase": "*too much",
            "definition": "overwhelming; excellent. (*Typically: be ~; get to be ~.) _ It’s wonderful. It’s just too much! _ You are so kind. This is too much."
        },
        {
            "id": 124,
            "phrase": "too much of a good thing",
            "definition": "more of a thing than is good or useful. I usually take short vacations. I can’t stand too much of a good thing. Too much of a good thing can make you sick, especially if the good thing is chocolate."
        },
        {
            "id": 125,
            "phrase": "too rich for someone’s blood",
            "definition": "1. too expensive for one’s budget.  This hotel is too rich for my blood.  Europe is getting too rich for our blood. 2. too high in fat content for one’s diet.  This dessert is too rich for my blood.  Most ice cream is too rich for my blood."
        },
        {
            "id": 126,
            "phrase": "tool around (in something)",
            "definition": "to go around in a car; to speed around in a car.  Who is that kid tooling around in that souped-up car? _ Ann spends a lot of time tooling around in her new car."
        },
        {
            "id": 127,
            "phrase": "tool something up†",
            "definition": "to equip a factory or production line with particular tools and machines, as for new products.  The manager closed down the factory so she could tool it up for the new models. She tooled up the factory in record time."
        },
        {
            "id": 128,
            "phrase": "tool up",
            "definition": "to become equipped with tools.  I need some money so I can tool up to do the job.  The factory tooled up to make the new cars in only two weeks."
        },
        {
            "id": 129,
            "phrase": "top brass",
            "definition": "the highest leader(s); the boss(es). (Originally military.) _The top brass turned thumbs down on the proposal. You’ll have to check it out with the top brass. She’ll be home around five."
        },
        {
            "id": 130,
            "phrase": "top notch",
            "definition": "the absolute best. (Hyphenated before a nominal.) _Julie’s singing in the musical is top notch. He prepared a top-notch meal before the movie and dessert for afterward."
        },
        {
            "id": 131,
            "phrase": "the top of the heap",
            "definition": "a position superior to everyone else.  For some reason, Jerry has to be at the top of the heap. She fought her way to the top of the heap and means to stay there."
        },
        {
            "id": 132,
            "phrase": "top something off",
            "definition": "to add to the difficulty of something.  Jane lost her job, and to top that off, she caught the f lu.  I had a bad day, and to top it off, I have to go to a meeting tonight."
        },
        {
            "id": 133,
            "phrase": "top something off† (with something)",
            "definition": "1. to end or terminate something with something; to put something on the top of something.  They topped the building off with a tall f lagpole.  He topped off each piece of pie with a heap of whipped cream. 2. to celebrate an end to something with something. They topped the evening off with a bottle of champagne. They topped off the evening with a bottle of champagne."
        },
        {
            "id": 134,
            "phrase": "top something up†",
            "definition": "to add a bit of something to replenish the amount that was used.  Let me top your drink up.  Can I top up your glass?"
        },
        {
            "id": 135,
            "phrase": "top something with something",
            "definition": "to decorate or finish something by adding something. They topped the new garage with a weather vane.  Molly-Jo topped each sundae with a big red cherry."
        },
        {
            "id": 136,
            "phrase": "topple down",
            "definition": "[for a stack of something] to crumple and fall down. The chimney toppled down in the earthquake.  The woodpile toppled down during the night and scared us all to death."
        },
        {
            "id": 137,
            "phrase": "topple over",
            "definition": "[for something very tall] to fall over. I was afraid that Jimmy’s stack of blocks would topple over. The stack of books toppled over and ended up as a jumbled mess on the f loor."
        },
        {
            "id": 138,
            "phrase": "topple something down†",
            "definition": "to cause a stack of something to crumple and fall down.  The earthquake toppled the chimney down.  The hurricane toppled down the weakest buildings."
        },
        {
            "id": 139,
            "phrase": "torment someone into doing something",
            "definition": "to force someone to agree to do something through threats or maltreatment.  You can’t torment me into doing something I don’t want to do! _ Alice was tormented into going on the picnic."
        },
        {
            "id": 140,
            "phrase": "torture someone into something",
            "definition": "to force someone to do something through the use of torture. (More severe than torment someone into something.) _The agents threatened to torture me into telling the secrets, so I gave in immediately, of course.  Max tried to torture the old prospector into telling where the gold was hidden."
        },
        {
            "id": 141,
            "phrase": "toss a salad",
            "definition": "to mix various salad ingredients together.  The chef tossed the salad. I tossed the salad just before my guests arrived."
        },
        {
            "id": 142,
            "phrase": "toss one’s cookies",
            "definition": "Sl. to vomit.  Don’t run too fast after you eat or you’ll toss your cookies.  Oh, I feel terrible. I think I’m going to toss my cookies."
        },
        {
            "id": 143,
            "phrase": "toss (someone) for something",
            "definition": "to decide with someone, by tossing a coin, who will get or do something.  Let’s see who gets to go first. I’ll toss you for it.  I’ll toss for it.  Let’s toss for it."
        },
        {
            "id": 144,
            "phrase": "toss someone or something around†",
            "definition": "to throw someone or something around.  The waves tossed him around and almost dashed him on the rocks. The waves tossed around all the little boats."
        },
        {
            "id": 145,
            "phrase": "toss someone or something aside†",
            "definition": "to throw someone or something aside or out of the way. The kidnapper tossed the child aside and reached for his gun. The soldier tossed aside the helpless civilian and ran into the house.  Fred tossed the can aside and Alice picked it up."
        },
        {
            "id": 146,
            "phrase": "toss someone or something away†",
            "definition": "to throw someone or something away; to discard someone or something. You can’t just toss me away! I’m your husband! _ She tossed away her husband of twenty years.  She tossed the cigarette away."
        },
        {
            "id": 147,
            "phrase": "toss someone or something back†",
            "definition": "1. to throw or force someone or something backward.  The blast tossed me back into the room.  The blast tossed back the emergency personnel. 2. to throw someone or something back to where someone or something came from.  My father always threatened to toss me back where I came from, the way a fish is returned to the water.  I will toss back all the undersize fish."
        },
        {
            "id": 148,
            "phrase": "toss something around†",
            "definition": "to discuss something.  I have a few things to discuss. Can we meet later and toss them around? _ We tossed around a few ideas after dinner."
        },
        {
            "id": 149,
            "phrase": "toss something at someone or something",
            "definition": "to throw something at someone or something.  Jimmy tossed an apple at Sarah to see what she would do.  John tossed a stone at the wall."
        },
        {
            "id": 150,
            "phrase": "toss something back and forth",
            "definition": "[for two or more people] to toss something to each other alternately.  Carol and Kelly tossed the ball back and forth for a few minutes. We will toss the ball back and forth until we get tired."
        },
        {
            "id": 151,
            "phrase": "toss something down†",
            "definition": "to drink down a drink quickly.  He tossed a beer down and left the bar.  Sam tossed down a couple of shots."
        },
        {
            "id": 152,
            "phrase": "toss something off†",
            "definition": "to throw something off (of oneself ).  Bob coughed so hard he tossed his blanket off.  Tom tossed off his jacket and sat down to watch television."
        },
        {
            "id": 153,
            "phrase": "toss something together",
            "definition": "to assemble something hastily. This report is useless. You just tossed it together! _ This meal was just tossed together, but it was delicious."
        },
        {
            "id": 154,
            "phrase": "toss something up†",
            "definition": "to throw something upward to a higher place or up into the air.  He tossed the coin up, calling “heads” and hoping for the best.  He tossed up the coin."
        },
        {
            "id": 155,
            "phrase": "total something up†",
            "definition": "to add up the total of something.  Please total the bill up and let me see the cost.  Total up the bill and give it to me."
        },
        {
            "id": 156,
            "phrase": "totally awesome",
            "definition": "Sl. very, very impressive.  His motorcycle is totally awesome. It must have cost a fortune."
        },
        {
            "id": 157,
            "phrase": "tote something up†",
            "definition": "to add something up. The clerk toted the bill up and asked for an enormous sum.  Tote up your expense report quickly and submit it to accounts payable."
        },
        {
            "id": 158,
            "phrase": "touch at some place",
            "definition": "[for a ship or an airplane] to visit or call at a port. We touched at Aruba for about an hour.  Our little boat touched at a number of different islands during the two-week cruise."
        },
        {
            "id": 159,
            "phrase": "touch base (with someone)",
            "definition": "to talk to someone; to confer with someone briefly. I need to touch base with John on this matter.  John and I touched base on this question yesterday, and we are in agreement."
        },
        {
            "id": 160,
            "phrase": "touch down",
            "definition": "[for an airplane] to come in contact with the ground; to land.  Flight twelve is due to touch down at midnight.  When will this plane touch down?"
        },
        {
            "id": 161,
            "phrase": "a touch of something",
            "definition": "1. a mild case of some illness.  I have a touch of the flu and need some more bed rest. 2. a little bit of something, particularly a small helping of food or drink.  A: How about some more? What do you need? B: I’ll have just a touch of that meatloaf if there’s enough to go around."
        },
        {
            "id": 162,
            "phrase": "touch on something",
            "definition": "to mention something; to talk about something briefly.  In tomorrow’s lecture I’d like to touch on the matter of taxation.  The teacher only touched on the subject. There wasn’t time to do more than that."
        },
        {
            "id": 163,
            "phrase": "touch someone or something off†",
            "definition": "to ignite or excite someone or something; to excite anger or chaos.  She is very excitable. The slightest thing will touch her off.  The appearance of the fox touched off a furor in the henhouse."
        },
        {
            "id": 164,
            "phrase": "touch someone or something with something",
            "definition": "to bring something into contact with someone or something.  Don’t touch me with that filthy stick! _ I touched the snake with a stick to make sure it was dead.  Wherever he touched himself with the leaf, his skin blistered."
        },
        {
            "id": 165,
            "phrase": "touch someone (up) for something",
            "definition": "to approach someone and ask for something; to beg or borrow something from someone. Jerry tried to touch me for twenty bucks, but I didn’t have it.  It won’t do any good to touch me up for money. I don’t have any."
        },
        {
            "id": 166,
            "phrase": "touch something to something",
            "definition": "to bring something into contact with something.  She touched her hand to her ear to indicate to the speaker to talk louder.  The magician touched his wand to the hat and a rabbit jumped out."
        },
        {
            "id": 167,
            "phrase": "touch something up†",
            "definition": "to fix up the minor flaws in something; to repair a paint job on something. It’s only a little scratch in the finish. We can touch it up easily.  Tom touched up the scrape with a little paint."
        },
        {
            "id": 168,
            "phrase": "touch (up)on something",
            "definition": "to mention something; to talk about something briefly.  In tomorrow’s lecture I’d like to touch on the matter of taxation.  The teacher only touched upon the subject. There wasn’t time to do more than that."
        },
        {
            "id": 169,
            "phrase": "touch-and-go",
            "definition": "very uncertain or critical.  Things were touch-and-go at the office until a new manager was hired.  Jane had a serious operation, and everything was touchand- go for two days after her surgery."
        },
        {
            "id": 170,
            "phrase": "touched by someone or something",
            "definition": "emotionally affected or moved by someone or something. Sally was very nice to me. I was very touched by her.  I was really touched by your kind letter."
        },
        {
            "id": 171,
            "phrase": "touched (in the head)",
            "definition": "Rur. crazy. Sometimes Bob acts like he’s touched in the head.  In fact, I thought he was touched."
        },
        {
            "id": 172,
            "phrase": "a tough break",
            "definition": "a bit of bad fortune.  I’m sorry to hear about your accident. Tough break. John had a lot of tough breaks when he was a kid, but he’s doing okay now."
        },
        {
            "id": 173,
            "phrase": "a tough call",
            "definition": "a difficult judgment to make.  It’s a tough call, but I choose Fred and Mary. Sorry Tom and Carole.  We’re still undecided on whether to buy a place or rent— it’s a tough call."
        },
        {
            "id": 174,
            "phrase": "a tough cookie",
            "definition": "a person who is difficult to deal with.  He’s a tough cookie, but I can handle him.  There was a tough cookie in here this morning who demanded to see the manager."
        },
        {
            "id": 175,
            "phrase": "a tough customer",
            "definition": "someone who is difficult to deal with.  Some of those bikers are really tough customers.  Walt is a tough customer. Just keep away from him."
        },
        {
            "id": 176,
            "phrase": "tough going",
            "definition": "progress that is difficult. It was tough going for the first few miles, but the trail became much easier as we got farther into the forest."
        },
        {
            "id": 177,
            "phrase": "tough guy",
            "definition": "a strong and severe man; a man who might be part of the underworld. He was your typical tough guy— jutting chin, gruff voice—but he was just our decorator checking up on the drapes. So, you want to be a tough guy, huh?"
        },
        {
            "id": 178,
            "phrase": "*tough on someone",
            "definition": "severe and demanding in dealing with someone. (*Typically: act ~; be ~; become ~; get ~.) _ My boss is very tough on me, but I need the structure and discipline."
        },
        {
            "id": 179,
            "phrase": "tough something out",
            "definition": "to carry on with something despite difficulties or setbacks.  Sorry, you’ll just have to tough it out. I think I can tough this job out for another month."
        },
        {
            "id": 180,
            "phrase": "toughen someone or something up†",
            "definition": "to cause someone or something to be stronger, more uncompromising, or more severe.  A few days behind the service counter at the dis- count store will toughen her up quickly.  Having to deal with complaints toughened up the clerk quickly. She tried to toughen the skin on her palms up."
        },
        {
            "id": 181,
            "phrase": "toughen up",
            "definition": "to become tougher, stronger, or more severe.  She will toughen up after a while. You have to be tough around here to survive.  You are going to have to toughen up if you want to play on the team."
        },
        {
            "id": 182,
            "phrase": "tout someone or something around",
            "definition": "to promote and boost someone or something publicly. He is touting his favorite candidate around, hoping to get a few votes for her. Roger is touting his book around, trying to boost sales."
        },
        {
            "id": 183,
            "phrase": "tout someone or something as something",
            "definition": "to present someone or something as a beneficial type of person or something.  Joel touted his candidate as the best of all.  Ann touted her medicine as a cure-all."
        },
        {
            "id": 184,
            "phrase": "tout suite!",
            "definition": "right away; with all haste. (Pronounced “toot sweet.” From French toute de suite.) _ John: Come on, get this finished! Bob: I’m trying. John: Tout suite! Get moving! _ “I want this mess cleaned up, tout suite!” shouted Sally, hands on her hips and steaming with rage."
        },
        {
            "id": 185,
            "phrase": "tow someone or something away†",
            "definition": "to pull something, such as a car or a boat, away with another car, boat, etc. (The someone refers to the property of someone, not the person.) _If I don’t get back to my car, they will tow me away.  The truck towed away my car.  A big truck came and towed the illegally parked car away."
        },
        {
            "id": 186,
            "phrase": "tow someone or something out (of some place)",
            "definition": "to pull something, such as a car, out of something, such as a ditch. (The someone refers to the property of someone, not the person.) _ The farmer used his tractor to tow Andrew out of the ditch.  He towed the car out of the ditch."
        },
        {
            "id": 187,
            "phrase": "tow someone or something out (to something)",
            "definition": "to pull something, such as a boat, or someone in or on something out in the water, to something. (The someone refers to the property of someone, not the person.) _ Frank, who was on his surfboard, asked Tony to tow him out to the little island.  We towed the raft out where the water is deep."
        },
        {
            "id": 188,
            "phrase": "towel someone or something down†",
            "definition": "to rub someone or something dry with a towel.  The mother toweled her child down and dressed her in clean clothes.  She toweled down the child gently.  Towel down the dog. He’s wet and shaking."
        },
        {
            "id": 189,
            "phrase": "towel someone or something off†",
            "definition": "to dry someone or something with a towel.  The young mother toweled the baby off with a soft, warm towel.  She toweled off the baby."
        },
        {
            "id": 190,
            "phrase": "tower above someone or something",
            "definition": "to stand or be much taller than someone or something. (Often used in exaggeration.) _The basketball player towered above everyone else in the room.  The new building towered above all the others in town."
        },
        {
            "id": 191,
            "phrase": "tower head and shoulders above someone or something",
            "definition": "[for someone] to stand much taller than someone or something. (Often used in exaggeration.) _ Bob towers head and shoulders above both his parents.  The boys towered head and shoulders above the walls of the maze. They found their way around easily."
        },
        {
            "id": 192,
            "phrase": "a tower of strength",
            "definition": "a person who can always be depended on to provide support and encouragement, especially in times of trouble.  Mary was a tower of strength when Jean was in the hospital. She looked after her whole family. Jack was a tower of strength during the time that his father was unemployed."
        },
        {
            "id": 193,
            "phrase": "tower over someone or something",
            "definition": "to stand much taller than someone or something.  Tom towers over his older brother, Stan.  Tom towered over the little desk he had been assigned to."
        },
        {
            "id": 194,
            "phrase": "town-and-gown",
            "definition": "the relations between a town and the university located within the town; the relations between university students and the nonstudents who live in a university town. (Usually in reference to a disagreement. Fixed order.) _ There is another town-and-gown dispute in Adamsville over the amount the university costs the city for police services. There was more town-and-gown strife reported at Larry’s Bar and Grill last Saturday night."
        },
        {
            "id": 195,
            "phrase": "toy with someone",
            "definition": "to tease someone; to deal lightly with someone’s emotions.  Ann broke up with Tom because he was just toying with her. He was not serious at all.  Don’t toy with me! I won’t have it!"
        },
        {
            "id": 196,
            "phrase": "toy with something",
            "definition": "to play with something; to fiddle with something.  You are just toying with me! _ Please don’t toy with the stereo controls."
        },
        {
            "id": 197,
            "phrase": "trace around something",
            "definition": "to press something against paper and draw a line around the edges that are in contact with the paper.  Trace around this piece of material and cut out a new pattern. If you trace around the edges carefully, you will end up with a good drawing of the outline."
        },
        {
            "id": 198,
            "phrase": "trace over something",
            "definition": "1. to draw over something lightly. Trace over the drawing to make it a little darker. I had to trace over it twice to make it visible. 2. to copy something by placing a thin sheet of paper over it and drawing an outline of the thing to be copied. Trace over this picture and then photocopy about ten copies for us all.  This needs to be traced over again."
        },
        {
            "id": 199,
            "phrase": "trace someone or something (back†) (to someone or something)",
            "definition": "to trail or track the origin of someone or something back to someone or something.  We traced her back to the car she had ridden in, but lost her trail at that point.  We traced the letter back to her. See if you can trace back the check to its writer."
        },
        {
            "id": 200,
            "phrase": "track someone or something down†",
            "definition": "to search out where someone or something is.  I don’t know where Anne is. I’ll try to track her down.  I’ll track down Anne for you."
        },
        {
            "id": 201,
            "phrase": "track something (all) over something",
            "definition": "to spread something everywhere in a place from the bottom of one’s shoes or feet.  You’re tracking mud all over my house! _ Who tracked stuff over my carpet?"
        },
        {
            "id": 202,
            "phrase": "track something up†",
            "definition": "to mess something up by spreading around something dirty or messy with one’s shoes or feet.  Please don’t track the f loor up! _ Claire tracked up the f loor."
        },
        {
            "id": 203,
            "phrase": "trade at some place",
            "definition": "to buy and sell at some place; to shop at someplace. Do you trade at that store anymore? _We don’t trade there because their prices are too high."
        },
        {
            "id": 204,
            "phrase": "trade insults (with someone)",
            "definition": "to take turns with someone in mutual insulting.  We traded insults with each other for a while and then settled down to some serious discussions of our differences."
        },
        {
            "id": 205,
            "phrase": "trade on something",
            "definition": "to use a fact or a situation to one’s advantage. Tom was able to trade on the fact that he had once been in the army.  John traded on his poor eyesight to get a seat closer to the stage."
        },
        {
            "id": 206,
            "phrase": "a trade secret",
            "definition": "a secret way of making or selling a product; a business secret. The exact formula of the soft drink is a trade secret."
        },
        {
            "id": 207,
            "phrase": "trade someone or something for someone or something",
            "definition": "to exchange someone or something for someone or something.  I will trade you our shortstop for your catcher and two additional promising ball players. I will trade you my office desk for a conference table."
        },
        {
            "id": 208,
            "phrase": "trade something off†",
            "definition": "to get rid of something in an exchange.  I traded my car off.  I traded off my old car for a new one."
        },
        {
            "id": 209,
            "phrase": "trade something with someone",
            "definition": "to exchange something with someone.  Would you trade seats with me? I want to sit there.  Can I trade books with you? This one is dull."
        },
        {
            "id": 210,
            "phrase": "trade up from something",
            "definition": "to exchange a specific lower-level product for a higher-level product. I decided to trade up from my little car to a much larger one. I can’t afford what I have, let alone be able to trade up to anything."
        },
        {
            "id": 211,
            "phrase": "trade up (to something)",
            "definition": "to exchange a lower-level product for a specific higher-level product.  I would like to trade up to a more luxurious model. I would like to trade up."
        },
        {
            "id": 212,
            "phrase": "trade with someone or something",
            "definition": "to do business with someone or something.  I don’t like the owner of that shop. I won’t trade with him anymore.  Thank you for trading with us all these years.  We don’t trade with that company because their prices are too high."
        },
        {
            "id": 213,
            "phrase": "traffic in something",
            "definition": "to deal in something; to trade in something, usually something illegal.  Max had been trafficking in guns for years before they caught him. The president of the country was trafficking in drugs for years."
        },
        {
            "id": 214,
            "phrase": "a traffic jam",
            "definition": "vehicle traffic that is so heavy and slow that it can no longer move. Going to the airport, we got stuck in a traffic jam for nearly and hour and missed our plane."
        },
        {
            "id": 215,
            "phrase": "trail (along) (after someone or something)",
            "definition": "1. to drag along after someone or something.  His pants were torn, and a piece of his trouser leg trailed along after him.  His trouser leg trailed after him. 2. to follow along after someone or something.  A little dog trailed along after Mary and Karen.  Is that your dog trailing along?"
        },
        {
            "id": 216,
            "phrase": "trail behind (someone or something)",
            "definition": "1. to follow or drag along behind someone or something. A long satin train trailed behind the bride. A long train trailed behind. 2. to move along behind someone or a group in a competition.  Sally trailed behind the rest of the marathon runners.  Roger trailed behind Dave during most of the race."
        },
        {
            "id": 217,
            "phrase": "trail over something",
            "definition": "to lie behind, flowing out over something. Her long gown trailed over the marble f loor. The flowering vine trailed over the wall, making a lovely little garden area."
        },
        {
            "id": 218,
            "phrase": "trail someone or something by something",
            "definition": "to have a smaller score than someone or something by a specific number of points.  Our team trails the visiting team by only six points.  I trailed her by only a few points."
        },
        {
            "id": 219,
            "phrase": "train for something",
            "definition": "to practice or drill for some task.  I am training for the marathon. We all have to train for the upcoming football season."
        },
        {
            "id": 220,
            "phrase": "train someone in something",
            "definition": "to drill and practice someone in a particular skill or body of knowledge.  Her mentor trained her in the art of argumentation. I will try to train you in the skills needed to perform this task."
        },
        {
            "id": 221,
            "phrase": "train someone on something",
            "definition": "to educate someone in the use of something. We trained him on the high diving board, but he isn’t ready for competition yet. She trained herself on the computer so she could write a book."
        },
        {
            "id": 222,
            "phrase": "train someone or an animal as something",
            "definition": "to educate someone or an animal to serve in a particular way. We trained him as a first-rate mechanic.  I trained my cocker spaniel as a moderately effective watchdog."
        },
        {
            "id": 223,
            "phrase": "train someone or an animal for something",
            "definition": "to educate someone or an animal for some purpose. His parents trained him for work in the family business.  He was trained for factory work."
        },
        {
            "id": 224,
            "phrase": "train something on someone, something, or an animal",
            "definition": "to aim something at someone, something, or an animal.  Dave trained the spotlight on Fred, who was just coming out of the building. Train your lens on that bush. There is a deer back there."
        },
        {
            "id": 225,
            "phrase": "train up to something",
            "definition": "to practice or drill up to a certain level of proficiency.  I don’t have enough stamina for the marathon now, but I am training up to it.  Alice trained up to the long-distance swim for years."
        },
        {
            "id": 226,
            "phrase": "traipse around (some place)",
            "definition": "to walk or travel around some place.  I spent all afternoon traipsing around town looking for just the right gift for Roger.  She has been traipsing around all day."
        },
        {
            "id": 227,
            "phrase": "tramp across something",
            "definition": "to march or stamp across an area.  The kids tramped across the yard and wore a path.  Please don’t tramp across my garden."
        },
        {
            "id": 228,
            "phrase": "tramp through something",
            "definition": "to march or stamp a passage through something.  The kids tramped through every puddle in town on their way to school.  Don’t tramp through every mud puddle you see."
        },
        {
            "id": 229,
            "phrase": "trample someone or something down†",
            "definition": "to crush down someone or something with the feet. Stay out of crowds at rock concerts. Those kids will trample you down if they get excited.  The cows trampled down the stalks of corn."
        },
        {
            "id": 230,
            "phrase": "trample someone or something to something",
            "definition": "to stomp or crush someone or something underfoot to the point of death or destruction.  The elephant trampled the photographer to death.  All the joggers trampled the grass to a muddy mess."
        },
        {
            "id": 231,
            "phrase": "trample something out†",
            "definition": "to create a pathway by marching or stamping the same trail over and over. The mail carriers have trampled a path out through my marigolds! _ Jim trampled out a path in my garden."
        },
        {
            "id": 232,
            "phrase": "trample (up)on someone or something",
            "definition": "to crush someone or something underfoot. (Upon is formal and less commonly used than on.) _ Please don’t trample upon the f lowers! _ The bulls running through the streets trampled on some of the bystanders."
        },
        {
            "id": 233,
            "phrase": "transcribe something from someone or something",
            "definition": "to write something down from an audible source.  We transcribed the folktales from authentic storytellers.  I transcribed the tale from an old phonograph recording."
        },
        {
            "id": 234,
            "phrase": "transcribe something in something",
            "definition": "1. to transliterate one alphabet into another.  Can you translate these romanized Korean words into the Korean script? _We had to transcribe the entire novel into Cyrillic. 2. to represent speech sounds in a phonetic transcription.  The editor wanted the pronunciation transcribed in dictionary-style phonetics.  It is much easier to transcribe the material in the International Phonetic Alphabet. 3. to write something down in something.  Please transcribe this list of names in your notebook.  I can’t read what is transcribed in my book."
        },
        {
            "id": 235,
            "phrase": "transfer someone or something (from some place) (to some place)",
            "definition": "to move or relocate someone or something from one place to another.  Her company transferred her from Houston to Los Angeles.  We transferred the boxes from one place to another."
        },
        {
            "id": 236,
            "phrase": "transfer someone or something to someone",
            "definition": "to reassign someone or something to someone. I transferred my secretary to Joel, who can get along with almost anyone. Ann transferred her car registration to her sister."
        },
        {
            "id": 237,
            "phrase": "transfer something (from someone) (to someone else)",
            "definition": "to reassign something from one person to another.  I have to transfer ownership of this car to my daughter. The title of the car was transferred from me to someone else."
        },
        {
            "id": 238,
            "phrase": "transfer to something",
            "definition": "to have oneself reassigned to something.  I am transferring to the accounting department.  Andy wanted to transfer to a different school."
        },
        {
            "id": 239,
            "phrase": "transform someone or something (from someone or something) (in)to someone or something",
            "definition": "to change someone or something from someone or something into someone or something else.  Time had transformed gangly little Rachel into a lovely young woman. Manners transformed Tom from a pest into a prince."
        },
        {
            "id": 240,
            "phrase": "transgress against someone or something",
            "definition": "to make an offense against someone or something. (Stilted and formal.) _I did not mean to transgress against you. We did not transgress against the rules of the college."
        },
        {
            "id": 241,
            "phrase": "translate something (from something) ((in)to something)",
            "definition": "to decode something from something, such as a language, to another.  Will you please translate this from Russian into English? _ I can translate it into Russian from any Romance language."
        },
        {
            "id": 242,
            "phrase": "transliterate something (from something) ((in)to something)",
            "definition": "to decode something from one set of symbols to another.  Donald transliterated the tale from Cyrillic script into Roman letters and still couldn’t read it aloud.  Can you transliterate this from the original Bengali script into the Roman alphabet? _ I will transliterate this into Cyrillic."
        },
        {
            "id": 243,
            "phrase": "transmit something (from some place) (to some place)",
            "definition": "to send or dispatch something from one place to another.  Can you transmit a fax from your hotel to your office? _ I can transmit it to any place in the world."
        },
        {
            "id": 244,
            "phrase": "transmit something to someone or something",
            "definition": "to send or dispatch something to someone or something.  Please transmit this message to Rachel.  I will transmit the message to my office."
        },
        {
            "id": 245,
            "phrase": "transmute something (from something) ((in)to something)",
            "definition": "to change something from one thing into another.  Do you believe that it is possible to transmute gold into lead? _ No, you cannot transmute one metal into another."
        },
        {
            "id": 246,
            "phrase": "transport someone or something (from some place) (to some place)",
            "definition": "to move or convey someone or something from one place to another.  In his car, he transported us from our home to the airport. Please see that this box gets transported from here to the loading dock."
        },
        {
            "id": 247,
            "phrase": "transpose something (from something) ((in)to something)",
            "definition": "to change something, usually in music, from one musical key to another.  Can you transpose this from F-sharp to a higher key? _It would be easy to transpose it into a higher key."
        },
        {
            "id": 248,
            "phrase": "trap someone in something",
            "definition": "to catch someone in an inconsistency or contradiction.  The lawyer trapped the witness in his inconsistencies. She trapped herself in her own argument."
        },
        {
            "id": 249,
            "phrase": "trap someone into something",
            "definition": "to get one into such a position that one has little choice but to do something unwanted. You’ll never trap me into going out with Roger! _ I was trapped into going there."
        }
    ]
}