{
    "dictionary": [
        {
            "id": 0,
            "phrase": "match up to something",
            "definition": "[for something] to match, be equal to, or complementary to something.  This sock does not match up to the other one. This one matches up to all the others."
        },
        {
            "id": 1,
            "phrase": "match wits (with someone)",
            "definition": "to enter into intellectual competition with someone.  Whenever I try to match wits with Fred, he always ends up running circles around me with his clever repartee."
        },
        {
            "id": 2,
            "phrase": "mate with an animal",
            "definition": "[for an animal] to copulate with its own kind. The gander mated with the goose in the barnyard.  The coyote acted as if it wanted to mate with the dog."
        },
        {
            "id": 3,
            "phrase": "mate with someone",
            "definition": "to marry with someone, and presumably, to copulate with someone. Did you meet anyone you would like to mate with and spend the rest of your life with?"
        },
        {
            "id": 4,
            "phrase": "a matter of life and death",
            "definition": "Cliché an issue of great urgency; an issue that will decide between living and dying.  We must find a doctor. It’s a matter of life and death.  A matter of life and death demands that I return home at once."
        },
        {
            "id": 5,
            "phrase": "a matter of opinion",
            "definition": "the question of how good or bad someone or something is.  It’s a matter of opinion how strong the company is. John thinks it’s great and Fred thinks it’s poor."
        },
        {
            "id": 6,
            "phrase": "matter to someone",
            "definition": "to be important to someone.  Does money really matter to you? _ Yes, it matters to me a lot."
        },
        {
            "id": 7,
            "phrase": "max out",
            "definition": "to reach one’s maximum in something, such as weight in weight lifting or credit on a credit card. Andy finally maxed out at 300 pounds.  Randy just knew when he had maxed out. Something in his body told him to stop."
        },
        {
            "id": 8,
            "phrase": "maxed out",
            "definition": "1. Sl. exhausted; tired. I am just maxed out. I haven’t been getting enough sleep.  I had to stop work because I was too maxed out. 2. Sl. intoxicated. Sam was maxed out and seemed happy enough to sit under the table and whimper.  I hadn’t seen Barlowe so maxed out in years. He was nearly paralyzed."
        },
        {
            "id": 9,
            "phrase": "May I be excused?",
            "definition": "May I leave this place, please?; May I leave to use the toilet? _ Nature calls. May I be excused? _ The student raised her hand and said, “Teacher, may I be excused?”"
        },
        {
            "id": 10,
            "phrase": "mean business",
            "definition": "to be very, very serious. Stop laughing! I mean business. I could tell from the look on her face that she meant business."
        },
        {
            "id": 11,
            "phrase": "mean by something",
            "definition": "to intend a certain meaning by words or deeds.  What do you mean by that? _ I did not mean anything special by my remarks."
        },
        {
            "id": 12,
            "phrase": "mean (for someone) to do something",
            "definition": "to intend (for someone) to do something.  John meant to go with us to the zoo.  John meant for Jane to do the dishes."
        },
        {
            "id": 13,
            "phrase": "mean no offense",
            "definition": "not to intend to offend.  I’m really sorry. I meant no offense.  It was simply a slip of the tongue. He meant no offense by it."
        },
        {
            "id": 14,
            "phrase": "mean nothing (to someone)",
            "definition": "1. not to make sense to someone.  This sentence means nothing to me. It isn’t clearly written.  I’m sorry. This message means nothing. 2. [for someone] not to have feeling for someone or something.  Do I mean nothing to you after all these years? _ Do all those years of devotion mean nothing?"
        },
        {
            "id": 15,
            "phrase": "mean something as something",
            "definition": "to intend something to be understood as something.  Do you mean your remarks as criticism? _ I meant my comment as encouragement."
        },
        {
            "id": 16,
            "phrase": "mean something for someone or something",
            "definition": "to imply something important for someone or something; to be important or meaningful for someone or something.  Are your comments supposed to mean something special for me? _ I mean these remarks for the government."
        },
        {
            "id": 17,
            "phrase": "a mean streak",
            "definition": "a tendency for a person to do things that are mean.  I think that Wally has a mean streak that no one ever saw before this incident."
        },
        {
            "id": 18,
            "phrase": "mean well",
            "definition": "to intend to be nice, polite, helpful, etc., but fail in the effort.  I know you mean well, but your comments are sort of insulting."
        },
        {
            "id": 19,
            "phrase": "meaner than a junkyard dog (with fourteen sucking pups)",
            "definition": "Rur. cruel; eager to fight.  Don’t mess with her. She’s meaner than a junkyard dog with fourteen sucking pups. They say Jim’s meaner than a junkyard dog, but really, he’s a sweetheart."
        },
        {
            "id": 20,
            "phrase": "meant to be",
            "definition": "destined to exist.  Our love was meant to be! _ It was not meant to be."
        },
        {
            "id": 21,
            "phrase": "meant to be something",
            "definition": "destined or fated to be something. Jane was meant to be a chemist. I was meant to be rich, but something didn’t work right!"
        },
        {
            "id": 22,
            "phrase": "measure someone against someone else or something against something else",
            "definition": "to compare someone with someone else; to compare something with something else.  Daniel measured his brother against the boy next door.  We measured the new building against the older ones and found the new one lacking in many respects.  I measured myself against Tom and found him superior in almost everything."
        },
        {
            "id": 23,
            "phrase": "measure someone up against someone or something",
            "definition": "to place someone up against someone or something else for the purpose of comparing size or other qualities. Please measure Fred up against Tom and see who has the best qualifications.  Can you measure Brian up against the mark on the wall to see how tall he is growing?"
        },
        {
            "id": 24,
            "phrase": "measure something off†",
            "definition": "to determine the length of something. He measured the length of the room off and wrote down the figure in his notebook.  Fred measured off the width of the house.  Fred measured a few feet of string off, and cut it with a knife."
        },
        {
            "id": 25,
            "phrase": "measure something out†",
            "definition": "to measure and distribute something as it is being taken out, unwrapped, unfolded, etc.  Carl measured the grain out a cup at a time.  He measured out the grain little by little."
        },
        {
            "id": 26,
            "phrase": "measure up (to someone or something)",
            "definition": "to compare well to someone or something.  He just doesn’t measure up to Sarah in intelligence.  This meal doesn’t measure up to my expectations."
        },
        {
            "id": 27,
            "phrase": "a Mecca for someone",
            "definition": "a place that is frequently visited by a particular group of people because it is important to them for some reason. (From the city of Mecca, the religious center of Islam.) _New York City is a Mecca for theatergoers.  St. Andrews is a Mecca for golf enthusiasts because of its famous course."
        },
        {
            "id": 28,
            "phrase": "meddle in something",
            "definition": "to intrude [oneself] into something.  I wish you wouldn’t meddle in my affairs.  Go meddle in someone else’s business."
        },
        {
            "id": 29,
            "phrase": "meddle with someone or something",
            "definition": "to interfere with someone or something; to mess around with someone or something. Please don’t meddle with me. I am in a bad mood.  Would you please stop meddling with my computer?"
        },
        {
            "id": 30,
            "phrase": "mediate between someone and someone else",
            "definition": "to negotiate an agreement between people.  I will have to mediate between Mary and Vernon.  No one wants to mediate between them."
        },
        {
            "id": 31,
            "phrase": "meditate on someone or something",
            "definition": "to reflect on someone or something.  Judy was instructed to meditate on a f lower.  I will meditate on that happy thought."
        },
        {
            "id": 32,
            "phrase": "*meek as a lamb",
            "definition": "[of someone] shy, quiet, and docile. (*Also: as ~.) _ Only an hour after their argument, Joe went to Elizabeth and, meek as a lamb, asked her to forgive him. Betsy terrorizes the other children, but she’s as meek as a lamb around her elders."
        },
        {
            "id": 33,
            "phrase": "meet one’s match",
            "definition": "to meet one’s equal; to encounter someone who can match or outdo one in some activity, talent, etc.  John played tennis with Bill yesterday, and it looks as if John has finally met his match.  Listen to Jane and Mary argue. I always thought that Jane was loud, but she has finally met her match."
        },
        {
            "id": 34,
            "phrase": "meet one’s Waterloo",
            "definition": "to meet one’s final and insurmountable challenge. (Alludes to the final defeat of Napoleon at Waterloo.) _ The boss is being very hard on Bill. It seems that Bill has finally met his Waterloo.  John was more than Sally could handle. She has finally met her Waterloo."
        },
        {
            "id": 35,
            "phrase": "meet someone halfway",
            "definition": "to compromise with someone. No, I won’t give in, but I’ll meet you halfway. They settled the argument by agreeing to meet each other halfway."
        },
        {
            "id": 36,
            "phrase": "meet the requirements (for something)",
            "definition": "to fulfill the requirements for something.  Sally was unable to meet the requirements for the job.  Jane met the requirements and was told to report to work the next day."
        },
        {
            "id": 37,
            "phrase": "meet up with someone or something",
            "definition": "to meet someone or something, usually by accident.  I met up with Don on the street yesterday.  James met up with a strange accident."
        },
        {
            "id": 38,
            "phrase": "meet with someone",
            "definition": "to have a meeting with someone.  I will meet with all of them on Monday.  When can I meet with you?"
        },
        {
            "id": 39,
            "phrase": "meet with something",
            "definition": "1. [for someone] to experience something, such as an accident.  Poor Carlo met with a serious accident. Henry always feared meeting with a horrible fate. 2. [for someone or something] to strike or touch something. That board is supposed to meet perfectly with the surface of the wall.  Her head met with the top of the car a number of times during the journey. 3. to encounter some kind of response.  The proposal met with unexpected opposition.  Her speech was met with universal approval."
        },
        {
            "id": 40,
            "phrase": "a meeting of the minds",
            "definition": "the establishment of agreement; complete agreement.  After a lot of discussion we finally reached a meeting of the minds.  We struggled to bring about a meeting of the minds on the issues."
        },
        {
            "id": 41,
            "phrase": "a mell of a hess",
            "definition": "Inf. a hell of a mess. (A deliberate spoonerism.) _What a mell of a hess you’ve gotten us into this time.  Have you ever seen such a mell of a hess?"
        },
        {
            "id": 42,
            "phrase": "mellow out",
            "definition": "1. to become less angry. When you mellow out, maybe we can talk.  Come on, man, stop yelling and mellow out! 2. to become generally more relaxed. Gary was nearly forty before he started to mellow out a little and take life less seriously.  After his illness, he mellowed out and seemed more glad to be alive."
        },
        {
            "id": 43,
            "phrase": "melt away",
            "definition": "to melt into a liquid.  The ice cubes melted away quickly in the intense heat.  When the wax candles melted away, they ruined the lace tablecloth."
        },
        {
            "id": 44,
            "phrase": "melt down",
            "definition": "[for something frozen] to melt.  The glacier melted down little by little.  When the ice on the streets melted down, it was safe to drive again."
        },
        {
            "id": 45,
            "phrase": "melt in one’s mouth",
            "definition": "1. to taste very good. (Also can be literal.) _ This cake is so good it’ll melt in your mouth.  John said that the food didn’t exactly melt in his mouth. 2. [of meat] to be very, very tender.  My steak is so tender it could melt in my mouth. This filet will melt in your mouth!"
        },
        {
            "id": 46,
            "phrase": "melt in something",
            "definition": "1. [for something] to melt to a liquid at a high temperature.  Surely the plastic cup will melt in such heat.  This tray will melt in the oven, so keep it out of there. 2. [for something] to dissolve in a particular liquid. Sugar melts in hot water easily. Will this substance melt in heated water?"
        },
        {
            "id": 47,
            "phrase": "melt into something",
            "definition": "to melt and change into a different state.  All the ice cream melted into a sticky soup.  The candles melted into a pool of colored wax in all the heat we had last summer."
        },
        {
            "id": 48,
            "phrase": "melt something away†",
            "definition": "to cause something to melt into a liquid.  The sun melted the ice away.  The sun melted away the ice."
        },
        {
            "id": 49,
            "phrase": "melt something down†",
            "definition": "to cause something frozen to melt; to cause something solid to melt.  The rays of the sun melted the candle down to a puddle of wax.  The heat melted down the ice."
        },
        {
            "id": 50,
            "phrase": "melt something into something",
            "definition": "to cause something to change its state when melting. The ice melted into a cold liquid that we could drink.  We melted the fat into a liquid that we could deep-fry in."
        },
        {
            "id": 51,
            "phrase": "Men are blind in their own cause.",
            "definition": "Prov. If you believe in something very fervently, you will not recognize the flaws in what you believe or the dangers associated with it.  Jill: Lyle is so intent on converting people to his religion, that he doesn’t see that his constant preaching is alienating his friends. Jane: Men are blind in their own cause."
        },
        {
            "id": 52,
            "phrase": "Men make houses, women make homes.",
            "definition": "Prov. Men are often the ones who build or acquire houses for their families, but women provide the things that make a house into a home.  When William moved into his own apartment, his mother insisted on choosing and arranging the furniture and decorations for him. “Men make houses, women make homes,” she said, “and I want you to have a home as nice as the one you grew up in.”"
        },
        {
            "id": 53,
            "phrase": "mend (one’s) fences",
            "definition": "to repair fences as part of one’s chores.  Tom is mending fences today at the south end of the ranch."
        },
        {
            "id": 54,
            "phrase": "mend one’s ways",
            "definition": "to improve one’s behavior.  John used to be very wild, but he’s mended his ways. You’ll have to mend your ways if you go out with Mary. She hates people to be late."
        },
        {
            "id": 55,
            "phrase": "*a mental block (against something)",
            "definition": "to have some psychological barrier that prevents one from doing something. (*Typically: get ~; have ~; give someone ~.) _ Perry has a mental block against speaking in public."
        },
        {
            "id": 56,
            "phrase": "mention someone or something in passing",
            "definition": "to mention someone or something casually; to mention someone or something while talking about someone or something else.  He just happened to mention in passing that the mayor had resigned.  John mentioned in passing that he was nearly eighty years old."
        },
        {
            "id": 57,
            "phrase": "mention someone or something in something",
            "definition": "1. to name someone or something in a particular context. We mentioned you in regard to nominations for the congress.  Everyone mentioned your book in the discussions. 2. to name someone or something in a will, lecture, story, article, etc. They mentioned your name in the discussion.  Uncle Herman mentioned you in his will."
        },
        {
            "id": 58,
            "phrase": "mention something to someone",
            "definition": "to refer to something while talking to someone.  Please mention it to your father.  You had better not mention that to anyone."
        },
        {
            "id": 59,
            "phrase": "a mere trifle",
            "definition": "a tiny bit; a small, unimportant matter; a small amount of money. But this isn’t expensive! It costs a mere trif le!"
        },
        {
            "id": 60,
            "phrase": "merge in(to something)",
            "definition": "to join into something.  The stream merged into the main channel of the river."
        },
        {
            "id": 61,
            "phrase": "merge something with something else",
            "definition": "to join two things together. The management merged the sales division with the marketing division.  We merged the accounting department with the auditing department."
        },
        {
            "id": 62,
            "phrase": "merge with someone or something",
            "definition": "to join with someone or something.  Ted merged with Fred and they created a very profitable partnership.  Our company merged with a larger one, and we all kept our jobs. This stream merges with a larger stream about two miles to the west."
        },
        {
            "id": 63,
            "phrase": "mesh together",
            "definition": "to fit together.  Their interests and personalities mesh together perfectly. Their ideas don’t mesh together too well."
        },
        {
            "id": 64,
            "phrase": "mesh with something",
            "definition": "to fit with something.  Your idea just doesn’t mesh with my plans. Currently, your proposed project doesn’t mesh at all well with our long-range planning."
        },
        {
            "id": 65,
            "phrase": "mess someone over†",
            "definition": "Sl. to treat someone badly; to beat or harm someone.  Max messed Lefty over and sent him to the hospital.  Max messed over Lefty."
        },
        {
            "id": 66,
            "phrase": "mess someone’s face up†",
            "definition": "Sl. to beat someone about the face.  The champ threatened to mess the challenger’s face up. The champ broke the challenger’s nose and really did mess up his face."
        },
        {
            "id": 67,
            "phrase": "mess someone up†",
            "definition": "Sl. to rough someone up; to beat someone up. The robbers threatened to mess Bob up if he didn’t cooperate.  John messed up Bill a little, but no real harm was done."
        },
        {
            "id": 68,
            "phrase": "mess something up†",
            "definition": "to make something disorderly; to create disorder in something; to throw someone’s plans awry.  You really messed this place up! _ Who messed up my bed? mills mess up to make an error; to do something wrong; to flub up.  I hope I don’t mess up on the quiz.  You really messed up and now you’re in big trouble!"
        },
        {
            "id": 69,
            "phrase": "messed up",
            "definition": "1. confused.  I’m sort of messed up since my divorce.  Most kids are sort of messed up at this age. 2. intoxicated.  Somehow I must have got messed up. What caused it, do you think? _Everybody at the party was too messed up to drive home."
        },
        {
            "id": 70,
            "phrase": "metamorphose into something",
            "definition": "to transform into something. This ugly caterpillar will surely metamorphose into something beautiful. At about eighteen, Wally metamorphosed into a reasonably handsome young man."
        },
        {
            "id": 71,
            "phrase": "mete something out†",
            "definition": "to measure something out.  She meted the solution out carefully into a row of test tubes.  She meted out the cookies to each of them."
        },
        {
            "id": 72,
            "phrase": "*method in one’s madness",
            "definition": "a purpose in what one is doing, even though it seems to be crazy. (*Typically: be ~; have ~.) _ What I’m doing may look strange, but there is method in my madness.  Wait until she finishes; then you’ll see that she has method in her madness."
        },
        {
            "id": 73,
            "phrase": "a middle ground",
            "definition": "a position of compromise; a state of thinking where two opposing parties can discuss an issue politely and productively.  If we could only reach a middle ground on this issue, things wouldn’t be so confrontational."
        },
        {
            "id": 74,
            "phrase": "the middle of nowhere",
            "definition": "a very isolated place.  I don’t want to stay out here in the middle of nowhere.  I was stranded in the middle of nowhere for an hour with a f lat tire."
        },
        {
            "id": 75,
            "phrase": "might and main",
            "definition": "Cliché great physical strength; great force.  The huge warrior, with all his might and main, could not break his way through the castle gates.  The incredible might and main of the sea crushed the ship against the cliff."
        },
        {
            "id": 76,
            "phrase": "might as well be hung for a sheep as (for) a lamb",
            "definition": "Rur. might as well commit a large fault as a small one, since the same punishment will result.  I’ll take the expensive fishing rod. My wife will be mad at me no matter how much I spend, so I might as well be hung for a sheep as for a lamb."
        },
        {
            "id": 77,
            "phrase": "might could",
            "definition": "Rur. might be able to.  Charlie: Can you come out with me after work? Tom: I might could. I’ll have to see if my wife has other plans.  I might could help you, if you’ll tell me what’s the matter."
        },
        {
            "id": 78,
            "phrase": "Might makes right.",
            "definition": "Prov. Cliché The stronger of two opponents will always control the situation. Child: How come the country with the biggest army always tells the other countries what to do? Father: Might makes right."
        },
        {
            "id": 79,
            "phrase": "might(y) nigh",
            "definition": "Rur. very nearly.  We mighty nigh lost Mary that time she fell through the ice in the river.  That was might nigh the worst night of my life."
        },
        {
            "id": 80,
            "phrase": "migrate between some place and some place else",
            "definition": "to change residence from one place to another, perhaps repeatedly.  These birds migrate between the north and the south.  They migrate between their cottage in the North in the summer and their condo in Florida in the winter."
        },
        {
            "id": 81,
            "phrase": "migrate (from some place) (to some place)",
            "definition": "[for a population] to move from some place to another.  The birds all migrate from Europe to Africa.  They migrate to Canada from South America."
        },
        {
            "id": 82,
            "phrase": "*a mile a minute",
            "definition": "very fast. (*Typically: go ~; move ~; talk ~; travel ~.) _ She talks a mile a minute and is very hard to keep up with."
        },
        {
            "id": 83,
            "phrase": "militate against something",
            "definition": "[for something] to work against something.  Everything you have said today militates against an early settlement to our disagreement.  This really militates against my going to college."
        },
        {
            "id": 84,
            "phrase": "the milk of human kindness",
            "definition": "natural kindness and sympathy shown to others. (From Shakespeare’s play Macbeth, I. v.) _ Mary is completely hard and selfish—she doesn’t have the milk of human kindness in her.  Roger is too full of the milk of human kindness and people take advantage of him."
        },
        {
            "id": 85,
            "phrase": "milk someone for something",
            "definition": "to pressure someone into giving information or money.  The reporter milked the mayor’s aide for information.  The thief milked me for $20."
        },
        {
            "id": 86,
            "phrase": "The mill cannot grind with water that is past.",
            "definition": "Prov. Do not waste the opportunities you now have.; Do not waste time wishing for what you had in the past. If you want to go abroad, do it now, while you’re young and have the money. The mill cannot grind with water that is past."
        },
        {
            "id": 87,
            "phrase": "*a million miles away",
            "definition": "lost in thought; [of someone] daydreaming and not paying attention. (Only one’s mind is far away. *Typically: be ~; look to be ~; seem ~.) _He was a million miles away during the entire lecture.  Look at her. She is a million miles away, not paying any attention to what she is doing."
        },
        {
            "id": 88,
            "phrase": "The mills of God grind slowly, yet they grind exceeding small.",
            "definition": "Prov. It may take a long time, but evil will always be punished.  Jill: It really doesn’t seem right that Fred can be so horrible and dishonest, but he always gets everything he wants. Jane: Be patient. The mills of God grind slowly, yet they grind exceeding small."
        },
        {
            "id": 89,
            "phrase": "a millstone about one’s neck",
            "definition": "a continual burden or handicap.  This huge and expensive house is a millstone about my neck.  Bill’s inability to control his temper is a millstone about his neck."
        },
        {
            "id": 90,
            "phrase": "mince (one’s) words",
            "definition": "to soften the effect of one’s words.  Tell me what you think, and don’t mince your words.  A frank person never minces words."
        },
        {
            "id": 91,
            "phrase": "mind one’s own business",
            "definition": "to attend only to the things that concern one. Leave me alone, Bill. Mind your own business. I’d be fine if John would mind his own business."
        },
        {
            "id": 92,
            "phrase": "mind one’s p’s and q’s.",
            "definition": "Prov. to behave properly; to display good manners.  When you children go to visit Aunt Muriel, you’ll have to mind your p’s and q’s; not like at home, where I let you do as you please. We’d better mind our p’s and q’s for this new teacher; I hear he’s very strict."
        },
        {
            "id": 93,
            "phrase": "mind over matter",
            "definition": "[an instance where there are] intellectual powers overriding threats, difficulties, or problems. You need to concentrate harder. Pay no attention to your surroundings. This is a case of mind over matter."
        },
        {
            "id": 94,
            "phrase": "mind you",
            "definition": "a phrase introducing something that should be taken into consideration.  He’s very well dressed, but mind you, he’s got plenty of money to buy clothes.  Lisa is unfriendly to me, but mind you, she’s never very nice to anyone."
        },
        {
            "id": 95,
            "phrase": "Mind your own beeswax.",
            "definition": "to mind one’s own business. (Juvenile.) _ You just mind your own beeswax! _ Lay off! Mind your own beeswax!"
        },
        {
            "id": 96,
            "phrase": "mine for something",
            "definition": "to dig into the ground in search of a mineral, a metal, or an ore.  The prospectors ended up mining for coal.  What are they mining for in those hills?"
        },
        {
            "id": 97,
            "phrase": "a mine of information",
            "definition": "someone or something that is full of information.  Grandfather is a mine of information about World War II.  The new search engine is a positive mine of useful information."
        },
        {
            "id": 98,
            "phrase": "mingle in (with someone)",
            "definition": "to join in with someone; to mix with people. I am going to go into the hall and mingle in with the rest of the guests.  Ken came into the room and mingled in at once."
        },
        {
            "id": 99,
            "phrase": "mingle with someone",
            "definition": "to mix with people.  Try to mingle with the guests. I would like to get out and mingle with people more."
        },
        {
            "id": 100,
            "phrase": "minister to someone or something",
            "definition": "to take care of someone or someone’s needs.  Sarah tried to minister to the people of the village. He sought to minister to the grief of the widow."
        },
        {
            "id": 101,
            "phrase": "minor in something",
            "definition": "to study a secondary subject in college. (Compare this with major in something.) _ I minored in math in college.  I decided to minor in history."
        },
        {
            "id": 102,
            "phrase": "a miscarriage of justice",
            "definition": "a wrong or mistaken decision, especially one made in a court of law. Sentencing the old man on a charge of murder proved to be a miscarriage of justice.  Punishing the student for cheating was a miscarriage of justice. He was innocent."
        },
        {
            "id": 103,
            "phrase": "Misery loves company.",
            "definition": "Prov. Unhappy people like other people to be unhappy too.  Jill: Why is Linda criticizing everybody today? Jane: Her boss criticized her this morning, and misery loves company.  I should probably feel bad because my sister is so depressed, but I’m pretty depressed myself. Misery loves company."
        },
        {
            "id": 104,
            "phrase": "Misfortunes never come singly.",
            "definition": "Prov. Bad things tend to happen in groups. I already told you that my wife lost her job. Well, misfortunes never come singly; our house was robbed last night."
        },
        {
            "id": 105,
            "phrase": "mislead someone about something",
            "definition": "to misrepresent something to someone.  I hope you are not trying to mislead me about the price.  I’m afraid I misled you on this matter."
        },
        {
            "id": 106,
            "phrase": "misplace one’s trust (in someone)",
            "definition": "to put trust in the wrong person; to put trust in someone who does not deserve it. The writer misplaced his trust in his editor.  The voters misplaced their trust in the corrupt politician."
        },
        {
            "id": 107,
            "phrase": "miss a trick",
            "definition": "to miss an opportunity or chance. (Typically with the negative.) _ She hardly ever misses a trick. Mr. Big never misses a trick. How did a smart guy like you miss a trick like that?"
        },
        {
            "id": 108,
            "phrase": "A miss is as good as a mile.",
            "definition": "Prov. Almost having done something is the same as not having done it at all, since in both cases the thing does not get done.  We only missed the train by one minute? Well, a miss is as good as a mile."
        },
        {
            "id": 109,
            "phrase": "miss (something) by a mile",
            "definition": "to fail to hit something by a great distance; to land wide of the mark. Ann shot the arrow and missed the target by a mile.  “Good grief, you missed by a mile,” shouted Sally."
        },
        {
            "id": 110,
            "phrase": "miss the boat",
            "definition": "to miss out (on something); to be ignorant (of something).  Pay attention, John, or you’ll miss the boat and not learn algebra.  Tom really missed the boat when it came to making friends."
        },
        {
            "id": 111,
            "phrase": "miss the point",
            "definition": "to fail to understand the important part of something.  I’m afraid you missed the point. Let me explain it again. You keep explaining, and I keep missing the point."
        },
        {
            "id": 112,
            "phrase": "mission in life",
            "definition": "one’s purpose in life; the reason for which one lives.  Bob’s mission in life is to make money.  My mission in life is to help people live in peace."
        },
        {
            "id": 113,
            "phrase": "mix and match",
            "definition": "1. to assemble a limited number of items, usually clothing, in a number of different ways.  Alice learned to mix and match her skirts, blouses, and sweaters so that she always could be attractively dressed on a limited budget. Gary always bought black, blue, and gray trousers and shirts so he could mix and match without too many bad combinations. 2. to select a number of items from an assortment, often in order to get a quantity discount. (As opposed to getting a quantity discount for buying a lot of only one item.) _The candles were 25 percent off, and you could mix and match colors, sizes, and length.  I found a good sale on shirts. They were four for fifty dollars, and the store would let you mix and match."
        },
        {
            "id": 114,
            "phrase": "mix in (with someone or something)",
            "definition": "to mix or combine with people or substances.  The band came down from the stage and mixed in with the guests during the break.  The eggs won’t mix in with the shortening!"
        },
        {
            "id": 115,
            "phrase": "mix it up (with someone)",
            "definition": "to fight with someone; to quarrel with someone.  Wilbur and Walt mixed it up for a while, and then things calmed down.  Richard came out of the shop and began to mix it up with Walt."
        },
        {
            "id": 116,
            "phrase": "mix someone up†",
            "definition": "to confuse someone.  Please don’t ask questions now; you’ll mix me up! _ You mixed up the speaker with your question."
        },
        {
            "id": 117,
            "phrase": "mix someone up† in something",
            "definition": "to get someone involved in something.  Please don’t mix me up in this problem.  Walter mixed up his daughter in the sordid affair."
        },
        {
            "id": 118,
            "phrase": "mix something up†",
            "definition": "to bring something into disorder; to throw something into a state of confusion.  Don’t mix up the papers on my desk. He mixes up things in his eagerness to speak."
        },
        {
            "id": 119,
            "phrase": "mix something up† (with something)",
            "definition": "1. to mix or stir something using a mixing or stirring device.  He mixed the batter up with a spoon.  First, mix up the batter. 2. to combine substances and mix them together. Please mix the egg up with the sugar first. Please mix up the egg with the sugar."
        },
        {
            "id": 120,
            "phrase": "mix with someone or something",
            "definition": "to mix socially with someone or a group.  Tom dislikes Bill and Ted so much that he could never mix with them socially.  She finds it difficult to mix with friends."
        },
        {
            "id": 121,
            "phrase": "mix with something",
            "definition": "[for a substance] to combine with a substance.  Will this pigment mix with water? _ Water will not mix with oil."
        },
        {
            "id": 122,
            "phrase": "a mixed bag",
            "definition": "a varied collection of people or things. (Refers originally to a bag of game brought home after a day’s hunting.) _The new students in my class are a mixed bag—some bright, some positively stupid.  The furniture I bought is a mixed bag. Some of it is antique and the rest is quite contemporary."
        },
        {
            "id": 123,
            "phrase": "*mixed feelings (about someone or something)",
            "definition": "uncertainty about someone or something. (*Typically: get ~; have ~; give someone ~.) _I have mixed feelings about Bob. Sometimes I think he likes me; other times I don’t.  I have mixed feelings about my trip to England. I love the people, but the climate upsets me."
        },
        {
            "id": 124,
            "phrase": "*mixed up in something",
            "definition": "involved in something, especially something wrong or illegal. (*Typically: be ~; get ~.) _ The youth has had problems ever since he got mixed up in a group of boys that stole a car."
        },
        {
            "id": 125,
            "phrase": "*mixed up with someone else",
            "definition": "involved with another person, possibly romantically. (*Typically: be ~; get ~.) _ I hear that Sam is mixed up with Sally.  Who is Jerry mixed up with now?"
        },
        {
            "id": 126,
            "phrase": "moan about something",
            "definition": "to complain about something.  What are you moaning about? _ I am not moaning about anything."
        },
        {
            "id": 127,
            "phrase": "moan something out†",
            "definition": "to say something in a moan.  The injured woman moaned the name of her assailant out.  She moaned out the name."
        },
        {
            "id": 128,
            "phrase": "moan with something",
            "definition": "to groan because of pain or pleasure.  The patient moaned with pain and fear.  Ken moaned with pleasure."
        },
        {
            "id": 129,
            "phrase": "mock something up†",
            "definition": "to make a model or simulation of something. The engineers mocked the new car design up for the managers to see.  They mocked up the new car design."
        },
        {
            "id": 130,
            "phrase": "model something in something",
            "definition": "to make a model of something in a particular substance.  She modeled the figure in clay.  I modeled a bear in modeling clay."
        },
        {
            "id": 131,
            "phrase": "Moderation in all things.",
            "definition": "Prov. Do not do anything too much or too little.  Felicia always ate sparingly. “Moderation in all things,” she told herself.  Jane: I think you watch too much TV. Jill: So you think I shouldn’t watch any? Jane: No, just watch a reasonable amount. Moderation in all things."
        },
        {
            "id": 132,
            "phrase": "modulate to a (different) key",
            "definition": "to change from one musical key to another by means of a musical transition.  Suddenly, the organist modulated to a key that was too high for most of the singers. I will have to modulate to a lower key before I start the next hymn."
        },
        {
            "id": 133,
            "phrase": "moist around the edges",
            "definition": "intoxicated. Charlie is more than moist around the edges. He is soused.  Didn’t that guy seem a little moist around the edges?"
        },
        {
            "id": 134,
            "phrase": "the moment of truth",
            "definition": "the point at which someone has to face the reality of a situation.  The moment of truth is here. Turn over your exam papers and begin. Now for the moment of truth when we find out whether we have got planning permission or not."
        },
        {
            "id": 135,
            "phrase": "Monday’s child is fair of face.",
            "definition": "Prov. A child born on Monday will be good-looking. (This comes from a rhyme that tells what children will be like, according to which day they are born: “Monday’s child is fair of face, / Tuesday’s child is full of grace, / Wednesday’s child is full of woe, / Thursday’s child has far to go, / Friday’s child is loving and giving, / Saturday’s child works hard for a living, / But a child that is born on the Sabbath day / Is blithe and bonny, good and gay.”) _ Joan is so pretty, she must be a Monday’s child. Monday’s child is fair of face."
        },
        {
            "id": 136,
            "phrase": "Money burns a hole in someone’s pocket.",
            "definition": "An expression decribing someone who spends money as soon as it is earned. Sally can’t seem to save anything. Money burns a hole in her pocket. If money burns a hole in your pocket, you never have any for emergencies."
        },
        {
            "id": 137,
            "phrase": "Money does not grow on trees.",
            "definition": "Prov. It is not easy to get money. (Implies that the person you are addressing spends money too easily.) _ Child: Can I have ten dollars to go to the movies? Father: Ten dollars?! Money doesn’t grow on trees."
        },
        {
            "id": 138,
            "phrase": "money from home",
            "definition": "1. easily gotten money. (Underworld.) _ There is nothing to a simple con job like this. It’s money from home.  This job is like taking candy from a kid. It’s money from home. 2. something as welcome as long-awaited money from home.  This cool drink is money from home right now. Having you visit like this is like getting money from home, Mary."
        },
        {
            "id": 139,
            "phrase": "Money is power.",
            "definition": "Prov. If you have money, you can get things and do things.  Emily wanted a career that would make her a lot of money, since money is power."
        },
        {
            "id": 140,
            "phrase": "Money talks.",
            "definition": "Money gives one power and influence to help get things done or get one’s own way.  Don’t worry. I have a way of getting things done. Money talks.  I can’t compete against rich old Mrs. Jones. She’ll get her way because money talks."
        },
        {
            "id": 141,
            "phrase": "Monkey see, monkey do.",
            "definition": "Prov. Children imitate what they see other people doing. I don’t let my children watch TV programs that show kids being disrespectful to their elders. I know what would happen if I did: monkey see, monkey do."
        },
        {
            "id": 142,
            "phrase": "monkey suit",
            "definition": "a tuxedo. (Jocular. Possibly in reference to the fancy suit worn by an organ-grinder’s monkey.) _Do I have to wear a monkey suit to dinner? _All the men except me wore monkey suits at dinner on the cruise."
        },
        {
            "id": 143,
            "phrase": "mooch (something) from someone",
            "definition": "to beg something from someone.  Can I mooch a match from you? _ Go mooch some money from Fred.  Why do you always mooch from people?"
        },
        {
            "id": 144,
            "phrase": "moon something away†",
            "definition": "to waste time pining or grieving.  Don’t moon the whole year away! _ You have mooned away half the year. Now pull yourself together!"
        },
        {
            "id": 145,
            "phrase": "mop something down†",
            "definition": "to clean a surface with a mop.  Please mop this f loor down now.  Please mop down this f loor."
        },
        {
            "id": 146,
            "phrase": "mop something off†",
            "definition": "to wipe the liquid off something.  Please mop the counter off with paper towels. Mop off the counter."
        },
        {
            "id": 147,
            "phrase": "mop something up†",
            "definition": "to clean up something, such as a spill, with a mop or with a mopping motion. Please mop this mess up.  I will mop up this mess."
        },
        {
            "id": 148,
            "phrase": "mop something up† with something",
            "definition": "to clean or remove something from something else using a mop, rag, towel, etc.  I can mop the mess up with this old rag mop.  She will mop up the mess with the rag."
        },
        {
            "id": 149,
            "phrase": "mop the floor up† with someone",
            "definition": "to overwhelm and physically subdue someone; to beat someone. Stop talking like that, or I’ll mop the f loor up with you! _ Did you hear that? He threatened to mop up the f loor with me!"
        },
        {
            "id": 150,
            "phrase": "mop up (after someone or something)",
            "definition": "to clean up with a mop a sloppy mess made by someone or something. I am the one who has to mop up after the mess you made!"
        },
        {
            "id": 151,
            "phrase": "mope around",
            "definition": "to go about in a depressed state.  Since her dog ran away, Sally mopes around all day. Don’t mope around. Cheer up!"
        },
        {
            "id": 152,
            "phrase": "a mopping-up operation",
            "definition": "a clean-up operation; the final stages in a project where the loose ends are taken care of. It’s all over except a small mopping-up operation. The mopping-up operation from the hurricane should cost just under twenty million."
        },
        {
            "id": 153,
            "phrase": "moralize about someone or something",
            "definition": "to utter moral platitudes about someone or something.  There is no point in moralizing about Carlo. He can’t be changed. Why are you moralizing about the election? The people are always right."
        },
        {
            "id": 154,
            "phrase": "more and more",
            "definition": "an increasing amount; additional amounts.  As I learn more and more, I see how little I really know.  Dad seems to be smoking more and more lately."
        },
        {
            "id": 155,
            "phrase": "more dead than alive",
            "definition": "exhausted; in very bad condition; near death. (Almost always an exaggeration.) _ We arrived at the top of the mountain more dead than alive. The marathon runners stumbled one by one over the finish line, more dead than alive."
        },
        {
            "id": 156,
            "phrase": "more often than not",
            "definition": "usually.  These f lowers will live through the winter more often than not. This kind of dog will grow up to be a good watchdog more often than not."
        },
        {
            "id": 157,
            "phrase": "more or less",
            "definition": "somewhat; approximately; a phrase used to express vagueness or uncertainty.  Henry: I think this one is what I want, more or less. Clerk: A very wise choice, sir.  I spent more or less a half hour waiting for my f light to depart."
        },
        {
            "id": 158,
            "phrase": "More power to you!",
            "definition": "Well done!; You really stood up for yourself !; You really did something for your own benefit! (The stress is on to, and the you is usually “ya.”) _ Bill: I finally told her off, but good. Bob: More power to you! _ Sue: I spent years getting ready for that job, and I finally got it. Mary: More power to you!"
        },
        {
            "id": 159,
            "phrase": "more’s the pity",
            "definition": "it is a great pity or shame; it is sad. (Sometimes with the.) _ Jack can’t come, more’s the pity.  Jane had to leave early, more’s the pity."
        },
        {
            "id": 160,
            "phrase": "more someone or something than one can shake a stick at",
            "definition": "Rur. a lot; too many to count. There were more snakes than you could shake a stick at.  There are lots of f lowers in the field—more than one can shake a stick at."
        },
        {
            "id": 161,
            "phrase": "more something than Carter has (liver) pills",
            "definition": "a great deal of something. (Older; refers to a product called Carter’s Little Liver Pills.) _ Why he’s got more problems than Carter has pills! _ Bobby has more marbles than Carter has liver pills!"
        },
        {
            "id": 162,
            "phrase": "more than one bargained for",
            "definition": "more than one thought one would get. (Usually in reference to trouble or difficulty.) _ When Betsy brought home the sweet little puppy for a companion, she got more than she bargained for. That animal has cost her hundreds of dollars in bills. I got more than I bargained for when I took this job."
        },
        {
            "id": 163,
            "phrase": "more than you(‘ll ever) know",
            "definition": "a great deal, more than you suspect.  Bob: Why did you do it? Bill: I regret doing it. I regret it more than you know. John: Oh, Mary, I love you. Mary: Oh, John, I love you more than you’ll ever know."
        },
        {
            "id": 164,
            "phrase": "the more the merrier",
            "definition": "Cliché the more people there are, the happier the situation will be. Of course you can have a ride with us! The more the merrier. The manager hired a new employee even though there’s not enough work for all of us now. Oh, well, the more the merrier."
        },
        {
            "id": 165,
            "phrase": "more (to something) than meets the eye",
            "definition": "[there are] hidden values or facts regarding something. There is more to that problem than meets the eye.  What makes you think that there is more than meets the eye?"
        },
        {
            "id": 166,
            "phrase": "the morning after (the night before)",
            "definition": "a hangover; the feelings associated with having drunk too much alcohol.  Do worries about the morning after keep you from having a good time at parties? _She’s suffering from the morning after the night before."
        },
        {
            "id": 167,
            "phrase": "Morning dreams come true.",
            "definition": "Prov. If you dream something in the morning, it will really happen. (According to a superstition.) _ As I was sleeping through the sound of my alarm clock this morning, I dreamed I was late to work. That morning dream definitely came true."
        },
        {
            "id": 168,
            "phrase": "most of all",
            "definition": "of greatest importance; more than any other. (Compare this with least of all.) _ I wanted to go to that museum most of all. Why can’t I go? _There are many reasons why I didn’t use my car today. Most of all, it’s a lovely day for walking."
        },
        {
            "id": 169,
            "phrase": "motherhood and apple pie",
            "definition": "an often parodied sentiment expressed about allegedly quintessential elements of American home life.  Fred is so old-fashioned. Everything about old times is good to him. He’s all motherhood and apple pie."
        },
        {
            "id": 170,
            "phrase": "motion (for) someone to do something",
            "definition": "to give someone a hand signal to do something. The minister motioned the organist to begin playing. I motioned Ken to raise the curtain so the play could begin. Sally motioned for the waiter to bring the check.  I will motion to the usher and try to get him to come over here and help us."
        },
        {
            "id": 171,
            "phrase": "motion someone aside†",
            "definition": "to give a hand signal to someone to move aside.  He motioned her aside and had a word with her.  I motioned aside the guard and asked him a question."
        },
        {
            "id": 172,
            "phrase": "motion someone away from someone or something",
            "definition": "to give a hand signal to someone to move away from someone or something.  She motioned me away from Susan.  The police officer motioned the boys away from the wrecked car."
        },
        {
            "id": 173,
            "phrase": "motion to someone",
            "definition": "to make some sort of hand signal to a person.  Did you motion to me? What do you want? _ I did not motion to you."
        },
        {
            "id": 174,
            "phrase": "mound something up†",
            "definition": "to form something into a mound. Mound the dirt up around the base of the shrub. Please mound up the leaves around the rosebushes."
        },
        {
            "id": 175,
            "phrase": "mount something against someone or something",
            "definition": "to create or instigate something against someone or something.  The prosecutor mounted a questionable case against Robert.  The state mounted a very complex case against the company."
        },
        {
            "id": 176,
            "phrase": "mount something on something",
            "definition": "to place or attach something onto something.  Mount the butterf lies on plain white paper.  Sue mounted her favorite stamps on a display board."
        },
        {
            "id": 177,
            "phrase": "mount up",
            "definition": "1. to get up on a horse.  Mount up and let’s get out of here! _ Please mount up so we can leave. 2. [for something] to increase in amount or extent.  Expenses really mount up when you travel.  Medical expenses mount up very fast when you’re in the hospital."
        },
        {
            "id": 178,
            "phrase": "The mouse that has but one hole is quickly taken.",
            "definition": "Prov. It is dangerous to always depend on just one thing, because if it fails you, you will not have any alternatives.  Don’t put all your money in a single bank account. The mouse that has but one hole is quickly taken."
        },
        {
            "id": 179,
            "phrase": "a mouth full of South",
            "definition": "Sl. a southern accent.  You sure do have a mouth full of South.  I just love to hear a man with a mouth full of South."
        },
        {
            "id": 180,
            "phrase": "mouth off",
            "definition": "to speak out of turn; to backtalk.  If you mouth off, I will ground you for three weeks. Don’t mouth off at me, buster!"
        },
        {
            "id": 181,
            "phrase": "mouth on someone",
            "definition": "to inform the authorities on someone; to tattle on someone.  Max mouthed on his accomplice and got him arrested.  You had better not mouth on me!"
        },
        {
            "id": 182,
            "phrase": "a movable feast",
            "definition": "a religious holiday that is on a different date from year to year.  Easter is the best known movable feast."
        },
        {
            "id": 183,
            "phrase": "move ahead of someone or something",
            "definition": "to advance beyond someone or something.  All my coworkers are moving ahead of me in salary. What am I doing wrong? _The police moved ahead of the parade, pushing back the crowd."
        },
        {
            "id": 184,
            "phrase": "move along",
            "definition": "to continue to move; to start moving out of the way. (Often a command.) _ The crowd moved along slowly.  Please just move along. There is nothing to see here."
        },
        {
            "id": 185,
            "phrase": "move aside",
            "definition": "to step or move out of the way. Please move aside. Could you please move aside so we can get this cart through?"
        },
        {
            "id": 186,
            "phrase": "move away (from someone or something)",
            "definition": "1. to withdraw from someone or something.  Please don’t move away from me. I like you close by.  I have to move away from the smoking section. There was too much smoke there, so I moved away. 2. to move, with one’s entire household, to another residence.  Timmy was upset because his best friend had moved away. They moved away just as we were getting to know them."
        },
        {
            "id": 187,
            "phrase": "move back (from someone or something)",
            "definition": "to move back and away. (Often a command.) _ Please move back from the edge.  Please move back!"
        },
        {
            "id": 188,
            "phrase": "move down",
            "definition": "to move oneself farther down a line of things.  Someone else needs to sit on this bench. Please move down. Could you move down a little so we can have some more room?"
        },
        {
            "id": 189,
            "phrase": "move for something",
            "definition": "to make a parliamentary or legal motion in favor of something.  I move for dismissal of the case against my client.  My lawyer moved for a recess of the trial."
        },
        {
            "id": 190,
            "phrase": "move forward with something",
            "definition": "to advance with something; to make progress with something.  Let us try to move forward with this matter at once.  I want to move forward with the project at a fast pace."
        },
        {
            "id": 191,
            "phrase": "move heaven and earth to do something",
            "definition": "to make a major effort to do something.  “I’ll move heaven and earth to be with you, Mary,” said Bill.  I had to move heaven and earth to get there on time."
        },
        {
            "id": 192,
            "phrase": "move in (on someone)",
            "definition": "to come to live with someone.  My brother moved in on me without even asking.  I don’t mean to move in on you. I just need a place for a few days."
        },
        {
            "id": 193,
            "phrase": "move in (on someone or something)",
            "definition": "to move closer to someone or something; to make advances or aggressive movements toward someone or something.  The crowd moved in on the frightened guard.  They moved in slowly."
        },
        {
            "id": 194,
            "phrase": "move in with someone",
            "definition": "to take up residence with someone.  Sally moved in with Sam.  Jimmy moved in with his brother and shared expenses."
        },
        {
            "id": 195,
            "phrase": "move in(to something)",
            "definition": "[for someone] to come to reside in something or some place.  I moved into a new apartment last week.  When did the new family move in?"
        },
        {
            "id": 196,
            "phrase": "move off (from someone or something)",
            "definition": "to move away from someone or something.  The doctor moved off from the patient, satisfied with her work.  The officer stopped for a minute, looked around, and then moved off."
        },
        {
            "id": 197,
            "phrase": "move on",
            "definition": "to continue moving; to travel on; to move along and not stop or tarry. Move on! Don’t stop here! _Please move on!"
        },
        {
            "id": 198,
            "phrase": "move on someone",
            "definition": "to attempt to pick up someone; to attempt to seduce someone.  Don’t try to move on my date, old chum. Harry is trying to move on Tiffany. They deserve each another."
        },
        {
            "id": 199,
            "phrase": "move on something",
            "definition": "to do something about something.  I will move on this matter only when I get some time.  I have been instructed to move on this and give it the highest priority."
        },
        {
            "id": 200,
            "phrase": "move on (to something)",
            "definition": "to change to a different subject or activity.  Now, I will move on to a new question.  That is enough discussion on that point. Let’s move on."
        },
        {
            "id": 201,
            "phrase": "move out (of some place)",
            "definition": "1. to leave a place; to leave; to begin to depart. (Especially in reference to a large number of persons or things.) _The crowd started to move out of the area about midnight.  They had moved out by one o’clock. 2. to leave a place of residence permanently. We didn’t like the neighborhood, so we moved out of it.  We moved out because we were unhappy."
        },
        {
            "id": 202,
            "phrase": "move over",
            "definition": "to move a bit [away from the speaker]. Move over. I need some space.  Please move over. Part of this space is mine."
        },
        {
            "id": 203,
            "phrase": "move someone or something around",
            "definition": "to move someone or something from place to place.  I wish that the army would stop moving me around. I have moved ten times in eight years. Let’s move the furniture around and see how this room looks."
        },
        {
            "id": 204,
            "phrase": "move someone or something away (from someone or something)",
            "definition": "to cause someone or something to withdraw from someone or something.  Move Billy away from Tommy so they will stop fighting. Move the cake away from Billy."
        },
        {
            "id": 205,
            "phrase": "move someone or something back (from someone or something)",
            "definition": "to cause someone or something to move back and away from someone or something.  Please move your child back from the lawn mower.  Move everyone back from the street."
        },
        {
            "id": 206,
            "phrase": "move someone or something down†",
            "definition": "to cause someone or something to move farther down or along [something].  Move Tom down a few seats. We need more space here.  Move down all these chairs. We need more space."
        },
        {
            "id": 207,
            "phrase": "move someone or something forward",
            "definition": "to cause someone or something to advance.  Move her forward. She is too far back.  Please move the chair forward."
        },
        {
            "id": 208,
            "phrase": "move someone or something on",
            "definition": "to cause someone or something to move onward or out of the way.  Please move those people on. They are in the way. The officers worked hard to move the crowd on."
        },
        {
            "id": 209,
            "phrase": "move someone or something out (of some place)",
            "definition": "to cause someone to depart or leave; to carry someone or something out of a place. Move those people out of here. They are crowding up the room. Please move all that stuff out."
        },
        {
            "id": 210,
            "phrase": "move someone or something over",
            "definition": "to cause someone or something to move a little way away.  Move Tom over a little bit. He is taking too much space.  Would you move your foot over a little?"
        },
        {
            "id": 211,
            "phrase": "move someone or something to something",
            "definition": "to make someone or something shift toward something.  Can you move your foot to the right a little? _ Would you move yourself to the right?"
        },
        {
            "id": 212,
            "phrase": "move someone or something up",
            "definition": "to cause someone or something to go higher or more forward. She is too far down. Move her up one step. Would you move the sofa up a little? It is too far back."
        },
        {
            "id": 213,
            "phrase": "move someone to tears",
            "definition": "to bring someone to the point of crying. The story moved me to tears. As she recounted the accident, she moved herself to tears."
        },
        {
            "id": 214,
            "phrase": "move someone up†",
            "definition": "to advance or promote someone. We are ready to move you up. You have been doing quite well.  It will be years before they move up the new people."
        },
        {
            "id": 215,
            "phrase": "move to some place",
            "definition": "to move one’s household to some place, perhaps permanently.  When we retired, we moved to Arizona.  I hope we can move to a larger house."
        },
        {
            "id": 216,
            "phrase": "move toward someone or something",
            "definition": "to move in the direction of someone or something.  The car is moving toward Roger!"
        },
        {
            "id": 217,
            "phrase": "move up",
            "definition": "to advance; to go higher. Isn’t it about time that I move up? I’ve been an office clerk for over a year.  I had hoped that I would move up faster than this."
        },
        {
            "id": 218,
            "phrase": "move up into something",
            "definition": "to advance into something.  I moved up into administration and I like it fine.  When I move up into management, I will get a bigger office."
        },
        {
            "id": 219,
            "phrase": "move up through something",
            "definition": "to advance through something.  He moved up through the ranks at a very rapid pace.  He moved up through every level of management to become CEO."
        },
        {
            "id": 220,
            "phrase": "move up (to something)",
            "definition": "to advance to something; to purchase a better quality of something.  We are moving up to a larger car.  There are too many of us now for a small house. We are moving up."
        },
        {
            "id": 221,
            "phrase": "movers and shakers",
            "definition": "people who get things done; organizers and managers.  The movers and shakers in this firm haven’t exactly been working overtime. Who are the movers and shakers around here?"
        },
        {
            "id": 222,
            "phrase": "Moving three times is as bad as a fire.",
            "definition": "Prov. If you move your household three times, you will lose or damage as many things as a fire in your house would have destroyed or damaged.  Fred: The company is transferring me again. Ellen: But we can’t make another move! Moving three times is as bad as a fire."
        },
        {
            "id": 223,
            "phrase": "mow someone or something down†",
            "definition": "to cut, knock, or shoot someone or something down.  The speeding car almost mowed us down.  The car mowed down the pedestrian."
        },
        {
            "id": 224,
            "phrase": "Mr. Nice Guy",
            "definition": "a friendly, forgiving fellow. You’ll find that I am Mr. Nice Guy as long as you play fair with me.  Oh, my boss is Mr. Nice Guy. He’ll give me the day off, I’m sure."
        },
        {
            "id": 225,
            "phrase": "Mr. Right",
            "definition": "the one man who is right for a woman to marry.  Some day Mr. Right will come along and sweep you off your feet. I’m tired of waiting for Mr. Right. Where is Mr. Maybe?"
        },
        {
            "id": 226,
            "phrase": "much ado about nothing",
            "definition": "Cliché a furor over something unimportant. (The name of a Shakespeare play.) _All this arguing is much ado about nothing."
        },
        {
            "id": 227,
            "phrase": "much in evidence",
            "definition": "Cliché very visible or evident.  John was much in evidence during the conference.  Your inf luence is much in evidence. I appreciate your efforts."
        },
        {
            "id": 228,
            "phrase": "Much obliged.",
            "definition": "Rur. Thankful and owing a debt of gratitude.  A: Sit down, Elmer, and have a drink on me. B: Much obliged."
        },
        {
            "id": 229,
            "phrase": "much of a muchness",
            "definition": "too much of something that there is generally a lot of.  All this talk about e-commerce and business-2-business is too much of a muchness."
        },
        {
            "id": 230,
            "phrase": "*much sought after",
            "definition": "Cliché wanted or desired very much. (*Typically: be ~; become ~.) _ This kind of crystal is much sought after. It’s very rare. Sally is a great singer. She’s much sought after."
        },
        {
            "id": 231,
            "phrase": "muck something up†",
            "definition": "to ruin something.  I should never have trusted Jim with the repair work. He was bound to muck it up.  I asked her to take over for me while I was gone, and she really mucked it up.  She mucked up the whole deal."
        },
        {
            "id": 232,
            "phrase": "muddle along",
            "definition": "to progress in confusion; to continue awkwardly. I will just have to muddle along as best I can until things get straightened out.  The project muddled along until the new manager got hold of it."
        },
        {
            "id": 233,
            "phrase": "muddle around",
            "definition": "to work inefficiently.  I can’t get anything done today. I’m just muddling around.  Jed is not doing his job well. He is muddling around and getting nothing done."
        },
        {
            "id": 234,
            "phrase": "muddle something up†",
            "definition": "to mix something up; to make something confusing.  You really muddled the language of this contract up.  Who muddled up the wording?"
        },
        {
            "id": 235,
            "phrase": "muddle through (something)",
            "definition": "to manage to get through something awkwardly.  We hadn’t practiced the song enough, so we just muddled through it.  We didn’t know what we were meant to do, so we muddled through."
        },
        {
            "id": 236,
            "phrase": "muddled (up)",
            "definition": "intoxicated.  I’ve had a little too much muddler, I think. Anyway, I’m muddled.  Larry is too muddled up to drive."
        },
        {
            "id": 237,
            "phrase": "muddy something up†",
            "definition": "1. to make water muddy; to stir up the mud in water, as at the bottom of a pond or river. Don’t muddy the water up. It will clog our filters. Don’t muddy up the water."
        },
        {
            "id": 238,
            "phrase": "muddy the water",
            "definition": "to make something less clear; to make matters confusing; to create difficulty where there was none before. Things were going along quite smoothly until you came along and muddied the water. The events of the past month have muddied the water as far as our proposed joint venture is concerned."
        },
        {
            "id": 239,
            "phrase": "muffle something up†",
            "definition": "to deaden or stifle a sound.  Betty tried to muff le the sounds up, but everyone heard what was going on.  She muff led up the sounds."
        },
        {
            "id": 240,
            "phrase": "mulct something out of someone",
            "definition": "to cheat something away from someone.  Are you trying to mulct my inheritance out of me? _ Max tried to mulct every last cent out of his victim."
        },
        {
            "id": 241,
            "phrase": "mull something over†",
            "definition": "to think about something; to ponder or worry about something.  That’s an interesting idea, but I’ll have to mull it over.  I’ll mull over your suggestions and reply to you next week."
        },
        {
            "id": 242,
            "phrase": "multiply by something",
            "definition": "to use the arithmetic process of multiplication to expand numerically a certain number of times. To get the amount of your taxes, multiply by .025.  Can you multiply by sixteens?"
        },
        {
            "id": 243,
            "phrase": "multiply something by something",
            "definition": "to use the arithmetic process of multiplication to expand numerically a particular number a certain number of times.  Multiply the number of dependents you are claiming by one thousand dollars.  Multiply 12 by 16 and tell me what you get."
        },
        {
            "id": 244,
            "phrase": "a multitude of sins",
            "definition": "many kinds of sins or errors.  The term offensive covers a multitude of sins."
        },
        {
            "id": 245,
            "phrase": "Mum’s the word.",
            "definition": "a pledge not to reveal a secret or to tell about something or someone. “Mum’s the word,” said Jane to ease Mary’s mind about her secret."
        },
        {
            "id": 246,
            "phrase": "munch out",
            "definition": "Sl. to overeat.  I can’t help it. Whenever I see french fries, I just have to munch out.  I try not to munch out more than once a week."
        },
        {
            "id": 247,
            "phrase": "mung something up†",
            "definition": "Sl. to mess something up.  Don’t mung it up this time. The team munged up the play, and the coach blasted them but good."
        },
        {
            "id": 248,
            "phrase": "murder on something",
            "definition": "very destructive or harmful to something.  Running a marathon is murder on your knees.  This dry weather is murder on my crops."
        },
        {
            "id": 249,
            "phrase": "Murder will out.",
            "definition": "Prov.Murder will always be discovered.; A bad deed will be found out.  Horace thought he had disposed of his victim in such a way that no one would ever discover his crime, but murder will out."
        }
    ]
}