{
    "dictionary": [
        {
            "id": 0,
            "phrase": "It’s not over till it’s over.",
            "definition": "Inf. It is not over yet and will not be until the event has completely played out. It looks like we have won, but it’s not over ’til it’s over! _ They haven’t won the game yet. It’s not over ’til it’s over."
        },
        {
            "id": 1,
            "phrase": "It’s not the heat, it’s the humidity.",
            "definition": "Prov. When the air is damp, hot days feel even hotter and more miserable.  Jill: I hope the air-conditioning is fixed soon; the heat is unbearable in here. Jane: It’s not the heat, it’s the humidity.  Alan: I thought the summers were hot when I was growing up in New Mexico, but they’re even hotter here in Iowa. Jane: The climate is moister here; it’s not the heat, it’s the humidity."
        },
        {
            "id": 2,
            "phrase": "It’s on me.",
            "definition": "I will pay this bill. (Usually a bill for a meal or drinks. Compare this with This one’s on me.) _ As the waiter set down the glasses, Fred said, “It’s on me,” and grabbed the check.  John: Check, please. Bill: No, it’s on me this time."
        },
        {
            "id": 3,
            "phrase": "It’s six of one, half a dozen of another.",
            "definition": "Cliché Two options are equivalent.  To get downtown, we can either take the highway or the side streets. It’s six of one, half a dozen of another, since both routes take the same amount of time.  Jill: Would you rather peel the carrots or wash the lettuce? Jane: It’s six of one, half a dozen of the other."
        },
        {
            "id": 4,
            "phrase": "(It ’s) time for a change.",
            "definition": "an expression announcing a decision to make a change.  Bill: Are you really going to take a new job? Mary: Yes, it’s time for a change.  Jane: Are you going to Florida for your vacation again? Fred: No. It’s time for a change. We’re going skiing."
        },
        {
            "id": 5,
            "phrase": "(It’s) time to go.",
            "definition": "It is now time to leave. (Usually said by guests, but can be said by an adult to children who are guests.) _ Jane: Look at the clock! Time to go! John: Yup! I’m out of here too.  Mother: It’s four o’clock. The party’s over. Time to go. Bill: I had a good time. Thank you."
        },
        {
            "id": 6,
            "phrase": "It’s time we should be going.",
            "definition": "a statement made by one member of a pair (or group) of guests to the other member( s), indicating a desire to leave. (Typically, a way for one person in a couple to signal the other, indicating a desire to leave.) _Mr. Franklin looked at his wife and said softly, “It’s time we should be going.” _ Tom: Well, I suppose it’s time we should be going. Mary: Yes, we really should. Alice: So early?"
        },
        {
            "id": 7,
            "phrase": "It’s written all over one’s face.",
            "definition": "It is very evident and can easily be detected when looking at someone’s face.  I know she’s guilty. It’s written all over her face."
        },
        {
            "id": 8,
            "phrase": "It’s you!",
            "definition": "It suits you perfectly.; It is just your style.  John (trying on jacket): How does this look? Sally: It’s you! _Sue: I’m taking a job with the candy company. I’ll be managing a store on Maple Street. Mary: It’s you! That’s a nice step up, and that store is so close by."
        },
        {
            "id": 9,
            "phrase": "It’s your funeral.",
            "definition": "If that is what you are going to do, you will have to endure the dire consequences.  Tom: I’m going to call in sick and go to the ball game instead of to work today. Mary: Go ahead. It’s your funeral.  Bill: I’m going to go into the boss and tell what I really think of him. Sue: It’s your funeral."
        },
        {
            "id": 10,
            "phrase": "it strikes me that",
            "definition": "it seems to me that.  Henry: It strikes me that you are losing a little weight. Mary: Oh, I’m so glad you noticed! _ “It strikes me that all this money we are spending is accomplishing very little,” said Bill."
        },
        {
            "id": 11,
            "phrase": "(It) suits me (fine).",
            "definition": "It is fine with me. John: Is this one okay? Mary: Suits me.  John: I’d like to sit up front where I can hear better. Mary: Suits me fine."
        },
        {
            "id": 12,
            "phrase": "It takes all kinds (to make a world).",
            "definition": "There are many different kinds of people, and you should not condemn them for being different.  Jill: Eleanor’s trying another fad diet. This week she’s sprinkling dried algae on all her food. Jane: It takes all kinds. Child: Mommy, I saw a weird man today. He was walking down the street singing real loud. I wish they’d put weird people like that away. Mother: Now, now, honey, it takes all kinds to make a world."
        },
        {
            "id": 13,
            "phrase": "It takes money to make money.",
            "definition": "Prov. In order to make money, you must first have some money to invest.  I’ve been reading a lot of books about how to become wealthy, and they all make it depressingly clear that it takes money to make money."
        },
        {
            "id": 14,
            "phrase": "(It) takes one to know one.",
            "definition": "Inf. You are one also.  A: You are a stupid oaf. B: So are you. It takes one to know one."
        },
        {
            "id": 15,
            "phrase": "It takes (some) getting used to.",
            "definition": "It is very unpleasant at first, but after a time it will not be so bothersome. (Said in recognition of the unpleasantness of something.) _ I never ate raw oysters before. It takes some getting used to.  These hot Mexican dishes seem impossible at first. They take some getting used to, I agree. But it’s worth it."
        },
        {
            "id": 16,
            "phrase": "It takes two to make a bargain.",
            "definition": "Prov. Both parties in a negotiation must agree in order for the negotiation to be successful.  Jill: You’ll give me a ride to work every day this week, like we agreed, won’t you? Jane: Wait a minute. I only said I’d give you a ride to work today. It takes two to make a bargain. Ellen: We decided you should make dinner tonight, right? Fred: No, we didn’t decide that; you decided that. It takes two to make a bargain."
        },
        {
            "id": 17,
            "phrase": "It takes two to make a quarrel.",
            "definition": "Prov. An argument is never only one person’s fault.; If the other person refuses to participate, there cannot be an argument. Sue: I think Mimi ought to apologize for arguing with me. Mother: It takes two to make a quarrel, dear. Maybe you ought to apologize to her.  Jill: Why are you always so quarrelsome? Jane: Hey, it’s not just my fault. It takes two to make a quarrel."
        },
        {
            "id": 18,
            "phrase": "(It) takes two to tango.",
            "definition": "Prov. Some things cannot happen by one person acting alone.  Alan: You’re always arguing! Stop arguing all the time. Jane: I can’t argue all by myself. It takes two to tango.  Fred: Did you hear? Janice got herself pregnant. Jill: Well, she didn’t do it all by herself. Takes two to tango, you know."
        },
        {
            "id": 19,
            "phrase": "It will be your ass!",
            "definition": "Sl. You will pay dearly!; You will suffer the consequences. (Potentially offensive. Use only with discretion.) _If you do that again, it will be your ass! _It will be your ass if it isn’t done right this time."
        },
        {
            "id": 20,
            "phrase": "It will take some doing.",
            "definition": "It will require considerable effort and care.  It’ll take some doing, but it’ll get done.  It’s not impossible. It’ll just take some doing."
        },
        {
            "id": 21,
            "phrase": "It won’t wash!",
            "definition": "Nobody will believe it! _ Sorry, it won’t wash. Try another approach.  Don’t expect me to believe that! It won’t wash."
        },
        {
            "id": 22,
            "phrase": "(It) works for me.",
            "definition": "Inf. It is fine with me. (With stress on works and me. The answer to a question implying Does it work for you?) _ Bob: Is it okay if I sign us up for the party? Sally: It works for me.  Tom: Is Friday all right for the party? Bill: Works for me. Bob: It works for me too."
        },
        {
            "id": 23,
            "phrase": "It would take an act of Congress to do something.",
            "definition": "It is almost impossible to do something.  It would take an act of Congress to get Bill to wear a necktie.  She’s a sour woman. It would take an act of Congress to get her to put a smile on her face."
        },
        {
            "id": 24,
            "phrase": "*an itch for something",
            "definition": "a desire for something. (*Typically: get ~; have ~; give someone ~.) _ I have an itch for some ice cream.  We had an itch for a good movie, so we went."
        },
        {
            "id": 25,
            "phrase": "itch for something",
            "definition": "to desire something. I’m just itching for a visit from Amy.  We are itching for some chocolate."
        },
        {
            "id": 26,
            "phrase": "*an itch to do something",
            "definition": "a desire to do something. (*Typically: get ~; have ~; give someone ~.) _ I have an itch to see a movie tonight.  Tom has an itch to go swimming."
        },
        {
            "id": 27,
            "phrase": "*itchy feet",
            "definition": "the need to leave; a feeling of a need to travel. (*Typically: get ~; have ~; give someone ~.) _ Hearing the train whistle at night gives me itchy feet."
        },
        {
            "id": 28,
            "phrase": "It’ll all come out in the wash.",
            "definition": "It does not matter.; No lasting damage has been done.  Tom: I feel so bad about what I said to Bill. I don’t think he’ll ever forgive me. Mary: Oh, don’t worry. It’ll all come out in the wash. Jane: I’ll never forgive myself for losing Mary’s book. Charlie: Just tell her you’re sorry, and offer to pay for the book. It’ll all come out in the wash."
        },
        {
            "id": 29,
            "phrase": "It’ll be a cold day in hell when something happens.",
            "definition": "Rur. Something will never happen or is highly unlikely.  It’ll be a cold day in Hell when the city council agrees on where to build that bridge. It’ll be a cold day in Hell when I forgive you."
        },
        {
            "id": 30,
            "phrase": "It’ll be a long day in January when something happens.",
            "definition": "Rur. Something will never happen. (There are fewer hours of daylight in January.) _Tom: Maybe this will be the year that Mama treats herself to a nice vacation. Jane: Are you kidding? It’ll be a long day in January when she does that! _ It’ll be a long day in January when that car dealer gives an honest price."
        },
        {
            "id": 31,
            "phrase": "It ’ll never fly.",
            "definition": "It will never work!; It will never be approved! (Refers originally to an evaluation of an unlikely-looking aircraft of some type.) _I have read your report and studied your proposal. It’ll never f ly.  Your design for a new electric automobile is interesting, but it’ll never f ly!"
        },
        {
            "id": 32,
            "phrase": "it’s no use (doing something)",
            "definition": "it is hopeless to do something; it is pointless to do something.  It’s no use trying to call on the telephone. The line is always busy. They tried and tried, but it was no use."
        },
        {
            "id": 33,
            "phrase": "(I’ve) been getting by.",
            "definition": "Inf. a response to a greeting inquiry into one’s well-being indicating that one is having a hard time surviving or that things could be much better. just getting by.) _ John: How are things? Jane: Oh, I’ve been getting by.  Sue: How are you doing? Mary: Been getting by. Things could be better."
        },
        {
            "id": 34,
            "phrase": "(I’ve) been okay.",
            "definition": "Inf. a standard response to a greeting inquiry that asks how one has been. Bill: Well, how have you been, good buddy? John: I’ve been okay.  Sue: How you doing? Jane: Been okay. And you? Sue: The same."
        },
        {
            "id": 35,
            "phrase": "(I’ve) been under the weather.",
            "definition": "a greeting response indicating that one has been ill.  John: How have you been? Sally: I’ve been under the weather, but I’m better.  Doctor: How are you? Mary: I’ve been under the weather. Doctor: Maybe we can fix that. What seems to be the trouble?"
        },
        {
            "id": 36,
            "phrase": "I’ve done my do.",
            "definition": "Rur. I have done my share.  Tom: Aren’t you going to finish cleaning the kitchen? Jane: I’ve done my do. You can do the rest.  I feel I’ve done my do, and someone else should do the rest."
        },
        {
            "id": 37,
            "phrase": "(I’ve) (got) better things to do.",
            "definition": "There are better ways to spend my time.; I cannot waste any more time on this matter. (Either I’ve got or I have.) _ Andy: Good-bye. I’ve got better things to do than stand around here listening to you brag. Henry: Well, good-bye and good riddance.  Mary: How did things go at your meeting with the zoning board? Sally: I gave up. Can’t fight city hall. Better things to do."
        },
        {
            "id": 38,
            "phrase": "(I’ve) got to get moving.",
            "definition": "I have to leave right now. have to shove off for other possible variations.) _ Tom: Time to go. Got to get moving. Sally: Bye, Tom.  Mary: It’s late and I’ve got to get moving. Sue: Well, if you must, okay. Come again sometime. Mary: Bye."
        },
        {
            "id": 39,
            "phrase": "(I’ve) got to go.",
            "definition": "a phrase announcing one’s need to depart. have to shove off for other possible variations.) _ Andy: Bye, I’ve got to go. Rachel: Bye, little brother. See you. Sally: Got to go. Sue: See ya! Take it easy."
        },
        {
            "id": 40,
            "phrase": "(I’ve) got to go home and get my beauty sleep.",
            "definition": "a phrase announcing one’s need to depart because it is late. have to shove off for other possible variations.) _ Sue: Leaving so early? John: I’ve got to go home and get my beauty sleep.  Jane: I’ve got to go home and get my beauty sleep. Fred: Well, you look to me like you’ve had enough. Jane: Why, thank you."
        },
        {
            "id": 41,
            "phrase": "(I’ve) got to run.",
            "definition": "a phrase announcing one’s need to depart. have to shove off for other possible variations.) _ John: Got to run. It’s late. Jane: Me too. See ya, bye-bye.  Mary: Want to watch another movie? Bill: No, thanks. I’ve got to run."
        },
        {
            "id": 42,
            "phrase": "(I’ve) got to split.",
            "definition": "Inf. Fig. I have to leave now. have to shove off for other possible variations.) _ Jane: Look at the time! Got to split. Mary: See you later, Jane.  Bill: It’s getting late. I’ve got to split. Sue: Okay, see you tomorrow. Bill: Good night."
        },
        {
            "id": 43,
            "phrase": "(I’ve) got to take off.",
            "definition": "a phrase announcing one’s need to depart. have to shove off for other possible variations.) _ Mary: Got to take off. Bye. Bob: Leaving so soon? Mary: Yes. Time to go. Bob: Bye.  “Look at the time. I’ve got to take off!” shrieked Alice."
        },
        {
            "id": 44,
            "phrase": "I’ve got work to do.",
            "definition": "I’m too busy to stay here any longer.  Jane: Time to go. I’ve got work to do. John: Me too. See you. Bob: I have to leave now. Bill: So soon? Bob: Yes, I’ve got work to do."
        },
        {
            "id": 45,
            "phrase": "I’ve had enough of this!",
            "definition": "I will not take any more of this situation! _ Sally: I’ve had enough of this! I’m leaving! Fred: Me too! _ John (glaring at Tom): I’ve had enough of this! Tom, you’re fired! Tom: You can’t fire me, I quit!"
        },
        {
            "id": 46,
            "phrase": "I’ve had it up to here (with someone or something).",
            "definition": "I will not endure any more of someone or something.  Bill: I’ve had it up to here with your stupidity. Bob: Who’s calling who stupid? _John: I’ve had it up to here with Tom. Mary: Are you going to fire him? John: Yes."
        },
        {
            "id": 47,
            "phrase": "I’ve heard so much about you.",
            "definition": "a polite phrase said upon being introduced to someone you have heard about from a friend or the person’s relatives.  Bill: This is my cousin Kate. Bob: Hello, Kate. I’ve heard so much about you. Sue: Hello, Bill. I’ve heard so much about you. Bill: Hello. Glad to meet you."
        },
        {
            "id": 48,
            "phrase": "(I’ve) seen better.",
            "definition": "a noncommittal and not very positive judgment about something or someone. Alice: How did you like the movie? John: I’ve seen better.  Bill: What do you think about this weather? Bob: Seen better."
        },
        {
            "id": 49,
            "phrase": "I’ve seen better heads on nickel beers.",
            "definition": "Rur. This person is stupid.  Jim’s good-looking, but I’ve seen better heads on nickel beers.  My students this term aren’t what you’d call bright. I’ve seen better heads on nickel beers."
        },
        {
            "id": 50,
            "phrase": "(I’ve) seen worse.",
            "definition": "a noncommittal and not totally negative judgment about something or someone.  Alice: How did you like the movie? John: I’ve seen worse.  Bill: What do you think about this weather? Gladys: Seen worse."
        },
        {
            "id": 51,
            "phrase": "jab at someone or something",
            "definition": "to poke or punch at someone or something.  Tom jabbed at Fred.  Don’t jab at the cat!"
        },
        {
            "id": 52,
            "phrase": "jab someone in something",
            "definition": "to poke someone in a particular location on the body. Fred jabbed Tom in the side. He jabbed himself in the hand."
        },
        {
            "id": 53,
            "phrase": "jab someone with something",
            "definition": "to poke or stick someone with something.  He jabbed Henry with the rake handle on purpose.  The mugger jabbed the victim with a knife."
        },
        {
            "id": 54,
            "phrase": "jab something at someone or something",
            "definition": "to poke someone or something with something.  Tom jabbed the stick at the dog.  I jabbed my fist at Walter."
        },
        {
            "id": 55,
            "phrase": "jab something out†",
            "definition": "to thrust something out. Molly jabbed her fist out suddenly.  She jabbed out her fist."
        },
        {
            "id": 56,
            "phrase": "jabber about someone or something",
            "definition": "1. to talk or chat very informally about someone or something. Who are they jabbering about? _ Those kids are jabbering about school again. 2. to talk unintelligibly about someone or something.  Is she jabbering about whatever comes to mind? _ She is jabbering about something, but we can’t understand her."
        },
        {
            "id": 57,
            "phrase": "jack of all trades",
            "definition": "someone who can do several different jobs instead of specializing in one.  John can do plumbing, carpentry, and roofing—a real jack of all trades. He isn’t very good at any of them.  Take your car to a certified engine mechanic, not a jack of all trades."
        },
        {
            "id": 58,
            "phrase": "a jack of all trades is a master of none.",
            "definition": "Prov. If you are able to do a lot of things fairly well, you will not have time to learn to do one thing extremely well. Jill: I envy Bob; he can do so many things. He writes novels, paints pictures, makes sculptures, and even plays the dulcimer. Jane: It’s true he does a lot of things, but he probably doesn’t do them all terribly well. A jack of all trades is a master of none, you know."
        },
        {
            "id": 59,
            "phrase": "jack someone up†",
            "definition": "1. Sl. to excite or stimulate someone, possibly with drugs.  Tom jacked up his buddy by talking to him.  Tom jacked up Fred with a lot of encouragement. 2. Sl. to motivate someone; to stimulate someone to do something. The mail is late again today. We’ll have to jack those people up at the post office.  I guess I’ll have to jack up the carpenter again to repair my stairs."
        },
        {
            "id": 60,
            "phrase": "jack something up†",
            "definition": "to raise something up on a mechanical lifting device. Now I have to jack the car up, so I can change the tire. Please jack up the car."
        },
        {
            "id": 61,
            "phrase": "jacked (out)",
            "definition": "Sl. angry; annoyed.  Boy was that old guy jacked out at you.  Yup, he was jacked all right."
        },
        {
            "id": 62,
            "phrase": "a jam session",
            "definition": "an informal session where musicians play together. Andy and Nick had a jam session last night and kept all the neighbors awake."
        },
        {
            "id": 63,
            "phrase": "jam someone or something together",
            "definition": "to pack people or things close together.  The usher jammed everybody together so more people could be seated.  Don’t just jam the boxes together! Sort them out first."
        },
        {
            "id": 64,
            "phrase": "jam something together",
            "definition": "to assemble something hastily or carelessly. The fragile contents were just jammed together in one box and everything was broken. The thing was just jammed together with no care at all."
        },
        {
            "id": 65,
            "phrase": "jam something up†",
            "definition": "1. to clog up something; to impede or block the movement of or through something.  Rachel jammed traffic up when her car stalled. All the leaves and branches jammed up the sewer. 2. Fig. to force something upwards in haste or anger. Who jammed the window up? _ Wally jammed up the window and nearly broke it."
        },
        {
            "id": 66,
            "phrase": "jam something up something",
            "definition": "to thrust something up something. She poked the broom handle up the chimney, hoping to force the bird to f ly out.  She jammed it up a few times, but it had no effect."
        },
        {
            "id": 67,
            "phrase": "jam something (up†) with something",
            "definition": "to clog something with something. Time had jammed the pipe up with rust.  Time had jammed up the pipe with rust.  Jam the hole with a cloth so nothing else will leak out."
        },
        {
            "id": 68,
            "phrase": "jam the brakes on†",
            "definition": "to press down hard on a vehicle’s brakes.  Alice jammed the brakes on and the car skidded all over the place.  She jammed on the brakes."
        },
        {
            "id": 69,
            "phrase": "jam with someone",
            "definition": "to play music in an improvised band with someone. Andy loves to jam with the other students.  Let’s set up a time when we can jam with the others."
        },
        {
            "id": 70,
            "phrase": "jangle on something",
            "definition": "1. Fig. to ring a bell incessantly.  Will you stop jangling on that doorbell! _ Who is jangling on that bell? 2. Fig. to irritate someone’s nerves; to make someone nervous. All that noise jangles on my nerves.  Too much chattering jangles on Ken’s nerves."
        },
        {
            "id": 71,
            "phrase": "jar against someone or something",
            "definition": "to bump against someone or something.  The guest jarred against the wall, knocking a picture askew.  Someone jarred against Fran, almost knocking her over."
        },
        {
            "id": 72,
            "phrase": "jar on someone or something",
            "definition": "to bother someone or someone’s nerves. (Similar to jangle on something.) _Her voice really jars on me.  My brash manner jars on her, I guess."
        },
        {
            "id": 73,
            "phrase": "jaw about someone or something",
            "definition": "to talk aimlessly about someone or something. Do we have to keep jawing about Tom all day? _ Stop jawing about your problems and set about fixing them."
        },
        {
            "id": 74,
            "phrase": "jaw at someone",
            "definition": "to lecture at someone; to talk endlessly to someone.  Please stop jawing at me.  You are jawing at me too much lately."
        },
        {
            "id": 75,
            "phrase": "jaw someone down†",
            "definition": "Sl. to talk someone down; to wear someone down talking.  We’ll try to jaw him down. If that doesn’t work, I don’t know what we will do.  We will jaw down the objectors."
        },
        {
            "id": 76,
            "phrase": "jazz someone or something up†",
            "definition": "to make someone or something more exciting or sexy; to make someone or something appeal more to contemporary tastes. Let’s jazz this room up a little bit. They jazzed up Donna till she looked like a rock star."
        },
        {
            "id": 77,
            "phrase": "jazzed (up)",
            "definition": "1. alert; having a positive state of mind.  I am jazzed up and ready to face life.  Those guys were jazzed and ready for the game. 2. intoxicated. Dave was a bit jazzed up, but not terribly.  Gert was jazzed out of her mind. 3. enhanced; with something added; made more enticing.  The third act was jazzed up with livelier music. 4. forged or altered. Better not try to cash a jazzed check at this bank."
        },
        {
            "id": 78,
            "phrase": "jeer at someone or something",
            "definition": "to poke fun at someone; to make rude sounds at someone. Please stop jeering at my cousin! _ The others just jeered at my idea."
        },
        {
            "id": 79,
            "phrase": "Jekyll and Hyde",
            "definition": "someone with both an evil and a good personality. (From the novel The Strange Case of Dr. Jekyll and Mr. Hyde by Robert Louis Stevenson.) _ Bill thinks Mary is so soft and gentle, but she can be very cruel—she is a real Jekyll and Hyde.  Jane doesn’t know that Fred is a Jekyll and Hyde. She sees him only when he is being kind and generous, but he can be very cruel."
        },
        {
            "id": 80,
            "phrase": "jerk something up†",
            "definition": "1. to pull something up quickly.  He jerked his belt up tight.  He jerked up the zipper to his jacket. 2. to lift up something, such as ears, quickly. The dog jerked its ears up.  The dog jerked up its ears when it heard the f loor creak.  The soldier jerked his binoculars up to try to see the sniper."
        },
        {
            "id": 81,
            "phrase": "jest about someone or something",
            "definition": "to make jokes about someone or something.  There is no need to jest about Lady Bracknell.  I wish you would not jest about that."
        },
        {
            "id": 82,
            "phrase": "jest at someone or something",
            "definition": "to make fun of someone or something.  Please don’t jest at my cousin.  Is someone jesting at my hairdo?"
        },
        {
            "id": 83,
            "phrase": "jest with someone",
            "definition": "to joke with someone; to try to fool someone.  Surely you are jesting with me.  Don’t jest with me!"
        },
        {
            "id": 84,
            "phrase": "jet (from some place) (to some place)",
            "definition": "to travel from some place to some other place by jet airplane.  They jetted from here to there.  They jetted to here from there."
        },
        {
            "id": 85,
            "phrase": "jet from something",
            "definition": "to spurt from something. Water jetted from the broken pipe.  A column of water jetted from the top of the fountain."
        },
        {
            "id": 86,
            "phrase": "jibe with something",
            "definition": "[for something] to agree with something.  Your story doesn’t jibe with what we heard from the arresting officer.  Her tale jibes with yours quite well."
        },
        {
            "id": 87,
            "phrase": "jim-dandy",
            "definition": "excellent. This is a jim-dandy knife. Where’d you get it? _Tom: I’ll meet you at six, OK? Charlie: That’ll be jim-dandy."
        },
        {
            "id": 88,
            "phrase": "jimmy something up†",
            "definition": "pry something up.  See if you can jimmy this window up.  Can you jimmy up this window?"
        },
        {
            "id": 89,
            "phrase": "jockey around",
            "definition": "to move around as if trying to get into a special position.  I spent most of the movie jockeying around, trying to get comfortable.  She always has to jockey around a bit when she is getting into a parking place."
        },
        {
            "id": 90,
            "phrase": "jockey for position",
            "definition": "to work one’s horse into a desired position in a horse race. Three riders were jockeying for position in the race.  Ken was behind, but jockeying for position."
        },
        {
            "id": 91,
            "phrase": "jockey someone or something into position",
            "definition": "to manage to get someone or something into a desirable position.  The rider jockeyed his horse into position.  Try to jockey your bicycle into position so you can pass the others."
        },
        {
            "id": 92,
            "phrase": "jockey something around†",
            "definition": "to maneuver something around; to manage something.  We had to jockey our bikes around a number of stalled cars.  We jockeyed around a few cars to make room for the bus in the parking lot."
        },
        {
            "id": 93,
            "phrase": "jog along",
            "definition": "to trot or run along at a slow pace.  She was jogging along quite happily.  I had been jogging along for a few minutes when my shoelaces broke."
        },
        {
            "id": 94,
            "phrase": "jog someone’s memory",
            "definition": "to stimulate someone’s memory to recall something. Hearing the first part of the song I’d forgotten really jogged my memory. I tried to jog Bill’s memory about our childhood antics."
        },
        {
            "id": 95,
            "phrase": "join forces (with someone)",
            "definition": "to combine one’s efforts with someone else’s efforts.  The older boys joined forces with the younger ones to sing the school song.  Let’s join forces with the other faction and run our own slate of candidates."
        },
        {
            "id": 96,
            "phrase": "join hands",
            "definition": "[for people] to hold hands so that each person is holding the hands of two other people; [for two people] to hold each other’s hands.  Let us join hands and pray together. The dancers joined hands and formed a circle that moved to the left."
        },
        {
            "id": 97,
            "phrase": "join in (with someone)",
            "definition": "to join someone in doing something. Do you mind if we join in with you? _Please join in."
        },
        {
            "id": 98,
            "phrase": "join in ((with) something)",
            "definition": "to participate in doing something.  The older boys joined in with the singing.  I’m glad they joined in. We needed basses."
        },
        {
            "id": 99,
            "phrase": "join something and something else together†",
            "definition": "to connect or unite things. We joined the pipe and the hose together.  He joined together all the blue wires and the red ones."
        },
        {
            "id": 100,
            "phrase": "join something to something else",
            "definition": "to connect something to something else.  We joined our club to the other club.  We joined our chorus to the other chorus, making a huge singing group."
        },
        {
            "id": 101,
            "phrase": "Join the club!",
            "definition": "Inf. an expression indicating that the person spoken to is in the same, or a similar, unfortunate state as the speaker.  You don’t have anyplace to stay? Join the club! Neither do we.  Did you get fired too? Join the club!"
        },
        {
            "id": 102,
            "phrase": "join up",
            "definition": "to join some organization.  The club has opened its membership rolls again. Are you going to join up? _ I can’t afford to join up."
        },
        {
            "id": 103,
            "phrase": "join (up) with someone or something",
            "definition": "to bring oneself into association with someone or something.  I decided to join up with the other group.  Our group joined with another similar group."
        },
        {
            "id": 104,
            "phrase": "joined at the hip",
            "definition": "Sl. closely connected; always together. Those two are joined at the hip. They are always together.  Sam and Martha are joined at the hip."
        },
        {
            "id": 105,
            "phrase": "The joke is on someone.",
            "definition": "1. Someone is the butt of the joke.  The joke is on Bob, so it’s good that he is a good sport. 2. The joke has backfired on someone.  Ha, ha! The joke’s on you after all."
        },
        {
            "id": 106,
            "phrase": "joke (with someone) (about someone or something)",
            "definition": "to quip with someone about someone or something; to make verbal fun with someone about someone or something.  I was joking with Tom about the performance.  I joked about Andy with Fran."
        },
        {
            "id": 107,
            "phrase": "jolt someone out of something",
            "definition": "to startle someone out of inertness.  The cold water thrown in her face was what it took to jolt Mary out of her deep sleep.  At the sound of the telephone, he jolted himself out of his stupor."
        },
        {
            "id": 108,
            "phrase": "jostle someone around†",
            "definition": "to push or knock someone around.  Please don’t jostle me around.  Don’t jostle around everyone!"
        },
        {
            "id": 109,
            "phrase": "jostle someone aside†",
            "definition": "to push or nudge someone aside.  Poor little Timmy was jostled aside by the crowd every time he got near the entrance.  The big kids jostled aside all the little ones."
        },
        {
            "id": 110,
            "phrase": "jostle with someone",
            "definition": "to struggle with someone.  Andy jostled with Fred for access to the door. Timmy and Bobby jostled with one another while they were waiting to get in."
        },
        {
            "id": 111,
            "phrase": "jot something down†",
            "definition": "to make a note of something.  This is important. Please jot this down.  Jot down this note, please."
        },
        {
            "id": 112,
            "phrase": "judge between someone or something and someone or something else",
            "definition": "to decide between people or things, in any combination.  You can’t expect me to judge between apples and oranges, can you? _ Can you judge between the prosecution and the defense?"
        },
        {
            "id": 113,
            "phrase": "judge one on one’s own merits",
            "definition": "to evaluate one on one’s own good and bad points and no one else’s. Please judge Janet on her own merits.  I was judged on my own merits."
        },
        {
            "id": 114,
            "phrase": "judge something on its own merits",
            "definition": "to evaluate something on its own good and bad points and nothing else.  You must judge this proposal on its own merits.  The proposal has not been judged on its own merits."
        },
        {
            "id": 115,
            "phrase": "jugged (up)",
            "definition": "Sl. intoxicated.  I’m not jugged up. I’m not even tipsy.  Fred was too jugged to drive home."
        },
        {
            "id": 116,
            "phrase": "juggle someone or something around†",
            "definition": "to alter the position or sequence of someone or something.  We will juggle everyone around so that the second round of interviews are in a different order.  I think I can juggle my schedule around so I can have lunch with you. Please juggle around my appointments for this afternoon so I can have a late lunch."
        },
        {
            "id": 117,
            "phrase": "juice and cookies",
            "definition": "trivial and uninteresting snacks or refreshments. The party was not much. Nothing but juice and cookies. After juice and cookies, we all went back into the meeting room for another hour of talk, talk, talk."
        },
        {
            "id": 118,
            "phrase": "juice something back†",
            "definition": "Sl. to drink all of something alcoholic, quickly. He juiced a beer back. Max juiced back another beer."
        },
        {
            "id": 119,
            "phrase": "juice something up†",
            "definition": "1. Sl. to make something more powerful. How much did it cost to juice this thing up? _Wally juiced up his car. 2. Sl. to turn on the electricity to something. It’s time to juice the stage lights up. Juice up the stage lights."
        },
        {
            "id": 120,
            "phrase": "juice up",
            "definition": "Sl. to drink one or more alcoholic drinks. Hey, man, let’s go out and juice up tonight.  Stop juicing up every night."
        },
        {
            "id": 121,
            "phrase": "jumble someone or something together",
            "definition": "to mix people or things together randomly into a hodgepodge. They just jumbled everything together and made a real mess.  The army just jumbled everybody together, no matter what their skills and talents were."
        },
        {
            "id": 122,
            "phrase": "jumble something together",
            "definition": "to assemble something clumsily and hastily.  They just jumbled some holiday decorations together. It really wasn’t very well done.  I hope this airplane wasn’t jumbled together as badly as this meal."
        },
        {
            "id": 123,
            "phrase": "jumble something up†",
            "definition": "to make a hodgepodge out of things.  Who jumbled my papers up? _ Who jumbled up all my papers?"
        },
        {
            "id": 124,
            "phrase": "jump across something",
            "definition": "to leap over something that is broad rather than tall.  The frog jumped across the puddle.  Timmy tried but failed to jump across the puddle."
        },
        {
            "id": 125,
            "phrase": "jump at someone or something",
            "definition": "to jump in the direction of someone or something.  The frog jumped at me, but I dodged it.  The cat jumped at the leaf as it fell from the tree."
        },
        {
            "id": 126,
            "phrase": "jump at something",
            "definition": "to seize the opportunity to do something. .) _ When I heard about John’s chance to go to England, I knew he’d jump at it.  If something you really want to do comes your way, jump at it."
        },
        {
            "id": 127,
            "phrase": "jump clear of something",
            "definition": "to get out of the way of something; to leap off something before it crashes.  I barely had time to jump clear of the oncoming truck.  I jumped clear of the ball as it came my way."
        },
        {
            "id": 128,
            "phrase": "jump (down) (from something)",
            "definition": "to jump downward off something.  A small mouse jumped down from the shelf.  A tiny mouse jumped from the shelf."
        },
        {
            "id": 129,
            "phrase": "jump down something",
            "definition": "to leap downward into or through something.  The rats jumped down the manhole.  Timmy jumped down the stairs on the morning of his birthday party."
        },
        {
            "id": 130,
            "phrase": "jump from something to something",
            "definition": "to leap from one place to another.  A frog jumped from lily pad to lily pad.  The child jumped from stone to stone."
        },
        {
            "id": 131,
            "phrase": "jump in((to) something)",
            "definition": "to leap into something, such as water, a bed, a problem, etc.  She was so cold she just jumped into bed and pulled up the covers.  I jumped in and had a refreshing swim."
        },
        {
            "id": 132,
            "phrase": "jump off ((of ) something)",
            "definition": "to leap off something. (Of is usually retained before pronouns.) _ Rachel lost her balance and jumped off the diving board instead of diving.  Better to jump off than to fall off."
        },
        {
            "id": 133,
            "phrase": "jump off the deep end (over someone or something)",
            "definition": "to get deeply involved with someone or something. (Often refers to romantic involvement.) _ Jim is about to jump off the deep end over Jane.  Jane is great, but there is no need for Jim to jump off the deep end."
        },
        {
            "id": 134,
            "phrase": "*the jump on someone",
            "definition": "a chance to do something before someone else. (*Typically: get ~; have ~; give someone ~.) _ Each reporter is trying to get the jump on the others with the story about the earthquake.  Kelly finally got the jump on Sam."
        },
        {
            "id": 135,
            "phrase": "jump on someone or something",
            "definition": "to pounce on someone or something.  The cat jumped on the mouse.  Max jumped on the unsuspecting tourist and robbed him."
        },
        {
            "id": 136,
            "phrase": "jump on((to) something)",
            "definition": "1. to get onto something. The cat jumped onto the sofa and took a nap.  I was sitting on the sofa and the cat jumped on it and scared me. 2. to get involved in something very quickly. Jump onto that story now and get it done for tonight’s edition. I’ll jump on the story right now, boss."
        },
        {
            "id": 137,
            "phrase": "jump out of something",
            "definition": "to leap from something. A mouse jumped out of the cupboard and scared me. I jumped out of bed and ran to answer the telephone."
        },
        {
            "id": 138,
            "phrase": "jump over something",
            "definition": "to leap over or across something.  The fellow named Jack jumped over a candle placed on the f loor. Puddles are to be jumped over, not waded through."
        },
        {
            "id": 139,
            "phrase": "jump over the broomstick",
            "definition": "Rur. to get married.  Jim and Jane have decided to jump over the broomstick.  The happiest day of my life was when your mother said she’d jump over the broomstick with me."
        },
        {
            "id": 140,
            "phrase": "jump ship",
            "definition": "to leave one’s job on a ship and fail to be aboard it when it sails; [for a sailor] to go AWOL.  One of the deckhands jumped ship at the last port."
        },
        {
            "id": 141,
            "phrase": "jump the gun",
            "definition": "to start before the starting signal. (Originally used in sports contests that are started by firing a gun.) _We all had to start the race again because Jane jumped the gun. When we took the test, Tom jumped the gun and started early."
        },
        {
            "id": 142,
            "phrase": "jump the track",
            "definition": "[for something] to fall or jump off the rails or guides. (Usually said about a train.) _ The train jumped the track, causing many injuries to the passengers.  The engine jumped the track, but the other cars stayed on."
        },
        {
            "id": 143,
            "phrase": "jump up (from something)",
            "definition": "to leap upward from something.  The dog jumped up from its resting place.  The dog jumped up and ran to the door."
        },
        {
            "id": 144,
            "phrase": "jump up (on someone or something)",
            "definition": "to leap upward onto someone or something.  A spider jumped up on me and terrified me totally.  The cat jumped up on the sofa."
        },
        {
            "id": 145,
            "phrase": "jump up (to something)",
            "definition": "to leap upward to the level of something. The child jumped up to the next step. The dog couldn’t reach the piece of meat on the edge of the table, so it jumped up and got it."
        },
        {
            "id": 146,
            "phrase": "jump with something",
            "definition": "to be very active with excitement or enthusiasm. The crowd was jumping with enthusiasm.  The bar was jumping with young people."
        },
        {
            "id": 147,
            "phrase": "junk mail",
            "definition": "annoying, unsolicited mail, such as promotional letters, etc. I am so incredibly tired of getting pound after pound of junk mail every day. I could just scream."
        },
        {
            "id": 148,
            "phrase": "The jury is still out on someone or something.",
            "definition": "a decision has not been reached on someone or something; the people making the decision on someone or something have not yet decided.  The jury is still out on Jane. We don’t know what we are going to do about her.  The jury is still out on the question of building a new parking lot."
        },
        {
            "id": 149,
            "phrase": "just a minute",
            "definition": "only a short time; [wait] a short period of time.  I’m almost done. I’ll be there in just a minute! _ Could I have just a minute of your time?"
        },
        {
            "id": 150,
            "phrase": "Just a minute (you)!",
            "definition": "Stop where you are! (Not very polite.) _ Just a minute, you! Where are you going with my coat?"
        },
        {
            "id": 151,
            "phrase": "(just) as I expected",
            "definition": "I thought so; I knew it would be this way.  Just as I expected. The window was left open and it rained in.  As I expected, he left work early again."
        },
        {
            "id": 152,
            "phrase": "just fell off the turnip truck",
            "definition": "Rur. ignorant; unsophisticated.  He stood there gawking at the buildings in town like he just fell off the turnip truck.  My cousin acts like she just fell off the turnip truck."
        },
        {
            "id": 153,
            "phrase": "just in case",
            "definition": "in the event that (something happens). All right. I’ll take it just in case.  I’ll take along some aspirin, just in case."
        },
        {
            "id": 154,
            "phrase": "just in time",
            "definition": "at the last possible time. He got to the meeting just in time. They had just started the topic he was supposed to talk about."
        },
        {
            "id": 155,
            "phrase": "just like that",
            "definition": "in just the way it happened or was stated; without any [further] discussion or comment. Sue: You can’t walk out on me just like that. John: I can too. Just watch! _ Mary: And then she slapped him in the face, just like that! Sally: She can be so rude."
        },
        {
            "id": 156,
            "phrase": "just off the boat",
            "definition": "to be newly immigrated and perhaps gullible and naive. I’m not just off the boat. I know what’s going on.  He may act like he’s just off the boat, but he’s very savvy."
        },
        {
            "id": 157,
            "phrase": "just one’s cup of tea",
            "definition": "to be something that one prefers or desires.  This spy novel is just my cup of tea.  Teaching children to read is just my cup of tea."
        },
        {
            "id": 158,
            "phrase": "just passing through",
            "definition": "just moving through an area and not stopping. We didn’t stop in Moose Jaw. We were just passing through."
        },
        {
            "id": 159,
            "phrase": "just so",
            "definition": "1. in perfect order; neat and tidy.  Her hair is always just so.  Their front yard is just so. 2. Precisely right!; Quite right! (Usually Just so!) _ Bill: The letter should arrive tomorrow. Tom: Just so! _ Jane: We must always try our best. Martin: Just so!"
        },
        {
            "id": 160,
            "phrase": "(just) taking care of business",
            "definition": "doing what I am supposed to do; an answer to the question “What are you doing lately?” (Also abbreviated T.C.B.) _Bill: Hey, man. juxtapose What you been doing? Tom: Just taking care of business.  Andy: Look, officer, I’m just standing here, taking care of business, and this Tom guy comes up and tries to hit me for a loan. Tom: That’s not true!"
        },
        {
            "id": 161,
            "phrase": "just the ticket",
            "definition": "to be just the perfect thing.  This soup is just the ticket for a quick lunch.  A good, hot cup of coffee will be just the ticket."
        },
        {
            "id": 162,
            "phrase": "just what the doctor ordered",
            "definition": "exactly what is required, especially for health or comfort.  That meal was delicious, Bob. Just what the doctor ordered.  Bob: Would you like something to drink? Mary: Yes, a cold glass of water would be just what the doctor ordered."
        },
        {
            "id": 163,
            "phrase": "justify something by something",
            "definition": "to try to explain why something needs doing or why it is acceptable to do something.  You cannot justify violence by quoting proverbs.  Your action was totally justified by the circumstances."
        },
        {
            "id": 164,
            "phrase": "justify something to someone",
            "definition": "to explain something to someone and show why it is necessary. Please try to justify this to the voters.  I can justify your action to no one."
        },
        {
            "id": 165,
            "phrase": "jut out (from something)",
            "definition": "to stick outward from something. The f lagpole juts out from the side of the building.  His nose juts out sharply."
        },
        {
            "id": 166,
            "phrase": "jut out (into something)",
            "definition": "to stick outward into an area.  The back end of the truck jutted out into the street.  The back end jutted out."
        },
        {
            "id": 167,
            "phrase": "jut out (over someone or something)",
            "definition": "to stick out over someone or something.  The roof of the house jutted out over the patio.  I’m glad the roof jutted out and kept us dry during the brief storm."
        },
        {
            "id": 168,
            "phrase": "juxtapose someone or something to someone or something",
            "definition": "to place people or things next to each other, in any combination. (Also implies that the placing or arranging is done carefully.) _ I went to the meeting room early so I could juxtapose myself to the head of the table.  I juxtaposed the chair to the view out the window."
        },
        {
            "id": 169,
            "phrase": "a kangaroo court",
            "definition": "a bogus or illegal court. Is this a staff meeting or a kangaroo court? _You have turned this interview into a kangaroo court."
        },
        {
            "id": 170,
            "phrase": "Katie bar the door",
            "definition": "Prepare immediately for an advancing threat. Katie bar the door, the grandchildren are here and they all look hungry."
        },
        {
            "id": 171,
            "phrase": "keel over",
            "definition": "[for a person] to fall over or fall down in a faint or in death.  It was so hot in the room that two people just keeled over."
        },
        {
            "id": 172,
            "phrase": "keel something over†",
            "definition": "Rur. to push something over.  He leaned on the f limsy wall and keeled it right over.  The high wind keeled over that sorry old fence."
        },
        {
            "id": 173,
            "phrase": "keen on doing something",
            "definition": "willing or eager to do something.  Dave isn’t very keen on going to the opera.  The children are keen on swimming this afternoon. Shall I take them?"
        },
        {
            "id": 174,
            "phrase": "keep a civil tongue (in one’s head)",
            "definition": "to speak decently and politely.  Please, John. Don’t talk like that. Keep a civil tongue in your head.  John seems unable to keep a civil tongue."
        },
        {
            "id": 175,
            "phrase": "keep a close watch on someone or something",
            "definition": "to watch someone or something very carefully.  Let’s keep a close watch on Fred and his friends. I want to keep a close watch on the house across the street."
        },
        {
            "id": 176,
            "phrase": "keep a secret",
            "definition": "to know a secret and not tell anyone.  Please keep our little secret private.  Do you know how to keep a secret?"
        },
        {
            "id": 177,
            "phrase": "Keep a stiff upper lip.",
            "definition": "Prov. Act as though you are not upset.; Do not let unpleasant things upset you. (English people are stereotypically supposed to be very good at keeping a stiff upper lip.) _Even though he was only three years old, Jonathan kept a stiff upper lip the whole time he was in the hospital recovering from his surgery. Jill: Sometimes this job frustrates me so much I could just break down in tears. Jane: Keep a stiff upper lip. Things are bound to improve."
        },
        {
            "id": 178,
            "phrase": "Keep a thing seven years and you’ll (always) find a use for it.",
            "definition": "Prov. If you keep a seemingly useless thing for seven years, you will supposedly have some occasion to use it during that time. Jill: My mother sent me a fourfoot- tall ceramic vase for my birthday. What can I possibly use it for? Jane: Keep it seven years and you’ll find some use for it."
        },
        {
            "id": 179,
            "phrase": "Keep at it!",
            "definition": "Keep doing what you are doing!; Keep trying! (Said as encouragement to keep working at something.) _ The boss told me to keep at it every time he passed my desk.  Keep at it, Tom! You can do it!"
        },
        {
            "id": 180,
            "phrase": "keep at something",
            "definition": "to persist at doing something; to continue trying to do something.  John kept at his painting until the whole house was done.  Keep at the job if you want to get it finished."
        },
        {
            "id": 181,
            "phrase": "keep banker’s hours",
            "definition": "to work or be open for business for less than eight hours a day.  The advertising agency keeps banker’s hours. They are only open until four.  James doesn’t really work full-time. He keeps banker’s hours."
        },
        {
            "id": 182,
            "phrase": "keep body and soul together",
            "definition": "to manage to keep existing, especially when one has very little money. (Compare this with keep the wolf from the door.) _ We hardly had enough to keep body and soul together. I don’t earn enough money to keep body and soul together."
        },
        {
            "id": 183,
            "phrase": "keep (close) watch (on someone or something)",
            "definition": "to monitor someone or something; to observe someone or something.  Keep close watch on Bill. I think he’s loafing.  Okay. I’ll keep watch, but I think he’s a good worker."
        },
        {
            "id": 184,
            "phrase": "keep (close) watch (over someone or something)",
            "definition": "to guard or care for someone or something.  I’m keeping watch over my children to make sure they have the things they need.  I think that an angel is keeping close watch over her to make sure nothing bad happens to her."
        },
        {
            "id": 185,
            "phrase": "keep company (with someone)",
            "definition": "to spend much time with someone; to associate with or consort with someone.  Bill has been keeping company with Ann for three months.  Bob has been keeping company with a tough-looking bunch of boys."
        },
        {
            "id": 186,
            "phrase": "keep cool",
            "definition": "Inf. to stay calm and undisturbed.  Relax, man, keep cool! _If Sally could just keep cool before a race, she could probably win."
        },
        {
            "id": 187,
            "phrase": "keep faith with someone",
            "definition": "to be loyal to someone.  I intend to keep faith with my people and all they stand for.  We could not keep faith with them any longer."
        },
        {
            "id": 188,
            "phrase": "keep fit",
            "definition": "to keep in good physical condition.  I do everything I can to keep fit."
        },
        {
            "id": 189,
            "phrase": "keep from something",
            "definition": "to avoid doing something; to refrain from doing something.  How could I keep from crying? It was so sad! _ Try to keep from falling off the ladder."
        },
        {
            "id": 190,
            "phrase": "keep (going) on about someone or something",
            "definition": "to continue to talk excessively about someone or something.  I wish you would not keep going on about Tom and Jill.  Don’t keep on about my haircut. It’s perfect!"
        },
        {
            "id": 191,
            "phrase": "keep (going) on at someone or something",
            "definition": "to continue to complain about or scold someone or a group. Don’t keep going on at him. Give him the dickens and be done with it.  Please don’t keep on at the committee. They did the best they could."
        },
        {
            "id": 192,
            "phrase": "keep good time",
            "definition": "[for a watch or clock] to be accurate.  I have to return my watch to the store because it doesn’t keep good time.  Mine keeps good time."
        },
        {
            "id": 193,
            "phrase": "keep harping on something",
            "definition": "to continue to talk or complain about something; to keep raising a topic of conversation. Why do you keep harping on the same old complaint? _You keep harping on my problems and ignore your own!"
        },
        {
            "id": 194,
            "phrase": "keep house",
            "definition": "to manage a household.  I hate to keep house. I’d rather live in a tent than keep house. My grandmother kept house for nearly sixty years."
        },
        {
            "id": 195,
            "phrase": "keep in good with someone",
            "definition": "to remain in someone’s favor.  I always try to keep in good with the boss’s secretary.  It’s also good to keep in good with the boss."
        },
        {
            "id": 196,
            "phrase": "Keep in there!",
            "definition": "Inf. Keep trying! _ Andy: Don’t give up, Sally. Keep in there! Sally: I’m doing my best! _ John: I’m not very good, but I keep trying. Fred: Just keep in there, John."
        },
        {
            "id": 197,
            "phrase": "Keep in touch.",
            "definition": "Good-bye. (Sometimes a sarcastic way of saying good-bye to someone one doesn’t care about.) _ Nice talking to you. Keep in touch.  Sorry, we can’t use you anymore. Keep in touch."
        },
        {
            "id": 198,
            "phrase": "keep in training",
            "definition": "to maintain oneself in good physical condition.  I try to keep in training so I will live longer.  Try to keep in training."
        },
        {
            "id": 199,
            "phrase": "keep inside ((of ) something)",
            "definition": "to remain inside of something, usually a shelter, house, etc. (Of is usually retained before pronouns.) _ Please keep inside of the house while it’s raining.  I want you to keep inside."
        },
        {
            "id": 200,
            "phrase": "keep it down (to a dull roar)",
            "definition": "to keep quiet or as quiet as possible.  Keep it down, you kids! _ Please try to keep it down to a dull roar, could you?"
        },
        {
            "id": 201,
            "phrase": "keep (it) in mind that",
            "definition": "a statement emphasizing something that the speaker wants remembered.  Bill: When we get there I want to take a long hot shower. Father: Keep it in mind that we are guests, and we have to fit in with the routines of the household. Sally: Keep it in mind that you don’t work here anymore, and you just can’t go in and out of offices like that. Fred: I guess you’re right."
        },
        {
            "id": 202,
            "phrase": "Keep it up!",
            "definition": "1. Keep up the good work!; Keep on doing it.; Keep (on) trying.  Jane: I think I’m doing better in calculus. John: Keep it up! _Sally: I can now jog for almost three miles. Fred: Great! Keep it up! 2. Just keep acting that way and see what happens to you. (Compare this with (Go ahead,) make my day!) _John: You’re just not doing what is expected of you. Bill: Keep it up! Just keep it up, and I’ll quit right when you need me most. “Your behavior is terrible, young man! You just keep it up and see what happens,” warned Alice. “Just keep it up!”"
        },
        {
            "id": 203,
            "phrase": "keep late hours",
            "definition": "to stay up or stay out until very late at night.  I’m always tired because I keep late hours.  If I didn’t keep late hours, I wouldn’t sleep so late in the morning."
        },
        {
            "id": 204,
            "phrase": "keep on an even keel",
            "definition": "to remain cool and calm. (Originally nautical.) _ If Jane can keep on an even keel and not panic, she will be all right. Try to keep on an even keel and not get upset so easily."
        },
        {
            "id": 205,
            "phrase": "keep on (doing something)",
            "definition": "to continue to do something.  Are you going to keep on singing all night? _ Yes, I’m going to keep on."
        },
        {
            "id": 206,
            "phrase": "keep on keeping on",
            "definition": "Inf. keep trying; keep doing what you are doing.  I do my best. I just keep on keeping on."
        },
        {
            "id": 207,
            "phrase": "keep on the left(-hand) side (of something)",
            "definition": "to stay on the left-hand side of something. Please don’t keep on the left side all the time when everyone else is on the right! _ In England you keep on the left-hand side."
        },
        {
            "id": 208,
            "phrase": "keep on the right(-hand) side (of something)",
            "definition": "to stay on the right-hand side of something. We always keep on the right side of the road in this country.  Please keep on the right-hand side."
        },
        {
            "id": 209,
            "phrase": "keep on (the) track",
            "definition": "to stay on the path that one is on; to continue doing the things one is doing.  Keep on the track and you will end up where you want to be.  I know I can keep on track."
        },
        {
            "id": 210,
            "phrase": "keep on top (of someone or something)",
            "definition": "to stay wellinformed about the status of someone or something.  I need to keep on top of the president, because I am doing a report on him.  News is easy to get these days, and I do what I can to keep on top."
        },
        {
            "id": 211,
            "phrase": "keep on trucking",
            "definition": "Inf. to continue to do well; to continue to try.  Just keep on trucking, man.  All I can do is keep on trucking."
        },
        {
            "id": 212,
            "phrase": "keep on with something",
            "definition": "to continue with something.  Just keep on with your work. Don’t pay any attention to me.  Can I keep on with this while you are talking?"
        },
        {
            "id": 213,
            "phrase": "keep one in one’s place",
            "definition": "to make someone stay in the proper rank or station.  I guess you want to keep me in my place, is that right? _ I know enough to keep myself in my place."
        },
        {
            "id": 214,
            "phrase": "keep one’s chin up",
            "definition": "to keep one’s spirits high; to act brave and confident.  Keep your chin up, John. Things will get better.  Just keep your chin up and tell the judge exactly what happened."
        },
        {
            "id": 215,
            "phrase": "keep one’s cool",
            "definition": "Inf. to remain calm and in control.  Relax, man! Just keep your cool.  It’s hard to keep your cool when you’ve been cheated."
        },
        {
            "id": 216,
            "phrase": "keep one’s distance (from someone or something)",
            "definition": "to maintain a respectful or cautious distance from someone or something.  Keep your distance from John. He’s in a bad mood.  Keep your distance from the fire."
        },
        {
            "id": 217,
            "phrase": "keep one’s eye on the ball",
            "definition": "1. Fig. to watch or follow the ball carefully, especially when one is playing a ball game; to follow the details of a ball game very carefully.  John, if you can’t keep your eye on the ball, I’ll have to take you out of the game.  “Keep your eye on the ball!” the coach roared at the players. 2. Fig. to remain alert to the events occurring around oneself.  If you want to get along in this office, you’re going to have to keep your eye on the ball. Bill would do better in his classes if he would just keep his eye on the ball."
        },
        {
            "id": 218,
            "phrase": "keep one’s finger on the pulse of something",
            "definition": "to monitor the current state of something frequently.  I have to keep my finger on the pulse of the city if I want to be a good reporter.  It is hard to keep your finger on the pulse of Washington, D.C., but a U.S. senator must do it."
        },
        {
            "id": 219,
            "phrase": "keep one’s hand in (something)",
            "definition": "to remain involved in something, perhaps only a token involvement. I want to keep my hand in things even after I retire.  I always have to keep my hand in so I will feel a part of things."
        },
        {
            "id": 220,
            "phrase": "keep one’s hands off (something)",
            "definition": "to refrain from touching or handling something.  I’m going to put these cookies here. You keep your hands off them.  Get your hands off my book, and keep them off."
        },
        {
            "id": 221,
            "phrase": "keep one’s hands to oneself",
            "definition": "to refrain from touching anything or anyone; to refrain from punching or poking someone. Won’t you keep your hands to yourself ? _ Keep your hands to yourself while we are in the toy store.  I want you boys to stop fighting and keep your hands to yourselves."
        },
        {
            "id": 222,
            "phrase": "keep one’s head",
            "definition": "to remain calm and sensible when in an awkward situation that might cause a person to panic or go out of control.  She was very angry. We had to calm her down and encourage her to keep her head.  Always try to keep your head when others are panicking."
        },
        {
            "id": 223,
            "phrase": "keep one’s head above water",
            "definition": "to keep from drowning when swimming or floating.  I was so tired I could hardly keep my head above water."
        },
        {
            "id": 224,
            "phrase": "keep one’s mind on someone or something",
            "definition": "to concentrate on someone or something.  He is keeping his mind on Jane instead of his work.  I find it hard to keep my mind on my reading."
        },
        {
            "id": 225,
            "phrase": "keep one’s mouth shut (about someone or something)",
            "definition": "to keep quiet about someone or something; to keep a secret about someone or something.  They told me to keep my mouth shut about the boss or I’d be in big trouble.  I think I’ll keep my mouth shut."
        },
        {
            "id": 226,
            "phrase": "keep one’s nose clean",
            "definition": "to keep out of trouble, especially trouble with the law.  I’m trying to keep my nose clean by staying away from those rough guys. John, if you don’t learn how to keep your nose clean, you’re going to end up in jail."
        },
        {
            "id": 227,
            "phrase": "keep one’s nose out of someone’s business",
            "definition": "to refrain from interfering in someone else’s business.  Let John have his privacy, and keep your nose out of my business, too! _ Keep your nose out of my business!"
        },
        {
            "id": 228,
            "phrase": "keep one’s nose out of something",
            "definition": "to stay out of something, such as someone else’s business. Try to keep your nose out of stuff that doesn’t concern you.  Keep your nose out of my personal affairs."
        },
        {
            "id": 229,
            "phrase": "keep one’s nose to the grindstone",
            "definition": "to work hard and constantly.  Son: I’ll never get good grades. I might as well not even study. Mother: Don’t give up yet. I’m sure that if you just keep your nose to the grindstone, you’ll get the results you want.  Mary kept her nose to the grindstone while her friends were out enjoying themselves."
        },
        {
            "id": 230,
            "phrase": "keep one’s opinions to oneself",
            "definition": "to stop mentioning one’s own opinions, especially when they disagree with someone else’s.  You ought to keep your opinions to yourself rather than upset our guests. Please keep your rude opinions to yourself!"
        },
        {
            "id": 231,
            "phrase": "keep one’s own counsel",
            "definition": "to keep one’s thoughts and plans to oneself; to withhold from other people one’s thoughts and plans.  Jane is very quiet. She tends to keep her own counsel.  I advise you to keep your own counsel."
        },
        {
            "id": 232,
            "phrase": "keep one’s place",
            "definition": "to exhibit only the behavior appropriate to one’s position or status in life.  When I complained about the food, they told me to keep my place! _ I suggest you keep your place until you’re in a position to change things."
        },
        {
            "id": 233,
            "phrase": "keep one’s weather eye open",
            "definition": "to watch for something (to happen); to be on the alert (for something); to be on guard. Some trouble is brewing. Keep your weather eye open. Try to be more alert. Learn to keep your weather eye open."
        },
        {
            "id": 234,
            "phrase": "keep one’s wits about one",
            "definition": "to remain rational when threatened or under stress; to keep one’s mind operating in a time of stress. If Jane hadn’t kept her wits about her during the fire, things would have been much worse.  I could hardly keep my wits about me."
        },
        {
            "id": 235,
            "phrase": "keep one’s word",
            "definition": "to uphold one’s promise; to do as one says. (The opposite of break one’s word.) _ I told her I’d be there to pick her up, and I intend to keep my word.  Keeping one’s word is necessary in the legal profession."
        },
        {
            "id": 236,
            "phrase": "keep oneself to oneself",
            "definition": "to remain aloof.  He does tend to keep himself to himself.  Keep yourself to yourself, and you’ll be all right there."
        },
        {
            "id": 237,
            "phrase": "keep out from under someone’s feet",
            "definition": "to stay out of someone’s way.  Please keep out from under my feet. I’m very busy. Try to keep out from under Tom’s feet while he is working."
        },
        {
            "id": 238,
            "phrase": "keep out (of something)",
            "definition": "to remain outside something or some place.  You should keep out of the darkroom when the door is closed.  The door is closed. Keep out!"
        },
        {
            "id": 239,
            "phrase": "keep pace (with someone or something)",
            "definition": "to move at the same speed as someone, something, or an animal; to match someone or some creature pace for pace.  The black horse was having a hard time keeping pace with the brown one.  Tom runs very fast and I couldn’t keep pace with him."
        },
        {
            "id": 240,
            "phrase": "keep people straight (in one’s mind)",
            "definition": "to correctly distinguish one person from other people.  The twins look exactly alike. Not even their mother can keep them straight."
        },
        {
            "id": 241,
            "phrase": "keep sight of someone or something",
            "definition": "to keep someone or something in view.  Try to keep sight of the skier.  I want to keep sight of the children at all times."
        },
        {
            "id": 242,
            "phrase": "Keep smiling.",
            "definition": "a good-bye phrase encouraging someone to have good spirits.  John: Things are really getting tough. Sue: Well, just keep smiling. Things will get better.  Bill: What a day! I’m exhausted and depressed. Bob: Not to worry. Keep smiling. Things will calm down."
        },
        {
            "id": 243,
            "phrase": "keep someone at something",
            "definition": "to make sure someone continues to work at something.  Please keep Walter at his chores.  I was so sick I couldn’t keep myself at my work."
        },
        {
            "id": 244,
            "phrase": "keep someone company",
            "definition": "to sit or stay with someone, especially someone who is lonely.  I kept my uncle company for a few hours. He was very grateful for someone to keep him company. He gets very lonely."
        },
        {
            "id": 245,
            "phrase": "keep someone down",
            "definition": "to prevent someone from advancing or succeeding.  His lack of a degree will keep him down.  I don’t think that this problem will keep her down."
        },
        {
            "id": 246,
            "phrase": "keep someone from doing something",
            "definition": "to prevent someone from doing something.  I kept the child from falling in the lake by grabbing his collar.  I try to keep myself from overeating, but I seem to fail frequently."
        },
        {
            "id": 247,
            "phrase": "keep someone from someone or something",
            "definition": "to hold someone away from someone or something; to prevent someone from getting at someone or something.  You must keep the child from her mother until the mother is infection-free. It is hard to keep a child from the playground, even a sick child.  I could hardly keep myself from the dessert table."
        },
        {
            "id": 248,
            "phrase": "keep someone honest",
            "definition": "to manage to make someone behave honestly and fairly and tell the truth.  I love to tell about our vacations, and my wife is usually with me to keep me honest."
        },
        {
            "id": 249,
            "phrase": "keep someone in (a state of) suspense",
            "definition": "to make someone wait anxiously for something.  Tell us what happened. Don’t keep us in a state of suspense.  Don’t keep me in suspense!"
        }
    ]
}