{
    "dictionary": [
        {
            "id": 0,
            "phrase": "rise to the bait",
            "definition": "to respond to an allurement; to fall for an enticement or fall into a trap. (Alludes to a fish coming up from deep water to seize bait.) _ You can get him here easily. Tell him that there will be lots of food and he will rise to the bait.  He rose to the bait and did just as he was expected to do."
        },
        {
            "id": 1,
            "phrase": "rise to the challenge",
            "definition": "to accept a challenge. (Usually in reference to success with the challenge.) _You can depend on Kelly to rise to the challenge. We were not able to rise to the challenge and we lost the contract."
        },
        {
            "id": 2,
            "phrase": "rise to the occasion",
            "definition": "to meet the challenge of an event; to try extra hard to do a task.  John was able to rise to the occasion and make the conference a success.  It was a big challenge, but he rose to the occasion."
        },
        {
            "id": 3,
            "phrase": "rise to the top",
            "definition": "to move or float to something, such as the top, surface, etc.  The cream will rise to the top.  The lighter oil rose to the top and we scooped it up and saved it."
        },
        {
            "id": 4,
            "phrase": "rise up",
            "definition": "1. to come up; to ascend.  The water is rising up fast. You had better get to higher ground.  As the water rose up, it covered the fields and streets. 2. to get up from lying down.  The deer rose up and darted off into the woods.  I rose up and brushed my clothing."
        },
        {
            "id": 5,
            "phrase": "rise (up) against someone or something",
            "definition": "to challenge someone or something; to rebel against someone or something. The citizens rose up against their elected officials. They rose up against the abusive power of the government."
        },
        {
            "id": 6,
            "phrase": "risk one’s neck (to do something)",
            "definition": "to accept the risk of physical harm in order to accomplish something.  Look at that traffic! I refuse to risk my neck just to cross the street to buy a paper.  I refuse to risk my neck at all."
        },
        {
            "id": 7,
            "phrase": "risk something on someone or something",
            "definition": "to chance losing something on someone or something.  I wouldn’t risk any money on him. He’s a poor credit risk. Don’t risk your life on his being there to help you."
        },
        {
            "id": 8,
            "phrase": "rival someone in something",
            "definition": "to have a quality or status that is comparable to that of someone else.  I would say that Jane rivals Dave in the ability to find the essential elements of a problem and deal with them swiftly.  No one rivals Ted in pitching a baseball."
        },
        {
            "id": 9,
            "phrase": "rivet someone’s attention",
            "definition": "to keep someone’s attention fixed [on something].  The movie riveted the audience’s attention.  Professor Jones’s lecture riveted the students’ attention."
        },
        {
            "id": 10,
            "phrase": "riveted to the ground",
            "definition": "[of someone or someone’s feet] unable to move.  I was riveted to the ground out of fear.  My feet were riveted to the ground and I could not move an inch."
        },
        {
            "id": 11,
            "phrase": "road hog",
            "definition": "someone who drives carelessly and selfishly.  Look at that road hog driving in the middle of the road and stopping other drivers from passing him.  That road hog nearly knocked the children over. He was driving too fast."
        },
        {
            "id": 12,
            "phrase": "The road to hell is paved with good intentions.",
            "definition": "Prov. People often mean well but do bad things. (Can be a strong rebuke, implying that the person you are addressing did something bad and his or her good intentions do not matter.) _ Jane: I’m sorry. I didn’t mean to hurt your feelings; I only wanted to help you. Jane: Oh, yeah? The road to hell is paved with good intentions."
        },
        {
            "id": 13,
            "phrase": "roar at someone or something",
            "definition": "to bellow or bawl at someone or something.  Don’t roar at me! Control your temper. The lion roared at the hyena, who ran off."
        },
        {
            "id": 14,
            "phrase": "roar away",
            "definition": "to speed away, making a loud clamor.  The car roared away into the night with tires screeching.  The train roared away, carrying Andy to Canada."
        },
        {
            "id": 15,
            "phrase": "roar something out†",
            "definition": "to bellow something out loudly.  Walter roared his protest out so everyone knew how he felt.  Jane roared out her criticism."
        },
        {
            "id": 16,
            "phrase": "rob Peter to pay Paul",
            "definition": "to take or borrow from one in order to give or pay something owed to another. Why borrow money to pay your bills? That’s just robbing Peter to pay Paul.  There’s no point in robbing Peter to pay Paul. You will still be in debt."
        },
        {
            "id": 17,
            "phrase": "rob someone blind",
            "definition": "1. Fig. to steal freely from someone.  Her maid was robbing her blind. I don’t want them to rob me blind. Keep an eye on them. 2. Fig. to overcharge someone.  You are trying to rob me blind. I won’t pay it! _ Those auto repair shops can rob you blind if you don’t watch out."
        },
        {
            "id": 18,
            "phrase": "rob someone of something",
            "definition": "to deprive someone of something, not necessarily by theft. What you have done has robbed me of my dignity! _If you do that, you will rob yourself of your future."
        },
        {
            "id": 19,
            "phrase": "rob the cradle",
            "definition": "to marry or date someone who is much younger than oneself.  I hear that Bill is dating Ann. Isn’t that sort of robbing the cradle? She’s much younger than he is.  Uncle Bill—who is nearly eighty—married a thirty-year-old woman. That is really robbing the cradle."
        },
        {
            "id": 20,
            "phrase": "rock around",
            "definition": "to tilt or totter about.  The boat rocked around, tossing the passengers to and fro.  The road was bumpy and the huge car rocked around."
        },
        {
            "id": 21,
            "phrase": "*(rock) bottom",
            "definition": "the lowest point or level. (*Typically: be at ~; hit ~; reach ~.) _ The value of the goods is at rock bottom right now.  Prices have reached rock bottom.  When my life hit bottom, I gradually began to feel much better."
        },
        {
            "id": 22,
            "phrase": "rock someone to something",
            "definition": "to help someone, usually an infant, get to sleep by rocking in a rocking chair, cradle, or carriage.  It is best to rock the baby to sleep after you feed her.  Somehow she learned to rock herself to sleep."
        },
        {
            "id": 23,
            "phrase": "rock the boat",
            "definition": "to do something to move a boat from side to side, causing it to rock. (Often in a negative sense.) _ Sit down and stop rocking the boat. You’ll turn it over!"
        },
        {
            "id": 24,
            "phrase": "rocket (in)to something",
            "definition": "[for a projectile] to ascend into the sky or into space; [for something] to shoot rapidly into something.  The space shuttle rocketed into space.  The locomotive rocketed into the darkness."
        },
        {
            "id": 25,
            "phrase": "rocket something into something",
            "definition": "to send something somewhere— usually into space—by rocket. The government rocketed the satellite into space. Someone suggested rocketing our waste into space."
        },
        {
            "id": 26,
            "phrase": "a rocky road",
            "definition": "a difficult period of time. Bob’s been going down quite a rocky road since his divorce."
        },
        {
            "id": 27,
            "phrase": "Roger (wilco).",
            "definition": "Yes. (From aircraft radio communication. Wilco = “will comply.”) _John: Can you do this right now? Bob: Roger.  Mary: I want you to take this over to the mayor’s office. Bill: Roger wilco."
        },
        {
            "id": 28,
            "phrase": "roll about",
            "definition": "to move about, turning or rotating, as a wheel or a ball.  The ball rolled about awhile and then came to rest. His eyes rolled about in amazement before he spoke."
        },
        {
            "id": 29,
            "phrase": "roll along",
            "definition": "[for wheels or something on wheels] to move along, smoothly and rapidly.  The wheels of the cart rolled along, making a grinding noise as they went.  Our car rolled along rapidly toward our destination."
        },
        {
            "id": 30,
            "phrase": "roll around",
            "definition": "to move about, rotating, turning over, turning, or moving on wheels. The baby rolled around on the f loor, giggling and cooing. The toy truck won’t roll around anymore."
        },
        {
            "id": 31,
            "phrase": "roll away",
            "definition": "to move away, rotating, turning over, turning, or moving on wheels. The ball rolled away and fell down a storm sewer. The cart rolled away, and we had to chase it down the hill."
        },
        {
            "id": 32,
            "phrase": "roll back",
            "definition": "[for something] to return, rotating or turning or moving on wheels.  I rolled the ball away, thinking it would roll back. It didn’t.  I struck the golf ball out of the sand trap, but it rolled back."
        },
        {
            "id": 33,
            "phrase": "roll by",
            "definition": "to pass by, rotating, as a wheel or a ball; to move past, rolling on wheels.  The wheel of a car rolled by, all by itself. It must have come off a car somewhere down the road. The traffic rolled by relentlessly."
        },
        {
            "id": 34,
            "phrase": "roll down",
            "definition": "to move downward, rotating, as a wheel or a ball, or to move downward on wheels.  I pushed the wagon up the driveway, and it rolled down again.  Don’t place the cart at the top of the hill. It will roll down."
        },
        {
            "id": 35,
            "phrase": "roll down something",
            "definition": "to move downward, along something, rotating, as a wheel or a ball, or moving downward on wheels.  The ball rolled down the hall to the end.  The cart went rolling down the hill all by itself."
        },
        {
            "id": 36,
            "phrase": "roll in",
            "definition": "to come in large numbers or amounts, easily, as if rolling. (Alludes to the arrival of many wheeled conveyances.) _We didn’t expect many people at the party, but they just kept rolling in. Money is simply rolling in for our charity."
        },
        {
            "id": 37,
            "phrase": "roll in something",
            "definition": "to rotate about in something.  What is that dog rolling in? _ We had fun rolling in the leaves."
        },
        {
            "id": 38,
            "phrase": "roll in(to some place)",
            "definition": "to arrive at a place; to come into some place.  The two cars rolled into the parking lot at about the same time.  What time did they roll in?"
        },
        {
            "id": 39,
            "phrase": "roll off (someone or something)",
            "definition": "to flow or fall off someone or something.  The ball rolled off the shelf and bounced across the room.  The ball rolled off and struck the lampshade."
        },
        {
            "id": 40,
            "phrase": "roll on",
            "definition": "[for something] to continue rolling.  The ball rolled on and on.  The cart came rolling down the hill and rolled on for a few yards at the bottom."
        },
        {
            "id": 41,
            "phrase": "roll one’s sleeves up†",
            "definition": "to turn one’s sleeves upward, exposing the arms. He rolled his sleeves up and began to wash the dishes.  Don rolled up his sleeves so he would be cooler."
        },
        {
            "id": 42,
            "phrase": "roll (oneself) up in something",
            "definition": "to spin or swivel oneself so as to be contained in a coil of something.  Roll yourself up in some cloth and go to the costume party as a mummy.  The caterpillar rolled up in a leaf."
        },
        {
            "id": 43,
            "phrase": "roll out the red carpet (for someone)",
            "definition": "to unwind a roll of red carpet for someone important to walk on.  The city council decided to roll out the red carpet for the visit of the foreign prince."
        },
        {
            "id": 44,
            "phrase": "roll over",
            "definition": "to turn over; to rotate one half turn.  The old man rolled over and started snoring again. Please roll over and give me some more space in the bed."
        },
        {
            "id": 45,
            "phrase": "roll over and play dead",
            "definition": "to just give up and be unable to cope with life or a problem. Why can’t I complain about this? Am I supposed to roll over and play dead?"
        },
        {
            "id": 46,
            "phrase": "roll over something",
            "definition": "[for something that rolls] to pass over something.  The wheelbarrow rolled over the hose, making the water squirt off and on. After all the traffic had rolled over Timmy’s ball, there was very little left to it."
        },
        {
            "id": 47,
            "phrase": "roll prices back†",
            "definition": "to reduce prices.  The store rolled all its prices back for the sale.  The protesters demanded that the big oil companies roll back their prices."
        },
        {
            "id": 48,
            "phrase": "roll someone or something over",
            "definition": "to turn someone or something over. Bobby rolled Billy over and began tickling him ruthlessly in the tummy. Mary rolled the stone over, hoping to find a snake underneath."
        },
        {
            "id": 49,
            "phrase": "roll someone or something (up) in something",
            "definition": "to turn or wrap someone or something so as to contain someone or something in something.  Roll this painting up in a sheet of heavy wrapping paper.  They rolled the burning man up in a blanket to put out the f lames."
        },
        {
            "id": 50,
            "phrase": "roll something away†",
            "definition": "to cause something to move away, rotating, turning over, turning, or moving on wheels.  Jane rolled the ball away and it was lost. Jane rolled away the ball."
        },
        {
            "id": 51,
            "phrase": "roll something back†",
            "definition": "to return something to someone by rotating it, as with a wheel or a ball, or moving it back on wheels.  I intercepted the ball and rolled it back.  Jane rolled back the ball."
        },
        {
            "id": 52,
            "phrase": "roll something down†",
            "definition": "1. to move something down, making it rotate like a wheel or a ball, or moving it on wheels.  Don’t carry the ball down; roll it down! _ I rolled down the ball as you asked. 2. to crank down something, such as a car window.  Please roll the window down and get some air in this car.  Please roll down the car window."
        },
        {
            "id": 53,
            "phrase": "roll something down something",
            "definition": "to cause something to move down along something, rotating it like a wheel or a ball.  Claire rolled the bowling ball down the alley for a strike.  Roll the barrel down the ramp carefully. It is heavy."
        },
        {
            "id": 54,
            "phrase": "roll something in†",
            "definition": "to bring something in by rotating it like a wheel or a ball or by moving it on wheels.  She put the round table on its edge and rolled it in. Then she went out and got the chairs before the rain started.  The waiters rolled in the table with the wedding cake on it."
        },
        {
            "id": 55,
            "phrase": "roll something in something",
            "definition": "to turn something over and over in something, as if to coat the thing being rolled.  Tony rolled each of the meatballs in f lour and popped them into the hot oil.  Roll each of these cookies in powdered sugar."
        },
        {
            "id": 56,
            "phrase": "roll something out†",
            "definition": "1. to bring or take something out by rolling it; to push something out on wheels.  Jane rolled her bike out to show it off.  Alice rolled out her bicycle for us to see. 2. to flatten something by rolling it. You should roll the pastry out first. They rolled out the steel in a huge mill."
        },
        {
            "id": 57,
            "phrase": "roll something over†",
            "definition": "to renew a financial instrument as it expires.  Do you plan to roll this certificate of deposit over? _ Are you going to roll over your certificates of deposit?"
        },
        {
            "id": 58,
            "phrase": "roll something to someone or something",
            "definition": "to send something revolving toward someone or something or moving toward someone or something on wheels.  I rolled the ball to the baby, who just sat and looked at it.  The blow with the mallet rolled the croquet ball to the wicket."
        },
        {
            "id": 59,
            "phrase": "roll something up†",
            "definition": "to coil or rotate something into a coil or roll of something.  I rolled the poster up and put it back in its mailing tube.  I have to roll up this paper."
        },
        {
            "id": 60,
            "phrase": "roll something up† (into something)",
            "definition": "1. to include something into something that is being rotated into a coil.  I guess I accidentally rolled the letter up into the poster that was lying on my desk. I rolled up the letter into the poster. 2. to make something into a round shape by rolling it.  He rolled the gum up into a ball and tossed it away.  Jane rolled up the dough into a ball."
        },
        {
            "id": 61,
            "phrase": "roll with the punches",
            "definition": "to absorb the force of a blow, as in boxing.  You have to learn to roll with the punches. Accept what is dealt to you. Paul could never roll with the punches. He always had to get even."
        },
        {
            "id": 62,
            "phrase": "*rolling in the aisles",
            "definition": "[of an audience] wild with laughter. (*Typically: get them ~; have them ~; leave them ~.) _I have the best jokes you’ve ever heard. I’ll have them rolling in the aisles.  What a great performance. We had them rolling in the aisles."
        },
        {
            "id": 63,
            "phrase": "A rolling stone gathers no moss.",
            "definition": "Prov. A person who does not settle down is not attached to anything or anyone. (Can be said in admiration or in censure, depending on whether or not the speaker feels it is good to be attached to something or someone.) _I worry about Tom. He’s never lived in the same place for two years in a row, and he keeps changing jobs. A rolling stone gathers no moss."
        },
        {
            "id": 64,
            "phrase": "Rome was not built in a day.",
            "definition": "Prov. It takes a lot of time to achieve something important.  Professor: When will you finish your research project? Student: It’ll take me a while. Rome wasn’t built in a day, you know."
        },
        {
            "id": 65,
            "phrase": "romp around",
            "definition": "to run and bounce around playfully. The horses were in the meadow, romping around in the crisp autumn air.  The children need to get out and romp around."
        },
        {
            "id": 66,
            "phrase": "romp through something",
            "definition": "to run through something fast and playfully.  The conductor romped through the slow movement of the symphony as if it were a march.  The cast romped through the last act, knowing that the play would be closed that very night."
        },
        {
            "id": 67,
            "phrase": "roof something over†",
            "definition": "to build a roof over something; to provide something with a roof.  After the destructive storm they had to roof the shed over so that the cow would have some shelter.  We will roof over the patio and turn the area into a porch."
        },
        {
            "id": 68,
            "phrase": "room and board",
            "definition": "food to eat and a place to live; the cost of food and lodging.  That college charges too much for room and board.  How much is your room and board?"
        },
        {
            "id": 69,
            "phrase": "room together",
            "definition": "[for two or more people] to share a room, as in a college dormitory.  Sarah and I roomed together in college.  We don’t want to room together anymore."
        },
        {
            "id": 70,
            "phrase": "room with someone",
            "definition": "to share a room with someone, as in college.  I need someone to room with me next year.  No one wants to room with Kelly."
        },
        {
            "id": 71,
            "phrase": "root around (for something)",
            "definition": "to dig or shuffle in or through something, looking for something. Alice rooted around in her desk drawer for a pen. I’ll root around here and see if I can find it."
        },
        {
            "id": 72,
            "phrase": "root for someone or something",
            "definition": "to cheer and encourage someone or something.  Are you rooting for anyone in particular, or are you just shouting because you’re excited? _ I’m rooting for the home team."
        },
        {
            "id": 73,
            "phrase": "*the root of the problem",
            "definition": "an understanding of the causes or basis of a problem. (*Typically: determine ~; figure out ~; find ~; get to ~; get at ~.) _ It will take a little more study to get to the root of the problem.  Let’s stop avoiding the issue and get at the root of the problem."
        },
        {
            "id": 74,
            "phrase": "root something in something",
            "definition": "to start a plant growing roots in something.  I tried to root the plants in sand, but they died.  You have to root this kind of tree in very rich soil."
        },
        {
            "id": 75,
            "phrase": "root something out†",
            "definition": "to get rid of something completely; to destroy something to its roots or core.  No government will ever root out crime completely.  The principal wants to root out troublemakers at the local school."
        },
        {
            "id": 76,
            "phrase": "root something up†",
            "definition": "[for a pig] to find something in the ground by digging with its nose.  The pigs will root your plants up if they get out of their pen.  The pigs will root up your plants if they get out of their pen."
        },
        {
            "id": 77,
            "phrase": "rooted in something",
            "definition": "based on something; connected to a source or cause.  The civil war was rooted in old cultural hatred.  This fictional book was rooted in actual events."
        },
        {
            "id": 78,
            "phrase": "*rooted to something",
            "definition": "[of someone] firmly attached to something. (*Typically: be ~; become ~.) _ She is firmly rooted to her homeland and has no intention of emigrating.  The farmer is rooted to the land and will not leave."
        },
        {
            "id": 79,
            "phrase": "*rooted to the spot",
            "definition": "unable to move because of fear or surprise. (*Typically: appear to be ~; be ~; become ~.) _Jane stood rooted to the spot when she saw the ghostly figure. Mary stood rooted to the spot when the thief snatched her bag."
        },
        {
            "id": 80,
            "phrase": "rope someone into doing something",
            "definition": "to persuade or trick someone into doing something. I don’t know who roped me into doing this, but I don’t want to do it.  See if you can rope somebody into taking this to the post office."
        },
        {
            "id": 81,
            "phrase": "rope someone or an animal up†",
            "definition": "to tie someone or an animal up with a rope.  Rope this guy up tight so he won’t get away.  The cowboy roped up the steer."
        },
        {
            "id": 82,
            "phrase": "rope something off†",
            "definition": "to isolate something with a rope barrier. The police roped the scene of the accident off. The police roped off the scene of the accident."
        },
        {
            "id": 83,
            "phrase": "rope something together†",
            "definition": "to tie or bind up a thing or things with rope.  Rope this carton together and put it in the trunk of the car. Rope together these two packages and take them to the truck."
        },
        {
            "id": 84,
            "phrase": "*the ropes",
            "definition": "knowledge of how to do something; how to work something. (*Typically: know ~; learn ~; show someone ~; teach someone ~.) _ I’ll be able to do my job very well when I know the ropes.  John is very slow to learn the ropes."
        },
        {
            "id": 85,
            "phrase": "A rose by any other name would smell as sweet.",
            "definition": "Prov. The nature of a thing is more important than what it is called. (From Shakespeare’s play, Romeo and Juliet.) _ Bob was upset when his job title was changed from “administrative assistant” to “secretary.” We tried to convince him that a rose by any other name would smell as sweet."
        },
        {
            "id": 86,
            "phrase": "rot away",
            "definition": "to decompose; to decompose and fall away.  The fallen trees rotted away and surrendered their nutrients to the soil.  As the wood rotted away, it became rich humus."
        },
        {
            "id": 87,
            "phrase": "rot off",
            "definition": "to decompose. If you don’t clean and repaint that old windowsill, it will rot off.  A few old branches finally rotted off, but the ancient tree looked as if it would survive the wet spell."
        },
        {
            "id": 88,
            "phrase": "rot out",
            "definition": "to decompose and fall out. If you don’t clean your teeth regularly, they’ll rot out! _ Some of the rafters in the shed rotted out, but we replaced them easily."
        },
        {
            "id": 89,
            "phrase": "rotate on something",
            "definition": "to spin on something; to pivot on something.  This wheel rotates on this little red jewel on the main frame of the watch.  The record rotates on this device, which is called a turntable."
        },
        {
            "id": 90,
            "phrase": "a rotten apple",
            "definition": "a single bad person or thing.  There always is a rotten apple to spoil it for the rest of us.  Tom sure has turned out to be the rotten apple."
        },
        {
            "id": 91,
            "phrase": "The rotten apple spoils the barrel.",
            "definition": "Prov. A bad person influences everyone he or she comes into contact with, making them bad too.  Helen is the rotten apple that spoils the barrel in our office. Everyone sees her come in late to work and take long coffee breaks, and they think, “Why can’t I do the same?”"
        },
        {
            "id": 92,
            "phrase": "rotten luck",
            "definition": "bad luck.  Of all the rotten luck! _ I’ve had nothing but rotten luck all day."
        },
        {
            "id": 93,
            "phrase": "rotten to the core",
            "definition": "really bad; corrupt.  That lousy punk is rotten to the core.  The entire administration is rotten to the core."
        },
        {
            "id": 94,
            "phrase": "rough it",
            "definition": "to live without luxury; to live simply; to camp out.  During the blackout, we roughed it without electricity.  The campers roughed it in the remote cabin for a week."
        },
        {
            "id": 95,
            "phrase": "rough someone up†",
            "definition": "to beat someone up; to maltreat someone. Am I going to have to rough you up, or will you cooperate? _ The crooks roughed up the old lady before taking her purse."
        },
        {
            "id": 96,
            "phrase": "rough something in†",
            "definition": "to construct or draw something initially, temporarily, or crudely.  The carpenter roughed the doorways in without consulting the plans.  The carpenter roughed in the doorways without consulting the plans."
        },
        {
            "id": 97,
            "phrase": "rough something out†",
            "definition": "to make a rough sketch of something.  I will rough it out and have one of the staff artists attend to the details.  Jane roughed out a picture of the proposed building."
        },
        {
            "id": 98,
            "phrase": "rough something up†",
            "definition": "to scrape or rub something in a way that makes it rough.  All you have to do is rough the ground up, sow the seeds, and then water them.  Rough up the surface a little before you paint it."
        },
        {
            "id": 99,
            "phrase": "rough stuff",
            "definition": "unnecessary roughness; physical violence or threats of violence.  Okay, let’s cut out the rough stuff! _ There was too much rough stuff in the football game."
        },
        {
            "id": 100,
            "phrase": "rough-and-ready",
            "definition": "strong, active, and ready for anything.  John is not exactly rough-and-ready, but he is a moderately good athlete. Ralph is very rough-and-ready, but his table manners are very bad. "
        },
        {
            "id": 101,
            "phrase": "round someone or something up†",
            "definition": "to locate and gather someone or something. Please round the suspects up for questioning.  The police rounded up the two possible suspects."
        },
        {
            "id": 102,
            "phrase": "round something down†",
            "definition": "to reduce a fractional part of a number to the next lowest whole number.  You can round this figure down if you want. It won’t affect the total all that much. Please round down all figures having fractions less than one-half."
        },
        {
            "id": 103,
            "phrase": "round something off†",
            "definition": "to change a number to the next higher or lower whole number.  You should round 8.122 off.  I rounded off 8.789 to 9."
        },
        {
            "id": 104,
            "phrase": "round something off† (with something)",
            "definition": "to finish something with something; to complement something with something. We rounded the meal off with a fine cognac. We rounded off the meal with a sinful dessert."
        },
        {
            "id": 105,
            "phrase": "round something out†",
            "definition": "to complete or enhance something.  We will round the evening out with dessert at a nice restaurant.  They rounded out the meal with dessert."
        },
        {
            "id": 106,
            "phrase": "round something up†",
            "definition": "1. to collect a group of people or things; to organize people or things into a group.  The cowboys rounded up the cattle for market.  See if you can round some helpers up. 2. to change a number to the next higher whole number.  I rounded up 8.789 to 9.  You should round $65.99 up to $66."
        },
        {
            "id": 107,
            "phrase": "a rounding error",
            "definition": "a large amount of money that is relatively small in comparison to a much larger sum.  To a large company like Smith &amp; Co., a few thousand dollars is just a rounding error. It’s not a lot at all."
        },
        {
            "id": 108,
            "phrase": "round-trip ticket",
            "definition": "a ticket (for a plane, train, bus, etc.) that allows one to go to a destination and return.  A round-trip ticket is usually cheaper than two one-way tickets.  How much is a round-trip ticket to San Francisco?"
        },
        {
            "id": 109,
            "phrase": "rouse someone from something",
            "definition": "to awaken someone from something; to cause someone to come out of something.  I roused Tom from his nap and sent him on his way.  We could not rouse her from her deep sleep."
        },
        {
            "id": 110,
            "phrase": "rouse someone out of something",
            "definition": "to awaken someone out of a state, such as sleep. It was almost impossible to rouse George out of his sleep. They could not rouse us out of our drowsy state."
        },
        {
            "id": 111,
            "phrase": "rouse someone to something",
            "definition": "to stir someone to something. I will rouse the workers to action. They will work or have to find other jobs.  The speech by the president roused the citizens to action."
        },
        {
            "id": 112,
            "phrase": "route someone or something around something",
            "definition": "to send someone or something on a path that avoids something.  The travel agent routed us around the congestion of the big city.  Due to the storm, they routed the trains around the fallen bridge."
        },
        {
            "id": 113,
            "phrase": "route something to someone",
            "definition": "to send something along a particular path to someone. Try to route this to Walter, who is on a ship at sea. I’ll get the name of the ship for you.  I will route a copy of the invoice to you."
        },
        {
            "id": 114,
            "phrase": "row (someone or something) out† to something",
            "definition": "to carry someone or something in a rowboat from the shore out to something. Will you row me out to the island? _I rowed out all the visitors to the little island."
        },
        {
            "id": 115,
            "phrase": "a royal pain",
            "definition": "a great annoyance.  This guy’s a royal pain, but we have to put up with him because he’s the boss."
        },
        {
            "id": 116,
            "phrase": "the royal treatment",
            "definition": "very good treatment; very good and thoughtful care of a person.  I was well cared for. They gave me the royal treatment.  I got the royal treatment when I stayed at that expensive hotel."
        },
        {
            "id": 117,
            "phrase": "rub (away) at something",
            "definition": "to chafe or scrape something, repeatedly.  The side of his shoe rubbed away at the side of his desk until the paint wore off. Don’t rub at your sore. It will get worse."
        },
        {
            "id": 118,
            "phrase": "rub off ((of ) something)",
            "definition": "[for something] to become detached from something because of incidental rubbing or scraping. (Of is usually retained before pronouns.) _ The label rubbed off this can. What do you think it is? _ I can’t tell what it is. The label rubbed off."
        },
        {
            "id": 119,
            "phrase": "rub off (on someone)",
            "definition": "[for a characteristic of one person] to seem to transfer to someone else.  I’ll sit by Ann. She has been lucky all evening. Maybe it’ll rub off on me.  Sorry. I don’t think that luck rubs off."
        },
        {
            "id": 120,
            "phrase": "rub off on(to) someone or something",
            "definition": "[for something, such as a coating] to become transferred to someone or something through the contact of rubbing. Look what rubbed off on me! _ The wet paint rubbed off onto my pants leg."
        },
        {
            "id": 121,
            "phrase": "rub salt in a wound",
            "definition": "to deliberately make someone’s unhappiness, shame, or misfortune worse.  Don’t rub salt in the wound by telling me how enjoyable the party was.  Bill is feeling miserable about losing his job and Bob is rubbing salt into the wound by saying how good his replacement is."
        },
        {
            "id": 122,
            "phrase": "rub someone or an animal down†",
            "definition": "to stroke or massage someone or an animal, for muscular well-being.  Sam rubbed his horse down after his ride. He rubbed down his horse."
        },
        {
            "id": 123,
            "phrase": "rub someone or something with something",
            "definition": "to wipe someone or something with something.  The mother rubbed the baby gently with a soft cloth.  Todd rubbed the surface of the car with a rag to polish it."
        },
        {
            "id": 124,
            "phrase": "rub someone out†",
            "definition": "Sl. to kill someone. (Underworld.) _The gunman was eager to rub somebody out. The crooks tried to rub out the witness."
        },
        {
            "id": 125,
            "phrase": "rub someone(‘s fur) the wrong way",
            "definition": "to irritate someone.  I’m sorry I rubbed your fur the wrong way. I didn’t mean to upset you.  Don’t rub her the wrong way!"
        },
        {
            "id": 126,
            "phrase": "rub someone’s nose in it",
            "definition": "to remind one of something one has done wrong; to remind one of something bad or unfortunate that has happened. (Alludes to a method of housebreaking pets.) _ When Bob failed his exam, his brother rubbed his nose in it.  Mary knows she shouldn’t have broken off her engagement. Don’t rub her nose in it."
        },
        {
            "id": 127,
            "phrase": "rub something against someone or something",
            "definition": "to scrape or chafe something against someone or something repeatedly.  The cat kept rubbing its tail against me.  I wish John would stop rubbing his hand against my leg."
        },
        {
            "id": 128,
            "phrase": "rub something away†",
            "definition": "to remove something by chafing or rubbing. See if you can rub some of the dirt away. Rub away the dirt if you can."
        },
        {
            "id": 129,
            "phrase": "rub something in†",
            "definition": "to keep reminding one of one’s failures; to nag someone about something.  I like to rub it in. You deserve it! _ Why do you have to rub in everything I do wrong?"
        },
        {
            "id": 130,
            "phrase": "rub something out†",
            "definition": "to obliterate something by rubbing.  See if you can rub those stains out.  Rub out the graffiti on the side of the car if you can."
        },
        {
            "id": 131,
            "phrase": "rub something over something",
            "definition": "to cover something with something, spreading it by rubbing. The chef rubbed the herbal butter over the skin of the turkey.  Please rub the lotion over my back."
        },
        {
            "id": 132,
            "phrase": "rub something together",
            "definition": "to press two things together and move them back and forth.  Sam rubbed his fingers together, indicating that he needed some money before he could continue.  Mary rubbed her hands together to get them warmed up."
        },
        {
            "id": 133,
            "phrase": "rub something up†",
            "definition": "to raise something, such as the nap of a rug, by rubbing.  When you run the vacuum cleaner across the f loor, you rub the nap of the rug up and get the dirt out.  Don’t rub up the nap."
        },
        {
            "id": 134,
            "phrase": "rub (up) against someone or something",
            "definition": "to bump or scrape against someone or something.  The cat rubbed up against me and seemed friendly.  The side of the car rubbed against the fence."
        },
        {
            "id": 135,
            "phrase": "ruffle its feathers",
            "definition": "[for a bird] to point its feathers outward.  The bird ruff led its feathers when it was annoyed. My parrot ruff les its feathers whenever it is ready to preen itself."
        },
        {
            "id": 136,
            "phrase": "ruffle someone’s feathers",
            "definition": "to irritate or annoy someone.  I didn’t mean to ruff le his feathers. I just thought that I would remind him of what he promised us."
        },
        {
            "id": 137,
            "phrase": "ruffle something up†",
            "definition": "to raise something, such as feathers, up or outward.  The bird ruff led its feathers up and started to preen.  It ruff led up its feathers."
        },
        {
            "id": 138,
            "phrase": "rug rat",
            "definition": "Sl. a small child, especially an infant or toddler. (Also a term of address.) _ You got any rug rats at your house? _ Hey, you cute little rug rat, come over here."
        },
        {
            "id": 139,
            "phrase": "the ruin of someone or something",
            "definition": "the cause of destruction; a failure. Your bad judgment will be the ruin of this company! _ The greedy politicians were the ruin of the old empire."
        },
        {
            "id": 140,
            "phrase": "rule against someone or something",
            "definition": "to give a judgment against someone or something. The judge ruled against the prosecutor.  The judge ruled against my motion."
        },
        {
            "id": 141,
            "phrase": "a rule of thumb",
            "definition": "a general principle developed through experiential rather than scientific means.  As a rule of thumb, I move my houseplants outside in May.  Going by a rule of thumb, we stop for gas every 200 miles when we are traveling."
        },
        {
            "id": 142,
            "phrase": "rule on something",
            "definition": "to give a decision or judgment about something.  How long will it be before the court rules on your petition? _ The boss will rule on your request tomorrow."
        },
        {
            "id": 143,
            "phrase": "rule over someone or something",
            "definition": "to serve as the boss or chief over someone or something.  I guess you could say that the boss rules over me.  The president of a democracy doesn’t really rule over the country."
        },
        {
            "id": 144,
            "phrase": "rule someone or something out†",
            "definition": "to prevent, disqualify, overrule, or cancel someone or something.  John’s bad temper rules him out for the job.  The rainy weather ruled out a picnic for the weekend."
        },
        {
            "id": 145,
            "phrase": "rule the roost",
            "definition": "to be the boss or manager, especially at home.  Who rules the roost at your house? _ Our new office manager really rules the roost."
        },
        {
            "id": 146,
            "phrase": "rule with a velvet glove",
            "definition": "to rule in a very gentle way.  She rules with a velvet glove, but she gets things done, nonetheless.  He may appear to rule with a velvet glove, but he is really quite cruel."
        },
        {
            "id": 147,
            "phrase": "rule with an iron fist",
            "definition": "to rule in a very stern manner. The dictator ruled with an iron fist and terrified the citizens.  My boss rules with an iron fist. I’m looking for a new job."
        },
        {
            "id": 148,
            "phrase": "rummage around (somewhere) (for something)",
            "definition": "to move things about haphazardly while looking for something somewhere. Alice rummaged around in the drawer for a candy bar she had been saving.  After she rummaged around for the candy bar, she found it.  She rummaged around in the old trunk."
        },
        {
            "id": 149,
            "phrase": "rummage through something",
            "definition": "to move things about haphazardly while searching through something.  I rummaged through my top drawer, looking for any two socks that matched. Mary spent some time rummaging through the toolbox before she found what she was looking for."
        },
        {
            "id": 150,
            "phrase": "rumor has it that...",
            "definition": "there is a rumor that....  Rumor has it that Fred is seeing Mary and that they are engaged."
        },
        {
            "id": 151,
            "phrase": "rump session",
            "definition": "a meeting held after a larger meeting.  A rump session continued after the meeting was adjourned.  A lot of business was conducted in the rump session."
        },
        {
            "id": 152,
            "phrase": "rumple someone or something up†",
            "definition": "to bring disorder to someone[’s clothing] or something; to wrinkle someone or something. One of the little boys knocked another boy down and rumpled him up.  He rumpled up Dan’s shirt."
        },
        {
            "id": 153,
            "phrase": "run a comb through something",
            "definition": "to comb one’s hair quickly.  Run a comb through your hair after you come back in the house. She ran a comb through Timmy’s hair, and tried to make him look presentable."
        },
        {
            "id": 154,
            "phrase": "run a make on someone",
            "definition": "to perform an identity check on someone.  The cops ran a make on Lefty and learned about his prison record.  We tried to run a make on him and came up with nothing."
        },
        {
            "id": 155,
            "phrase": "run a red light",
            "definition": "to pass through an intersection having a red traffic light without stopping.  Sam got a ticket for running a red light."
        },
        {
            "id": 156,
            "phrase": "run a tab",
            "definition": "to accumulate charges on a bill at a bar or tavern.  They won’t let me run a tab here. I have to pay for each drink as I order it."
        },
        {
            "id": 157,
            "phrase": "run across something",
            "definition": "to cross something while running. The joggers all ran across the bridge together. The mice ran across the f loor, not knowing that a cat was watching them."
        },
        {
            "id": 158,
            "phrase": "run after someone",
            "definition": "to chase someone of the opposite sex hoping for a date or some attention.  Is John still running after Ann? _ No, Ann is running after John."
        },
        {
            "id": 159,
            "phrase": "run against someone",
            "definition": "to compete against someone for elective office.  Eisenhower ran against Adlai Stevenson in 1952.  Not many people run against an incumbent."
        },
        {
            "id": 160,
            "phrase": "run aground (on something)",
            "definition": "[for a ship] to ram its hull into something beneath the water and get stuck.  The ship ran aground on a reef and had to wait for high tide to get free. I was afraid we would run aground in the storm."
        },
        {
            "id": 161,
            "phrase": "run along",
            "definition": "to leave. Please run along and leave me alone.  I have to run along now. Good-bye."
        },
        {
            "id": 162,
            "phrase": "run around",
            "definition": "1. to run here and there. Why are you running around? Sit down and be quiet. Please stop running around. You are making me nervous. 2. to go here and there having meetings or doing errands.  I’ve been running around all day, shopping for the party tonight.  I am so tired of running around, carting children to various places."
        },
        {
            "id": 163,
            "phrase": "run around after someone or something",
            "definition": "to chase after someone or something; to seek after someone or something.  Where have you been? I’ve run around after you all over town! _I have been running around after the rightsized shoes all morning."
        },
        {
            "id": 164,
            "phrase": "run around with someone",
            "definition": "to be friends with someone; to go places with regular friends.  John and I were great friends. We used to run around with each other all the time.  Mary ran around with Jane for about a year."
        },
        {
            "id": 165,
            "phrase": "run as something",
            "definition": "to run for office in a certain party.  Do you suppose I can run as an independent? _ Fred ran as a Democrat and won a seat in the legislature."
        },
        {
            "id": 166,
            "phrase": "run at someone or something",
            "definition": "to run toward someone or something; to charge someone or something.  The bull started to run at us, but changed its mind—thank heavens.  The huge crocodile ran at the goat, but the goat leapt away."
        },
        {
            "id": 167,
            "phrase": "run away (from someone or something)",
            "definition": "to flee someone or something.  Please don’t run away from me. I mean you no harm.  Our dog ran away from the lawn mower."
        },
        {
            "id": 168,
            "phrase": "run away with someone",
            "definition": "1. to flee in the company of someone. Frank arrived on the scene, saw what had happened, and ran away with the other boys.  Tom ran away with Bill to a place where they could hide. 2. [for two people] to elope. Jill ran away with Jack, much to her father’s relief.  Jill and Jack ran away with each other."
        },
        {
            "id": 169,
            "phrase": "run away with something",
            "definition": "1. to flee with something in one’s possession.  The crook ran away with the watch.  Someone ran away with that lady’s purse. 2. to capture or steal a performance by being the best performer. Henry ran away with the show, and everyone loved him.  The dog ran away with the whole performance."
        },
        {
            "id": 170,
            "phrase": "run back",
            "definition": "to come back, running.  She ran to the barn and then ran back.  Tom ran back, very much afraid."
        },
        {
            "id": 171,
            "phrase": "run back over something",
            "definition": "to review something.  Would you please run back over that last part again? _Let me run back over the hard part for you."
        },
        {
            "id": 172,
            "phrase": "run back to someone or something",
            "definition": "to return to someone or something in a hurry.  The child ran back to her mother.  We all ran back to the house."
        },
        {
            "id": 173,
            "phrase": "run behind",
            "definition": "to be late; to run late.  We are running behind. You had better hurry. Things are running behind, and we will not finish on time."
        },
        {
            "id": 174,
            "phrase": "run behind someone or something",
            "definition": "to travel along behind someone or something, running.  I will run behind you in the race.  Mary ran behind the bicycle until she could not run anymore."
        },
        {
            "id": 175,
            "phrase": "run between something and something else",
            "definition": "1. to travel between someone or something, running.  I spent all afternoon running between my office and the conference room.  We ran between the two quarreling people all day long, trying to settle the argument. 2. to pass between someone or something, running. The child ran between the two ladies, giving them quite a start. Please don’t run between the bushes. You will wear a path there."
        },
        {
            "id": 176,
            "phrase": "run counter to something",
            "definition": "to be in opposition to something; to run against something. (This has nothing to do with running.) _ Your proposal runs counter to what is required by the manager.  His idea runs counter to good sense."
        },
        {
            "id": 177,
            "phrase": "run down",
            "definition": "1. to come down, running or very quickly; to go down, running or very quickly.  I need to talk to you down here. Can you run down? _I will run down and talk to you. 2. [for something] to lose power and stop working. The clock ran down because no one was there to wind it.  The toy ran down and wouldn’t go again until it had been wound. 3. to become worn or dilapidated.  The property was allowed to run down, and it took a lot of money to fix it up.  The old neighborhood has certainly run down since we moved away."
        },
        {
            "id": 178,
            "phrase": "run down some lines",
            "definition": "1. Sl. to converse (with someone).  I was running down some lines with Fred when the bell rang.  Hey, man, let’s run down some lines. 2. Sl. to try to seduce someone; to go through a talk leading to seduction. Go run down some lines with someone else. I was just standing there running down some lines with Mary when those guys broke in."
        },
        {
            "id": 179,
            "phrase": "run down to some place",
            "definition": "to travel to a place. (By running or any other means.) _I have to run down to the store and get some bread.  I want to run down to the bank, but my car is out of gas."
        },
        {
            "id": 180,
            "phrase": "run down to someone or something",
            "definition": "to come or go down to someone or something, rapidly. Sally ran down the slope to Bob, who stood waiting for her with outstretched arms.  I ran down to the well to get some water for Ed, who had the hiccups."
        },
        {
            "id": 181,
            "phrase": "run for it",
            "definition": "to escape by running.  The dogs were coming after me fast. There was nothing I could do but run for it.  I ran for it when I saw the police coming."
        },
        {
            "id": 182,
            "phrase": "run for one’s life",
            "definition": "to run away to save one’s life. The dam has burst! Run for your life! _ The captain told us all to run for our lives."
        },
        {
            "id": 183,
            "phrase": "*a run for one’s money",
            "definition": "1. Fig. the results or rewards one deserves, expects, or wants. (*Typically: get ~; have ~; give someone ~.) _ I get a run for my money at the club tennis tournament. I had a run for my money in the stock market. 2. Fig. a challenge. (*Typically: get ~; have ~; give someone ~.) _ Bob got a run for his money when he tried to beat Mary at pool.  Bill got a run for his money playing cards with John."
        },
        {
            "id": 184,
            "phrase": "run for something",
            "definition": "1. to travel quickly by running to a place of safety. The picnickers ran for the shelter when the rain started to fall.  Tom and Jane ran for the house as soon as they heard your call. 2. to try to be elected to a particular office. Who’s going to run for president? _I am running for mayor."
        },
        {
            "id": 185,
            "phrase": "run from someone or something",
            "definition": "to flee someone or something, usually on foot. She ran from the mugger who had accosted her.  Mary ran from the dog and jumped over a fence to safety."
        },
        {
            "id": 186,
            "phrase": "run from something to something",
            "definition": "to travel on foot from one thing or place to another, running.  Do you think you can run from the bank downtown to the post office on Maple Street? _I ran from door to door, telling people what had happened."
        },
        {
            "id": 187,
            "phrase": "run in something",
            "definition": "to compete in something, such as a race or an election.  I will run in the one-hundred-yard dash.  I will not run in a race this time.  Who will run in this year’s election?"
        },
        {
            "id": 188,
            "phrase": "run in the family",
            "definition": "[for a characteristic] to appear in many (or all) members of a family. My grandparents lived well into their nineties, and it runs in the family.  My brothers and I have red hair. It runs in the family."
        },
        {
            "id": 189,
            "phrase": "run into a stone wall",
            "definition": "to come to a barrier against further progress. We’ve run into a stone wall in our investigation. Algebra was hard for Tom, but he really ran into a stone wall with geometry."
        },
        {
            "id": 190,
            "phrase": "run into someone or something",
            "definition": "to bump into someone or something.  I didn’t mean to run into you. I’m sorry.  Mary ran into the fence and scraped her elbow."
        },
        {
            "id": 191,
            "phrase": "run in(to something)",
            "definition": "1. [for a liquid] to flow into something or a place. The water is running into the basement! _It’s running in very fast. 2. to enter something or a place on foot, running.  The boys ran into the room and out again.  They ran in and knocked over a lamp. 3. to stop by a place for a quick visit or to make a purchase quickly.  I have to run in the drugstore for a minute.  I ran into the store for a loaf of bread.  I want to visit Mrs. Potter. I can’t stay long. I can only run in for a minute."
        },
        {
            "id": 192,
            "phrase": "run it down",
            "definition": "Sl. to tell the whole story; to tell the truth.  Come on! What happened? Run it down for me! _ I don’t care what happened. Run it down. I can take it."
        },
        {
            "id": 193,
            "phrase": "run its course",
            "definition": "[for something] to continue through its cycle of existence, especially a disease.  Sorry. There is no medicine for it. It will just have to run its course."
        },
        {
            "id": 194,
            "phrase": "run like clockwork",
            "definition": "to run very well; to progress very well. I want this office to run like clockwork—with everything on time and everything done right.  The plans for the party were made and we knew that we could depend on Alice to make sure that everything ran like clockwork."
        },
        {
            "id": 195,
            "phrase": "run low (on something)",
            "definition": "to near the end of a supply of something.  We are running low on salt. It’s time to buy more.  The car is running low on gas."
        },
        {
            "id": 196,
            "phrase": "run off",
            "definition": "1. to flee. The children rang our doorbell and then ran off. They ran off as fast as they could. 2. to have diarrhea.  He said he was running off all night.  One of the children was running off and had to stay home from school. 3. [for a fluid] to drain away from a flat area.  By noon, all the rainwater had run off the playground."
        },
        {
            "id": 197,
            "phrase": "run off at the mouth",
            "definition": "Sl. to talk too much.  I wish you would stop running off at the mouth. Tom runs off at the mouth too much. I wish he would temper his remarks."
        },
        {
            "id": 198,
            "phrase": "run off in all directions",
            "definition": "[for people] to set out to do something or go somewhere in an aimless and disorganized fashion. (Can also apply to one person. See also ride off in all directions.) _ The people in the marketing department need some organization. They are always running off in all directions.  Stop running off in all directions and focus your energy."
        },
        {
            "id": 199,
            "phrase": "run off something",
            "definition": "to drive or travel off something, such as rails, tracks, a road, etc.  The train ran off its rails and piled up in a cornfield.  We almost ran off the road during the storm."
        },
        {
            "id": 200,
            "phrase": "run off (with someone)",
            "definition": "to run away with someone, as in an elopement.  Tom ran off with Ann.  Tom and Ann ran off and got married."
        },
        {
            "id": 201,
            "phrase": "run off with someone or something",
            "definition": "1. to take someone or something away, possibly running.  Fred ran off with Ken. They’ll be back in a minute.  Who ran off with my dictionary? 2. to capture and take away someone or something; to steal someone or something. The kidnappers ran off with little Valerie.  The kids ran off with a whole box of candy, and the storekeeper is going to press charges."
        },
        {
            "id": 202,
            "phrase": "run on",
            "definition": "1. to continue running. I wanted to stop her and ask her something, but she just ran on.  The joggers had a chance to stop and rest, but they just ran on. 2. to continue on for a long time.  The lecture ran on and bored everyone to tears. How long is this symphony likely to run on?"
        },
        {
            "id": 203,
            "phrase": "run on all cylinders",
            "definition": "[for an engine] to run well and smoothly.  This car is now running on all cylinders, thanks to the tune-up.  You can hear if an engine is not running on all cylinders."
        },
        {
            "id": 204,
            "phrase": "run one’s eye over something",
            "definition": "to gaze at the whole of something; to glance at all of something.  She ran her eyes over the lines of the automobile and nodded her approval.  He ran his eyes over the drawing and decided that he had to have it."
        },
        {
            "id": 205,
            "phrase": "run one’s feet off",
            "definition": "to run very hard and fast.  I ran my feet off and I’m really tired now that the race is over.  I almost ran my feet off getting over here to see you!"
        },
        {
            "id": 206,
            "phrase": "run one’s head against a brick wall",
            "definition": "to be frustrated by coming up against an insurmountable obstacle.  There is no point in running your head against a brick wall. If you can’t succeed in this case, don’t even try.  I have been running my head against a brick wall about this problem long enough."
        },
        {
            "id": 207,
            "phrase": "run one’s rhymes",
            "definition": "Sl. to say what you have to say; to give one’s speech or make one’s plea.  Go run your rhymes with somebody else! _ I told him to run his rhymes elsewhere."
        },
        {
            "id": 208,
            "phrase": "run out at someone or something",
            "definition": "to come out of a place and charge or attack someone or something. The badger ran out at us and then went back to its den. The dogs ran out at the speeding car."
        },
        {
            "id": 209,
            "phrase": "run out of some place",
            "definition": "to leave a place quickly, on foot; to flee a place.  He ran out of the room as fast as he could. We ran out of the building as soon as we felt the first signs of the earthquake."
        },
        {
            "id": 210,
            "phrase": "run out of steam",
            "definition": "to lose momentum and fail.  Toward the end of the lecture, he seemed to run out of steam, leaving us with no summary or conclusion."
        },
        {
            "id": 211,
            "phrase": "run out of time",
            "definition": "to have used up most of the allotted time; to have no time left. You have just about run out of time.  I ran out of time before I could finish the test."
        },
        {
            "id": 212,
            "phrase": "run out (on someone)",
            "definition": "to depart and leave someone behind.  My date ran out on me at the restaurant, and I had to pay the bill.  Her boyfriend ran out when she needed him the most."
        },
        {
            "id": 213,
            "phrase": "run over",
            "definition": "1. to come by for a quick visit.  Can you run over for a minute after work? _I will run over for a minute as soon as I can. 2. to overflow.  The bathtub ran over and there was water all over the f loor. She poured the coffee until the cup ran over."
        },
        {
            "id": 214,
            "phrase": "run over someone or something",
            "definition": "to drive, steer, or travel so as to pass over someone or something. The bus ran over the fallen man.  That car almost ran over my toe."
        },
        {
            "id": 215,
            "phrase": "run over (something)",
            "definition": "to exceed a limit.  The lecture ran over the allotted time.  Bob ran over the amount he was budgeted to spend."
        },
        {
            "id": 216,
            "phrase": "run over something with someone",
            "definition": "to review something with someone. I would like to run over this with you one more time.  I want to run over the proposal with Carl again."
        },
        {
            "id": 217,
            "phrase": "run over to something",
            "definition": "to go to something or some place, running or by any independent mode of transportation.  Would you run over to the store and get me some eggs? _ I have to run over to the bank to cash a check."
        },
        {
            "id": 218,
            "phrase": "run over with something",
            "definition": "to drop over for a visit, bringing something.  Do you mind if I run over with the cup of sugar I borrowed last week? _ Mary ran over with the papers you requested."
        },
        {
            "id": 219,
            "phrase": "run rampant",
            "definition": "to run, develop, or grow out of control.  The children ran rampant through the house. Weeds have run rampant around the abandoned house."
        },
        {
            "id": 220,
            "phrase": "run scared",
            "definition": "to behave as if one were going to fail.  The mayor was running scared, but won anyway.  When we lost that big contract, everyone in the office was running scared. We thought we’d be fired."
        },
        {
            "id": 221,
            "phrase": "run short (of something)",
            "definition": "to begin to run out of something. We are running short of eggs.  I always keep enough so I will never run short."
        },
        {
            "id": 222,
            "phrase": "run someone in†",
            "definition": "to arrest one and take one to the police station. The cop ran George in so they could question him extensively.  They ran in George to protect him from the rioters."
        },
        {
            "id": 223,
            "phrase": "run someone or something down†",
            "definition": "1. to collide with and knock down someone or something.  The drunken driver ran three pedestrians down.  Mary ran down a stop sign. 2. to criticize or deride someone or something.  Please stop running me down all the time. I can’t be that bad! _ You run down everybody who takes your old job! 3. to hunt for and locate someone or something. Could you run some information down for me? _I was finally able to run down my old friend."
        },
        {
            "id": 224,
            "phrase": "run someone or something to earth",
            "definition": "to find something after a search.  Lisa finally ran her long-lost cousin to earth in Paris. After months of searching, I ran a copy of Jim’s book to earth."
        },
        {
            "id": 225,
            "phrase": "run someone or something to something",
            "definition": "1. to run someone or something to some extreme extent, such as death.  The villain’s idea was to run his victim to death by chasing him.  He nearly ran his horse to death. 2. to drive some- one or something to some place.  Could you run me to the store? _ Please run these clothes to the cleaners."
        },
        {
            "id": 226,
            "phrase": "run someone ragged",
            "definition": "to keep someone or something very busy.  This busy season is running us all ragged at the store.  What a busy day. I ran myself ragged."
        },
        {
            "id": 227,
            "phrase": "run someone through something",
            "definition": "1. to make or guide someone though an area while running. They ran us through a maze as part of our training.  We ran the little boys through the park so they could get some exercise. 2. to guide a person through a process. Let me run you through the process so you will know what is happening to you.  Can I run you through this procedure again? 3. to rehearse someone.  The director ran the cast through the last act three times.  She ran herself through the part at home between rehearsals."
        },
        {
            "id": 228,
            "phrase": "run someone through (with something)",
            "definition": "to stab a person all the way through with something, such as a sword.  The knight ran the attacker through with his own sword.  He ran him through and stole his horse."
        },
        {
            "id": 229,
            "phrase": "run something back†",
            "definition": "to wind something back to the beginning.  Run the tape back and listen to it again.  Run back the tape and listen again."
        },
        {
            "id": 230,
            "phrase": "run something by (someone) (again)",
            "definition": "to explain something to someone again; to say something to someone again.  I didn’t hear you. Please run that by me again. Please run it by so we can all hear it."
        },
        {
            "id": 231,
            "phrase": "run something down†",
            "definition": "to use something having batteries, a motor, or an engine until it has no more power and it stops.  Who ran my electric toothbrush down? _ Someone ran down my batteries."
        },
        {
            "id": 232,
            "phrase": "run something in† (for something)",
            "definition": "to bring or drive something quickly into a place for some purpose.  I have to run my car in for an oil change.  I will run in the truck for the mechanic to take a look at it."
        },
        {
            "id": 233,
            "phrase": "run something off†",
            "definition": "1. to get rid of something, such as fat or energy, by running.  The little boys are very excited. Send them outside to run it off. They need to run off their energy. 2. to duplicate something, using a mechanical duplicating machine.  If the master copy is ready, I will run some other copies off.  I’ll run off some more copies."
        },
        {
            "id": 234,
            "phrase": "run something onto something",
            "definition": "to drive or guide something onto the surface of something.  He ran the car onto the grass and washed it.  Please run your bicycle onto the porch and I will try to fix it for you."
        },
        {
            "id": 235,
            "phrase": "run something through something",
            "definition": "1. to drive or propel something through the midst of something or a group.  The cowboys ran the cattle right through the crowd of people standing at the station.  He ran his truck through the bushes at the end of the driveway. 2. to process something by going through a procedure, a deliberative body, or a department.  I will have to run this through the board of directors.  She ran the invoice through the accounting department."
        },
        {
            "id": 236,
            "phrase": "run something up†",
            "definition": "to raise or hoist something, such as a flag.  Harry ran the f lag up the f lagpole each morning. Will you please run up the f lag today?"
        },
        {
            "id": 237,
            "phrase": "run the gamut",
            "definition": "to cover a wide range [from one thing to another].  She wants to buy the house, but her requests run the gamut from expensive new carpeting to completely new landscaping.  His hobbies run the gamut from piano repair to portrait painting."
        },
        {
            "id": 238,
            "phrase": "run the good race",
            "definition": "to do the best that one could; to live life as well and as fully as possible.  He didn’t get what he wanted, but he ran the good race.  Joan ran the good race, and she will be remembered by all of us."
        },
        {
            "id": 239,
            "phrase": "run the show",
            "definition": "to be in charge; to be in command. Who’s running this show? _ No, I don’t want to have to run the show again."
        },
        {
            "id": 240,
            "phrase": "run through something",
            "definition": "1. to pass through an area, running.  Stop running through the living room! _ We ran through the park as part of our exercise. 2. to go through a procedure or sequence; to rehearse a procedure or sequence. I want to run through act two again before we end this rehearsal. 3. to read or examine something quickly. I ran through your report this afternoon. Sally ran through the list, checking off the names of the people who had already paid for tickets. 4. to spend or use a supply of something wastefully and rapidly. He ran through his inheritance in two years. Have we run through all the peanut butter already?"
        },
        {
            "id": 241,
            "phrase": "run to someone or something",
            "definition": "to travel quickly on foot to someone or something; to go to someone or something with some urgency.  Mary ran to Alice and greeted her.  I ran to the door and f led."
        },
        {
            "id": 242,
            "phrase": "run to something",
            "definition": "to amount to a certain amount of money.  In the end, the bill ran to thousands of dollars.  His account ran to more than I expected."
        },
        {
            "id": 243,
            "phrase": "run up to some place",
            "definition": "to travel to a place quickly or for a brief time.  Let’s run up to the lake for the weekend."
        },
        {
            "id": 244,
            "phrase": "run up (to someone or something)",
            "definition": "to run as far as someone or something and stop; to run to the front of someone or something.  I ran up to the mailman and said hello to him.  I ran up and said hello."
        },
        {
            "id": 245,
            "phrase": "run with someone or something",
            "definition": "to stay in the company of someone or some group.  Fred was out running with Larry when they met Vernon.  Let’s go out and run with the other guys this morning."
        },
        {
            "id": 246,
            "phrase": "run with something",
            "definition": "to run, showing a particular characteristic.  Sally runs with speed and grace.  Fred runs with tremendous speed."
        },
        {
            "id": 247,
            "phrase": "run with the hare and hunt with the hounds",
            "definition": "to support both sides of a dispute.  In our office politics, Sally always tries to run with the hare and hunt with the hounds, telling both the clerical workers and the management that she thinks they should prevail."
        },
        {
            "id": 248,
            "phrase": "*the runaround",
            "definition": "a series of excuses, delays, and referrals. (*Typically: get ~; have ~; give someone ~.) _You’ll get the runaround if you ask to see the manager.  I hate it when they give me the runaround."
        },
        {
            "id": 249,
            "phrase": "running high",
            "definition": "[for feelings] to be in a state of excitement or anger.  Feelings were running high as the general election approached.  The mood of the crowd was running high when they saw the mother slap her child."
        }
    ]
}