{
    "dictionary": [
        {
            "id": 0,
            "phrase": "make a bolt for someone or something",
            "definition": "to run quickly to or at someone or something.  The child came into the room and made a bolt for her mother.  The dog made a bolt for the door."
        },
        {
            "id": 1,
            "phrase": "make a break for someone or something",
            "definition": "to run suddenly toward someone or something; to seize an opportunity to run toward someone or something. The crook made a break for the cop in order to get his gun.  Max made a break for the door."
        },
        {
            "id": 2,
            "phrase": "make a check (out†) (to someone or something)",
            "definition": "to write a check to someone or a group.  Please make the check out to Bill Franklin.  Make out a check to me.  Please make a check out to the bank. Make a check to the phone company."
        },
        {
            "id": 3,
            "phrase": "make a check over to someone or something",
            "definition": "to endorse the back of a check, making it payable to someone or a group.  Please make the check over to Bill Franklin.  Would you make the check over to my bank?"
        },
        {
            "id": 4,
            "phrase": "make a check to someone or something",
            "definition": "to write a check to someone.  The check should be for fifty dollars. Please make it to me.  Make the check to Jim.  She made the check to the bank, and sent it off in the mail."
        },
        {
            "id": 5,
            "phrase": "make a clean breast of something (to someone)",
            "definition": "to admit something to someone.  You should make a clean breast of the matter to someone.  You’ll feel better if you make a clean breast of the incident."
        },
        {
            "id": 6,
            "phrase": "make a clean sweep",
            "definition": "to do something completely or thoroughly, with no exceptions.  The boss decided to change the direction of the company, so he made a clean sweep and fired all the top management.  They made a clean sweep through the neighborhood, repairing all the sidewalks."
        },
        {
            "id": 7,
            "phrase": "make a comeback",
            "definition": "to return to one’s former (successful) career.  After ten years in retirement, the singer made a comeback.  You’re never too old to make a comeback."
        },
        {
            "id": 8,
            "phrase": "make a dash for someone or something",
            "definition": "to run quickly for someone or something.  Suddenly Max made a dash for Lefty and punched him in the stomach. John made a dash for the bathroom as soon as they arrived home."
        },
        {
            "id": 9,
            "phrase": "make a deal with someone",
            "definition": "to strike a bargain with someone. I want to buy your car and I think I can make a deal with you.  I will make a deal with you that you will like."
        },
        {
            "id": 10,
            "phrase": "make a dent in something",
            "definition": "to make a depression in something.  I kicked the side of the car and made a dent in it.  Please don’t make a dent in the side of the house."
        },
        {
            "id": 11,
            "phrase": "make a difference in someone or something",
            "definition": "to cause a noticeable change in someone or something.  Getting a job made a big difference in my lifestyle.  His mother’s death made a difference in his attitude toward doctors."
        },
        {
            "id": 12,
            "phrase": "make a difference to someone",
            "definition": "[for one choice or another] to matter to someone.  The big one or the little one—does it really make a difference to anyone? _It makes quite a difference to me!"
        },
        {
            "id": 13,
            "phrase": "make a fuss (over someone or something)",
            "definition": "1. to worry about or make a bother about someone or something.  Why do you make a fuss over a problem like that? _ Please don’t make a fuss. Everything will be all right. 2. to be very solicitous and helpful toward a person or a pet.  How can anyone make a fuss over a cat? _Billy was embarrassed when his mother made a fuss over him. 3. to argue about someone or something.  Please don’t make a fuss over who gets the last cookie.  Please discuss it. Don’t make a fuss over it!"
        },
        {
            "id": 14,
            "phrase": "make a go of something",
            "definition": "to succeed at something. (Often with it.) _ She just didn’t have the energy or inclination to make a go of her marriage.  I did everything I could to make a go of it."
        },
        {
            "id": 15,
            "phrase": "make a grab at someone or something",
            "definition": "to grasp at someone or something.  Don made a grab at Betsy, but she eluded him.  Kelly made a grab at the ball, but it went on past her."
        },
        {
            "id": 16,
            "phrase": "make a great show of something",
            "definition": "to make something obvious; to do something in a showy fashion. Ann made a great show of wiping up the drink that John spilled. Jane displayed her irritation at our late arrival by making a great show of serving the cold dinner."
        },
        {
            "id": 17,
            "phrase": "make a habit of something",
            "definition": "to do something so often that it becomes a habit.  You mustn’t make a habit of interrupting.  I make a habit of counting my change."
        },
        {
            "id": 18,
            "phrase": "make a hit with someone",
            "definition": "to please someone; to impress someone.  The dessert you served really made a hit with the guests.  Her talk made a hit with the audience."
        },
        {
            "id": 19,
            "phrase": "make a killing",
            "definition": "to have a great success, especially in making money. John has got a job selling insurance. He’s not exactly making a killing.  Bill made a killing at the racetrack yesterday."
        },
        {
            "id": 20,
            "phrase": "make a (kind of) life for oneself",
            "definition": "to develop and live a particular kind of lifestyle for oneself. She made a good life for herself in New York City, working as a freelancer."
        },
        {
            "id": 21,
            "phrase": "Make a lap!",
            "definition": "Sl. to sit down.  Hey, make a lap and get out of the way! _ Pull up a chair and make a lap!"
        },
        {
            "id": 22,
            "phrase": "make a man of someone",
            "definition": "to make a young male into an adult male.  The experience will make a man of Ted.  Send Wally into the army. That’ll make a man of him."
        },
        {
            "id": 23,
            "phrase": "make a meal of something",
            "definition": "1. to eat something.  The cat made a meal of the fish.  They made a meal of the roast beef and enjoyed it very much. 2. to eat enough of something to consider it or have it as a full meal. I really don’t want to make a meal of lettuce alone. Can we make a meal of this turkey, or should we save some for sandwiches?"
        },
        {
            "id": 24,
            "phrase": "make a mental note of something",
            "definition": "to remember something.  So, you want to be considered for a job. I’ll make a mental note of that.  Please make a mental note of my telephone number."
        },
        {
            "id": 25,
            "phrase": "make a mess of something",
            "definition": "to mess something up; to ruin something.  Give it a try, but don’t make a mess of it.  Jerry made a mess of the kitchen."
        },
        {
            "id": 26,
            "phrase": "make a mistake",
            "definition": "to commit an error; to do something wrong accidentally.  I made a mistake and I am really sorry about it."
        },
        {
            "id": 27,
            "phrase": "make a mockery of something",
            "definition": "to make a deliberate parody or a poor imitation of something. What a mess. You made a mockery of the task.  You have made a mockery of my position!"
        },
        {
            "id": 28,
            "phrase": "make a mountain out of a molehill",
            "definition": "Cliché to make a major issue out of a minor one; to exaggerate the importance of something.  Come on, don’t make a mountain out of a molehill. It’s not that important. Mary is always making mountains out of molehills."
        },
        {
            "id": 29,
            "phrase": "make a move on someone",
            "definition": "to attempt to seduce someone.  Was he making a move on me? I think he was.  Jed is known for making moves on young women."
        },
        {
            "id": 30,
            "phrase": "make a name (for oneself)",
            "definition": "to become famous.  Sally wants to work hard and make a name for herself.  It’s hard to make a name without a lot of talent and hard work."
        },
        {
            "id": 31,
            "phrase": "make a night of it",
            "definition": "to spend the entire evening or night doing something. (Especially when one had intended to devote only a little time to the outing.) _ We went out to have a bite to eat and were having such a good time that we decided to make a night of it. I did not want to make a night of it, so I left early."
        },
        {
            "id": 32,
            "phrase": "make a note of something",
            "definition": "to write something down as a reminder.  Please make a note of it so you will remember.  I will make a note of it and try to remember where I put the note."
        },
        {
            "id": 33,
            "phrase": "make a nuisance of oneself",
            "definition": "to be a constant bother.  I’m sorry to make a nuisance of myself, but I do need an answer to my question.  Stop making a nuisance of yourself and wait your turn."
        },
        {
            "id": 34,
            "phrase": "make a pass at someone",
            "definition": "to flirt with or suggest sexual activity with someone.  Can you believe it? Larry made a pass at me! _ No one ever makes a pass at me."
        },
        {
            "id": 35,
            "phrase": "make a pass at something",
            "definition": "to fly over or close by something.  The plane made a pass at the landing field and pulled up at the last minute.  The bird made a pass at me because I got too close to its nest."
        },
        {
            "id": 36,
            "phrase": "make a pig of oneself",
            "definition": "to eat too much, too fast, or noisily; to eat more than one’s share.  Don’t make a pig of yourself! _ Sam is making a pig of himself and taking more than his share."
        },
        {
            "id": 37,
            "phrase": "make a pitch (for someone or something)",
            "definition": "to say something in support of someone or something; to attempt to promote, sell, or advance someone or something.  Bill is making a pitch for his friend’s new product again.  The theatrical agent came in and made a pitch for her client.  Every time I turn on the television set, someone is making a pitch."
        },
        {
            "id": 38,
            "phrase": "make a play (for someone)",
            "definition": "to attempt to attract the romantic interest of someone. Ann made a play for Bill, but he wasn’t interested in her.  I knew he liked me, but I never thought he’d make a play."
        },
        {
            "id": 39,
            "phrase": "make a run for it",
            "definition": "to run fast to get away or get somewhere. When the guard wasn’t looking, the prisoner made a run for it.  In the baseball game, the player on first base made a run for it, but he didn’t make it to second base."
        },
        {
            "id": 40,
            "phrase": "make a secret of something",
            "definition": "to act as if something were a secret.  I’m not making a secret of it. I am quitting this job.  Mary made a secret of her intentions."
        },
        {
            "id": 41,
            "phrase": "make a start on something",
            "definition": "to set out to do something; to make a beginning on something.  See if you can make a start on the project. I will try to make a start on the cleaning before I leave today."
        },
        {
            "id": 42,
            "phrase": "make a virtue of necessity",
            "definition": "Prov. to do what you have to do cheerfully or willingly. When Bill’s mother became sick, there was no one but Bill to take care of her, so Bill made a virtue of necessity and resolved to enjoy their time together."
        },
        {
            "id": 43,
            "phrase": "make allowance(s) (for someone or something)",
            "definition": "1. to allow time, space, food, etc., for someone or something.  When planning the party, please make allowances for John and his family.  I’m making allowance for ten extra guests. 2. to make excuses or explanations for someone or something; to take into consideration the negative effects of someone or something.  You’re very late even when we make allowance for the weather.  We have to make allowance for the age of the house when we judge its condition."
        },
        {
            "id": 44,
            "phrase": "make amends (to someone) (for someone or something)",
            "definition": "to make up to someone for something that someone or something did.  Don’t worry. I will make amends to her for my sister, who behaved so badly.  I will try to make amends for the accident. I can make amends to Sam, I’m sure."
        },
        {
            "id": 45,
            "phrase": "make (an amount of) headway",
            "definition": "to move forward.  Even in a light wind, the ship could not make any headway."
        },
        {
            "id": 46,
            "phrase": "make an appearance",
            "definition": "to appear; to appear in a performance. We waited for thirty minutes for the professor to make an appearance, then we went home.  The famous singing star made an appearance in Detroit last August."
        },
        {
            "id": 47,
            "phrase": "make an appointment (with someone)",
            "definition": "to schedule a meeting with someone. I made an appointment with the doctor for late today. The professor wouldn’t see me unless I made an appointment."
        },
        {
            "id": 48,
            "phrase": "make an entrance",
            "definition": "to enter [a place], in some formal or special way, as onto the stage in a play or opera.  She made her entrance too early and threw everyone into confusion."
        },
        {
            "id": 49,
            "phrase": "make an example of someone",
            "definition": "to do something to someone that shows the bad results of bad behavior; to point to someone as a bad example.  The judge said that he would make an example of Sally and would fine her the maximum amount. The teacher made an example of me to the class, with a detention on the first day of school."
        },
        {
            "id": 50,
            "phrase": "make an exception (for someone)",
            "definition": "to suspend a rule or practice for someone in a single instance.  Please make an exception just this once.  The rule is a good one, and I will not make an exception for anyone."
        },
        {
            "id": 51,
            "phrase": "make an exhibition of oneself",
            "definition": "to show off; to try to get a lot of attention for oneself. She is not just dancing, she is making an exhibition of herself.  Whenever Rudy drinks, he makes an exhibition of himself."
        },
        {
            "id": 52,
            "phrase": "make an honest woman of someone",
            "definition": "to marry a woman. (Intended as jocular.) _ So you finally made an honest woman out of Denise.  She had wanted Max to make an honest woman of her, but you can’t depend on Max to do anything right."
        },
        {
            "id": 53,
            "phrase": "make an impression on someone",
            "definition": "to produce a positive memorable effect on someone while one is present. (Akin to leave an impression (on someone).) _Tom made quite an impression on the banker."
        },
        {
            "id": 54,
            "phrase": "make application (to someone or something) (for something)",
            "definition": "to apply to a person or an office for something.  You must make application to the committee for admission.  Can I make application to this office for a scholarship?"
        },
        {
            "id": 55,
            "phrase": "make arrangements for someone",
            "definition": "to plan accommodations for someone.  John is coming for a visit next week. Please make arrangements for him at the hotel.  I will make arrangements for everyone when I call the hotel."
        },
        {
            "id": 56,
            "phrase": "make arrangements to do something",
            "definition": "to plan to do something; to facilitate the doing of something. Please make arrangements to have all this stuff hauled away.  We will make arrangements to be there on time."
        },
        {
            "id": 57,
            "phrase": "make arrangements (with someone) (for something)",
            "definition": "to make plans with someone for something.  I will make arrangements with Fred for the loan.  We can make arrangements for a car with the manager."
        },
        {
            "id": 58,
            "phrase": "make as if to do something",
            "definition": "to act as if one were about to do something.  The thief made as if to run away but changed his mind.  Jane made as if to smack the child."
        },
        {
            "id": 59,
            "phrase": "make believe that...",
            "definition": "to pretend that...  Make believe that you have a million dollars. What would you do with it?"
        },
        {
            "id": 60,
            "phrase": "make book on something",
            "definition": "1. Sl. to make or accept bets on something.  Well, she might. But I wouldn’t make book on it.  Don’t make book on my success in this game. 2. Sl. to feel confident enough about something to accept wagers on it.  Of course the delivery date is certain. You can make book on it! _ The work might be done on time, but I wouldn’t make book on it."
        },
        {
            "id": 61,
            "phrase": "make (both) ends meet",
            "definition": "to earn and spend equal amounts of money. (Usually in reference to a meager living with little if any money after basic expenses.) _I have to work at two jobs to make ends meet.  Through better budgeting, I am learning to make both ends meet."
        },
        {
            "id": 62,
            "phrase": "make certain of something",
            "definition": "to check something in order to be sure.  Please make certain of what you want to do.  Would you please make certain of the number of things you want to order?"
        },
        {
            "id": 63,
            "phrase": "make change (for someone) (for something)",
            "definition": "1. to return change [coins] for someone to use for some purpose.  Will you please make change for me for the telephone? _ I will make change for the telephone for you. 2. to return change [coins or bills or both] to someone for paper money.  The clerk refused to make change for her for the dollar bill.  I will be happy to make change for a ten for you."
        },
        {
            "id": 64,
            "phrase": "make chin music",
            "definition": "to talk or chatter. We sat around all evening making chin music.  You were making chin music when you should have been listening."
        },
        {
            "id": 65,
            "phrase": "make cracks about someone or something",
            "definition": "to make jokes or smart remarks about someone or something.  Stop making cracks about my cousin.  Ken made a few cracks about the movie."
        },
        {
            "id": 66,
            "phrase": "make do (with someone or something)",
            "definition": "to do as well as possible with someone or something.  You’ll have to make do with less money next year. The economy is very weak. We’ll have to make do with John even though he’s a slow worker."
        },
        {
            "id": 67,
            "phrase": "make every effort to do something",
            "definition": "to try very hard to accomplish something.  I will make every effort to be there on time."
        },
        {
            "id": 68,
            "phrase": "make eyes at someone",
            "definition": "to flirt with someone.  Mother, he’s making eyes at me! _Jed tried to make eyes at all the young women."
        },
        {
            "id": 69,
            "phrase": "make for somewhere",
            "definition": "to set out for somewhere; to run or travel to somewhere.  Wilbur made for Philadelphia when he heard the police in the Big Apple were after him.  Barlowe made for the stairs, but two shots rang out, and he knew it was all over for Mary."
        },
        {
            "id": 70,
            "phrase": "make free with someone",
            "definition": "to exploit someone; to take advantage of someone.  You shouldn’t make free with your employees. They are liable to take you to court.  He was making free with his secretary, having her do his private business."
        },
        {
            "id": 71,
            "phrase": "make free with something",
            "definition": "to use something freely; to exploit something. You can make free with the hot water. We have a huge tank.  Sally is making free with the sugar I was saving for breakfast cereal."
        },
        {
            "id": 72,
            "phrase": "make friends with someone",
            "definition": "to work to become a friend of someone.  I want to make friends with all the people I am going to be working with.  Let’s try to make friends with each other."
        },
        {
            "id": 73,
            "phrase": "make fun of someone or something",
            "definition": "to ridicule someone or something.  Are you making fun of me? _ I am making fun of your hat."
        },
        {
            "id": 74,
            "phrase": "make good as something",
            "definition": "to succeed in a particular role.  I hope I make good as a teacher.  John made good as a football player."
        },
        {
            "id": 75,
            "phrase": "make good (at something)",
            "definition": "to succeed at something.  Bob worked hard to make good at selling. Jane was determined to make good."
        },
        {
            "id": 76,
            "phrase": "make good money",
            "definition": "to earn a sizable amount of money.  Ann makes good money at her job.  I don’t know what she does, but she makes good money."
        },
        {
            "id": 77,
            "phrase": "make good on something",
            "definition": "1. to fulfill a promise.  Tom made good on his pledge to donate $1,000. Bill refused to make good on his promise. 2. to repay a debt.  I couldn’t make good on my debts, and I got in a lot of trouble.  If you don’t make good on this bill, I’ll have to take back your car."
        },
        {
            "id": 78,
            "phrase": "make good time",
            "definition": "to proceed at a fast or reasonable rate.  On our trip to Toledo, we made good time.  I’m making good time, but I have a long way to go."
        },
        {
            "id": 79,
            "phrase": "make (good) use of something",
            "definition": "to use something well.  I am sure I can make good use of the gift you gave me.  We will make use of this book."
        },
        {
            "id": 80,
            "phrase": "Make hay while the sun shines.",
            "definition": "Prov. If you have an opportunity to do something, do it before the opportunity expires.  Jane: While my husband’s out of town, I’m going to watch all the movies he wouldn’t take me to see. Jane: Why not? Make hay while the sun shines."
        },
        {
            "id": 81,
            "phrase": "make heads or tails of someone or something",
            "definition": "to understand someone or something that someone has said. (Usually with the negative.) _ I can’t make heads or tails of Fred.  No one can make heads or tails of this problem."
        },
        {
            "id": 82,
            "phrase": "make inroads into something",
            "definition": "to succeed in getting something done or at least started.  George was unable to make inroads into solving the problem.  We are making no inroads into the high-priority project."
        },
        {
            "id": 83,
            "phrase": "make it big",
            "definition": "to become successful, especially financially.  I always knew that someday I would make it big.  My brother made it big, but it has just led to tax problems."
        },
        {
            "id": 84,
            "phrase": "make it hot for someone",
            "definition": "to make things difficult for someone; to put someone under pressure.  Maybe if we make it hot for them, they’ll leave.  John likes making it hot for people. He’s sort of mean."
        },
        {
            "id": 85,
            "phrase": "Make it snappy!",
            "definition": "Inf. Hurry up!; Move quickly and smartly. Andy: Make it snappy! I haven’t got all day. Bob: Don’t rush me. Mary: Do you mind if I stop here and get some film? Bob: Not if you make it snappy! Mary: Don’t worry. I’ll hurry."
        },
        {
            "id": 86,
            "phrase": "make it (to) some place",
            "definition": "to reach some place; to be able to attend an event at a place. I couldn’t make it to the party.  He didn’t think his car could make it to Cleveland."
        },
        {
            "id": 87,
            "phrase": "Make it two.",
            "definition": "I wish to order the thing that someone else just now ordered. (Said to food or drink server.) _ Bill (speaking to the waiter): I’ll have the roast chicken. Mary: Make it two. Waiter: Would you like something to drink? Tom: Just a beer. Waiter (turning to Mary): And you? Mary: Make it two."
        },
        {
            "id": 88,
            "phrase": "make it worth someone’s while",
            "definition": "Euph. to tip or offer special (usually extra) payment to someone.  I made it worth the waiter’s while to give us good service.  If you’ll throw a few contracts my way, I’ll make it worth your while."
        },
        {
            "id": 89,
            "phrase": "make life miserable for someone",
            "definition": "to give someone misery; to be a great nuisance to someone.  This nagging backache is making life miserable for me.  I wish you would stop making life miserable for me."
        },
        {
            "id": 90,
            "phrase": "make light of something",
            "definition": "to treat something as if it were unimportant or humorous.  I wish you wouldn’t make light of his problems. They’re quite serious.  I make light of my problems, and that makes me feel better."
        },
        {
            "id": 91,
            "phrase": "make like a tree and leave",
            "definition": "Sl. to leave; to depart. (Jocular; a pun on the leaf of a tree.) _ I have to leave now. It’s time to make like a tree and leave.  Hey, Jane. Don’t you have an appointment somewhere? Why don’t you make like a tree and leave?"
        },
        {
            "id": 92,
            "phrase": "make like someone or something",
            "definition": "to act like someone or something.  Why don’t you make like a bunny and run away? Beat it! _ Would you please make like a butler and hold the door open for me?"
        },
        {
            "id": 93,
            "phrase": "make little of someone or something",
            "definition": "to minimize someone or something; to play someone or something down; to belittle someone or something.  John made little of my efforts to collect money for charity.  The neighbors made little of John and thought he would amount to nothing."
        },
        {
            "id": 94,
            "phrase": "make love (to someone)",
            "definition": "1. to kiss and caress someone. Ernest made love to Linda in the garden in the moonlight.  She liked the way he made love to her—all that poetry. 2. Euph. to have sex with someone.  I really think that he wanted to make love to me.  She did not want to make love to him."
        },
        {
            "id": 95,
            "phrase": "make mention of someone or something",
            "definition": "to mention someone or something.  Did you have to make mention of Sally? I’m angry with her.  I will have to make mention of your failure to secure additional business."
        },
        {
            "id": 96,
            "phrase": "make merry",
            "definition": "to have fun; to have an enjoyable time.  The guests certainly made merry at the wedding. The children were making merry in the backyard."
        },
        {
            "id": 97,
            "phrase": "Make mine something.",
            "definition": "I wish to have the thing named. (The something can be a particular food or drink, a flavor of a food, a size of a garment, or a type of almost anything. Most typically used for food or drink.) _ Bill: I want some pie. Yes, I’d like apple. Tom: Make mine cherry.  Waiter: Would you care for some dessert? The ice cream is homemade. Tom: Yes, indeed. Make mine chocolate."
        },
        {
            "id": 98,
            "phrase": "make mischief",
            "definition": "to cause trouble. Bob loves to make mischief and get other people into trouble. Don’t believe what Mary says. She’s just trying to make mischief."
        },
        {
            "id": 99,
            "phrase": "make money on something",
            "definition": "to make a certain amount of profit on something.  I am sure I can make something on the deal.  Can I make any money on this sale?"
        },
        {
            "id": 100,
            "phrase": "Make my day!",
            "definition": "Inf. Go ahead, do what you are going to do, and I will be very happy to do what I have to do! (A catchphrase from a movie scene of a police officer who has a gun pointed at a criminal. The police officer wants the criminal to do something that will justify pulling the trigger, which the police officer will do with pleasure. Used in real life in any context, and especially in sarcasm.) _Move a muscle! Go for your gun! Go ahead, make my day! _ Make my day. Just try it."
        },
        {
            "id": 101,
            "phrase": "Make no bones about it.",
            "definition": "to make no mistake (about it); no need to doubt it; absolutely.  This is the greatest cake I’ve ever eaten. Make no bones about it.  Make no bones about it, Mary is a great singer."
        },
        {
            "id": 102,
            "phrase": "make no difference (to someone)",
            "definition": "[for a choice] not to matter to someone. (Any is used with negative nouns or verbs.) _Pick whom you like. It makes no difference to me.  It doesn’t make any difference to me.  Nothing much makes any difference to them anymore."
        },
        {
            "id": 103,
            "phrase": "Make no mistake (about it)!",
            "definition": "Inf. Do not be mistaken! You can be certain. Sally: I’m very angry with you! Make no mistake about it! Fred: Whatever it’s about, I’m sorry.  Clerk: Make no mistake, this is the finest carpet available. Sally: I’d like something a little less fine, I think."
        },
        {
            "id": 104,
            "phrase": "make nonsense of something",
            "definition": "to make something appear to be silly or nonsensical.  You are just making nonsense of everything I have tried to do.  Your statement makes nonsense of everything you have said before."
        },
        {
            "id": 105,
            "phrase": "make nothing of something",
            "definition": "to ignore something as if it had not happened; to think no more about something. (Often with it.) _My father caught me throwing the snowball, but he made nothing of it.  I made nothing of the remark, even though it seemed quite rude. I saw him leave early, but I made nothing of it."
        },
        {
            "id": 106,
            "phrase": "make one’s mark",
            "definition": "to do something that allows one to receive appropriate recognition.  Perry made his mark by inventing a special kind of holder for a cell phone."
        },
        {
            "id": 107,
            "phrase": "make one’s mind up† (about someone or something)",
            "definition": "to decide about someone or something.  Please make your mind up about Ralph. Will you pick him or not? _ Make up your mind about her! _ I just couldn’t make my mind up."
        },
        {
            "id": 108,
            "phrase": "make one’s (own) bed",
            "definition": "to restore order to the bedclothes on one’s own bed.  Jimmy, you are old enough to make your own bed."
        },
        {
            "id": 109,
            "phrase": "make (one’s) peace with someone",
            "definition": "to set things right with someone; to make amends with someone.  I will make my peace with Jane. You needn’t be the one to patch things up.  Let’s go make peace with Karen."
        },
        {
            "id": 110,
            "phrase": "make one’s way along something",
            "definition": "to move along something slowly or carefully.  Todd made his way along the slippery walk. The old man made his way along the street carefully."
        },
        {
            "id": 111,
            "phrase": "make one’s way back (to something)",
            "definition": "to work one’s way back to something or some place.  I made my way back to the little town in the densest fog I have ever seen. I went for a walk and got lost. It took hours for me to make my way back."
        },
        {
            "id": 112,
            "phrase": "make one’s way in the world",
            "definition": "to succeed in the world independently. I intend to prepare myself to make my way in the world by getting a college degree.  I know that all my children can make their way in the world."
        },
        {
            "id": 113,
            "phrase": "make oneself at home",
            "definition": "to make oneself comfortable as if one were in one’s own home.  Please come in and make yourself at home. I’m glad you’re here. During your visit, just make yourself at home."
        },
        {
            "id": 114,
            "phrase": "make oneself conspicuous",
            "definition": "to attract attention to oneself.  Please don’t make yourself conspicuous. It embarrasses me.  Ann makes herself conspicuous by wearing brightly colored clothing."
        },
        {
            "id": 115,
            "phrase": "make oneself heard",
            "definition": "to speak loudly so that one will be heard above background noise.  I had to shout to make myself heard.  He screamed to make himself heard over the sound of the plane’s engines."
        },
        {
            "id": 116,
            "phrase": "make oneself miserable",
            "definition": "to do things which cause one to be unhappy. You’re just making yourself miserable by trying to do something you aren’t qualified to do.  I’m not making myself miserable! You’re making me miserable."
        },
        {
            "id": 117,
            "phrase": "make oneself scarce",
            "definition": "[for someone] to become difficult to find; [for someone to] go into hiding.  Tom is mad and is looking for you. Better make yourself scarce.  Make yourself scarce! Here comes the sheriff."
        },
        {
            "id": 118,
            "phrase": "make (oneself) up",
            "definition": "to put makeup on oneself.  I have to make up now. I go on stage in ten minutes.  I will make myself up. I don’t need your help."
        },
        {
            "id": 119,
            "phrase": "make or break someone",
            "definition": "[of a task, job, career choice] to bring success to or improve, or ruin, someone.  The army will either make or break him.  It’s a tough assignment, and it will either make or break her."
        },
        {
            "id": 120,
            "phrase": "make (out) after someone or something",
            "definition": "to run after someone or something; to start out after someone or something.  Paul made out after Fred, who had taken Paul’s hat.  The police officer made after the robber."
        },
        {
            "id": 121,
            "phrase": "make (out) for someone or something",
            "definition": "to run toward someone, something, or some place.  They made out for Sam as soon as they saw him coming.  The boys made for the swimming pool as soon as the coach blew the whistle."
        },
        {
            "id": 122,
            "phrase": "make out like a bandit",
            "definition": "Rur. to make a large profit.  Joe’s making out like a bandit, selling expensive cameras.  Mary made out like a bandit, playing twenty-one in Las Vegas."
        },
        {
            "id": 123,
            "phrase": "make (out) like something",
            "definition": "Rur. to pretend something.  Let’s make out like we’re cowboys and Indians.  Joe made out like he had a lot of money, and folks believed him."
        },
        {
            "id": 124,
            "phrase": "make out that...",
            "definition": "to pretend that [something is so]. He made out that he hadn’t seen me.  We all made out that we hadn’t heard the sound."
        },
        {
            "id": 125,
            "phrase": "make out (with someone)",
            "definition": "to kiss and pet with someone.  All evening long, he was trying to make out with me.  Sharon was trying to make out with Bill."
        },
        {
            "id": 126,
            "phrase": "make out (with someone or something)",
            "definition": "to manage to do something with someone or something. I think I can make out with this hammer.  If I can’t make out with a crew of four, I’ll have to ask for more help. "
        },
        {
            "id": 127,
            "phrase": "make overtures about doing something",
            "definition": "to give hints about something; to present or suggest ideas. The company made overtures about hiring me.  Tom is making overtures about inviting us to his country home next month."
        },
        {
            "id": 128,
            "phrase": "make points (with someone)",
            "definition": "to gain favor with someone; to impress someone.  Tom is trying to make points with Ann. He wants to ask her out. He’s trying to make points by smiling and telling her how nice she looks."
        },
        {
            "id": 129,
            "phrase": "make room (for someone or something)",
            "definition": "to provide space for someone or something.  Make room for Sam. He needs a place to sit.  Can you make room for this package?"
        },
        {
            "id": 130,
            "phrase": "make sense",
            "definition": "to be understandable.  John doesn’t make sense.  What John says makes sense to me."
        },
        {
            "id": 131,
            "phrase": "make (some) sense (out) of someone or something",
            "definition": "to understand someone or something.  I can’t make sense out of Doris and what she has done! _ No one can make sense out of Tom’s story."
        },
        {
            "id": 132,
            "phrase": "make someone an offer",
            "definition": "to offer someone an amount of money for something. (Usually an invitation.) _ Do you like it? Make me an offer."
        },
        {
            "id": 133,
            "phrase": "make someone eat crow",
            "definition": "to cause someone to retract a statement or admit an error.  Because Mary was completely wrong, we made her eat crow.  They won’t make me eat crow. They can’t prove I was wrong."
        },
        {
            "id": 134,
            "phrase": "make someone look good",
            "definition": "to cause someone to appear successful or competent (especially when this is not the case).  John arranges all his affairs to make himself look good.  The manager didn’t like the quarterly report because it didn’t make her look good."
        },
        {
            "id": 135,
            "phrase": "make someone look ridiculous",
            "definition": "to make someone look foolish (not funny).  This hat makes me look ridiculous.  Please make me look good. Don’t make me look ridiculous!"
        },
        {
            "id": 136,
            "phrase": "make someone or something available to someone",
            "definition": "to supply someone with someone or something.  I made my car available to Bob.  They made their maid available to us."
        },
        {
            "id": 137,
            "phrase": "make someone or something into something",
            "definition": "to turn someone or something into something.  I will make you into a Hollywood star! _ We made our basement into a family room."
        },
        {
            "id": 138,
            "phrase": "make someone or something tick",
            "definition": "to cause someone or something to run or function. (Usually with what. Tick refers to a watch or clock.) _ I don’t know what makes it tick. What makes John tick? I just don’t understand him.  I took apart the radio to find out what made it tick."
        },
        {
            "id": 139,
            "phrase": "make someone’s blood boil",
            "definition": "to make someone very angry. It just makes my blood boil to think of the amount of food that gets wasted around here.  Whenever I think of that dishonest mess, it makes my blood boil."
        },
        {
            "id": 140,
            "phrase": "make someone’s blood run cold",
            "definition": "to shock or horrify someone.  The terrible story in the newspaper made my blood run cold.  I could tell you things about prisons that would make your blood run cold."
        },
        {
            "id": 141,
            "phrase": "make someone’s gorge rise",
            "definition": "to cause someone to become very angry.  The unnecessary accident made my gorge rise.  Getting his tax bill made Bob’s gorge rise."
        },
        {
            "id": 142,
            "phrase": "make someone’s hair stand on end",
            "definition": "to cause someone to be very frightened. The horrible scream made my hair stand on end.  The ghost story made our hair stand on end."
        },
        {
            "id": 143,
            "phrase": "make someone’s mind up†",
            "definition": "to decide; to do something that decides something for someone.  Will you please make up your mind? _ I will help make up your mind."
        },
        {
            "id": 144,
            "phrase": "make someone’s mouth water",
            "definition": "to make someone hungry (for something); to cause saliva to flow in someone’s mouth.  That beautiful salad makes my mouth water.  Talking about food makes my mouth water."
        },
        {
            "id": 145,
            "phrase": "make someone’s position clear",
            "definition": "to clarify where someone stands on an issue.  I don’t think you understand what I said. Let me make my position clear.  I can’t tell whether you are in favor of or against the proposal. Please make your position clear."
        },
        {
            "id": 146,
            "phrase": "make someone sick",
            "definition": "to disgust someone. I am really tired of your vile talk. You make me sick! _ She screamed at him that he made her sick and then she ran out of the house."
        },
        {
            "id": 147,
            "phrase": "make someone the scapegoat for something",
            "definition": "to make someone take the blame for something. They made Tom the scapegoat for the whole affair. It wasn’t all his fault.  Don’t try to make me the scapegoat. I’ll tell who really did it."
        },
        {
            "id": 148,
            "phrase": "make someone up†",
            "definition": "to put makeup on someone. You have to make the clowns up before you start on the other characters in the play.  Did you make up the clowns?"
        },
        {
            "id": 149,
            "phrase": "make something about someone or something",
            "definition": "to make comments, remarks, a furor, a fuss, etc., about someone or something. Why are you making such a furor about such a minor matter? _ You are making too many negative remarks about Sue."
        },
        {
            "id": 150,
            "phrase": "make something against someone or something",
            "definition": "to build a legal case, argument, speech, etc., against someone or something.  The prosecutor made a strong case against Tim.  I made a strong speech against the proposed legislation."
        },
        {
            "id": 151,
            "phrase": "make something at someone",
            "definition": "to make some sign or signal at or to a person.  Carlo made a sign at Bill, who seemed to know just what to do.  Jimmy made an obscene gesture at me!"
        },
        {
            "id": 152,
            "phrase": "make something clear to someone",
            "definition": "to help someone understand something. Let me help make the contract clear to you. I want to make it clear to you, so ask questions if you want."
        },
        {
            "id": 153,
            "phrase": "make something for someone or something",
            "definition": "to prepare something for someone or something.  I made a big bowl of fruit salad for the visitors.  James made a cake for the party."
        },
        {
            "id": 154,
            "phrase": "make something from something",
            "definition": "to make something from certain parts or ingredients.  I made this cake from fresh butter and eggs.  They made the fences from the stones of a ruined Roman fort."
        },
        {
            "id": 155,
            "phrase": "make something in something",
            "definition": "to make money in a particular enterprise.  She made a lot of money in real estate.  I hope to make some money in the stock market."
        },
        {
            "id": 156,
            "phrase": "make something out†",
            "definition": "to see, read, or hear something well enough to understand it.  What did you say? I couldn’t quite make it out.  Can you make out what he is saying?"
        },
        {
            "id": 157,
            "phrase": "make something out of nothing",
            "definition": "to create something of value from nearly worthless parts. My uncle— he sells sand—made a fortune out of nothing.  My model airplane won the contest even though I made it out of scrap."
        },
        {
            "id": 158,
            "phrase": "make something out to be something else",
            "definition": "to portray something as something else.  You are trying to make this tragedy out to be a minor matter.  They made the disease out to be something far more serious than it really is."
        },
        {
            "id": 159,
            "phrase": "make something to order",
            "definition": "to custom-make an item; to make an item to fit someone’s specifications.  The tailor made the jacket to order for me.  The carpenter made the built-in bookcase to order for us."
        },
        {
            "id": 160,
            "phrase": "make something up†",
            "definition": "1. to redo something; to do something that one has failed to do in the past.  Can I make the lost time up? _ Can I make up the test that I missed? 2. to assemble something.  We will ship the parts to China where we will make up the computers with cheap labor. Have they finished making up the pages for the next edition of the magazine? 3. to think up something; to make and tell a lie.  That’s not true! You just made that up! _ I didn’t make it up! _ You made up that story! 4. to mix something up; to assemble something.  John: Is my prescription ready? Druggist: No, I haven’t made it up yet.  I’ll make up your prescription in a minute."
        },
        {
            "id": 161,
            "phrase": "make something up† from something",
            "definition": "to create something from something.  I will make some stew up from the ingredients available in the fridge.  I will make up a stew from the leftovers."
        },
        {
            "id": 162,
            "phrase": "make something up† out of whole cloth",
            "definition": "to fabricate a story or a lie.  That’s a lie. You just made that up out of whole cloth.  That’s a lie. You just made up that story out of whole cloth."
        },
        {
            "id": 163,
            "phrase": "make something up to someone",
            "definition": "to make amends to someone.  I’m so sorry. I will do what I can to make it up to you.  I will make it up to them. Don’t worry."
        },
        {
            "id": 164,
            "phrase": "make something with something",
            "definition": "to make something out of something.  I will make the cake with margarine rather than butter.  Can you make our coffee with spring water, please?"
        },
        {
            "id": 165,
            "phrase": "make sure (of something)",
            "definition": "to check something and be certain about it.  Please make sure of your facts before you write the report.  We made sure of the route we had to follow before we left. Please double-check and make sure."
        },
        {
            "id": 166,
            "phrase": "make the arrangements",
            "definition": "Euph. to arrange a funeral.  A funeral services practitioner will be happy to help you make the arrangements.  When my father died, I was the one who made the arrangements."
        },
        {
            "id": 167,
            "phrase": "make the best of a bad job",
            "definition": "Prov. to try to salvage something from a ruined situation. When the dry cleaners ruined Mrs. Anderson’s coat, they made the best of a bad job by offering to buy her another one."
        },
        {
            "id": 168,
            "phrase": "make the best of something",
            "definition": "to do as well as possible with something that is not too promising.  I don’t like it, but I will try to make the best of my summer landscaping job by getting a good tan. I will make the best of it, for a while anyway."
        },
        {
            "id": 169,
            "phrase": "make the grade",
            "definition": "to be satisfactory; to be what is expected.  I’m sorry, but your work doesn’t exactly make the grade.  This meal doesn’t just make the grade. It is excellent."
        },
        {
            "id": 170,
            "phrase": "make the most of something",
            "definition": "to make something appear as good as possible; to exploit something; to get as much out of something as is possible.  Mary knows how to make the most of her talents.  They designed the advertisements to make the most of the product’s features."
        },
        {
            "id": 171,
            "phrase": "make the scene",
            "definition": "1. Sl. to attend an event.  We plan to make the scene, but we may be a bit late.  I hope everybody can make the scene. 2. Sl. to understand a situation; to appreciate the situation.  I can’t quite make the scene, but it looks like Willie punched the guy over here. Then he moved to the window over here, and that’s when the woman across the street saw him.  I can make the scene. It’s just like you said, except Willie came in and found the guy laid out on the f loor."
        },
        {
            "id": 172,
            "phrase": "make the team",
            "definition": "to have been qualified enough to be selected to play on a sports team. I tried out, but I didn’t make the team."
        },
        {
            "id": 173,
            "phrase": "make time (with someone)",
            "definition": "to flirt with, date, or hang around with someone.  I hear that Tom’s been making time with Ann.  I hear they’ve been making time for months."
        },
        {
            "id": 174,
            "phrase": "make (too) much of someone or something",
            "definition": "to pay too much attention to someone or something. We all believe you are making much of Tom when he has done no more than anyone else. Don’t make too much of it. It was really nothing."
        },
        {
            "id": 175,
            "phrase": "make tracks (for something)",
            "definition": "to move rapidly toward something or some place.  The cowboys all made tracks for the chuck wagon.  Let’s make tracks! Here comes the sheriff."
        },
        {
            "id": 176,
            "phrase": "make trouble",
            "definition": "to cause trouble or additional work.  I don’t want to make trouble, but I have a few suggestions that could make things work more smoothly."
        },
        {
            "id": 177,
            "phrase": "make up",
            "definition": "to put on makeup.  I have to go make up before Joe comes to pick me up."
        },
        {
            "id": 178,
            "phrase": "make up a foursome",
            "definition": "to assemble into a team of four people.  We have three people now. Who can we get to make up a foursome? _ Let’s make up a foursome and play bridge."
        },
        {
            "id": 179,
            "phrase": "make up for lost time",
            "definition": "to catch up; to go fast to balance a period of going slow or not moving.  We drove as fast as we could, trying to make up for lost time.  Hurry. We have to make up for lost time."
        },
        {
            "id": 180,
            "phrase": "make up for someone or something",
            "definition": "1. to take the place of someone or something. John can’t play in the game Saturday, but I think I can make up for him.  Do you think that this cat can make up for the one that ran away? 2. to compensate for someone or something someone did.  We all had to do extra work to make up for Harry, who was very tired from being out late the night before.  We will certainly make up for what we failed to do."
        },
        {
            "id": 181,
            "phrase": "make up something",
            "definition": "to constitute something. Two chapters make up this volume.  Over forty freight cars made up the train."
        },
        {
            "id": 182,
            "phrase": "make up (to someone)",
            "definition": "1. to apologize to someone.  It’s too late to make up to me. I think you should go make up to Jerry. 2. to try to become friends with someone. Look how the cat is making up to Richard! _ Jimmy is making up to Donna, and she doesn’t even notice."
        },
        {
            "id": 183,
            "phrase": "make up (with someone)",
            "definition": "to reconcile with someone; to end a disagreement (with someone).  Bill and Max decided to make up.  They made up with each other and are now very good friends."
        },
        {
            "id": 184,
            "phrase": "make use of someone or something",
            "definition": "to utilize someone or something; to do something useful with someone or something.  Can you make use of these papers? _ We were unable to make use of the items you shipped to us."
        },
        {
            "id": 185,
            "phrase": "make war (on someone or something)",
            "definition": "to attack someone or something and start a war. The small country’s generals made war on the United States, hoping for foreign aid when they lost the war."
        },
        {
            "id": 186,
            "phrase": "make water",
            "definition": "Euph. to urinate. She’s got some kind of condition where it hurts when she makes water. Can we stop at this here gas station? I need to make water."
        },
        {
            "id": 187,
            "phrase": "make waves",
            "definition": "Sl. to cause difficulty. (Often in the negative.) _Just relax. Don’t make waves. If you make waves too much around here, you won’t last long."
        },
        {
            "id": 188,
            "phrase": "make way",
            "definition": "to make progress; to move ahead. (Originally nautical. See also make way (for someone or something).) _ Is this project making way? _ A sailboat can’t make way if there is no wind."
        },
        {
            "id": 189,
            "phrase": "make way (for someone or something)",
            "definition": "to clear a path for someone or something.  Make way for the stretcher.  Here comes the doctor—make way!"
        },
        {
            "id": 190,
            "phrase": "make with something",
            "definition": "Sl. to deliver something. Come on, make with the stuff you promised! _ Make with the information, Max, or you will stay in jail even longer! _ Come on, make with the cash.  I want to know. Come on, make with the answers!"
        },
        {
            "id": 191,
            "phrase": "Make your mind up†.",
            "definition": "Please make a decision.; Please choose. Henry: I don’t have all day. Make up your mind. Rachel: Don’t rush me. Bob: Make your mind up. We have to catch the plane. Mary: I’m not sure I want to go."
        },
        {
            "id": 192,
            "phrase": "Make yourself at home.",
            "definition": "Please make yourself comfortable in my home. (Also a signal that a guest can be less formal.) _ Andy: Please come in and make yourself at home. Sue: Thank you. I’d like to. Bill: I hope I’m not too early. Bob: Not at all. Come in and make yourself at home. I’ve got a few little things to do. Bill: Nice place you’ve got here."
        },
        {
            "id": 193,
            "phrase": "man about town",
            "definition": "a fashionable man who leads a sophisticated life.  He prefers a nightclub to a quiet night at home—a man about town.  Bob’s too much of a man about town to go to a football game."
        },
        {
            "id": 194,
            "phrase": "a man after my own heart",
            "definition": "a man with similar tastes and preferences to mine.  You like creamed chipbeef on toast? There’s a man after my own heart."
        },
        {
            "id": 195,
            "phrase": "Man does not live by bread alone.",
            "definition": "Prov. In order to survive, people need more than physical things like food and shelter.; People need mental or spiritual things like satisfaction and love. (Biblical.) _ Alan: I’m so miserable. Jill: How can you be miserable? You’ve got a good place to live, plenty to eat, nice clothes. . . . Alan: But man does not live by bread alone."
        },
        {
            "id": 196,
            "phrase": "the man in the street",
            "definition": "the ordinary person. Politicians rarely care what the man in the street thinks.  The man in the street has little interest in literature."
        },
        {
            "id": 197,
            "phrase": "A man is known by the company he keeps.",
            "definition": "Prov. A person tends to associate with people who are like him or her. Son, when you go away to school, spend your time with serious people; don’t hang around with people who go to parties all the time. A man is known by the company he keeps.  If you want to know what kind of person George is, look at his friends. A man is known by the company he keeps."
        },
        {
            "id": 198,
            "phrase": "a man of few words",
            "definition": "someone, not necessarily a man, who speaks concisely or not at all.  He is a man of few words, but he usually makes a lot of sense."
        },
        {
            "id": 199,
            "phrase": "a man of the cloth",
            "definition": "a clergyman.  Father Brown is a man of the cloth and is welcome at our table for dinner every Sunday."
        },
        {
            "id": 200,
            "phrase": "Man proposes, God disposes.",
            "definition": "Prov. People may make plans, but they cannot control the outcome of their plans.  Jill: Are you really going to be able to finish writing your novel by the end of the year? Bob: Man proposes, God disposes."
        },
        {
            "id": 201,
            "phrase": "man’s best friend",
            "definition": "a dog; dogs in general.  Man’s best friend just peed all over my shoes!"
        },
        {
            "id": 202,
            "phrase": "A man’s home is his castle.",
            "definition": "Prov. Cliché One can do whatever one wants to in one’s own home.  Don’t tell me not to go around the house in my underwear. A man’s home is his castle.  I’ll play my radio loud if I want to. A man’s home is his castle."
        },
        {
            "id": 203,
            "phrase": "man’s inhumanity to man",
            "definition": "human cruelty toward other humans. It doesn’t take a war to remind us of man’s inhumanity to man."
        },
        {
            "id": 204,
            "phrase": "manage with someone or something",
            "definition": "to do as well as possible with only someone or something (less than one had hoped for). We wanted Kelly to help us, but we will manage with Larry. I am sure we can manage with the money that we have."
        },
        {
            "id": 205,
            "phrase": "manage without someone or something",
            "definition": "to do as well as possible without someone or something. Carla said that she just can’t manage without Jerry.  We just can’t manage without some more money."
        },
        {
            "id": 206,
            "phrase": "maneuver for something",
            "definition": "to get into position for something.  Sally is maneuvering for a shot at a promotion.  Todd maneuvered for some attention, but they ignored him."
        },
        {
            "id": 207,
            "phrase": "maneuver someone into something",
            "definition": "to lure, position, or deceive someone into (doing) something.  I will see if I can maneuver him into accepting the offer.  He was maneuvered into accepting the offer."
        },
        {
            "id": 208,
            "phrase": "maneuver someone out of something",
            "definition": "to trick someone out of getting or achieving something.  Are you trying to maneuver me out of the running for the job? _ The runner maneuvered her opponent out of first place."
        },
        {
            "id": 209,
            "phrase": "manna from heaven",
            "definition": "unexpected help or comfort. (A biblical reference.) _The arrival of the rescue team was like manna from heaven to the injured climber. The offer of a new job just as she had been fired was manna from heaven to Joan."
        },
        {
            "id": 210,
            "phrase": "many (and many)’s the time",
            "definition": "there have been many times.  Many and many’s the time I warned him not to go to the swimmin’ hole by himself. Many’s the time she’s forgiven her husband."
        },
        {
            "id": 211,
            "phrase": "Many are called but few are chosen.",
            "definition": "Prov. Many people may answer a call for something, but only a few people are finally selected. (Biblical.) _ When it comes to getting into a good college, many are called but few are chosen."
        },
        {
            "id": 212,
            "phrase": "Many hands make light work.",
            "definition": "Prov. If everyone helps with a large task, it will get done easily and quickly.  Cleaning up the banquet room won’t take long if we all help; many hands make light work. You do have a lot of dishes to wash, but you also have all of us to help you, and many hands make light work."
        },
        {
            "id": 213,
            "phrase": "map something out†",
            "definition": "to plot something out carefully, usually on paper.  I have a good plan. I will map it out for you.  I will map out the plan for you."
        },
        {
            "id": 214,
            "phrase": "mar something up†",
            "definition": "to dent or scratch something; to harm the smooth finish of something.  Please don’t mar the furniture up.  Don’t mar up my desk."
        },
        {
            "id": 215,
            "phrase": "march against someone or something",
            "definition": "to march in a demonstration against someone or something.  The demonstrators marched against the mayor.  The citizens got together and marched against crime and injustice."
        },
        {
            "id": 216,
            "phrase": "march (from some place) (to some place)",
            "definition": "to move along, walking with purposeful steps, from some place to some place.  The army marched from one town to another.  They marched to the battlefield from town."
        },
        {
            "id": 217,
            "phrase": "march on",
            "definition": "to continue marching.  Please march on. Don’t stop here; there are other parts of the parade coming along behind you. Let’s march on. We have a long way to go."
        },
        {
            "id": 218,
            "phrase": "march past someone or something",
            "definition": "to move in a file or formation past someone or something.  The people in the parade marched past the children standing on the curb.  The soldiers marched past the general."
        },
        {
            "id": 219,
            "phrase": "march to (the beat of) a different drummer",
            "definition": "to believe in a different set of principles.  John is marching to a different drummer, and he doesn’t associate with us anymore.  Since Sally started marching to the beat of a different drummer, she has had a lot of great new ideas."
        },
        {
            "id": 220,
            "phrase": "mark my word(s)",
            "definition": "remember what I’m telling you.  Mark my word, you’ll regret this.  This whole project will fail—mark my words."
        },
        {
            "id": 221,
            "phrase": "mark someone down†",
            "definition": "[for a teacher] to give someone a low score.  He’ll mark you down for misspelled words.  I marked down Tom for bad spelling."
        },
        {
            "id": 222,
            "phrase": "mark someone for life",
            "definition": "to affect someone for life.  The tragedy marked her for life and she was never the same.  She was marked for life by her brother’s untimely death."
        },
        {
            "id": 223,
            "phrase": "mark someone or something with something",
            "definition": "1. to use something with which to mark someone or something.  She marked one of the twins with a sticker so she could identify him later.  Jill marked the ones that were sold with a wax pencil. 2. to place a particular kind of mark on someone or something.  The attendant marked the concertgoers who had paid with a rubber stamp.  Frank marked the book with his initials."
        },
        {
            "id": 224,
            "phrase": "mark something as something",
            "definition": "to make a mark next to the name of something on a list indicating what the thing is.  I will mark this one as expired.  This one is marked as needing repair work."
        },
        {
            "id": 225,
            "phrase": "mark something down†",
            "definition": "to write something down on paper.  She marked the number down on the paper. She marked down the number."
        },
        {
            "id": 226,
            "phrase": "mark something in†",
            "definition": "to write or make a mark on something, perhaps in a box or on a line.  I will mark an X in the box by your name.  I’ll mark in the X."
        },
        {
            "id": 227,
            "phrase": "mark something up†",
            "definition": "1. to mess something up with marks.  Don’t mark up your book! _ Who marked this book up? 2. to grade a paper and make lots of informative marks and comments on it.  The teacher really marked up my term paper.  Why did you mark my test up so much? I hardly made any errors. 3. to raise the price of something. The grocery store seems to mark the price of food up every week. They don’t mark up the price of turkey at Thanksgiving."
        },
        {
            "id": 228,
            "phrase": "mark time",
            "definition": "to wait; to do nothing but wait.  I’ll just mark time till things get better.  Do you expect me to just stand here and mark time?"
        },
        {
            "id": 229,
            "phrase": "*a marked man",
            "definition": "to be someone, usually a male, who is in danger from harm by someone else. (*Typically: be ~; live like ~.) _ Bob’s a marked man. His parents found out that he’s skipping school. Fred’s a marked man, too. Jack is looking for him to get his money back."
        },
        {
            "id": 230,
            "phrase": "maroon someone on an island",
            "definition": "to strand someone on something; to abandon someone on something, such as an island.  The pirate captain marooned his first mate on a small island in the Caribbean.  Through a navigation error, I marooned myself on a tiny island east of Guam."
        },
        {
            "id": 231,
            "phrase": "Marriages are made in heaven.",
            "definition": "Prov. You cannot foretell who will marry whom.; Two people may love each other very much but may end up not marrying each other, and two people who do not even know each other may marry each other in the end.  Tom and Eliza were childhood sweethearts, had a happy family, and now are celebrating their fiftieth wedding anniversary. Marriages are made in heaven."
        },
        {
            "id": 232,
            "phrase": "marry above oneself",
            "definition": "to marry someone in a higher social class than oneself. They say she married above herself, but who cares? _ Scott thought it would not be possible to marry above himself."
        },
        {
            "id": 233,
            "phrase": "Marry in haste, (and) repent at leisure.",
            "definition": "Prov. If you marry someone you do not know well, or decide to marry someone without first carefully considering what you are doing, you will probably regret it for a long time.  Sally wanted some time to consider Sam’s proposal of marriage; she had heard the saying, “Marry in haste, and repent at leisure.”"
        },
        {
            "id": 234,
            "phrase": "marry into something",
            "definition": "to become a part of a family or a fortune by marriage.  She married into money, they say.  I always wanted to marry into a large family until I found out what that means in terms of buying gifts."
        },
        {
            "id": 235,
            "phrase": "marry one’s way out of something",
            "definition": "to get out of something, such as poverty, by marrying someone.  She was able to marry her way out of poverty but regretted it in the long run. Sally married her way out of one unhappy home into another one."
        },
        {
            "id": 236,
            "phrase": "marry someone off† (to someone)",
            "definition": "to manage to get someone married to someone and out of the house or family.  Her parents wanted nothing more than to marry her off to a doctor.  They married off their children soon."
        },
        {
            "id": 237,
            "phrase": "marry up (with someone)",
            "definition": "Rur. to marry someone. They married up in the spring.  Jane’s going to marry up with someone she met at school."
        },
        {
            "id": 238,
            "phrase": "marshal someone or something together",
            "definition": "to organize or gather someone or something together. The leader marshaled all his people together in preparation for the parade.  Let’s marshal the troops together for the attack."
        },
        {
            "id": 239,
            "phrase": "marvel at someone or something",
            "definition": "to express wonder or surprise at someone or something.  I can only marvel at Valerie and all she has accomplished. We all marveled at the beauty of the new building."
        },
        {
            "id": 240,
            "phrase": "a marvel to behold",
            "definition": "someone or something quite exciting or wonderful to see.  Our new high-definition television is a marvel to behold.  Mary’s lovely new baby is a marvel to behold."
        },
        {
            "id": 241,
            "phrase": "mash on something",
            "definition": "to press on something, such as a button. (Southern.) _ He kept mashing on the doorbell until someone responded. Just mash on this button if you want someone to come."
        },
        {
            "id": 242,
            "phrase": "mash something up†",
            "definition": "to crush something into a paste or pieces. Mash the potatoes up and put them in a bowl.  Mash up the potatoes and serve them to our guests."
        },
        {
            "id": 243,
            "phrase": "mash something with something",
            "definition": "1. to use something to mash something up.  Vernon mashed the potatoes with a spoon because he couldn’t find the masher. Gerald used the heel of his shoe to mash the wasp. 2. to combine ingredients while mashing. Mash the turnips with the butter.  She mashed the potatoes with sour cream, cream cheese, and a little garlic salt."
        },
        {
            "id": 244,
            "phrase": "mask something out†",
            "definition": "to conceal or cover part of something from view.  The trees masked the city dump out, so it could not be seen from the street.  The trees masked out the dump."
        },
        {
            "id": 245,
            "phrase": "masquerade as someone or something",
            "definition": "to appear disguised as someone or something; to pretend to be someone or something.  We decided to masquerade as ghosts for the party. Mr. Wilson, who is a bit overweight, masqueraded as Cinderella’s coach."
        },
        {
            "id": 246,
            "phrase": "a match for someone, something, or an animal",
            "definition": "someone, something, or an animal that is the equal of someone, something, or some other animal, especially in a contest.  My older brother is no match for me; he’s much weaker.  Your horse is no match for mine in a race. Mine will always win."
        },
        {
            "id": 247,
            "phrase": "match someone against someone else or something against something else",
            "definition": "to challenge someone with someone else in a contest; to challenge something with something else in a contest. I will match my boxer against your boxer any day.  I’ll match myself against you any day!"
        },
        {
            "id": 248,
            "phrase": "match someone or something in something",
            "definition": "to equal someone or something in some quality. I am sure I match her in wisdom if not in grace and beauty.  You do not match her in any way."
        },
        {
            "id": 249,
            "phrase": "match up",
            "definition": "[for things or people] to match, be equal, or complementary.  These match up. See how they are the same length? _ Sorry, but these two parts don’t match up."
        }
    ]
}