{
    "dictionary": [
        {
            "id": 0,
            "phrase": "in control of someone or something",
            "definition": "1. in charge of someone or something.  Who is in control of this place? _ I am not in control of her. She works for another department. 2. to have someone or something mastered or subdued; to have achieved management of someone or something.  You should be in control of your dog at all times.  The attendant was instructed to be in control of his patient at all times."
        },
        {
            "id": 1,
            "phrase": "in debt",
            "definition": "having debts; having much debt; owing money.  Mary is deeply in debt.  I am in debt to the bank for my car loan."
        },
        {
            "id": 2,
            "phrase": "in deep",
            "definition": "1. Fig. deeply involved (with someone or something). Mary and Sam are in deep. Wilbur got in deep with the mob. 2. Fig. deeply in debt. (Often with with or to.) _ Willie is in deep with his bookie.  I’m in deep to the department store."
        },
        {
            "id": 3,
            "phrase": "in deep water",
            "definition": "in a dangerous or vulnerable situation; in a serious situation, especially one that is too difficult or is beyond the level of one’s abilities; in trouble.  John is having trouble with back taxes. He’s in deep water.  Bill got in deep water in algebra class. The class is too difficult for him, and he’s almost failing."
        },
        {
            "id": 4,
            "phrase": "in defiance (of someone or something)",
            "definition": "against someone’s will or against instructions; in bold resistance to someone or someone’s orders. Jane spent the afternoon in the park in defiance of her mother’s instructions. She did it in defiance of her mother.  She has done a number of things in defiance lately."
        },
        {
            "id": 5,
            "phrase": "in denial",
            "definition": "in a state of refusing to believe something that is true. Mary was in denial about her illness and refused treatment.  Tom doesn’t think he’s an alcoholic because he’s still in denial."
        },
        {
            "id": 6,
            "phrase": "in detail",
            "definition": "with lots of details; giving all the details. (Often used with an adjective showing the level of detail, such as great, enormous, etc., as in the second example.) _ I explained the policy to the customer in detail. We planned the entire project in great detail."
        },
        {
            "id": 7,
            "phrase": "in dire straits",
            "definition": "in a very serious, bad circumstance.  We are nearly broke and need money for medicine. We are in dire straits."
        },
        {
            "id": 8,
            "phrase": "in disguise",
            "definition": "hidden behind a disguise; looking like something else.  Santa Claus was really the little child’s father in disguise.  What I thought was terrible turned out to be a blessing in disguise!"
        },
        {
            "id": 9,
            "phrase": "in drag",
            "definition": "wearing the clothing of the opposite sex. (Usually refers to a man wearing women’s clothing.) _ Two actors in drag did a skit about life on the farm.  Gary looks better in drag than he does in a suit."
        },
        {
            "id": 10,
            "phrase": "in dribs and drabs",
            "definition": "in small portions; bit by bit.  I’ll have to pay you what I owe you in dribs and drabs.  The whole story is being revealed in dribs and drabs."
        },
        {
            "id": 11,
            "phrase": "in droves",
            "definition": "in large numbers.  The settlers arrived on the prairie in droves."
        },
        {
            "id": 12,
            "phrase": "*in Dutch (with someone)",
            "definition": "in trouble with someone. (*Typically: be ~; get ~.) _I’m in Dutch with my parents for my low grades.  You’re in Dutch quite often, it seems."
        },
        {
            "id": 13,
            "phrase": "*in earnest",
            "definition": "with sincerity. (*Typically: act ~; be ~; speak ~.) _ I’ve done all the research I need. I spent the day writing the paper in earnest. Mary’s comments were in earnest. She really meant them."
        },
        {
            "id": 14,
            "phrase": "in effect",
            "definition": "producing a particular effect; effectively.  In effect, this new law will raise taxes for most people.  This policy harms domestic manufacturers. In effect, all our clothing will be made in foreign countries."
        },
        {
            "id": 15,
            "phrase": "in essence",
            "definition": "basically; essentially.  I have lots of detailed advice for you, but in essence, I want you to do the best you can.  In essence, lightning is just a giant spark of electricity."
        },
        {
            "id": 16,
            "phrase": "in exchange (for someone or something)",
            "definition": "in return for someone or something. They gave us two of our prisoners in exchange for two of theirs.  I gave him chocolate in exchange for some licorice.  John gave Mary a book and got a sweater in exchange."
        },
        {
            "id": 17,
            "phrase": "in existence",
            "definition": "now existing; currently and actually being.  The tiger may not be in existence in a few decades.  All the oil in existence will not last the world for another century."
        },
        {
            "id": 18,
            "phrase": "in fact",
            "definition": "in reality; really; actually.  I’m over forty. In fact, I’m forty-six.  This is a very good computer. In fact, it’s the best."
        },
        {
            "id": 19,
            "phrase": "in fashion",
            "definition": "in style; current and socially acceptable.  Is that kind of thing still in fashion? _ It won’t be in fashion very long."
        },
        {
            "id": 20,
            "phrase": "in favor of someone",
            "definition": "to someone, as when writing a check.  Please make out a check for $300 in Tom’s favor.  I’m making out the check in favor of Mr. Brown."
        },
        {
            "id": 21,
            "phrase": "in favor (of someone or something)",
            "definition": "approving, supporting, or endorsing someone or something.  Are you in favor of lower taxes? _ Of course, I’m in favor."
        },
        {
            "id": 22,
            "phrase": "in fear and trembling",
            "definition": "Cliché with anxiety or fear; with dread. In fear and trembling, I went into the room to take the test. The witness left the courtroom in fear and trembling."
        },
        {
            "id": 23,
            "phrase": "in fine feather",
            "definition": "1. Fig. well dressed; of an excellent appearance. (Alludes to a bird that has clean, bright, and flawless feathers.) _Well, you are certainly in fine feather today.  I like to be in fine feather when I have to give a speech. 2. Fig. in good form; in good spirits.  Mary was really in fine feather tonight. Her concert was great! _ I feel in fine feather and ready to go!"
        },
        {
            "id": 24,
            "phrase": "in flight",
            "definition": "while flying. A passenger became ill in f light and the pilot had to return to the airport.  I really don’t care to eat in f light. I am too nervous."
        },
        {
            "id": 25,
            "phrase": "*in focus",
            "definition": "[of an image] seen clearly and sharply. (*Typically: be ~; come [into] ~; get [into] ~; get something [into] ~.) _ I have the slide in focus and can see the bacteria clearly."
        },
        {
            "id": 26,
            "phrase": "*in force",
            "definition": "1. [of a rule or law] currently valid or in effect. (*Typically: be ~.) _Is this rule in force now? _The constitution is still in force. 2. Fig. in a very large group. (*Typically: arrive ~; attack ~.) _The entire group arrived in force.  The mosquitoes will attack in force this evening. in hot in full flight fleeing at great speed; escaping rapidly.  The robbers were in full f light before the bank manager even called the sheriff."
        },
        {
            "id": 27,
            "phrase": "in general",
            "definition": "referring to the entire class being discussed; speaking of the entire range of possibilities; in most situations or circumstances.  I like vegetables in general, but not beets.  In general, I prefer a hotel room on a lower f loor, but will take a higher room if it’s special."
        },
        {
            "id": 28,
            "phrase": "in glowing terms",
            "definition": "using words of praise; using complimentary expressions.  The college president described his accomplishments in glowing terms and awarded him with an honorary degree."
        },
        {
            "id": 29,
            "phrase": "in good faith",
            "definition": "with good and honest intent; with sincerity.  We are convinced you were acting in good faith, even though you made a serious error.  I think you didn’t sign the contract in good faith. You never intended to carry out our agreement."
        },
        {
            "id": 30,
            "phrase": "in good hands",
            "definition": "in the safe, competent care of someone.  Don’t worry. Your children are in good hands. Sally is an experienced baby-sitter.  Your car is in good hands. My mechanics are factory-trained."
        },
        {
            "id": 31,
            "phrase": "in good repair",
            "definition": "operating well; well taken care of. (Usually said of a thing rather than a person.) _The house is in good repair and ought to attract a number of potential buyers.  If the car were in good repair, it would run more smoothly."
        },
        {
            "id": 32,
            "phrase": "in good spirits",
            "definition": "happy and cheerful; positive and looking toward the future, despite unhappy circumstances.  The patient is in good spirits and that will speed her recovery. Tom wasn’t in very good spirits after he heard the bad news."
        },
        {
            "id": 33,
            "phrase": "in great demand",
            "definition": "wanted by many people.  Liz is in great demand as a singer.  Mary’s paintings are in great demand."
        },
        {
            "id": 34,
            "phrase": "in great haste",
            "definition": "very fast; in a big hurry.  John always did his homework in great haste.  Why not take time and do it right? Don’t do everything in great haste."
        },
        {
            "id": 35,
            "phrase": "*in hand",
            "definition": "in one’s possession or control. (*Typically: be ~; have something ~.) _It’s in hand. I have it right here.  The papers are in hand. Have no fear."
        },
        {
            "id": 36,
            "phrase": "*in harm’s way",
            "definition": "liable to be harmed; subject to potential causes of harm. (*Typically: be ~; get ~; put someone ~.) _ Soldiers are expected to know what to do when they are in harm’s way."
        },
        {
            "id": 37,
            "phrase": "*in harmony (with someone or something)",
            "definition": "in musical concord with someone or something. (*Typically: be ~; get ~.) _ This part is in harmony with the tenor’s solo.  The tenor part is not in harmony with the accompaniment."
        },
        {
            "id": 38,
            "phrase": "*in heat",
            "definition": "in a period of sexual excitement; in estrus. (Estrus is the period of time in which females are most willing to breed. This expression is usually used for animals. It has been used for humans in a joking sense. *Typically: be ~; get [into] ~; go [into] ~.) _ Our dog is in heat.  She goes into heat every year at this time."
        },
        {
            "id": 39,
            "phrase": "in heaven",
            "definition": "in a state of absolute bliss or happiness.  Lisa was in heaven after winning the lottery.  Resting in his hammock, John was simply in heaven."
        },
        {
            "id": 40,
            "phrase": "in high dudgeon",
            "definition": "feeling or exhibiting great resentment; taking great offense at something. (Often with leave.) _ After the rude remarks, the person who was insulted left in high dudgeon.  Dennis strode from the room in high dudgeon, and we knew he would get his revenge eventually."
        },
        {
            "id": 41,
            "phrase": "*in high gear",
            "definition": "[of a machine, such as a car] set in its highest gear, giving the greatest speed. (*Typically: be ~; get [into] ~; move [into] ~.) _ When my car is in high gear, it goes very fast. You can’t start out in high gear. You must work up through the low ones. "
        },
        {
            "id": 42,
            "phrase": "in (high) hopes of something",
            "definition": "expecting something.  I was in hopes of getting there early.  We are in high hopes that John and Mary will have a girl."
        },
        {
            "id": 43,
            "phrase": "in hock",
            "definition": "in debt.  After buying the luxury car, Bob was in hock for years."
        },
        {
            "id": 44,
            "phrase": "in hog heaven",
            "definition": "very happy; having a wonderful time. Bill’s a fan of Clark Gable, so when the movie theater had a Clark Gable movie festival, Bill was in hog heaven. Jane loves to quilt, so she was in hog heaven when they opened that new store for quilters."
        },
        {
            "id": 45,
            "phrase": "in honor of someone or something",
            "definition": "showing respect or admiration for someone or something. Our club gave a party in honor of the club’s president.  I wrote a poem in honor of John and Mary’s marriage."
        },
        {
            "id": 46,
            "phrase": "in horror",
            "definition": "with intense shock or disgust.  Mike stepped back from the rattlesnake in horror.  The jogger recoiled in horror when she came upon a body in the park."
        },
        {
            "id": 47,
            "phrase": "*in hot water (with someone) (about someone or something)",
            "definition": "in trouble. (*Typically: be ~; get [into] ~.) _ You are going to get into hot water with Rebecca about that.  Amy got into hot water about Todd with Rebecca.  John got himself into hot water by being late."
        },
        {
            "id": 48,
            "phrase": "in ink",
            "definition": "written or signed with a pen that uses ink, not with a pencil. You should write your report in ink. You must sign your checks in ink."
        },
        {
            "id": 49,
            "phrase": "in jeopardy",
            "definition": "to be at risk; to be at peril.  John puts himself in jeopardy every time he goes skydiving.  I was in jeopardy when my car broke down on the deserted road."
        },
        {
            "id": 50,
            "phrase": "in kind",
            "definition": "1. in goods rather than in money.  The country doctor was usually paid in kind. He accepted two pigs as payment for an operation. Do you have to pay tax on payments made in kind? 2. similarly; [giving] something similar to what was received.  John punched Bill, and Bill gave it back in kind. She spoke rudely to me, so I spoke to her in kind."
        },
        {
            "id": 51,
            "phrase": "in labor",
            "definition": "[of a woman] experiencing the pains and exertion of childbirth.  Susan was in labor for nearly eight hours.  As soon as she had been in labor for an hour, she went to the hospital."
        },
        {
            "id": 52,
            "phrase": "in league (with someone)",
            "definition": "[of people] secretly cooperating, often to do something bad or illegal. The county sheriff is in league with criminals.  The car thieves and some crooked police are in league to make money from stolen cars."
        },
        {
            "id": 53,
            "phrase": "in less than no time",
            "definition": "very quickly.  I’ll be there in less than no time.  Don’t worry. This won’t take long. It’ll be over with in less than no time."
        },
        {
            "id": 54,
            "phrase": "in lieu of something",
            "definition": "in place of something; instead of something. (The word lieu occurs only in this phrase.) _ They gave me roast beef in lieu of ham.  We gave money to charity in lieu of sending f lowers to the funeral."
        },
        {
            "id": 55,
            "phrase": "*in limbo",
            "definition": "a region of the afterlife on the border of hell. (In some Christian religions, there is a limbo set aside for souls that do not go to either heaven or hell. This sense is used only in this religious context. *Typically: be ~; remain ~; stay ~.) _ The baby’s soul was in limbo because she had not been baptized."
        },
        {
            "id": 56,
            "phrase": "in love (with someone or something)",
            "definition": "feeling love for someone or something; experiencing a strong affectionate emotion for someone or something.  Mary was in love with her new car! It was perfect for her.  John is deeply in love with Mary."
        },
        {
            "id": 57,
            "phrase": "in low cotton",
            "definition": "Rur. depressed.  She was in low cotton because her dress got torn.  Jed is in low cotton because his favorite hound is dead."
        },
        {
            "id": 58,
            "phrase": "in luck",
            "definition": "fortunate; lucky.  You want a red one? You’re in luck. There is one red one left.  I had an accident, but I was in luck. It was not serious."
        },
        {
            "id": 59,
            "phrase": "in marching order",
            "definition": "organized and equipped; ready to go. (Originally military.) _ Is our luggage all packed and in marching order? _We’re in marching order and eager to go, sir."
        },
        {
            "id": 60,
            "phrase": "in memory of someone",
            "definition": "to continue the good memories of someone; for the honor of a deceased person.  Many streets were renamed in memory of John F. Kennedy.  We planted roses in memory of my deceased father."
        },
        {
            "id": 61,
            "phrase": "in midair",
            "definition": "in a point high in the air.  The planes crashed in midair.  Extra fuel was released from the plane in midair."
        },
        {
            "id": 62,
            "phrase": "*in mint condition",
            "definition": "in perfect condition. (*Typically: be ~; find something ~.) _This is a fine car. It runs well and is in mint condition. We saw a house in mint condition and decided to buy it."
        },
        {
            "id": 63,
            "phrase": "in my humble opinion",
            "definition": "Cliché a phrase introducing the speaker’s opinion. “In my humble opinion,” began Fred, arrogantly, “I have achieved what no one else ever could.” _ Bob: What are we going to do about the poor condition of the house next door? Bill: In my humble opinion, we will mind our own business."
        },
        {
            "id": 64,
            "phrase": "in name only",
            "definition": "nominally; not actual, only by terminology.  The president is head of the country in name only. Congress makes the laws.  Mr. Smith is the boss of the Smith Company in name only. Mrs. Smith handles all the business affairs."
        },
        {
            "id": 65,
            "phrase": "in need (of something)",
            "definition": "[of someone or an animal] to require something.  We are in need of a new car.  The company is in need of a larger building to hold all its employees."
        },
        {
            "id": 66,
            "phrase": "in neutral",
            "definition": "with the shift lever of a vehicle in the position where the motor is running but is not powering the wheels or other moving parts.  The car rolled down the hill because I’d left it in neutral and did not put on the brake.  If you are moving and in neutral, you do not have control of your vehicle."
        },
        {
            "id": 67,
            "phrase": "in no mood to do something",
            "definition": "not feeling like doing something; not wishing to do something.  I’m in no mood to cook dinner tonight. Mother is in no mood to put up with our arguing."
        },
        {
            "id": 68,
            "phrase": "in no time (at all)",
            "definition": "very quickly. (Compare this with in less than no time.) _ I’ll be there in no time.  It won’t take long. I’ll be finished in no time at all."
        },
        {
            "id": 69,
            "phrase": "in no uncertain terms",
            "definition": "Cliché in very specific and direct language.  I was so mad. I told her in no uncertain terms to leave and never come back.  I told him in no uncertain terms to stop calling me."
        },
        {
            "id": 70,
            "phrase": "*in on the act",
            "definition": "involved in something with someone else. (Often refers to an unwelcome attempt to join someone’s performance. *Typically: be ~; get ~; let someone ~.) _ Everybody wants to get in on the act.  Why are you trying to get in on the act?"
        },
        {
            "id": 71,
            "phrase": "*in on the ground floor",
            "definition": "involved at the very beginning of something. (Alludes to riding in an elevator that will become increasingly crowded as it ascends. You will be able to get in most easily at the lowest level. *Typically: be ~; get ~; let someone ~.) _ If you are starting a new project, I want to get in on the ground floor.  Invest now so you can get in on the ground f loor."
        },
        {
            "id": 72,
            "phrase": "*in one’s birthday suit",
            "definition": "naked; nude. (In the “clothes” in which one was born. *Typically: be ~; get [into] ~.) _I’ve heard that John sleeps in his birthday suit. We used to go down to the river and swim in our birthday suits."
        },
        {
            "id": 73,
            "phrase": "in one’s book",
            "definition": "according to one’s own opinion.  He’s okay in my book.  In my book, this is the best that money can buy."
        },
        {
            "id": 74,
            "phrase": "in one’s cups",
            "definition": "Euph. drunk. She doesn’t make much sense when she’s in her cups.  The speaker—who was in his cups—could hardly be understood."
        },
        {
            "id": 75,
            "phrase": "in one’s element",
            "definition": "in a natural or comfortable situation or environment. Sally is in her element when she’s working with algebra or calculus. Bob loves to work with color and texture. When he’s painting, he’s in his element."
        },
        {
            "id": 76,
            "phrase": "in one’s glory",
            "definition": "at one’s happiest or best.  When I go to the beach on vacation, I’m in my glory.  Sally is a good teacher. She’s in her glory in the classroom."
        },
        {
            "id": 77,
            "phrase": "in one’s mind’s eye",
            "definition": "in one’s mind or imagination. (Alludes to visualizing something in one’s mind.) _In my mind’s eye, I can see trouble ahead.  In her mind’s eye, she could see a beautiful building beside the river. She decided to design such a building."
        },
        {
            "id": 78,
            "phrase": "in one’s opinion",
            "definition": "according to one’s belief or judgment.  In my opinion, that is a very ugly picture.  That isn’t a good idea in my opinion."
        },
        {
            "id": 79,
            "phrase": "in one’s or its prime",
            "definition": "at one’s or its peak or best time.  Our dog—which is in its prime—is very active.  The building was in its prime back in the Fifties, but it has not been well maintained.  I could work long hours when I was in my prime."
        },
        {
            "id": 80,
            "phrase": "in one’s (own) backyard",
            "definition": "very close to one, where one lives, or where one is.  That kind of thing is quite rare. Imagine it happening right in your backyard. You always think of something like that happening to someone else. You never expect to find it in your own backyard."
        },
        {
            "id": 81,
            "phrase": "in one’s (own) (best) interest(s)",
            "definition": "to one’s advantage; as a benefit to oneself. It is not in your own interests to share your ideas with Jack. He will say that they are his.  Jane thought it was in the best interest of her friend to tell his mother about his illness."
        },
        {
            "id": 82,
            "phrase": "in one’s own way",
            "definition": "1. as the best one can do; using a personal and individual strategy.  I don’t know the answer to the problem, but perhaps I can help in my own way.  She couldn’t go to war and carry a gun, but she helped the war effort in her own way. 2. in the special way that one wishes or demands. I don’t like doing it your way. I want to do it in my own way.  I prefer to do it in my own way."
        },
        {
            "id": 83,
            "phrase": "in one’s right mind",
            "definition": "sane; rational and sensible. (Often in the negative.) _ That was a stupid thing to do. You’re not in your right mind.  You can’t be in your right mind! That sounds crazy!"
        },
        {
            "id": 84,
            "phrase": "in one’s salad days",
            "definition": "in one’s youth. (Usually formal or literary. Comparing the greenness of a salad with the greenness, or freshness and inexperience, of youth.) _ I recall the joys I experienced on school vacations in my salad days.  In our salad days, we were apt to get into all sorts of mischief on the weekends."
        },
        {
            "id": 85,
            "phrase": "in one’s second childhood",
            "definition": "[of an adult] interested in things or people that normally interest children.  My father bought himself a toy train, and my mother said he was in his second childhood.  Whenever I go to the river and throw stones, I feel as if I’m in my second childhood."
        },
        {
            "id": 86,
            "phrase": "in one’s spare time",
            "definition": "in one’s extra time; in the time not reserved for work or doing something else. I write novels in my spare time. I’ll try to paint the house in my spare time."
        },
        {
            "id": 87,
            "phrase": "*in one’s Sunday best",
            "definition": "Rur. in one’s best clothes; in the clothes one wears to church. (*Typically: be ~; get [into] ~.) _All the children were dressed up in their Sunday best. I like to be in my Sunday best whenever I go out.  Let’s get into our Sunday best and go out for dinner."
        },
        {
            "id": 88,
            "phrase": "in opposition (to someone or something)",
            "definition": "against someone or something; opposing someone or something.  You’ll find that I’m firmly in opposition to any further expenditures.  The council and the mayor are usually in opposition."
        },
        {
            "id": 89,
            "phrase": "*in orbit",
            "definition": "[of something] circling a heavenly body. (*Typically: be ~; put something [into] ~.) _ The moon is in orbit around the earth.  They put the satellite into orbit."
        },
        {
            "id": 90,
            "phrase": "*in order",
            "definition": "properly arranged. (*Typically: get something ~; have something ~; put something ~.) _ Please get your desk in order.  I wish you would put things in order!"
        },
        {
            "id": 91,
            "phrase": "in order to do something",
            "definition": "for the purpose of doing something; as a means of doing something.  I went to college in order to further my education.  I gave John three dollars in order to buy lunch."
        },
        {
            "id": 92,
            "phrase": "in other words",
            "definition": "a phrase introducing a restatement of what has just been said.  Henry: Sure I want to do it, but how much do I get paid? Andrew: In other words, you’re just doing it for the money. Bill: Well, I suppose I really should prepare my entourage for departure. Bob: In other words, you’re leaving? Bill: One could say that, I suppose. Bob: Why didn’t one?"
        },
        {
            "id": 93,
            "phrase": "*in over one’s head (with someone or something)",
            "definition": "in water that is deeper than one is tall. (*Typically: be ~; get ~.) _ Johnny! Don’t go out too far! You are in over your head."
        },
        {
            "id": 94,
            "phrase": "in park",
            "definition": "[of an automobile transmission] having the gears locked so the automobile cannot move.  The driver stopped the car and placed it in park.  You have to be in park in order to start this car."
        },
        {
            "id": 95,
            "phrase": "in part",
            "definition": "partly; to a lesser degree or extent. I was not there, in part because of my disagreement about the purpose of the meeting. I also had a previous appointment.  I hope to win, in part because I want the prize money."
        },
        {
            "id": 96,
            "phrase": "in particular",
            "definition": "specifically; especially. I’m not going anywhere in particular.  Of the three ideas, there is one I like in particular."
        },
        {
            "id": 97,
            "phrase": "in passing",
            "definition": "casually; said or mentioned as an aside. I just heard your name in passing. I didn’t hear more than that.  The lecturer referred to George Washington in passing."
        },
        {
            "id": 98,
            "phrase": "in pencil",
            "definition": "written or signed with a pencil.  Why did you write your report in pencil? _You can’t sign a check in pencil!"
        },
        {
            "id": 99,
            "phrase": "in perpetuity",
            "definition": "for an indefinitely long period of time; eternally.  My trust fund generates income in perpetuity.  The right for the road to cross my land was granted in perpetuity to the county."
        },
        {
            "id": 100,
            "phrase": "in person",
            "definition": "[of someone] actually physically present in a place rather than appearing in a film, on a television or computer screen, on a telephone, or through a radio broadcast.  All the famous movie stars were there in person.  You must appear in our office in person to collect the money that is due to you."
        },
        {
            "id": 101,
            "phrase": "*in perspective",
            "definition": "within a reasonable view or appraisal. (*Typically: be ~; get something ~; have something ~; put something [into] ~.) _ Let’s try to keep everything in perspective.  If we put the matter into perspective, I think we can discuss it reasonably."
        },
        {
            "id": 102,
            "phrase": "*in place",
            "definition": "in (someone’s or something’s) proper place or location. (*Typically: be ~; put something [into] ~.) _ The maid came into the room and put everything into place.  It’s good to see everything in place again."
        },
        {
            "id": 103,
            "phrase": "in place of someone or something",
            "definition": "instead of someone or something; as a substitute for someone or something.  I changed my mind. I want a red one in place of the blue one.  John came to help in place of Max, who was sick."
        },
        {
            "id": 104,
            "phrase": "*in play",
            "definition": "[of a ball, in a game] under the effect of the rules of the game. (*Typically: be ~; get back ~; put something back ~.) _ The ball is in play again and the activity is furious.  The ball is not in play yet."
        },
        {
            "id": 105,
            "phrase": "in point of fact",
            "definition": "just to point out a fact; in fact. In point of fact, I am not late. You are simply way too early."
        },
        {
            "id": 106,
            "phrase": "*in power",
            "definition": "in control; in charge. (*Typically: be ~; come [into] ~; get [into] ~.) _Who is in power now? _No one is in power.  The provisional government came into power six months ago."
        },
        {
            "id": 107,
            "phrase": "in practice",
            "definition": "1. in the actual doing of something; in reality. Our policy is to be very particular, but in practice we don’t care that much. The instructions say not to set it too high. In practice I always set it as high as possible. 2. wellrehearsed; well-practiced; well-exercised. The swimmer was not in practice and almost drowned. I play the piano for a living, and I have to keep in practice."
        },
        {
            "id": 108,
            "phrase": "in press",
            "definition": "[of a book or other document] in the process of being printed. This book is in press. It won’t be available for at least two months.  This book has been in press for a long time."
        },
        {
            "id": 109,
            "phrase": "in print",
            "definition": "[of a book, magazine, newspaper, or other written material] to be available from the publisher.  Ten thousand copies of the first edition remain in print.  The publisher listed all of its books in print."
        },
        {
            "id": 110,
            "phrase": "in private",
            "definition": "privately; without others present.  I’d like to speak to you in private.  I enjoy spending the evening in private."
        },
        {
            "id": 111,
            "phrase": "in progress",
            "definition": "under way; happening; developing or moving right now.  Don’t enter the studio. There’s a show in progress.  We now return you to the regularly scheduled show in progress."
        },
        {
            "id": 112,
            "phrase": "in proportion",
            "definition": "showing the correct size or proportion relative to something else.  That man’s large head is not in proportion to his small body. The cartoonist drew the dog in proportion to its surroundings."
        },
        {
            "id": 113,
            "phrase": "in public",
            "definition": "in a place or way so that other people can see or know about something. It’s illegal to walk naked in public.  John always tries to embarrass me whenever we’re in public."
        },
        {
            "id": 114,
            "phrase": "in pursuit of something",
            "definition": "chasing after something.  Bill spends most of his time in pursuit of money.  Every year Bob goes into the countryside in pursuit of butterf lies."
        },
        {
            "id": 115,
            "phrase": "in rags",
            "definition": "in worn-out and torn clothing.  Oh, look at my clothing. I can’t go to the party in rags! _I think the new casual fashions make you look as if you’re in rags."
        },
        {
            "id": 116,
            "phrase": "in rare form",
            "definition": "1. Fig. well prepared for a good performance; at one’s best.  The goalie is in rare form today; that’s his third great save already.  We are not exactly in rare form on Monday mornings. 2. Inf. intoxicated. Gert is in rare form, but she’ll have time to sleep it off. When Harry was finally in rare form, he slid beneath the table."
        },
        {
            "id": 117,
            "phrase": "in reality",
            "definition": "viewing things realistically; really.  Jane dreamed it was snowing, but in reality, it was very warm.  John looks happy, but in reality, he is miserable."
        },
        {
            "id": 118,
            "phrase": "in receipt of something",
            "definition": "in a state of having received something. (Used in business correspondence.) _ We are in receipt of your letter of request.  When we are in receipt of your check for the full balance, we will mark your bill as paid."
        },
        {
            "id": 119,
            "phrase": "in recent memory",
            "definition": "the period of time in which things are still remembered and discussed.  Never in recent memory has there been this much snow! _ I haven’t been this happy in recent memory!"
        },
        {
            "id": 120,
            "phrase": "in reduced circumstances",
            "definition": "Euph. in poverty.  After Frederick lost his position, we lived in reduced circumstances while waiting for my inheritance."
        },
        {
            "id": 121,
            "phrase": "in rehearsal",
            "definition": "a stage of development in the production of a play, opera, or concert, involving many rehearsals.  The play is in rehearsal now and will open next month.  While the opera was still in rehearsal, the star developed a hatred for the director."
        },
        {
            "id": 122,
            "phrase": "in relation to someone or something",
            "definition": "relating to someone or something; in connection with someone or something.  I mention this fact in relation to your proposed trip.  Let’s discuss Bill in relation to his future with this company."
        },
        {
            "id": 123,
            "phrase": "in remission",
            "definition": "[of a serious disease] not worsening or progressing.  While the disease was in remission, John got to leave the hospital.  The doctor said my cancer was in remission."
        },
        {
            "id": 124,
            "phrase": "in return for (someone or something)",
            "definition": "by way of giving something back; as a way of paying someone back for something; as part of an exchange.  I helped Tom yesterday, and he helped me in return for my efforts.  I paid $20 and received four tickets in return."
        },
        {
            "id": 125,
            "phrase": "*in ruins",
            "definition": "in a state of destruction. (*Typically: be ~; lay ~; leave something ~.) _The enemy army left the cities they attacked in ruins.  The crops laid in ruins after the f lood."
        },
        {
            "id": 126,
            "phrase": "in season",
            "definition": "1. [of a game animal] subject to legal hunting.  You cannot shoot ducks. They are not in season. 2. [of a female animal] ready to breed; in estrus; in heat.  The cat’s in season again. 3. to be currently available for selling. (Some foods and other things are available only at certain seasons. *Typically: be ~; come [into] ~.) _Oysters are available in season. Strawberries aren’t in season in January."
        },
        {
            "id": 127,
            "phrase": "in secret",
            "definition": "secretly.  They planned in secret to blow up the bridge.  I will tell her in secret so no one else will hear."
        },
        {
            "id": 128,
            "phrase": "in service",
            "definition": "[of something] operating or operable. service.) _Is this elevator in service?"
        },
        {
            "id": 129,
            "phrase": "in session",
            "definition": "[of a court, congress, or other organization] operating or functioning.  Use of cameras is forbidden while the meeting is in session.  The spectators must remain quiet while court is in session."
        },
        {
            "id": 130,
            "phrase": "in seventh heaven",
            "definition": "in a very happy state. Ann was really in seventh heaven when she got a car of her own.  I’d be in seventh heaven if I had a million dollars."
        },
        {
            "id": 131,
            "phrase": "in short",
            "definition": "stated briefly. At the end of the financial report, the board president said, “In short, we are okay.” _ My remarks, in short, indicate that we are in good financial shape."
        },
        {
            "id": 132,
            "phrase": "in short order",
            "definition": "very quickly.  I can straighten out this mess in short order.  The maids came in and cleaned the place up in short order."
        },
        {
            "id": 133,
            "phrase": "in short supply",
            "definition": "scarce. Fresh vegetables are in short supply in the winter.  Yellow cars are in short supply because everyone likes them and buys them.  At this time of the year, fresh vegetables go into short supply."
        },
        {
            "id": 134,
            "phrase": "in sight",
            "definition": "within the range of vision; visible.  The goal is in sight.  The end of the road is in sight."
        },
        {
            "id": 135,
            "phrase": "in so many words",
            "definition": "exactly; explicitly; in plain, clear language.  I told her in so many words to leave me alone.  He said yes, but not in so many words."
        },
        {
            "id": 136,
            "phrase": "in some neck of the woods",
            "definition": "Rur. in some vicinity or neighborhood; in some remote place. (The some is usually this, that, your, their, etc. Can be used to refer to some specific section of a forest.) _ I think that the Smiths live in your neck of the woods. What’s happening over in that neck of the woods?"
        },
        {
            "id": 137,
            "phrase": "*in someone’s face",
            "definition": "Sl. in a provocative attitude, as if ready to fight or argue. (*Typically: be ~; get ~.) _ Ted’s a real pain. He likes to get in your face. He’ll argue about anything.  I know you are angry, but don’t get in my face. I had nothing to do with it."
        },
        {
            "id": 138,
            "phrase": "in someone’s favor",
            "definition": "to someone’s advantage or credit. (Especially in sports scores, as in the examples.) _ The score was ten to twelve in our favor. At the end of the second half, the score was forty to three in the other team’s favor. 2. *in someone’s favor liked by someone; approved of by someone. (*Typically: be ~; get [into] ~.) _ John might be able to help me. I hope I’m currently in his favor.  My mother is mad at me. I’m certainly not in her favor.  I’ll try to get into her favor."
        },
        {
            "id": 139,
            "phrase": "*in someone’s good graces",
            "definition": "in good with someone; in someone’s favor. (*Typically: be ~; get ~.) _ I’m not in her good graces so I shouldn’t be the one to ask her."
        },
        {
            "id": 140,
            "phrase": "*in someone’s hair",
            "definition": "tangled in someone’s hair. (*Typically: be ~; get [into] ~.) _ My bubble gum got in my hair and I had to cut it out."
        },
        {
            "id": 141,
            "phrase": "in someone’s name",
            "definition": "in someone’s ownership; as someone’s property.  The house is in my name. I own all of it.  The car is in our names. "
        },
        {
            "id": 142,
            "phrase": "*in someone’s possession",
            "definition": "held by someone; owned by someone. (*Typically: be ~; come [into] ~.) _ The book is now in my possession.  How long has this object been in your possession?"
        },
        {
            "id": 143,
            "phrase": "in someone’s prayers",
            "definition": "[of someone] remembered and called by name when someone prays. I am sorry to hear of your sickness. You will be in our prayers.  The whole family is in my prayers because they have suffered so much."
        },
        {
            "id": 144,
            "phrase": "in spades",
            "definition": "in the best or most extreme way possible; extravagantly.  He f lunked the test in spades.  He succeeded at life in spades—honors degree, great career, rich wife, lovely children, and early retirement."
        },
        {
            "id": 145,
            "phrase": "in spite of someone or something",
            "definition": "without regard to someone or something; even though another course had been prescribed; ignoring a warning.  In spite of her orders to stay, I left. In spite of the bad weather, I had fun on vacation."
        },
        {
            "id": 146,
            "phrase": "*in step (with someone)",
            "definition": "[marching or dancing] in cadence with another person. (*Typically: be ~; get [into] ~; march ~; keep ~.) _ Please keep in step with Jane.  You two, back there. You aren’t in step."
        },
        {
            "id": 147,
            "phrase": "in step (with someone or something)",
            "definition": "as up-to-date as someone or something. Bob is not in step with the times.  We try to keep in step with the fashion of the day."
        },
        {
            "id": 148,
            "phrase": "in stitches",
            "definition": "laughing very hard.  Charlie had us in stitches with all his jokes.  The movie sure was funny. I was in stitches!"
        },
        {
            "id": 149,
            "phrase": "in stock",
            "definition": "to have merchandise available and ready for sale.  Do you have extra-large sizes in stock? _ Of course, we have all sizes and colors in stock."
        },
        {
            "id": 150,
            "phrase": "in storage",
            "definition": "in a place where things are stored or kept.  Mary placed her winter clothes in storage during the summer. John’s furniture is in storage while he is in the army."
        },
        {
            "id": 151,
            "phrase": "*in store (for someone)",
            "definition": "awaiting someone in the future. (*Typically: be ~; hold something ~; lie ~.) _ None of us knows what lies in store for us tomorrow. Some good lies in store for me, I think."
        },
        {
            "id": 152,
            "phrase": "in style",
            "definition": "in fashion; fashionable. This old coat isn’t in style anymore. I don’t care if it’s not in style. It’s warm. I hope this coat comes into style again."
        },
        {
            "id": 153,
            "phrase": "in surgery",
            "definition": "to be involved in surgery. (Can refer to a doctor, nurse, or patients.) _ Dr. Smith is in surgery now.  The patient is still in surgery."
        },
        {
            "id": 154,
            "phrase": "in tandem",
            "definition": "[of two or more things] in single file.  We marched to the door in tandem.  They rode along in tandem."
        },
        {
            "id": 155,
            "phrase": "in tatters",
            "definition": "in torn pieces of cloth.  The poor man’s clothes hung in tatters.  The f lag was in tatters after the storm."
        },
        {
            "id": 156,
            "phrase": "in terms of something",
            "definition": "regarding something; concerning something.  I don’t know what to do in terms of John’s problem. Now, in terms of your proposal, don’t you think you’re asking for too much?"
        },
        {
            "id": 157,
            "phrase": "in the absence of someone or something",
            "definition": "while someone or something isn’t here; without someone or something.  In the absence of the cook, I’ll prepare dinner.  In the absence of opposition, she won easily."
        },
        {
            "id": 158,
            "phrase": "in the act (of doing something)",
            "definition": "while doing something.  There he was, in the act of opening the door.  I tripped while in the act of climbing."
        },
        {
            "id": 159,
            "phrase": "in the affirmative",
            "definition": "in the form of an answer that means yes.  The soldier answered in the affirmative by nodding his head “yes.” _ My manager’s response was in the affirmative."
        },
        {
            "id": 160,
            "phrase": "in the air",
            "definition": "everywhere; all about. There is such a feeling of joy in the air.  We felt a sense of tension in the air."
        },
        {
            "id": 161,
            "phrase": "in the back",
            "definition": "in the back part of a building; in the back room of a building.  I don’t have your size here, but perhaps I can find it in the back.  He’s not in the shop right now. I’ll see if he’s in the back."
        },
        {
            "id": 162,
            "phrase": "*in the back of someone’s mind",
            "definition": "remembered by someone, but not very important; vaguely remembered by someone. (*Typically: have something ~; keep something ~; leave something ~; put something ~; remain ~; stay ~.) _You should put this problem in the back of your mind and concentrate on other things."
        },
        {
            "id": 163,
            "phrase": "*in the bag",
            "definition": "1. Fig. cinched; achieved. (*Typically: be ~; have something ~.) _It’s in the bag—as good as done.  The election is in the bag unless the voters find out about my past. 2. Fig. Inf. intoxicated. (*Typically: be ~.) _ Kelly looks like he is in the bag.  John is in the bag and mean as hell."
        },
        {
            "id": 164,
            "phrase": "*in the balance",
            "definition": "in an undecided state; at risk. (*Typically: be ~; hang ~.) _He stood on the edge of the cliff, his life in the balance.  With his fortune in the balance, John rolled the dice."
        },
        {
            "id": 165,
            "phrase": "in the ballpark",
            "definition": "within certain boundaries; [of an estimate] close to what is expected. Your estimate is not even in the ballpark. Please try again."
        },
        {
            "id": 166,
            "phrase": "*in the best of health",
            "definition": "very healthy. (*Typically: be ~; get oneself ~.) _ Bill is in the best of health. He eats well and exercises. I haven’t been in the best of health. I think I have the f lu."
        },
        {
            "id": 167,
            "phrase": "in the black",
            "definition": "not in debt; in a financially profitable condition. (As opposed to in the red.) _ I wish my accounts were in the black. Sally moved the company into the black."
        },
        {
            "id": 168,
            "phrase": "*in the bull pen",
            "definition": "[of a baseball pitcher to be] in a special place near the playing field, warming up to pitch. (*Typically: be ~; go [into] ~.) _ You can tell who is pitching next by seeing who is in the bull pen.  Our best pitcher just went into the bull pen. He’ll be pitching soon."
        },
        {
            "id": 169,
            "phrase": "*in the cards",
            "definition": "in the future. (*Typically: be ~; see something ~.) _Well, what do you think is in the cards for tomorrow? _I asked the boss if there was a raise in the cards for me."
        },
        {
            "id": 170,
            "phrase": "in the case of someone or something",
            "definition": "in the matter of someone or something; in the instance of someone or something. In the case of John, I think we had better allow his request.  In the case of this woman, we’ll not grant permission."
        },
        {
            "id": 171,
            "phrase": "in the catbird seat",
            "definition": "Sl. in a dominant or controlling position.  Sally’s in the catbird seat—telling everybody where to go.  I hold all the aces. I’m in the catbird seat."
        },
        {
            "id": 172,
            "phrase": "in the chips",
            "definition": "wealthy; having lots of money. (Having lots of gambling chips.) _I’m in the chips this month. Let’s go squander it. If I were in the chips, I’d buy a Rolls Royce."
        },
        {
            "id": 173,
            "phrase": "*in the clear",
            "definition": "not obstructed; not enclosed. (*Typically: be ~; get [into] ~; get someone or something [into] ~.) _ You’re in the clear. Go ahead and back up.  Once the deer got into the clear, it ran away."
        },
        {
            "id": 174,
            "phrase": "in the context of something",
            "definition": "in the circumstances under which something happens or has happened. In the context of a funeral, laughing loudly is inappropriate. In the context of an argument, it is fine to speak firmly."
        },
        {
            "id": 175,
            "phrase": "In the country of the blind, the one-eyed man is king.",
            "definition": "Prov. A person who is not particularly capable can attain a powerful position if the people around him or her are even less capable.  Jill: How on earth did Joe get promoted to be head of his department? He’s such a blunderer! Jane: In the country of the blind, the one-eyed man is king."
        },
        {
            "id": 176,
            "phrase": "*in the dark (about someone or something)",
            "definition": "uninformed about someone or something; ignorant about someone or something. (*Typically: be ~; keep someone ~; stay ~.) _I’m in the dark about who is in charge around here.  I can’t imagine why they are keeping me in the dark. She’s in the dark about how this machine works."
        },
        {
            "id": 177,
            "phrase": "*in the doghouse",
            "definition": "in trouble; in (someone’s) disfavor. (*Typically: be ~; get ~; find oneself ~; put someone [into] ~.) _ I’m really in the doghouse with my boss. I was late for an appointment.  I hate being in the doghouse all the time. I don’t know why I can’t stay out of trouble."
        },
        {
            "id": 178,
            "phrase": "*in the doldrums",
            "definition": "sluggish; inactive; in low spirits. (*Typically: be ~; put someone [into] ~.) _He’s usually in the doldrums in the winter.  I had some bad news yesterday, which put me into the doldrums."
        },
        {
            "id": 179,
            "phrase": "*in the drink",
            "definition": "in the water; in the ocean. (*Typically: be ~; fall ~; throw someone ~.) _He fell in the drink and had to be rescued."
        },
        {
            "id": 180,
            "phrase": "in the driver’s seat",
            "definition": "in control; in charge of things. (As if one were driving and controlling the vehicle.) _ Now that Fred is in the driver’s seat, there is a lot less criticism about how things are being done.  Joan can’t wait to get into the driver’s seat and do what she can to turn things around."
        },
        {
            "id": 181,
            "phrase": "in the event of something",
            "definition": "if something happens; on the chance that something happens.  In the event of his late arrival, please call me.  In the event of rain, the parade is canceled."
        },
        {
            "id": 182,
            "phrase": "*in the fast lane",
            "definition": "in a very active or possible risky manner.  Fred lives in the fast lane. It’s lucky he’s still alive."
        },
        {
            "id": 183,
            "phrase": "in the flesh",
            "definition": "bodily present; in person; totally real.  I’ve heard that the queen is coming here in the f lesh.  I’ve wanted a f lat-screen TV for years, and now I’ve got one right here in the f lesh."
        },
        {
            "id": 184,
            "phrase": "*in the groove",
            "definition": "Sl. attuned to something. (*Typically: be ~; get ~.) _ I was uncomfortable at first, but now I’m beginning to get in the groove.  Fred began to get in the groove, and things went more smoothly."
        },
        {
            "id": 185,
            "phrase": "*in the gutter",
            "definition": "[of a person] in a low state; poor and homeless. (*Typically: be ~; fall [into] ~; put someone [into] ~.) _ You had better straighten out your life, or you’ll end in the gutter.  His bad habits put him into the gutter."
        },
        {
            "id": 186,
            "phrase": "*in the hole",
            "definition": "in debt. (*Typically: be ~; get ~; go ~; put someone ~.) _ I’m $200 in the hole.  We went into the hole on that deal."
        },
        {
            "id": 187,
            "phrase": "*in the (home)stretch",
            "definition": "in the last stage of a process. (From horse racing. *Typically: be ~; get ~.) _ We’re in the homestretch with this project and can’t change it now. We’re in the stretch. Only three more days till we graduate."
        },
        {
            "id": 188,
            "phrase": "in the hopper",
            "definition": "in process; in line to be processed. (A hopper is a chute for incoming work or material to be processed.) _ It’s in the hopper. I’ll get to it.  Your job is in the hopper, and your turn is next."
        },
        {
            "id": 189,
            "phrase": "in the interest of saving time",
            "definition": "in order to hurry things along; in order to save time. Mary: In the interest of saving time, I’d like to save questions for the end of my talk. Bill: But I have an important question now! _“In the interest of saving time,” said Jane, “I’ll give you the first three answers.”"
        },
        {
            "id": 190,
            "phrase": "in the interest of someone or something",
            "definition": "as an advantage or benefit to someone or something; in order to advance or improve someone or something.  In the interest of health, people are asked not to smoke. The police imprisoned the suspects in the interest of the safety of the public."
        },
        {
            "id": 191,
            "phrase": "in the interim (between things)",
            "definition": "in the meantime; in the time between the ending of something and the beginning of something else.  In the interim between her morning and afternoon classes, Susan rushed home to get a book she had forgotten.  My favorite show starts in five minutes, but I’ll talk to you in the interim."
        },
        {
            "id": 192,
            "phrase": "in the know",
            "definition": "knowledgeable.  Let’s ask Bob. He’s in the know.  I have no knowledge of how to work this machine. I think I can get myself in the know very quickly though."
        },
        {
            "id": 193,
            "phrase": "in the lap of luxury",
            "definition": "Cliché in luxurious surroundings.  John lives in the lap of luxury because his family is very wealthy.  When I retire, I’d like to live in the lap of luxury."
        },
        {
            "id": 194,
            "phrase": "in the laundry",
            "definition": "with the clothes that are waiting to be washed.  Is my blue shirt clean or is it in the laundry? _ All my socks are in the laundry. What shall I do?"
        },
        {
            "id": 195,
            "phrase": "in (the) light of something",
            "definition": "because of certain knowledge now in hand; considering something. (As if knowledge or information shed light on something.) _ In light of what you have told us, I think we must abandon the project.  In light of the clerk’s rudeness, we didn’t return to that shop."
        },
        {
            "id": 196,
            "phrase": "in the line of duty",
            "definition": "as part of one’s expected duties. When soldiers fight people in a war, it’s in the line of duty.  Police officers have to do things they may not like in the line of duty."
        },
        {
            "id": 197,
            "phrase": "in the loop",
            "definition": "in the group of persons communicating regularly about a specific plan or project.  I don’t know what’s going on with the Jones deal since I’m not in the loop.  Bob and Jean are in the loop. They can tell you what’s happening."
        },
        {
            "id": 198,
            "phrase": "in the main",
            "definition": "basically; generally. Mary: Everything looks all right—in the main. Sally: What details need attention? Mary: Just a few things here and there. Like on page 27.  John: Are you all ready? Sue: I think we’re ready, in the main. John: Then, we shall go."
        },
        {
            "id": 199,
            "phrase": "*in the mainstream (of something)",
            "definition": "following the current trends or styles that are popular or are considered normal. (*Typically: be ~; get [into] ~.) _ Bob is too old-fashioned to be in the mainstream of modern living."
        },
        {
            "id": 200,
            "phrase": "in the making",
            "definition": "in development; in the process of developing.  This is a real problem in the making. Let’s try to keep it from getting any worse."
        },
        {
            "id": 201,
            "phrase": "*in the market (for something)",
            "definition": "wanting to buy something. (*Typically: be ~; find oneself ~.) _ I’m in the market for a new camera. If you have a boat for sale, we’re in the market."
        },
        {
            "id": 202,
            "phrase": "in the meantime",
            "definition": "the period of time between two things; the period of time between now and when something is supposed to happen.  The movie starts at 6:00. In the meantime, let’s eat dinner.  My f light was at 8:00. In the meantime, I played solitaire."
        },
        {
            "id": 203,
            "phrase": "*in the middle of nowhere",
            "definition": "in a very remote place. (*Typically: be ~; drive [into] ~; put someone or something [into] ~.) _ To get to my house, you have to drive into the middle of nowhere.  We found a nice place to eat, but it’s out in the middle of nowhere."
        },
        {
            "id": 204,
            "phrase": "in the money",
            "definition": "1. Fig. wealthy. John is really in the money. He’s worth millions. If I am ever in the money, I’ll be generous. 2. Fig. in the winning position in a race or contest. (As if one had won the prize money; in horse racing the top three finishers can pay off on bets.) _ I knew when Jane came around the final turn that she was in the money.  The horses coming in first, second, and third are said to be in the money."
        },
        {
            "id": 205,
            "phrase": "in the near future",
            "definition": "Cliché in the time immediately ahead. I don’t plan to go to Florida in the near future. Today’s prices won’t be around in the near future."
        },
        {
            "id": 206,
            "phrase": "in the offing",
            "definition": "happening at some time in the future.  There is a big investigation in the offing, but I don’t know when. It’s hard to tell what’s in the offing if you don’t keep track of things."
        },
        {
            "id": 207,
            "phrase": "*in the open",
            "definition": "in the outdoors; in an area that is not closed in. (*Typically: be ~; put something ~.) _ John’s bike was stolen because he left it out in the open.  Mary loves gardening because she loves to be in the open."
        },
        {
            "id": 208,
            "phrase": "*in the picture",
            "definition": "well-informed; aware of what is going on. (*Typically: be ~; keep someone ~; put someone ~.) _ Please, keep me fully in the picture.  John found out about the plan. He’s in the picture, so take care."
        },
        {
            "id": 209,
            "phrase": "in the pipeline",
            "definition": "backed up somewhere in a process; in process; in a queue.  There’s a lot of goods still in the pipeline. That means no more new orders will be shipped for a while. Your papers are in the pipeline somewhere. You’ll just have to wait."
        },
        {
            "id": 210,
            "phrase": "*in the poorhouse",
            "definition": "in a (historical) communal dwelling for impoverished persons. (*Typically: live ~; end up ~.) _ He couldn’t pay his debts and had to live in the poorhouse."
        },
        {
            "id": 211,
            "phrase": "in the prime of life",
            "definition": "in the best and most productive and healthy period of life. The good health of one’s youth can carry over into the prime of life. He was struck down by a heart attack in the prime of life."
        },
        {
            "id": 212,
            "phrase": "*in the public eye",
            "definition": "publicly; visible to all; conspicuous. (*Typically: be ~; find oneself ~; get [into] ~.) _ Elected officials find themselves constantly in the public eye.  The mayor made it a practice to get into the public eye as much as possible."
        },
        {
            "id": 213,
            "phrase": "in the rear",
            "definition": "located in the space or area behind someone or something.  The waiter told me that the bathrooms were in the rear.  All deliveries must be made in the rear."
        },
        {
            "id": 214,
            "phrase": "*in the red",
            "definition": "losing money. (*Typically: be ~; go [into] ~; as opposed to in the black.) _ State government has been operating in the red for five straight years.  What with all those car repairs, we’re going to be in the red this month."
        },
        {
            "id": 215,
            "phrase": "in the right",
            "definition": "correct; morally or legally correct.  I know I’m in the right.  You are not in the right on this point."
        },
        {
            "id": 216,
            "phrase": "in the right place at the right time",
            "definition": "in the location where something good is to happen exactly when it happens. I got a good deal on a car because I was in the right place at the right time.  Unless you are in the right place at the right time, you won’t get a chance to meet a movie star."
        },
        {
            "id": 217,
            "phrase": "in the road",
            "definition": "on the roadway.  What’s that in the road ahead?"
        },
        {
            "id": 218,
            "phrase": "in the running",
            "definition": "in competition; competing and having a chance to win.  Is Tom still in the running? Does he still have a chance to be elected? _I don’t know about Tom, but Gladys is definitely still in the running."
        },
        {
            "id": 219,
            "phrase": "*in the same boat (as someone)",
            "definition": "in the same situation; having the same problem. (*Typically: be ~; get [into] ~.) _ Tom: I’m broke. Can you lend me twenty dollars? Bill: Sorry. I’m in the same boat. Jane and Mary are both in the same boat. They have been called for jury duty."
        },
        {
            "id": 220,
            "phrase": "in the same breath",
            "definition": "[stated or said] almost at the same time.  He told me I was lazy, but then in the same breath he said I was doing a good job.  The teacher said that the students were working hard and, in the same breath, that they were not working hard enough."
        },
        {
            "id": 221,
            "phrase": "in the second place",
            "definition": "secondly; in addition. (Usually said after one has said in the first place.) _ In the first place, you don’t have enough money to buy one. In the second place, you don’t need one.  In the first place, I don’t have the time. In the second place, I’m not interested."
        },
        {
            "id": 222,
            "phrase": "*in the soup",
            "definition": "in a bad situation. (*Typically: be ~; get [into] ~.) _Now I’m really in the soup. I broke Mrs. Franklin’s window.  I make a lot of mistakes. It’s easy for me to get into the soup."
        },
        {
            "id": 223,
            "phrase": "*in the swim of things",
            "definition": "involved in or participating in events or happenings. (*Typically: be ~; get [into] ~.) _ I’ve been ill, but soon I’ll be back in the swim of things.  I can’t wait to settle down and get into the swim of things."
        },
        {
            "id": 224,
            "phrase": "*in the trust of someone",
            "definition": "under the responsibility or in the care of someone. (*Typically: be ~; leave someone or something ~; place someone or something ~.) _ The state placed the orphan in the trust of the foster parents.  Our bonds are left in the trust of our broker."
        },
        {
            "id": 225,
            "phrase": "*in the (very) nick of time",
            "definition": "just in time; at the last possible instant; just before it’s too late. (*Typically: arrive ~; get there ~; happen ~; reach something ~; save someone ~.) _The doctor arrived in the nick of time. The patient’s life was saved.  I reached the airport in the very nick of time and made my f light."
        },
        {
            "id": 226,
            "phrase": "in the wake of something",
            "definition": "after something; as a result of some event. (Alludes to a ship’s wake.) _ We had no place to live in the wake of the fire.  In the wake of the storm, there were many broken tree limbs."
        },
        {
            "id": 227,
            "phrase": "in the way of something",
            "definition": "as a kind of something; as a style of something.  What do you have in the way of dress shoes? _ We have nothing in the way of raincoats."
        },
        {
            "id": 228,
            "phrase": "in the wind",
            "definition": "about to happen. There are some major changes in the wind. Expect these changes to happen soon.  There is something in the wind. We’ll find out what it is soon."
        },
        {
            "id": 229,
            "phrase": "in the works",
            "definition": "being prepared; being planned; being done.  There are some new laws in the works that will affect all of us.  I have some ideas in the works that you might be interested in."
        },
        {
            "id": 230,
            "phrase": "in the worst way",
            "definition": "very much.  I want a new car in the worst way.  Bob wants to retire in the worst way."
        },
        {
            "id": 231,
            "phrase": "in the wrong",
            "definition": "wrong; morally or legally incorrect. I am not in the wrong, you are.  No, you are in the wrong."
        },
        {
            "id": 232,
            "phrase": "in the wrong place at the wrong time",
            "definition": "in the location where something bad is to happen exactly when it happens.  I always get into trouble. I’m just in the wrong place at the wrong time.  It’s isn’t my fault. I was just in the wrong place at the wrong time."
        },
        {
            "id": 233,
            "phrase": "in theory",
            "definition": "according to a theory; theoretically. In theory, if I take my medicine regularly, I will get well. How things work in theory doesn’t always match with how things work in reality."
        },
        {
            "id": 234,
            "phrase": "in there",
            "definition": "Sl. sincere; likeable.  Martha is really in there. Everybody likes her.  I like a guy who’s in there—who thinks about other people."
        },
        {
            "id": 235,
            "phrase": "in there pitching",
            "definition": "trying very hard.  Bob is always in there pitching.  Just stay in there pitching. You’ll make some progress eventually."
        },
        {
            "id": 236,
            "phrase": "in these parts",
            "definition": "Rur. around here; in this area.  There aren’t any big hospitals in these parts.  Joe’s the richest man in these parts."
        },
        {
            "id": 237,
            "phrase": "the in thing (to do)",
            "definition": "the fashionable thing to do.  Eating low-fat food is the in thing to do.  Bob is very oldfashioned. He never does the in thing."
        },
        {
            "id": 238,
            "phrase": "in this day and age",
            "definition": "now; in these modern times.  Bill: Ted f lunked out of school. Mother: Imagine that! Especially in this day and age.  Bill: Taxes keep going up and up. Bob: What do you expect in this day and age?"
        },
        {
            "id": 239,
            "phrase": "in those parts",
            "definition": "Rur. around there; in that area.  I’ve got a cousin who lives in those parts.  We used to spend our vacations in those parts."
        },
        {
            "id": 240,
            "phrase": "in times past",
            "definition": "long ago; in previous times. In times past, you would not have been able to wear casual clothing to work.  In times past, the air always seemed fresher and cleaner."
        },
        {
            "id": 241,
            "phrase": "in top form",
            "definition": "1. [of someone or some creature] in very good physical condition.  The runners are in top form, so this should be a good race.  I’m not in top form, but I’m not completely out of shape either. 2. able to make witty remarks and clever statements quickly and easily.  That was really funny, Bob. You are in top form tonight.  The president was in top form and entertained the audience with her speech."
        },
        {
            "id": 242,
            "phrase": "*in touch (with someone)",
            "definition": "1. Fig. in contact with someone by letter or telephone. (*Typically: be ~; get ~; keep ~.) _ I tried to get in touch with her, but she never answered her phone.  I just couldn’t seem to get in touch. 2. Fig. [of oneself] having self-knowledge. (*Typically: be ~; get ~.) _ I need to get in touch with myself and the way I really feel about things.  She needs to try more to be in touch with herself and her feelings."
        },
        {
            "id": 243,
            "phrase": "*in touch with someone or something",
            "definition": "1. Fig. in communication with someone or a group. (*Typically: be ~; get ~.) _ Are you in touch with your brother, or have you two grown apart? _ I am in touch with the person whom you asked about. 2. Fig. sympathetic or sensitive to someone or something; having good contact or rapport with someone or something. (*Typically: be ~; get ~.) _We talk to each other, but we’re not really in touch with each other."
        },
        {
            "id": 244,
            "phrase": "in tow",
            "definition": "closely following; under someone’s control.  The nanny walked into the park with three children in tow.  The manager went to the meeting with her staff in tow."
        },
        {
            "id": 245,
            "phrase": "in transit",
            "definition": "while in the process of being transported.  Dave is in transit from London to Chicago. The new stereo is now in transit from the manufacturer."
        },
        {
            "id": 246,
            "phrase": "in triplicate",
            "definition": "[of a document] produced in three copies.  Mr. Smith asked me to copy his notes in triplicate.  I completed each form in triplicate."
        },
        {
            "id": 247,
            "phrase": "*in trouble",
            "definition": "1. in danger; in difficulty; due for punishment. (*Typically: be ~; get [into] ~.) _ If you don’t be quiet, you’re going to be in trouble.  The company was in trouble for months, and then went bankrupt. 2. Euph. pregnant and unmarried. (*Typically: be ~; get [into] ~.) _They had to get married. She was in trouble. She’ll be in trouble before long, if she doesn’t quit running around like that."
        },
        {
            "id": 248,
            "phrase": "in tune",
            "definition": "in a state where musical notes are at their proper intervals so that none are flat or sharp.  Your piano is in tune.  The choir members all sang in tune."
        },
        {
            "id": 249,
            "phrase": "*in tune with someone or something",
            "definition": "in musical harmony with someone or something. (*Typically: be ~; get ~.) _The violin is in tune with the piano. The tenor is not in tune with the bass."
        }
    ]
}