{
    "dictionary": [
        {
            "id": 0,
            "phrase": "crawl out (of something)",
            "definition": "to get out of something by crawling.  The injured man crawled out of the overturned car.  Donna crawled out of the cave."
        },
        {
            "id": 1,
            "phrase": "crawl over something",
            "definition": "to cross over something by crawling. We crawled over the pile of boxes. Timmy crawled over the carpet and stood up at the coffee table."
        },
        {
            "id": 2,
            "phrase": "crawling with some kind of creature",
            "definition": "[of a surface] covered with insects or animals, moving about.  The basement was crawling with rats! _ We came home and found the kitchen f loor crawling with ants."
        },
        {
            "id": 3,
            "phrase": "crawling with someone",
            "definition": "[of a surface] covered with many people or members of a class of people moving about. The place was crawling with police and FBI agents.  The city was crawling with tourists making it almost impossible to go from place to place."
        },
        {
            "id": 4,
            "phrase": "crazy in the head",
            "definition": "stupid or insane.  Be quiet, Jed. You are just crazy in the head.  Am I crazy in the head, or did I just see someone walking a leopard on a leash?"
        },
        {
            "id": 5,
            "phrase": "the cream of the crop",
            "definition": "the best of all.  This particular car is the cream of the crop.  These three students are very bright. They are the cream of the crop in their class."
        },
        {
            "id": 6,
            "phrase": "crease something up†",
            "definition": "to get creases or folds into something that is supposed to be flat; to wrinkle one’s clothing. (Very similar to messed up.) _ You will crease your jacket up if you don’t sit up straight. I was sitting so long that I creased up my pants."
        },
        {
            "id": 7,
            "phrase": "creature comforts",
            "definition": "things that make people comfortable. The hotel room was a bit small, but all the creature comforts were there."
        },
        {
            "id": 8,
            "phrase": "*credit (for something)",
            "definition": "1. praise or recognition for one’s role in something. (*Typically: get ~; have ~; give someone ~.) Especially with a lot of ~, much ~.) _ Mary should get a lot of credit for the team’s success. Each of the team captains should get credit. 2. praise or recognition of someone for having a particular quality. (*Typically: get ~; have ~; give someone ~.) _ We give her a lot of credit for her ability to get people to work out their differences. We will give credit to Sharon for her good humor. 3. credit granted to someone’s account for some other financial transaction. (*Typically: get ~; have ~; give someone ~.) _ I will give you credit for the returned merchandise.  We got credit for the check Brian sent us."
        },
        {
            "id": 9,
            "phrase": "credit someone or something for something",
            "definition": "to give someone or something the praise deserved for doing something.  We must credit Sarah for her efforts on our behalf.  We have to credit all the rain we’ve had for saving the crops."
        },
        {
            "id": 10,
            "phrase": "credit someone or something with something",
            "definition": "to record a payment, deposit, etc., to the account of someone or something. I will credit you with this payment as you request.  Your account has been credited with this adjustment."
        },
        {
            "id": 11,
            "phrase": "credit something to someone or something",
            "definition": "to record a sum owed to the account of someone or something.  I will credit this payment to your account.  I am afraid that I accidentally credited your payment to George."
        },
        {
            "id": 12,
            "phrase": "a credit to someone or something",
            "definition": "of value or benefit to someone or something; of enough value or worth as to enhance someone or something.  I always want to be a credit to my school.  John is not what you would call a credit to his family."
        },
        {
            "id": 13,
            "phrase": "creep across something",
            "definition": "to move across something slowly and carefully; to sneak across something.  The soldiers crept slowly across the rope bridge.  The cat crept across the f loor, stalking the mouse."
        },
        {
            "id": 14,
            "phrase": "creep along something",
            "definition": "to move along something slowly and carefully; to sneak along something.  Creep along the side of the building until you reach the door.  The cat crept along the narrow kitchen counter."
        },
        {
            "id": 15,
            "phrase": "creep away",
            "definition": "to travel away slowly and carefully; to sneak away. The boys were completely ashamed and crept away.  The cat crept away quietly."
        },
        {
            "id": 16,
            "phrase": "creep by",
            "definition": "[for time] to pass slowly. The minutes crept by as I awaited Mrs. Barron’s telephone call.  I know the days will creep by until we finally get our test results."
        },
        {
            "id": 17,
            "phrase": "creep in(to something)",
            "definition": "to go into something or a place slowly and carefully; to sneak into something or a place.  The cat crept into the bedroom. Max planned to creep into the house and take cash and jewelry."
        },
        {
            "id": 18,
            "phrase": "creep out (of something)",
            "definition": "to go out of something or a place slowly and carefully; to sneak out of something or a place.  A little mouse crept out of the cupboard.  The fox crept out of the henhouse, carrying a chicken."
        },
        {
            "id": 19,
            "phrase": "creep over someone or something",
            "definition": "[for something, such as an insect] to walk or crawl over someone or something.  A huge ant crept over me, and I just lay there."
        },
        {
            "id": 20,
            "phrase": "creep under something",
            "definition": "to move slowly and carefully underneath something; to sneak underneath something.  The dog crept under the table to escape punishment.  The chipmunk crept under a pile of leaves and disappeared."
        },
        {
            "id": 21,
            "phrase": "creep up",
            "definition": "[for darkness] to move gradually and slowly [toward someone or something].  Dusk crept up and swallowed us in darkness."
        },
        {
            "id": 22,
            "phrase": "creep up on someone or something",
            "definition": "to sneak up on someone or something.  Please don’t creep up on me like that. You scared me to death.  The cat crept up on the mouse."
        },
        {
            "id": 23,
            "phrase": "crib something from someone or something",
            "definition": "to cheat by copying something from someone or something.  It appears that you cribbed this directly from the person sitting next to you."
        },
        {
            "id": 24,
            "phrase": "a crick in one’s back",
            "definition": "a twisted or cramped place in the back that causes pain. I can’t move! I’ve got a crick in my back! _ I had a crick in my back all night and I couldn’t sleep."
        },
        {
            "id": 25,
            "phrase": "a crick in one’s neck",
            "definition": "a twisted place or a cramp in the neck that causes pain.  I got a crick in my neck from sleeping in a draft. When I read on the plane, I get a crick in my neck."
        },
        {
            "id": 26,
            "phrase": "Crime doesn’t pay.",
            "definition": "Prov. Crime will ultimately not benefit a person.  No matter how tempting it may appear, crime doesn’t pay."
        },
        {
            "id": 27,
            "phrase": "cringe before someone or something",
            "definition": "to cower or recoil in the presence of someone or something.  Jeff cringed before the wrath of the policeman."
        },
        {
            "id": 28,
            "phrase": "crinkle up",
            "definition": "to wrinkle up. Her nose crinkled up when she laughed."
        },
        {
            "id": 29,
            "phrase": "criticize someone for something",
            "definition": "to reprimand or censure someone for something. I hope you don’t criticize me too severely for my part in this matter.  Maria criticized Ken for not being there on time."
        },
        {
            "id": 30,
            "phrase": "crock someone or something up†",
            "definition": "Sl. to damage or harm someone or something.  The accident crocked me up a bit.  I really crocked up my car last night."
        },
        {
            "id": 31,
            "phrase": "crop out",
            "definition": "to appear on the surface; [for something] to reveal itself in the open; to begin to show above the surface. A layer of rock cropped out at the edges of the desert."
        },
        {
            "id": 32,
            "phrase": "crop someone or something out†",
            "definition": "[for a photographer] to cut or trim out someone or something from a photograph.  The photographer cropped Mr. Jones out of the picture.  See if you can crop out the ugly fence at the side of the house."
        },
        {
            "id": 33,
            "phrase": "crop up",
            "definition": "to appear without warning; to happen suddenly; [for something] to begin to reveal itself in the open.  Some new problems cropped up at the last minute."
        },
        {
            "id": 34,
            "phrase": "cross from some place to some place",
            "definition": "to move across something from one point to another.  We crossed from one side of the hall to the other, looking for a seat.  I have to cross from Illinois to Missouri over a rickety old bridge."
        },
        {
            "id": 35,
            "phrase": "cross one’s heart (and hope to die)",
            "definition": "a phrase said to pledge or vow that the truth is being told.  It’s true, cross my heart and hope to die.  It’s really true—cross my heart."
        },
        {
            "id": 36,
            "phrase": "cross over",
            "definition": "1. to cross something such as a river or a street. This is a very wide river. Where do we cross over? _Let’s cross over here where it’s shallow. 2. to change sides, from one to another. Some players from the other team crossed over and joined ours after the tournament. 3. Euph. to die.  Uncle Herman crossed over long before Aunt Helen."
        },
        {
            "id": 37,
            "phrase": "cross over into some place",
            "definition": "to go from one place into another, by crossing a border, river, mountain range, etc. The refugees crossed over into Switzerland. We crossed over into Missouri at dawn."
        },
        {
            "id": 38,
            "phrase": "cross over something",
            "definition": "to go some place by crossing a border, river, mountain range, etc. Do we want to cross over the river at this point? _How do we cross over the highway?"
        },
        {
            "id": 39,
            "phrase": "cross paths (with someone)",
            "definition": "to meet someone by chance and not by choice.  The last time I crossed paths with Fred, we ended up arguing about something inconsequential."
        },
        {
            "id": 40,
            "phrase": "cross someone",
            "definition": "to oppose someone. You best not cross Jim. He has a very bad temper.  This is the last time you cross me, you hear?"
        },
        {
            "id": 41,
            "phrase": "cross someone or something out†",
            "definition": "to draw a line through the name of someone or something on a list or record. You can cross me out. I’m not going.  Please cross out Sarah’s name.  I crossed the sweater out. It was an error."
        },
        {
            "id": 42,
            "phrase": "cross someone’s palm with silver",
            "definition": "to pay money to someone in payment for a service. (A fortune-teller might ask for a potential customer to cross her palm with silver. Used in that sense or jocularly for something like tipping a porter.) _I crossed his palm with silver, but he still stood there.  You will find that things happen much faster in hotels if you cross the staff ’s palms with silver fairly often."
        },
        {
            "id": 43,
            "phrase": "cross someone up†",
            "definition": "to give someone trouble; to defy or betray someone; to spoil someone’s plans. (Also without up.) _ You really crossed up Bill when you told Tom what he said.  Please don’t cross me up again."
        },
        {
            "id": 44,
            "phrase": "cross something with something",
            "definition": "1. to go across something, using a particular type of vehicle.  The explorers crossed the river with their Jeep.  We can’t cross this stream with the canoes. It’s too fast. 2. to interbreed something with something else.  The farmer crossed this smaller breed of chicken with the meatier one. It is possible to cross a horse with a donkey."
        },
        {
            "id": 45,
            "phrase": "cross swords (with someone)",
            "definition": "to become the adversary of someone.  Gloria loved an argument and was looking forward to crossing swords with Sally."
        },
        {
            "id": 46,
            "phrase": "cross that bridge when one comes to it",
            "definition": "to delay worrying about something that might happen until it actually does happen. (Usually used in the phrase, “Let’s cross that bridge when we come to it,” a way of telling someone not to worry about something that has not happened yet. Alan: Where will we stop tonight? Jane: At the next town. Alan: What if all the hotels are full? Jane: Let’s cross that bridge when we come to it."
        },
        {
            "id": 47,
            "phrase": "cross the Rubicon",
            "definition": "to do something that inevitably commits one to following a certain course of action. (Alludes to the crossing of the River Rubicon by Julius Caesar with his army, which involved him in a civil war in B.C. 49.) _ Jane crossed the Rubicon by signing the contract.  Find another job before you cross the Rubicon and resign from this one."
        },
        {
            "id": 48,
            "phrase": "Cross the stream where it is shallowest.",
            "definition": "Prov. To do things in the easiest possible way.  Jill: How can I get Fred to give me permission to start this project? Jane: Cross the stream where it is shallowest. First ask Fred’s boss for permission; I’m sure she’ll give it to you. Then Fred will have to agree."
        },
        {
            "id": 49,
            "phrase": "Crosses are ladders that lead to heaven.",
            "definition": "Prov. Having to endure trouble can help you to be virtuous. When Mary was diagnosed with cancer, her mother consoled her by saying that crosses are ladders that lead to heaven, and that though she might have to suffer in this world, she would surely be rewarded in the next."
        },
        {
            "id": 50,
            "phrase": "cross-examine someone",
            "definition": "to question someone in court who has already been questioned by the opposing side; to question a suspect or a witness at great length.  The lawyer plans to cross-examine the witness tomorrow morning. The police cross-examined the suspect for three hours."
        },
        {
            "id": 51,
            "phrase": "crouch around",
            "definition": "[for people or other creatures] to stoop or squat within an area. Everyone crouched around, hoping the bomb would fall somewhere else.  The baboons crouched around, grooming one another."
        },
        {
            "id": 52,
            "phrase": "crouch down",
            "definition": "to stoop or huddle down.  Crouch down here, next to me.  Suddenly, Tex crouched down and reached for his pistol."
        },
        {
            "id": 53,
            "phrase": "crow bait",
            "definition": "Rur. someone or an animal that is likely to die; a useless animal or person.  That old dog used to hunt good, but now he’s just crow bait."
        },
        {
            "id": 54,
            "phrase": "crowd around someone or something",
            "definition": "to flock or swarm around someone or something.  The children crowded around the department store Santa, eager for their chance at talking to him.  Everyone crowded around the radio to listen."
        },
        {
            "id": 55,
            "phrase": "crowd in (on someone or something)",
            "definition": "to press or crush around someone or something. Please don’t crowd in on the guest of honor.  Can you keep them back from me? I don’t like it when they crowd in.  The people crowded in on us and frightened us a little bit. Don’t crowd in on the display case. It is an antique."
        },
        {
            "id": 56,
            "phrase": "crowd someone or something together",
            "definition": "to push or squeeze people or things together.  See if you can crowd them together and get more in the row.  I am afraid that I crowded the plants together too much."
        },
        {
            "id": 57,
            "phrase": "crowd something with someone or something",
            "definition": "to pack too many people or things into something.  The ushers crowded the room with visitors.  Aunt Victoria had crowded the room with the busy trappings of a bygone era."
        },
        {
            "id": 58,
            "phrase": "crowd through (something)",
            "definition": "[for a number of people] to push through something.  The little group of revelers crowded through the door.  They all tried to crowd through."
        },
        {
            "id": 59,
            "phrase": "crowd together",
            "definition": "to pack tightly together.  The tenants crowded together in the lobby.  All the kittens crowded together to keep warm."
        },
        {
            "id": 60,
            "phrase": "crown someone with something",
            "definition": "to place a crown on someone’s head.  They crowned the prince with the heavily jeweled royal crown."
        },
        {
            "id": 61,
            "phrase": "crown something with something",
            "definition": "to place something on the very top of something. (As if crowning royalty.) _ The chef crowned the cake with golden icing."
        },
        {
            "id": 62,
            "phrase": "cruise around in something",
            "definition": "to drive or ride around in something. Would you like to cruise around in a car like that? _They really liked cruising around in the motorboat."
        },
        {
            "id": 63,
            "phrase": "crumble away",
            "definition": "to break away in little pieces.  The marble pillar was crumbling away because of the acidic rain.  One of my teeth is just crumbling away."
        },
        {
            "id": 64,
            "phrase": "crumble into something",
            "definition": "to break apart and fall down into bits and pieces.  The base of the pillar suddenly crumbled into dust.  The bones crumbled into dust as the body was lifted from the box."
        },
        {
            "id": 65,
            "phrase": "crumble something up† (into something)",
            "definition": "to crunch up or break up something into pieces. Now, crumble the dried bread up into crumbs. Crumble up the bread into crumbs."
        },
        {
            "id": 66,
            "phrase": "crumble up",
            "definition": "to break up into little pieces.  The cake, which was very dry, crumbled up when I tried to cut it.  The paper of the old book crumbled up when I turned the pages."
        },
        {
            "id": 67,
            "phrase": "crumped out",
            "definition": "Sl. intoxicated.  She was too crumped out to drive herself home.  Are you crumped out again?"
        },
        {
            "id": 68,
            "phrase": "crumple something up†",
            "definition": "to fold up or crush someone or something. Walter crumpled the paper up.  He crumpled up the paper."
        },
        {
            "id": 69,
            "phrase": "crumple up",
            "definition": "to fold up; to collapse.  She was so frightened that she just crumpled up.  Fran crumpled up in a dead faint."
        },
        {
            "id": 70,
            "phrase": "crunch someone or something up†",
            "definition": "to break someone or something up into pieces. That machine will crunch you up. Stay away from it! _A number of blows with the hammer crunched up the rocks into pebbles. Try to crunch the larger chunks up."
        },
        {
            "id": 71,
            "phrase": "crunch something down†",
            "definition": "to press or crush something down, breaking it with a crunching noise.  Sally crunched the flower pot down, breaking it. She crunched down the fragile glass in the box accidentally."
        },
        {
            "id": 72,
            "phrase": "crusade against someone or something",
            "definition": "to campaign or demonstrate against someone or something.  You are always crusading against one cause or another. Ed started crusading against Eric and the latter threatened suit."
        },
        {
            "id": 73,
            "phrase": "crusade for someone or something",
            "definition": "to campaign or demonstrate for someone or something.  I can hardly crusade for the defeat of a friend.  Ed went on a crusade for Eric, hoping to get him elected."
        },
        {
            "id": 74,
            "phrase": "*a crush on someone",
            "definition": "infatuation with someone. (*Typically: get ~; have ~.) _ Mary thinks she’s getting a crush on Bill. Sally says she’ll never have a crush on anyone again."
        },
        {
            "id": 75,
            "phrase": "crush someone or something down†",
            "definition": "to press or force someone or something down.  Crush the leaves down so you can put more into the basket.  Crush down the leaves and fill the basket higher."
        },
        {
            "id": 76,
            "phrase": "crush someone or something to something",
            "definition": "to press or squeeze someone or something into a particular state, such as death, a pulp, nothing, etc.  The anaconda crushed the tapir to death. Donna crushed the bananas to a pulp and put them into the cake batter."
        },
        {
            "id": 77,
            "phrase": "crush something in†",
            "definition": "to force something inward; to break something in.  The beam nearly crushed Jason’s head in.  He tried to crush in the door."
        },
        {
            "id": 78,
            "phrase": "crush something (in)to something",
            "definition": "to grind or break something into bits and pieces.  He crushed the fennel seeds into a powder.  The roller crushes the rocks to bits."
        },
        {
            "id": 79,
            "phrase": "crush something out†",
            "definition": "to put out a cigarette or small flame by crushing. She crushed her cigarette out and put the butt into the sink.  Please crush out your cigarette. "
        },
        {
            "id": 80,
            "phrase": "crush something up†",
            "definition": "to reduce the mass of something by crushing. Crush this up and put it in the sauce. Crush up a clove of garlic and put it in the sauce."
        },
        {
            "id": 81,
            "phrase": "crush something up† (into something)",
            "definition": "to press or grind something with great force until it is reduced to something smaller.  The chef crushed the almonds up into a powder and sprinkled them on the dessert.  The machine crushed up all the glass into tiny bits."
        },
        {
            "id": 82,
            "phrase": "crush (up) against someone or something",
            "definition": "to press hard against someone or something.  The crowd crushed up against the people standing in line.  The eager theatergoers crushed against the lobby doors."
        },
        {
            "id": 83,
            "phrase": "crushed by something",
            "definition": "demoralized; having hurt feelings.  The whole family was completely crushed by the news.  I was just crushed by your attitude. I thought we were friends."
        },
        {
            "id": 84,
            "phrase": "cry all the way to the bank",
            "definition": "to make a lot of money on something that one ought to be ashamed of.  Jane: Have you read the new book by that romance novelist? They say it sold a million copies, but it’s so badly written that the author ought to be ashamed of herself. Alan: I’m sure she’s crying all the way to the bank.  That dreadful movie had no artistic merit. I suppose the people who produced it are crying all the way to the bank."
        },
        {
            "id": 85,
            "phrase": "cry before one is hurt",
            "definition": "to cry or complain needlessly, before one is injured.  Bill always cries before he’s hurt.  There is no point in crying before one is hurt."
        },
        {
            "id": 86,
            "phrase": "cry bloody murder",
            "definition": "to scream as if something very serious has happened, especially unnecessarily.  Now that Bill is really hurt, he’s crying bloody murder.  There is no point in crying bloody murder about the bill if you knew the restaurant was expensive."
        },
        {
            "id": 87,
            "phrase": "cry for someone or something",
            "definition": "1. to weep for the absence or loss of someone or something.  No need to cry for me. Take care of yourself. She cried for her lost cat. 2. to shout a demand for someone or something. She cried for help, but no one heard her.  Tony cried for Walter, but he did not hear. 3. to cry or bawl, signaling the need or want for someone or something. (As done by a baby.) _ The baby cried for a bottle. Little Jimmy was crying for his mother."
        },
        {
            "id": 88,
            "phrase": "cry in one’s beer",
            "definition": "to feel sorry for oneself.  She calls up, crying in her beer, and talks on and on about her problems.  Don’t cry in your beer. Get yourself straightened out."
        },
        {
            "id": 89,
            "phrase": "cry one’s eyes out",
            "definition": "to cry very hard. When we heard the news, we cried our eyes out with joy. She cried her eyes out after his death."
        },
        {
            "id": 90,
            "phrase": "cry oneself to sleep",
            "definition": "to weep until sleep overtakes one.  The baby finally cried herself to sleep."
        },
        {
            "id": 91,
            "phrase": "cry out (against someone or something)",
            "definition": "to shout in anger against someone or something.  The crowd cried out against the police.  She cried out against Eric, who had insulted her grossly."
        },
        {
            "id": 92,
            "phrase": "cry out for someone or something",
            "definition": "1. to shout praise or encouragement for someone or something. Everyone in the street cried out for the mayor to make an appearance. 2. to shout out demands for someone or something.  The children cried out for ice cream.  The mob was crying out for justice when they heard the unpopular sentences of the judge."
        },
        {
            "id": 93,
            "phrase": "cry over someone or something",
            "definition": "to weep because of someone or something.  There’s no need to cry over it. Things will work out.  She is still crying over her lost love."
        },
        {
            "id": 94,
            "phrase": "cry over spilled milk",
            "definition": "to be unhappy about what cannot be undone.  He is always crying over spilled milk. He cannot accept reality.  It can’t be helped. Don’t cry over spilled milk."
        },
        {
            "id": 95,
            "phrase": "cry (something) out† (to someone or an animal)",
            "definition": "to yell something to someone or an animal. She cried a warning out to the others.  Sally cried out a warning to the people behind her. The trainer cried a command out to the runaway horse."
        },
        {
            "id": 96,
            "phrase": "cry wolf",
            "definition": "to cry or complain about something when nothing is really wrong. (From the story wherein a child sounds the alarm frequently about a wolf when there is no wolf, only to be ignored when there actually is a wolf.) _ Pay no attention. She’s just crying wolf again.  Don’t cry wolf too often. No one will come."
        },
        {
            "id": 97,
            "phrase": "a crying need (for someone or something)",
            "definition": "a definite or desperate need for someone or something.  There is a crying need for someone to come in and straighten things out.  All the people in that area have a crying need for a local hospital."
        },
        {
            "id": 98,
            "phrase": "a crying shame",
            "definition": "a very unfortunate situation; a real shame. It’s a crying shame that people cannot afford adequate housing.  That your father could not attend graduation was a crying shame."
        },
        {
            "id": 99,
            "phrase": "cue someone in†",
            "definition": "to give someone a cue; to indicate to someone that the time has come. Now, cue the orchestra director in.  All right, cue in the announcer."
        },
        {
            "id": 100,
            "phrase": "culminate in something",
            "definition": "to climax in something; to end with something.  The contest culminated in a victory for the best band.  The play-offs culminated in a big win for the Chicago team."
        },
        {
            "id": 101,
            "phrase": "culturally advantaged",
            "definition": "Euph. rich; upper-class. I can’t deny I had a culturally advantaged upbringing. The charity appealed to culturally advantaged people to donate time and money to those less fortunate."
        },
        {
            "id": 102,
            "phrase": "culture vulture",
            "definition": "someone whom one considers to be excessively interested in the (classical) arts.  She won’t go to a funny film. She’s a real culture vulture. They watch only highbrow television. They’re culture vultures."
        },
        {
            "id": 103,
            "phrase": "cup one’s hands together",
            "definition": "to put one’s hands together to form a sort of cup.  He cupped his hands together and scooped up the water. You have to cup your hands together if you want a drink."
        },
        {
            "id": 104,
            "phrase": "curdle someone’s blood",
            "definition": "to frighten or disgust someone severely.  The story was scary enough to curdle your blood.  The terrible scream was enough to curdle my blood."
        },
        {
            "id": 105,
            "phrase": "cure someone of something",
            "definition": "to rid someone of a disease, ailment, bad habit, or obsession. I hope that the doctor prescribes something to cure him of that chronic cough. Will you please try to cure yourself of your constant interrupting?"
        },
        {
            "id": 106,
            "phrase": "cure something of something",
            "definition": "to eliminate the cause of a malfunction in a machine or a device. I think I have cured the stapler of jamming all the time.  I can’t seem to cure the committee of procrastination."
        },
        {
            "id": 107,
            "phrase": "Curiosity killed the cat.",
            "definition": "Prov. Being curious can get you into trouble. (Often used to warn someone against prying into other’s affairs.) _ Jill: Where did you get all that money? Jane: Curiosity killed the cat."
        },
        {
            "id": 108,
            "phrase": "curl something up†",
            "definition": "to roll something up into a coil.  She curled the edges of the paper up while she spoke.  Why did she curl up the paper?"
        },
        {
            "id": 109,
            "phrase": "curl up and die",
            "definition": "to die. (Often jocular.) _ When I heard you say that, I could have curled up and died.  No, it wasn’t an illness. She just curled up and died."
        },
        {
            "id": 110,
            "phrase": "curl up (in(to) something)",
            "definition": "1. to roll into a coil.  The snake curled up into a neat coil. It curled up so we couldn’t get at it. 2. [for one] to bend one’s body into a resting place, such as a chair or a bed.  Colleen curled up in the chair and took a nap.  She curled up and took a nap."
        },
        {
            "id": 111,
            "phrase": "curl up with someone or an animal",
            "definition": "to snuggle up to someone or something.  She curled up with her husband and fell asleep.  Elaine curled up with the family dog to keep warm."
        },
        {
            "id": 112,
            "phrase": "curry favor with someone",
            "definition": "to try to win favor from someone.  The lawyer tried to curry favor with the judge.  It’s silly to curry favor with the boss. Just act yourself."
        },
        {
            "id": 113,
            "phrase": "curse at someone or something",
            "definition": "to swear at someone or something; to use foul language at someone or something. He cursed at the jammed toaster and pounded his fist on the counter in anger.  Please don’t curse at me."
        },
        {
            "id": 114,
            "phrase": "curse someone for something",
            "definition": "to damn someone for doing something; to invoke evil upon someone for doing something.  She cursed her mother for ever having borne her.  Over and over, she cursed herself for ever having come there."
        },
        {
            "id": 115,
            "phrase": "curse someone or something with something",
            "definition": "1. to damn someone or something with something, especially a verbal curse.  She cursed him with the fervent wish that he rot in hell.  She cursed the day he was born with an unprintable oath. 2. to afflict or oppress someone or something with something.  His upbringing cursed him with a strong sense of guilt.  The political scandal cursed the town with a dismal reputation for years."
        },
        {
            "id": 116,
            "phrase": "curtain something off†",
            "definition": "to separate something or some place with a drape, screen, or curtain. We curtained this part of the room off, so please sleep over there.  We will curtain off part of the room."
        },
        {
            "id": 117,
            "phrase": "curtains for someone or something",
            "definition": "the death, end, or ruin of someone or something. (From the lowering or closing of the curtains at the end of a stage performance.) _ If the car hadn’t swerved, it would have been curtains for the pedestrians.  If they can’t get into the export market, it’s curtains for the whole company."
        },
        {
            "id": 118,
            "phrase": "curtsy to someone",
            "definition": "[for a woman] to dip or bow in deference to someone.  Of course, I curtsied to the queen! Do you think I’m an anarchist? _ The little girls curtsied after they did their dance number."
        },
        {
            "id": 119,
            "phrase": "curve to something",
            "definition": "to bend or bow toward something, some direction, or some place.  The road curved to the left.  One of her toes curves to the right."
        },
        {
            "id": 120,
            "phrase": "cuss a blue streak",
            "definition": "Rur. to curse a great deal.  When she dropped the brick on her toe, she cussed a blue streak. Bill could cuss a blue streak by the time he was eight years old."
        },
        {
            "id": 121,
            "phrase": "cuss someone out†",
            "definition": "to curse at someone.  Dad cussed me out for losing the money he gave me. The little kid cussed out his brother, shocking his grandmother."
        },
        {
            "id": 122,
            "phrase": "The customer is always right.",
            "definition": "Prov. In order to keep customers happy, the people who serve them should always obey their wishes. (Often cited as a principle of good business dealings; customers sometimes say it to the people serving them in order to try to get good service.) _ When I began working at the gift shop, my boss told me, “Remember, the customer is always right, no matter how stupid or rude you may think he is being.”"
        },
        {
            "id": 123,
            "phrase": "cut a deal",
            "definition": "to arrange a deal; to negotiate an agreement.  Maybe we can cut a deal. Let’s talk.  The two lawyers cut a deal that left me with my car, although she got the house."
        },
        {
            "id": 124,
            "phrase": "cut a fine figure",
            "definition": "to look good; to look elegant. (Usually said of a male.) _Tom really cuts a fine figure on the dance f loor.  Bill cuts a fine figure since he bought some new clothes."
        },
        {
            "id": 125,
            "phrase": "a cut above average",
            "definition": "better than average. John isn’t the best mechanic in town, but he’s a cut above average."
        },
        {
            "id": 126,
            "phrase": "a cut above something",
            "definition": "a measure or degree better than something else.  Your shirt is beautiful, but mine is a cut above yours."
        },
        {
            "id": 127,
            "phrase": "cut along something",
            "definition": "to make a cut following a line or guide.  Please cut along the dotted line. My hand is too shaky to cut along the line neatly."
        },
        {
            "id": 128,
            "phrase": "cut and dried",
            "definition": "fixed; determined beforehand; usual and uninteresting. (Can be hyphenated before nominals.) _ I find your writing quite boring. It’s too cut and dried.  The lecture was, as usual, cut and dried."
        },
        {
            "id": 129,
            "phrase": "cut and paste",
            "definition": "to cut something out of paper with scissors and paste it onto something else.  The teacher told the little children that it was time to cut and paste, and they all ran to the worktables.  Mary made a tiny house by cutting and pasting little strips of paper."
        },
        {
            "id": 130,
            "phrase": "cut and run",
            "definition": "Sl. to run away quickly. (Alludes to cutting loose a ship’s or boat’s anchor and sailing away in a hurry.) _ Wilbur decided to cut and run when he heard the police sirens. As soon as I finish what I am doing here, I’m going to cut and run. I’ve got to get home by six o’clock."
        },
        {
            "id": 131,
            "phrase": "cut around something",
            "definition": "to move rapidly around something, such as a corner, pole, beam, etc.  The cat cut around a corner and escaped from the dog.  The speeding car cut around the light pole and almost hit it."
        },
        {
            "id": 132,
            "phrase": "cut at someone or an animal",
            "definition": "to thrust a knife or something similar at someone or an animal.  The hoodlum cut at me, but I dodged the blade.  He cut at the dog, but it had no effect on the vicious animal."
        },
        {
            "id": 133,
            "phrase": "cut back",
            "definition": "to turn back; to reverse direction.  Suddenly, the bull cut back in our direction and began chasing us.  The road cuts back about a mile ahead, and it goes west again."
        },
        {
            "id": 134,
            "phrase": "cut back (on something)",
            "definition": "to reduce the use, amount, or cost of something.  You are all going to have to cut back on water usage. You simply must cut back on office expenses."
        },
        {
            "id": 135,
            "phrase": "cut back to someone or something",
            "definition": "[for a film or television camera] to return to a picture of someone or something.  Suddenly, the camera cut back to the reporter, who— unprepared—just stood there.  The scene cut back to the veranda overlooking the bay."
        },
        {
            "id": 136,
            "phrase": "cut both ways",
            "definition": "to affect both sides of an issue equally.  Remember that your suggestion that costs should be shared cuts both ways. Your division will have to reduce its budget as well.  If our side cannot take along supporters to the game, then yours cannot either. The rule has to cut both ways."
        },
        {
            "id": 137,
            "phrase": "cut corners",
            "definition": "to take shortcuts; to save money or effort by finding cheaper or easier ways to do something.  They’re always finding ways to cut corners.  I won’t cut corners just to save money. I put quality first."
        },
        {
            "id": 138,
            "phrase": "cut down (on something)",
            "definition": "to reduce the amount of something or of doing something; to use or buy less of something.  You will have to cut down on the time it takes you to get ready in the morning.  The doctor told him to cut down on his drinking."
        },
        {
            "id": 139,
            "phrase": "cut in (ahead of someone or something)",
            "definition": "to move quickly and carelessly into line ahead of someone, as in a line of people or in traffic.  A red car cut in ahead of me and nearly caused me to run off the road.  Careful! Don’t cut in ahead of that car!"
        },
        {
            "id": 140,
            "phrase": "cut in (on someone)",
            "definition": "[for someone] to ask to replace one member of a dancing couple.  Excuse me, may I cut in? _ Please don’t cut in."
        },
        {
            "id": 141,
            "phrase": "cut in (on something)",
            "definition": "to interrupt something, especially some sort of electronic transmission.  I didn’t mean to cut in on your announcement. Who cut in on my telephone call?"
        },
        {
            "id": 142,
            "phrase": "cut in (with something)",
            "definition": "to interrupt [someone] with a comment; to speak abruptly, interrupting what someone else is saying.  Jimmy cut in with a particularly witty remark. Must you always cut in while others are talking?"
        },
        {
            "id": 143,
            "phrase": "cut in(to something)",
            "definition": "to slice something; to gouge something.  We cut into the watermelon and found it to be spoiled. It was a beautiful apple, but when she cut in, she found out that she had been cheated."
        },
        {
            "id": 144,
            "phrase": "Cut it out!",
            "definition": "Inf. Stop doing that!; Stop saying that! (Fixed order.) _Sue: Why, I think you have a crush on Mary! Tom: Cut it out! _ “Cut it out!” yelled Tommy as Billy hit him again."
        },
        {
            "id": 145,
            "phrase": "cut no ice (with someone)",
            "definition": "Sl. to have no influence on someone; to fail to convince someone.  I don’t care who you are. It cuts no ice with me.  So you’re the mayor’s daughter. It still cuts no ice."
        },
        {
            "id": 146,
            "phrase": "cut off",
            "definition": "1. to stop by itself or oneself.  The machine got hot and cut off. Bob cut off in midsentence. 2. to turn off a road, path, highway, etc.  This is the place where you are supposed to cut off. When you come to a cutoff on the left, continue on for about mile."
        },
        {
            "id": 147,
            "phrase": "cut one’s eyes at someone or something",
            "definition": "Rur. to glance at someone or something.  He cut his eyes at me to see if I was looking.  She cut her eyes at the TV for a second."
        },
        {
            "id": 148,
            "phrase": "cut one’s eyeteeth on something",
            "definition": "to grow up experiencing something; to have had the experience of dealing with something [successfully] at a very early age.  My grandfather taught me how to fish, so I cut my eyeteeth on fishing.  Fred cut his eyeteeth on writing; both his parents were authors."
        },
        {
            "id": 149,
            "phrase": "cut one’s losses",
            "definition": "to do something to stop a loss of something.  I knew I had to do something to cut my losses, but it was almost too late.  Sell some of the high-priced stuff to cut your losses."
        },
        {
            "id": 150,
            "phrase": "cut one’s nose off to spite one’s face",
            "definition": "Prov. to hurt yourself in an attempt to hurt someone else. (Often in the form, “Don’t cut off your nose to spite your face.”) _Isaac dropped out of school because he wanted to make his father angry; years later, he realized that he had cut off his nose to spite his face."
        },
        {
            "id": 151,
            "phrase": "cut one’s (own) throat",
            "definition": "[for someone] to bring about one’s (own) failure.  If I were to run for office, I’d just be cutting my throat. Judges who take bribes are cutting their own throats."
        },
        {
            "id": 152,
            "phrase": "cut one’s wolf loose",
            "definition": "Sl. to go on a drinking bout; to get drunk.  I’m gonna go out and cut my wolf loose tonight. You’re going to cut your wolf loose too often and really get into trouble."
        },
        {
            "id": 153,
            "phrase": "cut (oneself) loose (from someone or something)",
            "definition": "to get out from under the domination of someone or something.  At last, she cut herself loose from her mother.  She had to cut loose from home.  Everyone wished that Todd would cut himself loose from his mother."
        },
        {
            "id": 154,
            "phrase": "cut oneself on something",
            "definition": "to slice one’s flesh with something accidentally.  Careful, you will cut yourself on that knife.  Careful! Don’t cut yourself on that broken glass."
        },
        {
            "id": 155,
            "phrase": "cut out",
            "definition": "to depart; to leave in a hurry.  Good-bye. I have to cut out now. It’s time I was cutting out. I’m late already."
        },
        {
            "id": 156,
            "phrase": "cut out for someone or something",
            "definition": "to run hurriedly toward someone or something. At the last minute, he cut out for the gate, which was closing very fast.  The child cut out for his mother, who had come to get him at school."
        },
        {
            "id": 157,
            "phrase": "cut out for something",
            "definition": "suited for something.  She was bright and she loved to read. Her folks thought she was cut out for being a schoolteacher.  He did his best, but he just wasn’t cut out for farming."
        },
        {
            "id": 158,
            "phrase": "cut out to be something",
            "definition": "destined to be something or a particular type of person.  I don’t think I was cut out to do this.  We weren’t cut out to be laborers."
        },
        {
            "id": 159,
            "phrase": "cut (someone) a check",
            "definition": "to write a check; to have a computer print a check. (Used in business especially of machine-made checks.) _ We will cut a check for the balance due you later this afternoon. We will cut you a check as soon as possible."
        },
        {
            "id": 160,
            "phrase": "cut someone dead",
            "definition": "to ignore someone totally.  Joan was just about to speak to James when he walked away and cut her dead.  Jean cut her former husband dead."
        },
        {
            "id": 161,
            "phrase": "cut someone down†",
            "definition": "to kill someone with a weapon, such as a sword, or with gunfire, etc.  The bandits cut the bystanders down and f led.  The gunman cut down an innocent pedestrian."
        },
        {
            "id": 162,
            "phrase": "cut someone in† (on something)",
            "definition": "Sl. to permit someone to share something, such as profits or loot.  Max refused to cut in his partner Lefty.  We can’t cut you in. There’s not enough."
        },
        {
            "id": 163,
            "phrase": "cut someone off† at the pass",
            "definition": "to block someone’s effort to get away; to thwart someone’s efforts. They are ahead now, but we’ll cut them off at the pass.  Try to cut off the bandits at the pass!"
        },
        {
            "id": 164,
            "phrase": "cut someone off† without a penny",
            "definition": "to end someone’s allowance; to fail to leave someone money in one’s will.  Mr. and Mrs. Franklin cut their son off without a penny after he quit school.  They cut off both of their sons without a penny. We learned, when Uncle Sam’s will was read, that he cut off his own f lesh and blood without a penny."
        },
        {
            "id": 165,
            "phrase": "cut someone or something loose from something",
            "definition": "to sever the connection between people or things, in any combination.  Wally cut the child loose from the tree where his playmates had tied him up.  I cut the cord loose from the anchor by mistake."
        },
        {
            "id": 166,
            "phrase": "cut someone or something off† (from something)",
            "definition": "to block or isolate someone or something from some place or something.  They cut the cattle off from the wheat field.  The enemy tanks cut off the troops from their camp."
        },
        {
            "id": 167,
            "phrase": "cut someone or something off† (short)",
            "definition": "to interrupt someone or something; to prevent someone from continuing to speak.  In the middle of her sentence, the teacher cut her off short.  Bob cut off Mary when she was trying to explain."
        },
        {
            "id": 168,
            "phrase": "cut someone or something out†",
            "definition": "to eliminate someone or something. They cut out the free coffee with lunch at the cafeteria. We have to cut Chuck out. There are too many better men on the team."
        },
        {
            "id": 169,
            "phrase": "cut someone or something to something",
            "definition": "to chop or slice up someone or something, especially to bits or pieces.  The chef cut the carrots to bite-size pieces.  The lawn mower will cut you to bits if you get under it."
        },
        {
            "id": 170,
            "phrase": "cut someone or something up†",
            "definition": "to criticize someone or something severely.  Jane is such a gossip. She was really cutting Mrs. Jones up.  The professor really cut up my essay."
        },
        {
            "id": 171,
            "phrase": "cut someone’s water off†",
            "definition": "to squelch someone; to thwart someone. (Fixed order.) _ Well, I guess that cuts your water off! _ That sure cuts off my water!"
        },
        {
            "id": 172,
            "phrase": "cut someone to ribbons",
            "definition": "to cut or slice someone severely.  He broke a mirror and the glass cut his hand to ribbons."
        },
        {
            "id": 173,
            "phrase": "cut someone up†",
            "definition": "to gash or carve on someone by cutting. The thugs cut him up badly, just for talking back.  They cut up their victim into pieces."
        },
        {
            "id": 174,
            "phrase": "cut someone up",
            "definition": "to make someone laugh. That comedian’s routine really cut me up.  Tommy’s rude noises cut the whole class up, but not the teacher."
        },
        {
            "id": 175,
            "phrase": "cut something away† (from something)",
            "definition": "to separate something from something by cutting.  The doctor cut the wart away from the patient’s foot. She cut away the loose thread."
        },
        {
            "id": 176,
            "phrase": "cut something back†",
            "definition": "to prune plants; to reduce the size of plants, bushes, etc.  Let’s cut these bushes back. They’re getting in the way.  Don’t cut back my roses!"
        },
        {
            "id": 177,
            "phrase": "cut something down†",
            "definition": "to chop something down; to saw or cut at something until it is felled. Stop cutting the banners down! _ Don’t cut down that tree!"
        },
        {
            "id": 178,
            "phrase": "cut something down† to something",
            "definition": "to reduce something to a manageable size.  We cut the program down to size and it was very enjoyable.  We cut down the program to a half hour."
        },
        {
            "id": 179,
            "phrase": "cut something from something",
            "definition": "to remove something from something by cutting. She carefully cut the blossoms from the bush.  A few blossoms were cut from the bush."
        },
        {
            "id": 180,
            "phrase": "cut something off†",
            "definition": "1. to shorten something.  Cut this board off a bit, would you? _ Cut off this board a little, please. 2. to turn something off, such as power, electricity, water, the engine, etc.  Would you please cut that engine off ? _ Cut off the engine, Chuck."
        },
        {
            "id": 181,
            "phrase": "cut something on something",
            "definition": "1. to slice something on or against something, accidentally.  I cut my finger on the knife.  Maria cut her foot on the broken glass. 2. to slice something that is lying on something else.  I cut the tomatoes on the cutting board your mother gave us."
        },
        {
            "id": 182,
            "phrase": "cut something out†",
            "definition": "to stop doing something. (Usually a command. See also Cut it out!) _ Cut that noise out! _ Cut out that noise! _ Now, cut that out! "
        },
        {
            "id": 183,
            "phrase": "cut something to the bone",
            "definition": "to slice deep to a bone. The knife cut John to the bone. He had to be sewed up.  Cut each slice of ham to the bone. Then each slice will be as big as possible."
        },
        {
            "id": 184,
            "phrase": "cut something with something",
            "definition": "to dilute something with something else.  They cut the liquor with cold water.  Please cut this with some soda. It’s too sweet, otherwise."
        },
        {
            "id": 185,
            "phrase": "cut teeth",
            "definition": "[for a baby or young person] to have new teeth emerging through the gums. Billy is cranky because he’s cutting teeth.  Ann cut her first tooth this week."
        },
        {
            "id": 186,
            "phrase": "cut the deadwood out",
            "definition": "to prune away and remove the dead branches from a tree or bush. They cut a lot of the deadwood out to save the tree.  You have to cut out the deadwood to make room for new growth."
        },
        {
            "id": 187,
            "phrase": "cut the dust",
            "definition": "to take a drink of liquor.  I think I’ll stop in here and cut the dust.  I want to cut the dust. Can I have a snort?"
        },
        {
            "id": 188,
            "phrase": "cut the ground out† from under someone",
            "definition": "to destroy the foundation of someone’s plans or someone’s argument. The politician cut the ground out from under his opponent. Congress cut out the ground from under the president."
        },
        {
            "id": 189,
            "phrase": "cut the pie up†",
            "definition": "to divide something up. (Can refer to an actual pie or anything that can be divided into varying portions.) _ It all depends on how you cut the pie up.  How should I cut up the pie?"
        },
        {
            "id": 190,
            "phrase": "cut through red tape",
            "definition": "to eliminate or neutralize something complicated, such as bureaucratic rules and procedures.  I will try to cut through all the red tape for you so you get your visa on time.  I am sure someone can help us cut through all this red tape."
        },
        {
            "id": 191,
            "phrase": "cut through something",
            "definition": "to penetrate something by cutting; to slice through something.  The worker cut through the steel door with a torch.  Walter cut through the rind of the watermelon."
        },
        {
            "id": 192,
            "phrase": "cut to someone or something",
            "definition": "to shift the radio, movie, or television audience’s attention abruptly to someone or something new.  Suddenly, the engineer cut to the announcer.  The technical director cut to a remote unit that was covering an accident.  The camera cut to scenes of Atlanta burning."
        },
        {
            "id": 193,
            "phrase": "cut to the chase",
            "definition": "Sl. to focus on what is important; to abandon the preliminaries and deal with the major points.  All right, let’s stop the idle chatter and cut to the chase.  After a few introductory comments, we cut to the chase and began negotiating."
        },
        {
            "id": 194,
            "phrase": "cut up",
            "definition": "to act wildly; to show off and be troublesome; to act like a clown.  Tom, Billy! Stop cutting up, or I’ll send you to the principal’s office.  If you spent more time studying than cutting up, you’d get better grades. "
        },
        {
            "id": 195,
            "phrase": "cut up (about someone or something)",
            "definition": "Sl. emotionally upset about someone or something.  She was all cut up about her divorce.  You could see how cut up she was."
        },
        {
            "id": 196,
            "phrase": "cut your peaches",
            "definition": "Rur. go on with what you were doing.  Stop gawking and cut your peaches.  There’s no need for you to follow me around. Go cut your peaches."
        },
        {
            "id": 197,
            "phrase": "*cute as a bug’s ear",
            "definition": "very cute. (*Also: as ~.) _ That little baby is cute as a bug’s ear."
        },
        {
            "id": 198,
            "phrase": "the cutting edge",
            "definition": "the most forward part of a trend; the leading part of a trend. (Alludes to the edge of a sword. See also on the cutting edge. See also on the bleeding edge.) _ Fred’s invention put him on the cutting edge of the computer chip business."
        },
        {
            "id": 199,
            "phrase": "dab at something",
            "definition": "to touch or pat something. The painter dabbed at the canvas, making little changes here and there.  Don’t just dab at the wall, spread the paint on!"
        },
        {
            "id": 200,
            "phrase": "dabble at something",
            "definition": "to play at doing something; to do something halfheartedly.  Don’t just dabble at your history paper. Settle down and do it right.  She dabbles at painting."
        },
        {
            "id": 201,
            "phrase": "dabble in something",
            "definition": "to be involved in something in a casual manner.  She dabbled in local politics for a while.  I want to dabble in something new for a while."
        },
        {
            "id": 202,
            "phrase": "Dad fetch my buttons!",
            "definition": "Rur. What a surprise!; Goodness me! _ Dad fetch my buttons! It’s a letter from Aunt Rita! _ Dad fetch my buttons, I never was so happy in all my life!"
        },
        {
            "id": 203,
            "phrase": "daily dozen",
            "definition": "physical exercises done every day.  My brother always feels better after his daily dozen.  She would rather do a daily dozen than go on a diet."
        },
        {
            "id": 204,
            "phrase": "the daily grind",
            "definition": "[someone’s] everyday work routine. I’m getting very tired of the daily grind.  When my vacation was over, I had to go back to the daily grind."
        },
        {
            "id": 205,
            "phrase": "dally over something",
            "definition": "to waste time or take too long doing something.  Don’t dally over your food. Eat your dinner.  I wish you wouldn’t dally over your homework."
        },
        {
            "id": 206,
            "phrase": "dally with someone",
            "definition": "to flirt with someone; to waste time with someone of the opposite sex. (Old.) _ Sam is dallying with that Johnson girl again.  Stop dallying with her and get back to your studies!"
        },
        {
            "id": 207,
            "phrase": "dam something up†",
            "definition": "to erect a barrier in a river, stream, brook, etc.  We are going to have to dam this stream up to make a pond for the cattle.  Let’s dam up this stream.  Why is this river dammed up?"
        },
        {
            "id": 208,
            "phrase": "Damn it to blue blazes!",
            "definition": "Rur. Damn it. (An oath.) _ Damn it to blue blazes, I told you I can’t lend you any more money! _ “Damn it to blue blazes! I give up!” Joe shouted, f linging his tools aside."
        },
        {
            "id": 209,
            "phrase": "a (damn) sight better",
            "definition": "Rur. much better. Mary can sing a damn sight better than Tom can.  You look a sight better with your hair cut short."
        },
        {
            "id": 210,
            "phrase": "damn someone or something with faint praise",
            "definition": "to criticize someone or something indirectly by not praising enthusiastically.  The critic did not say that he disliked the play, but he damned it with faint praise.  Mrs. Brown is very proud of her son’s achievements, but damns her daughter’s with faint praise."
        },
        {
            "id": 211,
            "phrase": "damn someone with something",
            "definition": "to curse someone with words.  She damned him with curse after curse.  Maria damned Joe with the worst curses she could think of."
        },
        {
            "id": 212,
            "phrase": "Damned if you do, damned if you don’t.",
            "definition": "Prov. No matter what you do, it will cause trouble.  If I use this money to pay the rent, I won’t have enough left over for food. But if I don’t use the money to pay the rent, my landlord will evict me. Damned if I do, damned if I don’t.  Helen: If I invite Shirley to the party, I’m sure she’ll get drunk and make an unpleasant scene. But if I don’t invite her, she’ll never forgive me. Jane: Damned if you do, damned if you don’t, huh?"
        },
        {
            "id": 213,
            "phrase": "damp off",
            "definition": "[for seedlings] to die from too much water.  All the new plants damped off, and we had to buy some from the nursery.  The little seedlings damped off and withered away."
        },
        {
            "id": 214,
            "phrase": "damp something down†",
            "definition": "to make something damp.  Damp the clothes down before you iron them.  Please damp down the clothes first."
        },
        {
            "id": 215,
            "phrase": "dance at someone’s wedding",
            "definition": "to celebrate in honor of someone at someone’s wedding.  I will dance at your wedding—if you invite me, of course.  If you think I will dance at your wedding, you had better be nicer to me!"
        },
        {
            "id": 216,
            "phrase": "dance on air",
            "definition": "to be very happy; to be euphoric enough as if to dance on air. I was so happy, I could have danced on air.  She was just dancing on air, she was so happy."
        },
        {
            "id": 217,
            "phrase": "dance to something",
            "definition": "to respond to music or rhythm with dancing.  I can’t dance to that fast beat! _ That music is horrible. No one can dance to that."
        },
        {
            "id": 218,
            "phrase": "dance with death",
            "definition": "to attempt to do something that is very risky.  The crossing of the border into enemy territory was like dancing with death. You are dancing with death in your effort to cross that narrow ledge."
        },
        {
            "id": 219,
            "phrase": "dance with someone",
            "definition": "to perform social dancing with another person.  Do you think you would like to dance with Wally? _ Would you please dance with me?"
        },
        {
            "id": 220,
            "phrase": "dangle from something",
            "definition": "to hang from something.  A number of colorful glass balls dangled from the branches of the tree.  Some loose threads dangled from the bottom of his jacket."
        },
        {
            "id": 221,
            "phrase": "dangle something from something",
            "definition": "to hang something loosely from something else.  She dangled a few small bells from the bottom of her skirt during the holidays.  I dangled a bit of fish from the window so I could see how high the cat would jump."
        },
        {
            "id": 222,
            "phrase": "dare someone (to do something)",
            "definition": "to challenge someone to do something. Sally dared Jane to race her to the corner.  You wouldn’t do that, would you? I dare you."
        },
        {
            "id": 223,
            "phrase": "dark horse",
            "definition": "someone or something whose abilities, plans, or feelings are little known to others. (From a race horse about which little or nothing is known.) _ It’s difficult to predict who will win the prize—there are two or three dark horses in the tournament.  Everyone was surprised at the results of the election. The dark horse won."
        },
        {
            "id": 224,
            "phrase": "the dark side of someone or something",
            "definition": "the negative and often hidden aspect of someone or something.  I had never seen the dark side of Mary before, and I have to tell you that I was horrified when she lost her temper."
        },
        {
            "id": 225,
            "phrase": "darken someone’s door",
            "definition": "[for an unwelcome person] to come to someone’s door seeking entry. (As if the visitor were casting a shadow on the door. Formal, or even jocular.) _ Who is this who has come to darken my door? _She pointed to the street and said, “Go and never darken my door again!”"
        },
        {
            "id": 226,
            "phrase": "dart a glance at someone or something",
            "definition": "to shoot a quick look at someone or something.  She darted a glance at him and looked quickly away.  He darted a glance at the door and looked even more uncomfortable."
        },
        {
            "id": 227,
            "phrase": "dart about",
            "definition": "to move about quickly.  The little fish were darting about everywhere.  People were darting about, to and fro, during the noon rush hour."
        },
        {
            "id": 228,
            "phrase": "dart across something",
            "definition": "to run quickly over something.  A small animal darted across the road in front of the car.  I tried to dart across the street, but the traffic was too heavy."
        },
        {
            "id": 229,
            "phrase": "dart in and out",
            "definition": "[for something moving] to move quickly between two things, or into a number of things, and move away again.  On the highway, a small car was darting in and out of the two right lanes of traffic.  A small bird darted in and out of the bush, probably going into a nest inside."
        },
        {
            "id": 230,
            "phrase": "dart out (of something) (at someone or something)",
            "definition": "to move quickly out of something toward someone or something. The ferret darted out of its burrow at the children. The snake darted out at the frog.  The mouse darted out of its hole."
        },
        {
            "id": 231,
            "phrase": "dash across something",
            "definition": "to run quickly across some area.  John dashed across the busy street and ran in the door.  The dog dashed across the yard and confronted the meter reader."
        },
        {
            "id": 232,
            "phrase": "dash out (for something)",
            "definition": "[for someone] to leave a place in a hurry to get something.  Harry dashed out for some cigarettes.  Excuse me. I just have to dash out."
        },
        {
            "id": 233,
            "phrase": "dash over (for something)",
            "definition": "[for someone] to come by quickly for something such as a brief visit. I just dashed over for a cup of sugar. Can you spare it? _ I needed some sugar, so I just dashed over."
        },
        {
            "id": 234,
            "phrase": "dash someone or something against someone or something",
            "definition": "to throw or fling someone or something at or against someone or something.  Sam dashed the bottle against the f loor, shattering it.  Alice dashed the box against Ed, throwing him off balance."
        },
        {
            "id": 235,
            "phrase": "dash someone’s hopes",
            "definition": "to ruin someone’s hopes; to put an end to someone’s dreams or aspirations. Mary dashed my hopes when she said she wouldn’t marry me."
        },
        {
            "id": 236,
            "phrase": "dash something off†",
            "definition": "to make or do something quickly.  I will dash this off now and try to take more time with the rest of them. I will see if I can dash off a cherry pie before dinner."
        },
        {
            "id": 237,
            "phrase": "dash something to pieces",
            "definition": "to break something into small pieces.  She dashed the glass to pieces on the f loor—she was so mad. The potter dashed the imperfect pot to pieces."
        },
        {
            "id": 238,
            "phrase": "date back (to someone or some time)",
            "definition": "to have origins that extend back to the time of someone or something. This part of the palace dates back to Catherine the Great. This is old! It really must date back."
        },
        {
            "id": 239,
            "phrase": "date from something",
            "definition": "to have an existence that extends from a particular time.  This building dates from the beginning of the last century.  These books date from the 1920s."
        },
        {
            "id": 240,
            "phrase": "daub something with something",
            "definition": "to smear or paint something with something sticky, such as paint, grease, makeup, etc.  The mechanic daubed the part with grease and put it back where it came from.  The end of the chair leg was daubed with glue and set into place."
        },
        {
            "id": 241,
            "phrase": "Davy Jones’s locker",
            "definition": "the bottom of the sea, especially when it is a grave.  They were going to sail around the world, but ended up in Davy Jones’s locker.  Most of the gold from that trading ship is in Davy Jones’s locker."
        },
        {
            "id": 242,
            "phrase": "dawdle about",
            "definition": "to waste time in a place; to waste time talking idly.  Don’t dawdle about. Get moving.  Tim has been dawdling about all morning."
        },
        {
            "id": 243,
            "phrase": "dawdle along",
            "definition": "to move along slowly and casually.  The boys dawdled along on their way to school.  We were just dawdling along, talking about life. We didn’t know we were late."
        },
        {
            "id": 244,
            "phrase": "dawdle over something",
            "definition": "to waste time when one should be doing a particular task; to loaf while doing something.  Don’t dawdle over your hamburger. The lunch period ends in two minutes.  Don’t dawdle over it. Get it done."
        },
        {
            "id": 245,
            "phrase": "dawdle something away†",
            "definition": "to waste a particular amount of time; to let a period of time slip away, wasted. You didn’t finish your work because you dawdled most of your time away.  You dawdle away too much time daydreaming."
        },
        {
            "id": 246,
            "phrase": "dawn (up)on someone",
            "definition": "[for a fact] to become apparent to someone; [for something] to be suddenly realized by someone. (Upon is formal and less commonly used than on.) _ Then it dawned upon me that I was actually going to have the job.  On the way home, it dawned on me that I had never returned your call, so when I got home I called immediately."
        },
        {
            "id": 247,
            "phrase": "day after day",
            "definition": "every day; daily; all the time.  He wears the same clothes day after day.  She visits her husband in the hospital day after day."
        },
        {
            "id": 248,
            "phrase": "a day late and a dollar short",
            "definition": "late and ill-prepared.  Tommy, you seem to show up a day late and a dollar short all the time. You need to get organized."
        },
        {
            "id": 249,
            "phrase": "*the day off",
            "definition": "a day free from working. (*Typically: get ~; have ~; give someone ~; take ~.) _ The next time I get a day off, we’ll go to the zoo.  I have the day off. Let’s go hiking."
        }
    ]
}