{
    "dictionary": [
        {
            "id": 0,
            "phrase": "every last one",
            "definition": "every one; every single one.  You must eat all your peas! Every last one! _Each of you—every last one—has to take some medicine."
        },
        {
            "id": 1,
            "phrase": "Every little bit helps.",
            "definition": "Prov. Even the smallest amount is helpful.  Tom: I can only give a dollar to your charity. Mary: That’s OK. Every little bit helps.  Jane gave me a pair of booties for my new baby. It’s not much, but every little bit helps."
        },
        {
            "id": 2,
            "phrase": "every living soul",
            "definition": "every person.  I expect every living soul to be there and be there on time.  This is the kind of problem that affects every living soul."
        },
        {
            "id": 3,
            "phrase": "Every man has his price.",
            "definition": "Prov. It is possible to bribe anyone as long as you know how much or what to bribe him or her with.  Henchman: I’ve offered the judge half a million dollars to give you a light sentence, but he says he can’t be bought. Gangster: Keep trying. Every man has his price.  Every man has his price, and the townsfolk were shocked to discover just how low their mayor’s price had been."
        },
        {
            "id": 4,
            "phrase": "Every man is the architect of his own fortune.",
            "definition": "Prov. Your own decisions and your own actions determine what your life will be like.  The teacher told us, “If you work hard, you can become whatever you want. Every man is the architect of his own fortune.” _ You shouldn’t blame other people for your problems. Every man is the architect of his own fortune."
        },
        {
            "id": 5,
            "phrase": "Every man to his taste.",
            "definition": "Prov. Everyone likes something different, and you should not condemn people because of what they like. (Can be used to remark that someone’s tastes are different from yours, as in the first example.) _ Jill: Why don’t you get some decent neckties, Fred? Fred: What do you mean, decent? My ties are perfectly fine! Jill: Oh, well. Every man to his taste.  Ellen: People who like cats are much more discerning than people who like dogs, don’t you think? Jane: Not necessarily. Everyone to his taste."
        },
        {
            "id": 6,
            "phrase": "every mother’s son (of them)",
            "definition": "every one of them.  The scout leader said that unless the scouts told him who had stolen the money, he would punish every mother’s son of them. When the football team won the championship, they were all crying, every mother’s son of them."
        },
        {
            "id": 7,
            "phrase": "every nook and cranny",
            "definition": "every small, out-of-the-way place or places where something can be hidden.  We looked for the tickets in every nook and cranny. They were lost. There was no doubt. The decorator had placed flowers in every nook and cranny."
        },
        {
            "id": 8,
            "phrase": "every other person or thing",
            "definition": "every second or alternate person or thing. The magician turned every other card over.  Every other table had an ashtray on it."
        },
        {
            "id": 9,
            "phrase": "every time one turns around",
            "definition": "frequently; at every turn; with annoying frequency.  Somebody asks me for money every time I turn around.  Something goes wrong with Bill’s car every time he turns around."
        },
        {
            "id": 10,
            "phrase": "every walk of life",
            "definition": "every status and occupation.  We invited people from every walk of life, but only those who could afford the long drive could possibly come."
        },
        {
            "id": 11,
            "phrase": "ever(y) which way",
            "definition": "Rur. in all directions.  When they heard me yell, the kittens ran off every which way.  That mountain road kind of turns you ever which way before it finally gets you to the top."
        },
        {
            "id": 12,
            "phrase": "Everybody loves a lord.",
            "definition": "Prov. People are attracted to the wealthy and powerful. Although the prince was vulgar and unpleasant, he always received plenty of invitations to social gatherings; everybody loves a lord."
        },
        {
            "id": 13,
            "phrase": "everything an’ all",
            "definition": "Rur. everything.  The thieves broke into Mary’s house and took the television, the silver, her jewelry, everything an’ all.  I had to write a report about my trip to Memphis, what I did, what I ate, what I saw, and everything an’ all."
        },
        {
            "id": 14,
            "phrase": "everything but the kitchen sink",
            "definition": "Cliché almost everything one can think of.  When Sally went off to college, she took everything but the kitchen sink.  John orders everything but the kitchen sink when he goes out to dinner, especially if someone else is paying for it."
        },
        {
            "id": 15,
            "phrase": "everything humanly possible",
            "definition": "everything that is in the range of human powers.  The rescuers did everything humanly possible to find the lost campers.  The doctor tried everything humanly possible to save the patient."
        },
        {
            "id": 16,
            "phrase": "Everything’s coming up roses.",
            "definition": "Everything is really just excellent. Life is prosperous.  Life is wonderful. Everything is coming up roses.  Q: How are things going? A: Everything’s coming up roses."
        },
        {
            "id": 17,
            "phrase": "evict someone from some place",
            "definition": "to force someone to move out of something or some place. They evicted the squatters from the building. They were evicted from their home for not paying their mortgage."
        },
        {
            "id": 18,
            "phrase": "Evil be to him who evil thinks.",
            "definition": "Prov. May bad things happen to anyone who thinks evil things. (A curse against those who wish you harm. This is the English version of the French Honi soit qui mal y pense, the motto of the Most Noble Order of the Garter, a British order of knighthood.) _ The secret brotherhood took an oath of loyalty and finished their meeting by declaring, “Evil be to him who evil thinks.”"
        },
        {
            "id": 19,
            "phrase": "exact something from someone",
            "definition": "to demand something from someone; to take something from someone. The bill collector sought to exact payment from them for a debt that had been paid off long ago. You cannot exact a single cent from me."
        },
        {
            "id": 20,
            "phrase": "examine someone in something",
            "definition": "to give someone an examination in a particular subject or covering certain material.  The committee examined her in her knowledge of history.  I was examined in math."
        },
        {
            "id": 21,
            "phrase": "examine someone on something",
            "definition": "to give someone an examination covering certain material.  I will have to examine you on this chapter myself.  The teacher examined Larry on his understanding of phonetics."
        },
        {
            "id": 22,
            "phrase": "examine someone or something for something",
            "definition": "to inspect someone or something for the presence of something.  I examined the child for signs of abuse.  You had better examine this dog for ticks.  Don’t forget to examine yourself for ticks after you return from the hike."
        },
        {
            "id": 23,
            "phrase": "Example is better than precept.",
            "definition": "Prov. You will teach people more effectively by being a good example than you will by telling them what to do.  Mother never lectured us; she just tried her best to be a good person, and we tried hard to be like her. She was living proof that example is better than precept."
        },
        {
            "id": 24,
            "phrase": "exceed someone or something by something",
            "definition": "to surpass someone or something by some amount. Wally exceeded his quota by two hundred.  He exceeded Larry by a large amount."
        },
        {
            "id": 25,
            "phrase": "exceed someone or something in something",
            "definition": "to surpass someone or something in something.  Tom exceeds Walter in athletic ability.  Ralph exceeded the Rock of Gibraltar in hardheadedness."
        },
        {
            "id": 26,
            "phrase": "The exception proves the rule.",
            "definition": "Prov. Something that does not follow a rule shows that the rule exists. (Often used facetiously, to justify some rule you have proposed but which someone else has listed exceptions to. From a Latin phrase meaning that an exception tests a rule.) _ Ellen: Men are always rude. Jane: But Alan’s always polite. And Larry and Ted are polite, too. Ellen: They’re just the exceptions that prove the rule.  Bill: All the shows on TV are aimed at people with low intelligence. Alan: What about that news program you like to watch? Bill: The exception proves the rule."
        },
        {
            "id": 27,
            "phrase": "excerpt something from something",
            "definition": "to select a part of something from the whole.  We excerpted a few short scenes from the play and performed them for the class.  A few paragraphs had been excerpted from the film as an example."
        },
        {
            "id": 28,
            "phrase": "exchange something for something",
            "definition": "to trade something for something else.  I will exchange this one for a larger size.  Can this be exchanged for something more suitable?"
        },
        {
            "id": 29,
            "phrase": "exchange something with someone",
            "definition": "to trade something with someone. I exchange Christmas presents with him, but I never see him otherwise.  Let’s exchange coats with each other."
        },
        {
            "id": 30,
            "phrase": "excite someone about something",
            "definition": "to stimulate someone about something.  I thought our vacation stories would excite her about going, but they did not.  She was excited about the trip to Moscow."
        },
        {
            "id": 31,
            "phrase": "excite something in someone",
            "definition": "to arouse something in someone; to arouse someone with something.  The horror movie excited a lot of fear in Mike.  The smell of jasmine in the warm air excited a romantic streak in me."
        },
        {
            "id": 32,
            "phrase": "*exciting as watching (the) paint dry",
            "definition": "very, very dull. (Sarcastic. *Also: about as ~; as ~.) _ This book is about as exciting as watching paint dry.  Listening to you is exciting as watching the paint dry."
        },
        {
            "id": 33,
            "phrase": "exclude someone or something from something",
            "definition": "to leave someone or something out of something; to leave someone or something off a list.  Did you mean to exclude me from the party? _ I excluded chocolate cake from the shopping list."
        },
        {
            "id": 34,
            "phrase": "excuse someone",
            "definition": "1. to forgive someone. (Usually with me. Said when interrupting or when some other minor offense has been committed. There are many mannerly uses of this expression.) _John came in late and said, “Excuse me, please.” _ John said “excuse me” when he interrupted our conversation.  When John made a strange noise at the table, he said quietly, “Excuse me.” _John suddenly left the room saying, “Excuse me. I’ll be right back.” 2. to permit someone to leave; to permit someone to remain away from an event.  The coach excused John from practice yesterday.  The teacher excused John, and he ran quickly from the room."
        },
        {
            "id": 35,
            "phrase": "excuse someone for something",
            "definition": "to pardon someone for something or for (doing) something.  Please excuse me for this mess. I’ve not been able to clean the house. I can’t excuse myself for not doing it."
        },
        {
            "id": 36,
            "phrase": "excuse someone from something",
            "definition": "to permit a person not to do something; to exempt someone from something.  Please excuse me from attending the meeting.  I must excuse myself from the discussion."
        },
        {
            "id": 37,
            "phrase": "exemplify something by something",
            "definition": "to use something to explain or illustrate something.  He exemplifies wisdom by his decisions.  Roger exemplifies virtue by the way he treats his employees."
        },
        {
            "id": 38,
            "phrase": "exempt someone from something",
            "definition": "to release someone from the obligation to do something; to allow a person not to be affected by a rule or law. I cannot exempt anyone from this rule. The members of Congress exempted themselves from the wage freeze."
        },
        {
            "id": 39,
            "phrase": "exercise someone or an animal in something",
            "definition": "to give someone or an animal practice in doing something; to drill someone or an animal at something. Please exercise the dog in obedience routines.  I hope you will exercise me in my Spanish irregular verbs."
        },
        {
            "id": 40,
            "phrase": "exercised about something",
            "definition": "upset about something.  Mary: You lost a hundred dollars playing poker!? Bill: Now don’t get exercised about it.  I can’t tell Ma I’m failing English class. She gets exercised about every dumb thing I do."
        },
        {
            "id": 41,
            "phrase": "exhort someone to do something",
            "definition": "to urge or pressure someone to do something.  She exhorted us to do better, but we only did worse.  The boss exhorted the workers to increase productivity."
        },
        {
            "id": 42,
            "phrase": "exile someone (from something) (to something)",
            "definition": "to force someone to leave something or some place and go to something or some place, often as a punishment for political reasons. The government exiled him from his hometown to an island off the coast of South America.  They exiled Gerald to another country."
        },
        {
            "id": 43,
            "phrase": "exit (from something) (to something)",
            "definition": "to go out of something or some place to another. The children exited from the school to the parking lot when the fire alarm rang. We exited to the main street from the parking lot."
        },
        {
            "id": 44,
            "phrase": "expand into something",
            "definition": "to grow into something; to enlarge into something.  The little problem expanded into a big one in no time at all.  In no time at all, the vegetable garden had expanded into a small farm."
        },
        {
            "id": 45,
            "phrase": "expand one’s horizons",
            "definition": "to experience and learn new things. Read more! Travel! Go out and expand your horizons!"
        },
        {
            "id": 46,
            "phrase": "expand something into something",
            "definition": "to enlarge something into something; to make something grow into something.  She expanded her business into a national company.  I would like to build on an addition to expand this room into a more usable space."
        },
        {
            "id": 47,
            "phrase": "expatiate on someone or something",
            "definition": "to say or write many words about someone or something.  She expatiated endlessly on the evils of tobacco.  I have heard you expatiate on Harry quite enough, thank you."
        },
        {
            "id": 48,
            "phrase": "expect someone or something for something",
            "definition": "to anticipate someone or a group to attend something.  I expect you for dinner on Thursday.  We expected all of the board of directors for the meeting."
        },
        {
            "id": 49,
            "phrase": "expectant mother",
            "definition": "a pregnant woman.  The doctor’s waiting room was filled with expectant mothers.  The magazine has articles of interest to young parents and expectant mothers."
        },
        {
            "id": 50,
            "phrase": "expel someone from something",
            "definition": "to force someone to leave something or some place; to eject someone from something or some place.  The two men expelled the fighters from the tavern.  Ken was expelled from school for disciplinary reasons."
        },
        {
            "id": 51,
            "phrase": "expel something from something",
            "definition": "to force or eject something out of something.  The machine expelled cup after cup from its opening.  The volcano expelled huge globs of molten lava."
        },
        {
            "id": 52,
            "phrase": "expend something for something",
            "definition": "to pay a certain amount for something. I expended an enormous amount for skin creams. How much money did you expend for this gaudy tie?"
        },
        {
            "id": 53,
            "phrase": "expend something in something",
            "definition": "to use or consume something in some activity.  You expend too much energy in talking.  Harry expended a lot of time in the preparation of his speech."
        },
        {
            "id": 54,
            "phrase": "expend something on someone or something",
            "definition": "to use something on someone or something. Don’t expend too much energy on him. He isn’t worth it.  There is no point in expending any more money on this car."
        },
        {
            "id": 55,
            "phrase": "Experience is the best teacher.",
            "definition": "Prov. You will learn more from things that happen to you in real life than you will from hearing about or studying things that happen to other people. I don’t care how many books you read about how to run a business; experience is the best teacher. The nurse believed that experience was the best teacher when it came to developing a bedside manner, so she made sure that all her students spent a lot of time with patients."
        },
        {
            "id": 56,
            "phrase": "Experience is the teacher of fools.",
            "definition": "Prov. Only fools do not learn after seeing other people’s mistakes and insist on repeating them.  Father: You should spend more time studying and less time having fun with your friends. If I had been a better student when I was your age, I’d have a better job now. Son: Oh, come on, Dad. School’s worthless. Father: Don’t make the same mistake I did! Experience is the teacher of fools."
        },
        {
            "id": 57,
            "phrase": "experiment in something",
            "definition": "to conduct research or experiments about something.  The research group is experimenting in the field of biomechanics. We want to experiment in thermodynamics."
        },
        {
            "id": 58,
            "phrase": "experiment (up)on someone or something",
            "definition": "to use someone or something as the subject of an experiment. (Upon is formal and less commonly used than on.) _ Do you think we should experiment upon people? _ The researchers were experimenting on a new drug that might cure rabies."
        },
        {
            "id": 59,
            "phrase": "experiment with someone or something",
            "definition": "to try different experiments on someone or something; to use different people or things as key variables in an experiment. They are supposed to be experimenting with new drugs.  We no longer experiment with animals."
        },
        {
            "id": 60,
            "phrase": "explain oneself",
            "definition": "1. to explain what one has said or done or what one thinks or feels. (Formal and polite.) _ Please take a moment to explain yourself. I’m sure we are interested in your ideas.  Yes, if you will let me explain myself, I think you’ll agree with my idea. 2. to give an explanation or excuse for something wrong that one may have done. (Usually said in anger.) _ Young man! Come in here and explain yourself this instant.  Why did you do that, Tom Smith? You had better explain yourself, and it had better be good."
        },
        {
            "id": 61,
            "phrase": "explain someone or something to someone",
            "definition": "to give information or instruction about someone or something to someone.  Please explain it to me.  Can you explain Andrew to me?"
        },
        {
            "id": 62,
            "phrase": "explain something away†",
            "definition": "to explain something so that it is no longer a problem.  You can try to explain it away if you want, but that won’t solve the problem. You can’t just explain away all your problems."
        },
        {
            "id": 63,
            "phrase": "explode with something",
            "definition": "to make a loud noise upon exploding or releasing energy.  The bomb exploded with a thunderous roar. When the joke was finished, the audience exploded with laughter."
        },
        {
            "id": 64,
            "phrase": "export something to some place",
            "definition": "to sell something abroad to a particular country.  They are now exporting their products to Hungary.  We are exporting all our product line to Eastern Europe."
        },
        {
            "id": 65,
            "phrase": "export something to someone or something",
            "definition": "to sell something abroad to someone or some country.  The company exported alcohol to Brazil.  We only export books to our agents abroad."
        },
        {
            "id": 66,
            "phrase": "expose someone or an animal to a disease",
            "definition": "to place someone or an animal near a source of a disease. Try to expose your children to chicken pox while they are young. It’s horrible when you are an adult.  He accidentally exposed his sheep to an infected animal."
        },
        {
            "id": 67,
            "phrase": "expose someone or something to someone or something",
            "definition": "to show someone or something to someone or something.  You should not expose the children to violent movies at their age.  Do not expose the film to the light."
        },
        {
            "id": 68,
            "phrase": "expose something or oneself to someone or something",
            "definition": "to disclose someone’s or something’s secrets to someone or a group.  He exposed his inner thoughts to everyone there. She refused to expose herself to the ears of the curious and ceased talking.  He exposed himself to the public when he revealed his involvement in the arms sale."
        },
        {
            "id": 69,
            "phrase": "expound ((up)on someone or something) (to someone)",
            "definition": "to speak at length about someone or something to someone. (Upon is formal and less commonly used than on.) _ Let me expound upon Tom to you for a while. I think you need all the details on his qualifications. Please do not expound on Bill anymore."
        },
        {
            "id": 70,
            "phrase": "express one’s anger",
            "definition": "to allow a release or expression of anger, such as through angry words, violence, or talking out a problem.  Don’t keep your emotions inside of you. You have to learn to express your anger.  Bob expresses his anger by yelling at people."
        },
        {
            "id": 71,
            "phrase": "express oneself (to someone) (on something)",
            "definition": "to say what one thinks about something.  I will express myself to Karen on that matter at another time. She expressed herself on Karen to the entire group."
        },
        {
            "id": 72,
            "phrase": "expropriate something (from someone or something) (for someone or something)",
            "definition": "to seize something from someone or something for someone or something.  The government expropriated the land from the peasants for an airfield.  They expropriated land for a highway.  They expropriated land from the farmers."
        },
        {
            "id": 73,
            "phrase": "expunge something from something",
            "definition": "to erase something from something. The judge ordered the clerk to expunge the comment from the record. Please expunge the lawyer’s remark from the transcript."
        },
        {
            "id": 74,
            "phrase": "expurgate something from something",
            "definition": "to cleanse something by removing something. (Often refers to editing objectionable material from written or broadcast material.) _ They expurgated the most graphic passages from the novel.  We will expurgate the offensive matter from the article."
        },
        {
            "id": 75,
            "phrase": "extend across something",
            "definition": "to spread across something.  The shadows extended across the whole land.  The fog extended across the low-lying land."
        },
        {
            "id": 76,
            "phrase": "extend (from something) (to something)",
            "definition": "to spread from one point to another point. The cloud of smoke extended from one end of town to the other.  It extended to the end of the road from our front gate."
        },
        {
            "id": 77,
            "phrase": "extend one’s sympathy (to someone)",
            "definition": "to express sympathy to someone. (A very polite and formal way to tell someone that you are sorry about a misfortune.) _Please permit me to extend my sympathy to you and your children. I’m very sorry to hear of the death of your husband. Let’s extend our sympathy to Bill Jones, who is in the hospital with a broken leg. We should send him some flowers."
        },
        {
            "id": 78,
            "phrase": "extend over someone or something",
            "definition": "to spread over someone or something.  The smoke extended over Tom and his friends, who were having a picnic. The cloud extended over the entire valley."
        },
        {
            "id": 79,
            "phrase": "extend something to something",
            "definition": "1. to lengthen something to reach something. We extended the antenna to its full length. Extend your arm to the wall and see how straight you can make it. 2. to push a stated deadline further into the future.  I will extend the deadline to Friday.  We cannot extend the due date to next month."
        },
        {
            "id": 80,
            "phrase": "extend to someone or something",
            "definition": "to reach all the way to someone or something.  This policy extends to you also.  The road extends to Los Angeles."
        },
        {
            "id": 81,
            "phrase": "extenuating circumstances",
            "definition": "special (but otherwise unspecified) circumstances that account for an irregular or improper way of doing something.  Mary was permitted to arrive late because of extenuating circumstances.  Due to extenuating circumstances, the teacher will not meet with the class today."
        },
        {
            "id": 82,
            "phrase": "extol someone or something as something",
            "definition": "to praise someone or something as something.  We extolled her as a heroine.  The salesman extolled the medicine as a cure-all."
        },
        {
            "id": 83,
            "phrase": "extort something from someone or something",
            "definition": "to steal something from someone by coercion; to force someone to give something by making threats.  The crook was trying to extort a lot of money from the widow by selling her a worthless insurance policy. The authorities caught the accounting firm trying to extort a great deal of money from the bank."
        },
        {
            "id": 84,
            "phrase": "extract something from someone or something",
            "definition": "to remove something from someone or something; to make someone or a group give something.  We extracted the juice from the oranges.  The police questioning Maggie extracted the truth from her."
        },
        {
            "id": 85,
            "phrase": "extradite someone from some place (to some place)",
            "definition": "to have someone sent from some place to face criminal prosecution.  The state’s attorney sought to extradite Max from Missouri.  The gang leader was extradited from Indiana to New York to face assault charges."
        },
        {
            "id": 86,
            "phrase": "extrapolate something from something",
            "definition": "to reason out the answer from the known facts. I cannot extrapolate what he meant from these notes.  Can you extrapolate the annual total from the company’s sales so far this year?"
        },
        {
            "id": 87,
            "phrase": "extricate someone or something from someone or something",
            "definition": "to disentangle someone or something from someone or something; to free someone or something from someone or something.  I tried to extricate myself from her, but she made it hard for me to get away politely.  I managed to extricate the ring from the vacuum cleaner bag."
        },
        {
            "id": 88,
            "phrase": "exult in something",
            "definition": "to take great pleasure in something; to enjoy something immensely.  I exult in the beauty of a spring day.  We exulted in the glory of summer."
        },
        {
            "id": 89,
            "phrase": "An eye for an eye (and a tooth for a tooth).",
            "definition": "Prov. If someone hurts you, you should punish the offender by hurting him or her in the same way. (An ancient principle of justice going back to biblical times.) _ When they were children, the two brothers operated on the principle of an eye for an eye, so that if the older one hit the younger one, the younger one was entitled to hit him back just as hard."
        },
        {
            "id": 90,
            "phrase": "eyeball-to-eyeball",
            "definition": "face-to-face and often very close; in person. They approached each other eyeball-to-eyeball and frowned.  Let’s talk more when we are eyeball-toeyeball."
        },
        {
            "id": 91,
            "phrase": "*an eyeful (of someone or something)",
            "definition": "a shocking or surprising sight. (*Typically: get ~; have ~; give someone ~.) _ The office door opened for a minute and I got an eyeful of the interior.  Mary got an eyeful of the company’s extravagant spending when she saw the bill for the executive board’s catered lunch."
        },
        {
            "id": 92,
            "phrase": "eyes like saucers",
            "definition": "eyes opened widely as in amazement. Our eyes were like saucers as we witnessed another display of the manager’s temper."
        },
        {
            "id": 93,
            "phrase": "eyes like two burnt holes in a blanket",
            "definition": "Rur. eyes with dark circles around them.  I can tell you ain’t slept. You got eyes like two burnt holes in a blanket."
        },
        {
            "id": 94,
            "phrase": "face away (from someone or something)",
            "definition": "to turn away from someone or something. Please face away from me while I change clothes.  I’ll face away. You go right ahead."
        },
        {
            "id": 95,
            "phrase": "face off",
            "definition": "1. to begin a hockey game with two players facing one another.  They faced off and the match was on. 2. to prepare for a confrontation.  The opposing candidates faced off and the debate began.  They faced off and I knew there was going to be a fight."
        },
        {
            "id": 96,
            "phrase": "face on(to) something",
            "definition": "[for something] to have a view out onto something.  The house faced onto the sea and provided a beautiful view of the incoming ships.  Our office building does not face onto the street. We asked for a room that faces on the main square."
        },
        {
            "id": 97,
            "phrase": "face someone down†",
            "definition": "to make a face-to-face stand with someone who eventually backs down. Chuck succeeded in facing Tom down.  Facing down Tom wasn’t difficult for Chuck."
        },
        {
            "id": 98,
            "phrase": "face someone or something forward",
            "definition": "to turn someone or something to the front. (Also with many other directions— backward, to the right, to the left, etc.) _Please face your brother forward now.  Face the book forward so we can read the title."
        },
        {
            "id": 99,
            "phrase": "face (someone or something) into something",
            "definition": "to turn (the face or front of ) someone or something directly toward something.  Face the sail into the wind.  Please face into the camera."
        },
        {
            "id": 100,
            "phrase": "face someone with something",
            "definition": "to present evidence of something to someone.  When I faced him with the evidence, he confessed immediately. The police faced Max with the witness’s story.  The CEO was faced with the problem of bringing the bankrupt firm back to profitability."
        },
        {
            "id": 101,
            "phrase": "face something down",
            "definition": "to turn something face downward.  Ted drew a card and faced it down.  Face your cards down when you leave the card table."
        },
        {
            "id": 102,
            "phrase": "face something head-on",
            "definition": "to confront a problem directly and openly. Let’s face this problem head-on and try to solve it quickly and painlessly."
        },
        {
            "id": 103,
            "phrase": "face something with something",
            "definition": "to install something on the surface of something.  We faced the kitchen walls with yellow tile.  The wall was faced with tile."
        },
        {
            "id": 104,
            "phrase": "face (the) facts",
            "definition": "to confront the truth about someone or something; to confront and accept the consequences of something.  Eventually, you will have to face the facts. Times are hard."
        },
        {
            "id": 105,
            "phrase": "face the music",
            "definition": "to receive punishment; to accept the unpleasant results of one’s actions.  Mary broke a dining- room window and had to face the music when her father got home.  After failing a math test, Tom had to go home and face the music."
        },
        {
            "id": 106,
            "phrase": "face up (to someone or something)",
            "definition": "to confront with courage someone or something representing a threat or unpleasantness.  You are simply going to have to admit your mistake and face up to the boss. You must face up to the authorities if you have done something wrong."
        },
        {
            "id": 107,
            "phrase": "face-to-face",
            "definition": "1. Fig. in person; in the same location. (Said only of people. An adverb.) _Let’s talk about this face-toface. I don’t like talking over the telephone.  Many people prefer to talk face-to-face. 2. Fig. facing one another; in the same location. (Used as an attributive.) _ I prefer to have a face-to-face meeting. They work better on a face-to-face basis."
        },
        {
            "id": 108,
            "phrase": "the facts of life",
            "definition": "1. Euph. the facts of sex and reproduction, especially human reproduction. My parents told me the facts of life when I was nine years old.  Bill learned the facts of life from his classmates. 2. Fig. the truth about the unpleasant ways that the world works.  Mary really learned the facts of life when she got her first job.  Tom couldn’t accept the facts of life in business, so he quit."
        },
        {
            "id": 109,
            "phrase": "fade away (into something)",
            "definition": "to diminish into something.  The light faded away into nothing.  The sound of the drums faded away into the distance. "
        },
        {
            "id": 110,
            "phrase": "fade back (into something)",
            "definition": "to move back into a particular area.  He faded back to throw a pass.  Quickly and unnoticed, he faded back."
        },
        {
            "id": 111,
            "phrase": "fade down",
            "definition": "[for sound] to diminish.  The roar of the train faded down as it passed and f led into the night.  As the thunder faded down, the sun began to break through the clouds."
        },
        {
            "id": 112,
            "phrase": "fade from something",
            "definition": "[for something] to leave something gradually, such as one’s consciousness, memory, view, etc.  The image faded from her memory at last."
        },
        {
            "id": 113,
            "phrase": "fade from view",
            "definition": "[for a sight] to fade away, typically owing to loss of light or distance.  The scene faded from view as the stage lights dimmed. My house faded from view as we drove down the long road to town."
        },
        {
            "id": 114,
            "phrase": "fade into something",
            "definition": "to diminish or change into something. The light of dusk faded into blackness. In the corner of the painting, the deep reds faded into lavender."
        },
        {
            "id": 115,
            "phrase": "fade something down†",
            "definition": "to turn down a sound. (Broadcasting.) _ The radio engineer faded the music down and the announcer’s voice began.  She faded down the music."
        },
        {
            "id": 116,
            "phrase": "fade something in†",
            "definition": "to bring a picture, sound, or both into prominence. (Broadcasting.) _ The technician faded the picture in and the program began.  Fade in the picture a little faster next time."
        },
        {
            "id": 117,
            "phrase": "fade something out†",
            "definition": "to diminish something altogether. (Broadcasting.) _ At the end, you should fade the music out completely.  Fade out the music earlier."
        },
        {
            "id": 118,
            "phrase": "fade something up†",
            "definition": "to increase the sound gradually. (Broadcasting.) _The director faded the music up and then down again before the announcer spoke.  Fade up the music when the announcer stops talking."
        },
        {
            "id": 119,
            "phrase": "fag someone out",
            "definition": "Sl. to tire someone out.  All that work really fagged me out.  The hard climb fagged the hikers out."
        },
        {
            "id": 120,
            "phrase": "fagged out",
            "definition": "Sl. exhausted.  I’m really fagged out after all that running.  John, you sure look fagged out."
        },
        {
            "id": 121,
            "phrase": "fail in something",
            "definition": "to have not earned passing or satisfactory grades in some school subject. George is failing in geometry.  I hope I do not fail in math."
        },
        {
            "id": 122,
            "phrase": "fail someone on something",
            "definition": "to give someone an unsatisfactory grade on an assignment or test.  She failed us all on the math assignment. The teacher failed half the class on the assignment."
        },
        {
            "id": 123,
            "phrase": "faint dead away",
            "definition": "to faint and fall unconscious.  I almost fainted dead away.  David will faint dead away when he reads this."
        },
        {
            "id": 124,
            "phrase": "faint from something",
            "definition": "to faint because of something.  I nearly fainted from fear! _ Three people along the parade route fainted from the heat."
        },
        {
            "id": 125,
            "phrase": "Faint heart never won fair lady.",
            "definition": "Prov. A timid suitor never won his lady. (Used to encourage boys or men to be bold in courting women.) _ Bill: I’d really like to go out with Alice, but what if she says no? Alan: You won’t know till you ask her. Faint heart never won fair lady. Don’t be so shy about talking to Edith. Faint heart never won fair lady."
        },
        {
            "id": 126,
            "phrase": "the faint of heart",
            "definition": "people who are squeamish; someone who is sickened or disturbed by unpleasantness or challenge.  The pathway around the top of the volcano, near the crater, is not for the faint of heart."
        },
        {
            "id": 127,
            "phrase": "fair and impartial",
            "definition": "just and unbiased. (Usually referring to some aspect of the legal system, such as a jury, a hearing, or a judge.) _ Gary felt that he had not received a fair and impartial hearing. We demand that all of our judges be fair and impartial in every instance."
        },
        {
            "id": 128,
            "phrase": "fair and square",
            "definition": "completely fair(ly); justly; within the rules. She won the game fair and square. The division of the money should be fair and square."
        },
        {
            "id": 129,
            "phrase": "fair game (for something)",
            "definition": "someone or something that it is considered permissible to attack or abuse in some way.  I don’t like seeing articles exposing people’s private lives, but politicians are fair game for that kind of criticism.  Journalists always regard movie stars as fair game."
        },
        {
            "id": 130,
            "phrase": "*a fair shake",
            "definition": "an instance of fair treatment. (*Typically: get ~; have ~; give someone ~.) _ He’s unpleasant, but we have to give him a fair shake.  He got a fair shake from us. Don’t worry!"
        },
        {
            "id": 131,
            "phrase": "fair something out†",
            "definition": "Rur. to distribute something fairly.  She faired the meager stew out the best she could. Walter faired out the pie."
        },
        {
            "id": 132,
            "phrase": "fair to middlin’",
            "definition": "Rur. mediocre; not bad but not good. (Middling means ‘of average quality.’) _ Tom: How are you feeling today? Bill: Fair to middlin’.  My sewing is excellent, but my cooking is only fair to middlin’."
        },
        {
            "id": 133,
            "phrase": "fair-haired boy",
            "definition": "a favored person. (Not necessarily young or a boy.) _ The teacher’s fair-haired boy always does well on tests. The supervisor’s son was the fair-haired boy on the construction site."
        },
        {
            "id": 134,
            "phrase": "fair-weather friend",
            "definition": "someone who is your friend only when things are pleasant or going well for you. Bill stayed for lunch but he wouldn’t help me with the yard work. He’s just a fair-weather friend. A fair-weather friend isn’t much help in an emergency."
        },
        {
            "id": 135,
            "phrase": "Faith will move mountains.",
            "definition": "Prov. If you believe in what you are doing, you can overcome any obstacle. (Sometimes refers to faith in God.) _ Jane’s faith in her cause could move mountains. You may feel disheartened sometimes, but remember that faith will move mountains."
        },
        {
            "id": 136,
            "phrase": "fake it",
            "definition": "to pretend (to do something).  If you don’t know the right notes, just fake it.  I can’t fake it anymore. I’ve got to be honest with you."
        },
        {
            "id": 137,
            "phrase": "fake off",
            "definition": "Sl. to waste time; to goof off.  Hey, you guys, quit faking off! _ All you clowns do is fake off. Now, get busy!"
        },
        {
            "id": 138,
            "phrase": "fake someone out†",
            "definition": "to deceive someone; to fool someone. You really faked me out. I never would have guessed it was you.  The student tried to fake out the teacher."
        },
        {
            "id": 139,
            "phrase": "fake someone out of something",
            "definition": "Sl. to get something from someone by deception.  He faked Tom out of his place in line.  She faked me out of a lot of money."
        },
        {
            "id": 140,
            "phrase": "fall (all) over oneself (to do something)",
            "definition": "to rush eagerly and awkwardly to do something.  The boys fell all over themselves to open the door for Sarah. Larry fell over himself trying to help Sarah on with her coat."
        },
        {
            "id": 141,
            "phrase": "fall all over someone",
            "definition": "to give a lot of attention, affection, or praise to someone.  My aunt falls all over me whenever she comes to visit.  I hate for someone to fall all over me. It embarrasses me."
        },
        {
            "id": 142,
            "phrase": "fall asleep",
            "definition": "to go to sleep.  I fell asleep while reading the very dull book.  I got in bed and fell asleep at once."
        },
        {
            "id": 143,
            "phrase": "fall away (from someone or something)",
            "definition": "[for something] to drop away from someone or something.  The paint is falling away from the sides of the house.  Over the years, all the paint fell away."
        },
        {
            "id": 144,
            "phrase": "fall away toward something",
            "definition": "to slant downward toward something.  The yard fell away toward the shore of the lake. The broad expanse of prairie land fell away toward the river bottomland, and beyond that, the river itself."
        },
        {
            "id": 145,
            "phrase": "fall back",
            "definition": "to move back from something; to retreat from something.  The gang members fell back, and I took that opportunity to get away.  The troops fell back to regroup."
        },
        {
            "id": 146,
            "phrase": "fall back on(to) someone or something",
            "definition": "to fall backwards onto someone or something.  She stumbled and fell back onto the lady behind her.  She fell back on the couch."
        },
        {
            "id": 147,
            "phrase": "fall behind (someone or something)",
            "definition": "to lag behind someone or something.  You have fallen behind everyone else in class. Our production fell behind that of the other production line."
        },
        {
            "id": 148,
            "phrase": "fall below something",
            "definition": "to drop to a lower level than something.  The temperature has fallen below freezing again.  When the audience fell below two hundred a night, they closed the play."
        },
        {
            "id": 149,
            "phrase": "fall beneath something",
            "definition": "to drop under something.  The thimble fell beneath the sofa.  The gift that Bob had purchased for Maggie fell beneath the wheels of a truck."
        },
        {
            "id": 150,
            "phrase": "fall between something and something else",
            "definition": "to drop between things.  My loose change fell between the cushions of the sofa. I hope that my wallet doesn’t fall between the table and the wall. I would never be able to move the table to get it."
        },
        {
            "id": 151,
            "phrase": "fall between two stools",
            "definition": "to come somewhere between two possibilities and so fail to meet the requirements of either.  The material is not suitable for an academic book or for a popular one. It falls between two stools.  He tries to be both teacher and friend, but falls between two stools."
        },
        {
            "id": 152,
            "phrase": "fall by some amount",
            "definition": "[for an asset] to drop in value by a certain amount.  The gas stocks fell by nearly 10 percent today.  If the stock market falls by four hundred points, I’m going to jump off a cliff."
        },
        {
            "id": 153,
            "phrase": "fall down",
            "definition": "to drop or topple. The baby fell down. Walk carefully on this ice or you will fall down."
        },
        {
            "id": 154,
            "phrase": "fall (down) at something",
            "definition": "to prostrate oneself before or at the feet of someone or something.  She fell down at the feet of the horrid man who held her child.  She fell at his feet."
        },
        {
            "id": 155,
            "phrase": "fall down on someone or something",
            "definition": "to fall and drop onto someone or something. Bits of the ceiling paint fell down on us and into our food. The leaves fell down on the lawn."
        },
        {
            "id": 156,
            "phrase": "fall down on the job",
            "definition": "to fail to do something properly; to fail to do one’s job adequately.  The team kept losing because the coach was falling down on the job. Tom was fired because he fell down on the job."
        },
        {
            "id": 157,
            "phrase": "fall (flat) on one’s face",
            "definition": "to fall down, face first.  Bobby fell f lat on his face and skinned his nose. Down he went—he fell on his face."
        },
        {
            "id": 158,
            "phrase": "fall for someone",
            "definition": "to fall in love with someone.  I fell for her in a big way. She’s gorgeous! _ Ted fell for Alice and they decided to get married."
        },
        {
            "id": 159,
            "phrase": "fall for something",
            "definition": "to believe something without reservation. Surely, you don’t expect me to fall for that! _She fell for the excuse I gave her about getting stuck in traffic."
        },
        {
            "id": 160,
            "phrase": "fall from grace",
            "definition": "to sin and get on the wrong side of God. (A Christian concept.) _ It was either fall from grace or starve from lack of money. That’s how thieves are made.  Given the choice between falling from grace and starving, few people choose to starve."
        },
        {
            "id": 161,
            "phrase": "fall from power",
            "definition": "to go out of power; to go out of office.  The dictator fell from power after the riots.  Every ruler will fall from power sooner or later."
        },
        {
            "id": 162,
            "phrase": "fall from someone or something",
            "definition": "to fall off of someone or something. The books fell from the top shelf in the earthquake. The eggs rolled and fell from the counter and broke on the f loor."
        },
        {
            "id": 163,
            "phrase": "fall head over heels",
            "definition": "to fall down, perhaps turning over or rolling. Fred tripped on the rug and fell head over heels into the center of the room.  Slow down or you will fall down—head over heels."
        },
        {
            "id": 164,
            "phrase": "fall head over heels in love (with someone)",
            "definition": "to fall deeply in love with someone, especially suddenly. Roger fell head over heels in love with Maggie, and they were married within the month. Very few people actually fall head over heels in love with each other. She fell head over heels in love and thought she was dreaming."
        },
        {
            "id": 165,
            "phrase": "fall heir to something",
            "definition": "to inherit something; to end up with certain possessions of someone who has died.  I fell heir to all my grandmother’s old photographs."
        },
        {
            "id": 166,
            "phrase": "fall ill",
            "definition": "to become ill.  Tom fell ill just before he was to perform.  We both fell ill after eating the baked fish."
        },
        {
            "id": 167,
            "phrase": "fall in",
            "definition": "to line up in a row, standing shoulder to shoulder.  The Boy Scouts were told to fall in behind the leader.  The soldiers fell in quickly."
        },
        {
            "id": 168,
            "phrase": "fall in love (with each other)",
            "definition": "[for two people] to become enamored of each other. They met in school and fell in love.  When they fell in love, they thought it would last forever."
        },
        {
            "id": 169,
            "phrase": "fall in love (with someone)",
            "definition": "to develop the emotion of love for someone.  Tom fell in love with Mary, but she only wanted to be friends.  John is too young to really fall in love."
        },
        {
            "id": 170,
            "phrase": "fall in love (with something)",
            "definition": "to become enamored of something.  I simply fell in love with the dress. I had to have it. I fell in love with the red car and bought it at once."
        },
        {
            "id": 171,
            "phrase": "fall in on someone or something",
            "definition": "to cave in on someone or something; to collapse on someone or something.  The roof of the mine fell in on the workers.  The ceiling fell in on the diners."
        },
        {
            "id": 172,
            "phrase": "fall in with someone or something",
            "definition": "to become involved with someone or a group.  I’m afraid that he fell in with the wrong kind of friends.  John fell in with Max, who had served time in prison."
        },
        {
            "id": 173,
            "phrase": "fall in with something",
            "definition": "to concur with something; to harmonize with something.  We had to fall in with her wishes.  The statement falls in exactly with my view."
        },
        {
            "id": 174,
            "phrase": "fall into decay",
            "definition": "to degenerate; to rot. The house was very old and had fallen into decay.  The small town fell into decay, and people moved out."
        },
        {
            "id": 175,
            "phrase": "fall into disfavor",
            "definition": "to lose one’s influence; to be preferred less and less.  This style of government fell into disfavor some years ago.  Poor Lee fell into disfavor with the boss and lost all his special privileges."
        },
        {
            "id": 176,
            "phrase": "fall into disgrace",
            "definition": "to become without honor.  The mayor fell into disgrace because of his financial dealings. We fell into disgrace because of our criminal affiliations."
        },
        {
            "id": 177,
            "phrase": "fall into disuse",
            "definition": "to be used less and less. The pump had fallen into disuse and the joints had rusted solid.  Since my books had fallen into disuse, I sold them to a used-book dealer."
        },
        {
            "id": 178,
            "phrase": "fall in(to) line",
            "definition": "to line up so that each person (except the first person) stands behind someone.  The teacher told the students to fall in line for lunch.  Hungry students fall into line very quickly."
        },
        {
            "id": 179,
            "phrase": "fall into one’s lap",
            "definition": "[for something of great value or usefulness] to be given or granted to someone without having been requested.  Some valuable antique jewelry just fell into his lap. His late mother had kept it hidden for years."
        },
        {
            "id": 180,
            "phrase": "fall in(to) place",
            "definition": "to fit together; to become organized; to make sense. After we heard the whole story, things began to fall in place.  When you get older, the different parts of your life begin to fall into place."
        },
        {
            "id": 181,
            "phrase": "fall in(to something)",
            "definition": "to drop into something.  The rabbit fell into the hole and was trapped.  It went right up to the hole and fell in."
        },
        {
            "id": 182,
            "phrase": "fall in(to step)",
            "definition": "to get into the same marching pattern as everyone else as regards which foot moves forward. (Everyone should be moving the same foot forward at the same time.) _ I just can’t seem to fall into step. I am very uncoordinated.  Fall in! March with the others!"
        },
        {
            "id": 183,
            "phrase": "fall into the wrong hands",
            "definition": "to become associated with the wrong person; to become the possession of the wrong person.  I don’t want these plans to fall into the wrong hands.  This could be dangerous if it fell into the wrong hands."
        },
        {
            "id": 184,
            "phrase": "fall off",
            "definition": "to decline or diminish.  Business falls off during the summer months. My interest in school fell off when I became twenty."
        },
        {
            "id": 185,
            "phrase": "fall on deaf ears",
            "definition": "[for talk or ideas] to be ignored by the persons they were intended for.  Her pleas for mercy fell on deaf ears; the judge gave her the maximum sentence.  All of Sally’s good advice fell on deaf ears. Walter had made up his own mind."
        },
        {
            "id": 186,
            "phrase": "fall on hard times",
            "definition": "to experience difficult times, especially financially. Since the war, her family had fallen on hard times. We fell on hard times during the recession."
        },
        {
            "id": 187,
            "phrase": "fall on one’s sword",
            "definition": "to fall down and be penetrated by one’s own sword, accidentally or on purpose.  He tripped and fell on his sword."
        },
        {
            "id": 188,
            "phrase": "fall on(to) someone or something",
            "definition": "to collapse toward or onto someone or something. The fence fell onto the car, denting it severely.  The branch fell on David."
        },
        {
            "id": 189,
            "phrase": "fall out",
            "definition": "1. to happen; to result. As things fell out, we had a wonderful trip.  What fell out of our discussion was a decision to continue. 2. to leave one’s place in a formation when dismissed. (Usually in scouting or the military. The opposite of fall in.) _ The scouts fell out and ran to the campfire. All the soldiers fell out and talked among themselves. 3. to depart. It’s late, George. I have to fall out.  Let’s fall out. I have to get up early in the morning."
        },
        {
            "id": 190,
            "phrase": "fall out of bed",
            "definition": "to roll out of one’s bed onto the floor.  I fell out of bed and broke my arm.  Billy fell out of bed and started to cry."
        },
        {
            "id": 191,
            "phrase": "fall out of love (with someone)",
            "definition": "to stop being in love with someone. She claimed she had fallen out of love with him.  He also had fallen out of love."
        },
        {
            "id": 192,
            "phrase": "fall out (of something)",
            "definition": "to topple out of something. Mary fell out of the tree and hurt herself."
        },
        {
            "id": 193,
            "phrase": "fall outside something",
            "definition": "to be beyond someone’s power, responsibility, or jurisdiction.  This matter falls outside my bailiwick.  Her offense fell outside of the manager’s jurisdiction."
        },
        {
            "id": 194,
            "phrase": "fall over",
            "definition": "to topple over and fall down. The fence fell over and dented the car.  I felt faint and almost fell over."
        },
        {
            "id": 195,
            "phrase": "fall over someone or something",
            "definition": "to stumble over someone or something.  Sam came into the house and fell over a kitchen chair. Walter fell over Roger, who was napping on the f loor."
        },
        {
            "id": 196,
            "phrase": "fall overboard",
            "definition": "to fall from a boat or a ship into the water.  Someone fell overboard and they had to stop the boat and go back.  The lady’s sunglasses fell overboard."
        },
        {
            "id": 197,
            "phrase": "fall short",
            "definition": "to lack something; to lack enough of something, such as money, time, etc.  We fell short of money at the end of the month.  Tom fell short of cash and had to borrow from me."
        },
        {
            "id": 198,
            "phrase": "fall through",
            "definition": "[for something, such as plans] to fail. Our party for next Saturday fell through.  I hope our plans don’t fall through."
        },
        {
            "id": 199,
            "phrase": "fall through something",
            "definition": "to fall and break through something.  One of the skaters fell through the thin ice.  A number of hailstones fell through the roof of the greenhouse."
        },
        {
            "id": 200,
            "phrase": "fall to",
            "definition": "to begin doing something; to prepare to do something and go to work on it. She asked for help, and everyone fell to.  Fall to, you guys!"
        },
        {
            "id": 201,
            "phrase": "fall to pieces",
            "definition": "to break into pieces. The road was so rough the car almost fell to pieces.  I was afraid that my bicycle would fall to pieces before I got there."
        },
        {
            "id": 202,
            "phrase": "fall to someone",
            "definition": "to become the responsibility of someone.  It always falls to me to apologize first.  Why does it fall to me to answer the telephone every time it rings?"
        },
        {
            "id": 203,
            "phrase": "fall toward something",
            "definition": "to drop or fall in the direction of something.  She fell toward the curb rather than toward the traffic.  The tree fell toward the garage rather than toward the house."
        },
        {
            "id": 204,
            "phrase": "fall under someone or something",
            "definition": "to drop down and end up beneath someone or something. The old man fell under the wheels of the truck, but he suffered only minor injuries. The child tripped and fell under Mrs. Rogers, who almost did not see her."
        },
        {
            "id": 205,
            "phrase": "fall under someone’s spell",
            "definition": "to come under the magical control of a magician or similar person. The damsel fell under the wizard’s spell and sat there speechless.  As the children fell under the witch’s spell, they went to sleep."
        },
        {
            "id": 206,
            "phrase": "fall (up)on someone",
            "definition": "[for a task] to become the duty of someone.  The task of telling Mother about the broken vase fell upon Jane.  The job of cleaning up the spill fell upon Tom."
        },
        {
            "id": 207,
            "phrase": "fall (up)on someone or something",
            "definition": "1. to collapse on top of someone or something. (Upon is formal and less commonly used than on.) _ The bridge fell upon a boat passing beneath it.  A small branch fell on Jerry as he passed beneath the tree. 2. to attack someone or something.  The cat fell upon the mouse and killed it. The children fell on the birthday cake and ate it all."
        },
        {
            "id": 208,
            "phrase": "fall within something",
            "definition": "to belong to a specific category or classification.  This falls within the realm of the medical profession. There’s no more I can do for you. Does this fall within your area of expertise?"
        },
        {
            "id": 209,
            "phrase": "falter in something",
            "definition": "to fail in doing something; to exhibit a lack of something, such as faith, loyalty, perseverance, etc.  He did not falter in his effort to see the project through to the end.  I promised not to falter in my loyalty."
        },
        {
            "id": 210,
            "phrase": "*familiar with someone or something",
            "definition": "to have a good knowledge of someone or something. (*Typically: be ~; become ~; get ~.) _ Are you familiar with changing a f lat tire? _ I can’t speak German fluently, but I’m somewhat familiar with the language."
        },
        {
            "id": 211,
            "phrase": "Familiarity breeds contempt.",
            "definition": "Prov. People do not respect someone they know well enough to know his or her faults.  The movie star doesn’t let anyone get to know him, because he knows that familiarity breeds contempt."
        },
        {
            "id": 212,
            "phrase": "familiarize someone with something",
            "definition": "to help someone get to know or understand someone or something.  I hope you will take the time to familiarize yourself with the instructions before you set out to operate this device.  Let me take a moment to familiarize myself with the facts of the case."
        },
        {
            "id": 213,
            "phrase": "The family that prays together stays together.",
            "definition": "Prov. Families who practice religion together will not break apart through divorce or estrangement. Mother believed that the family that prays together stays together and insisted that we all say prayers every night."
        },
        {
            "id": 214,
            "phrase": "famous last words",
            "definition": "assertions that are almost immediately countered. (Sarcastic.) _ A: I said I would never speak to her again in my entire life! B: Famous last words! You just said hello to her."
        },
        {
            "id": 215,
            "phrase": "*a fan of someone",
            "definition": "to be a follower of someone; to idolize someone. (*Typically: be ~; become ~.) _My mother is still a fan of the Beatles.  I’m a great fan of the mayor of the town."
        },
        {
            "id": 216,
            "phrase": "fan out",
            "definition": "to spread out over a wide area. The searchers fanned out, looking for the child lost in the woods.  Let’s fan out and search a wider area."
        },
        {
            "id": 217,
            "phrase": "fan out (from some place)",
            "definition": "to spread outward from a particular area. The paths seem to fan out from the wide trail that starts at the house.  The trails fanned out and soon we were all separated."
        },
        {
            "id": 218,
            "phrase": "fan something out†",
            "definition": "to spread something out so that all parts can be seen better. (As one opens a wood and paper fan.) _ Todd fanned the cards out so we could see which ones he held.  He fanned out the cards."
        },
        {
            "id": 219,
            "phrase": "fan the breeze",
            "definition": "to chat or gossip.  We’re just fanning the breeze, so you didn’t interrupt anything.  Stop fanning the breeze and get to work."
        },
        {
            "id": 220,
            "phrase": "fan the flames (of something)",
            "definition": "to make something more intense; to make a situation worse. The riot fanned the flames of racial hatred even more. The hostility in the school is bad enough without anyone fanning the f lames."
        },
        {
            "id": 221,
            "phrase": "fancy footwork",
            "definition": "clever and intricate dance steps.  The old man was known for his fancy footwork when he was on Broadway."
        },
        {
            "id": 222,
            "phrase": "Fancy meeting you here!",
            "definition": "I am very surprised to meet you here! _ Tom: Hi, Sue! Fancy meeting you here! Sue: Hi, Tom. I was thinking the same thing about you. “Fancy meeting you here,” said Mr. Franklin when he bumped into the company president at the racetrack."
        },
        {
            "id": 223,
            "phrase": "fancy someone as someone or something",
            "definition": "to imagine that someone were someone else or some particular type of person. Can you fancy her as a zookeeper? _I can fancy him as a tall, dark stranger. I really don’t fancy myself as a farmer."
        },
        {
            "id": 224,
            "phrase": "fancy someone’s chances",
            "definition": "to have confidence in someone’s [including one’s own] ability to be successful.  We all think she will refuse to go out with him, but he certainly fancies his own chances. The other contestants are so talented that I don’t fancy his chances at all."
        },
        {
            "id": 225,
            "phrase": "far and away the best",
            "definition": "unquestionably the best.  This soap is far and away the best I’ve ever used. Sally is good, but Ann is far and away the best artist in our school."
        },
        {
            "id": 226,
            "phrase": "far be it from me to do something",
            "definition": "it is not really my place to do something. (Always followed by but, as in the example.) _ Far be it from me to tell you what to do, but I think you should buy the book."
        },
        {
            "id": 227,
            "phrase": "a far cry from something",
            "definition": "a thing that is very different from something else.  What you did was a far cry from what you said you were going to do.  The song they played was a far cry from what I call music."
        },
        {
            "id": 228,
            "phrase": "far from it",
            "definition": "not it at all; not at all.  Do I think you need a new car? Far from it. The old one is fine.  Bill: Does this hat look strange? Tom: Far from it. It looks good on you."
        },
        {
            "id": 229,
            "phrase": "far from the madding crowd",
            "definition": "in a quiet, restful place. (From Thomas Gray’s poem, “Elegy Written in a Country Churchyard.”) _ Julia sat daydreaming at her desk, wishing she were far from the madding crowd.  Jane: Where shall we go this weekend? Alan: Anywhere, as long as it’s far from the madding crowd."
        },
        {
            "id": 230,
            "phrase": "far gone",
            "definition": "1. in an extreme state, usually an irrational or intoxicated state.  Wow, that chick is far gone. Listen to her rave. He was too far gone to make any sense. 2. intoxicated.  Larry’s far gone and looking sick.  Wow, is she ever far gone!"
        },
        {
            "id": 231,
            "phrase": "far into the night",
            "definition": "late into the night; until very late.  She sat up and read far into the night.  The party went on far into the night."
        },
        {
            "id": 232,
            "phrase": "far out",
            "definition": "far from the center of things; far from town.  The Smiths live sort of far out.  The restaurant is nice, but too far out."
        },
        {
            "id": 233,
            "phrase": "farm someone out†",
            "definition": "1. [for someone in control] to send someone to work for someone else.  I have farmed my electrician out for a week, so your work will have to wait.  We farmed out the office staff. 2. to send a child away to be cared for by someone; to send a child to boarding school. We farmed the kids out to my sister for the summer.  We farmed out the kids."
        },
        {
            "id": 234,
            "phrase": "farm something out†",
            "definition": "1. to deplete the fertility of land by farming too intensely.  They farmed their land out through careless land management.  They farmed out their land. 2. to send work to someone to be done away from one’s normal place of business; to subcontract work. We farmed the assembly work out. We always farm out the actual final assembly of the finished units."
        },
        {
            "id": 235,
            "phrase": "fart around",
            "definition": "to waste time playing around. (Caution with fart, which is considered coarse.) _ Stop farting around and get the job started."
        },
        {
            "id": 236,
            "phrase": "fashion something into something",
            "definition": "to make, form, or convert something into something else.  He fashioned the newspaper into a temporary rain hat.  Sarah fashioned the clay into a little bowl."
        },
        {
            "id": 237,
            "phrase": "fashion something on something",
            "definition": "to model something on something else; to pattern something after something else.  She fashioned her dress on something she had seen in a history book. Donna fashioned the plan on the one Robert had used."
        },
        {
            "id": 238,
            "phrase": "fashion something out of something",
            "definition": "to make something from something; to convert something into something else.  He tried to fashion a dog out of balloons.  Elaine was expert at fashioning a bow out of chocolate."
        },
        {
            "id": 239,
            "phrase": "fast and furious",
            "definition": "Cliché very rapidly and with unrestrained energy.  Her work in the kitchen was fast and furious, and it looked lovely when she finished.  Everything was going so fast and furious at the store during the Christmas rush that we never had time to eat lunch."
        },
        {
            "id": 240,
            "phrase": "fast friends",
            "definition": "good, loyal friends.  The two of them had been fast friends since college."
        },
        {
            "id": 241,
            "phrase": "a fast one",
            "definition": "a clever and devious trick. (Compare this with pull a fast one.) _ That was a fast one. I didn’t know you were so devious.  This was the last fast one like that you’ll ever catch me with."
        },
        {
            "id": 242,
            "phrase": "fasten someone or something (on)to someone or something",
            "definition": "to attach people or things together. He fastened himself onto the mast of the boat with a length of rope.  I fastened a note onto Jimmy, so his kindergarten teacher would read it and remind him to wear his gloves home."
        },
        {
            "id": 243,
            "phrase": "fasten something down† (to something)",
            "definition": "to attach something down to something else.  Fasten this board down to the top of the workbench. Please fasten down the board."
        },
        {
            "id": 244,
            "phrase": "fasten something up†",
            "definition": "to close something up, using buttons, a zipper, snaps, hooks, a clasp, or other things meant to hold something closed.  Please fasten this up for me. I can’t reach the zipper.  Please fasten up my buttons in back."
        },
        {
            "id": 245,
            "phrase": "fasten (up)on someone or something",
            "definition": "to take firm hold of someone or something.  She fastened upon me and would not let me go until she finished speaking.  I don’t like people who fasten on me and ask a lot of questions."
        },
        {
            "id": 246,
            "phrase": "faster and faster",
            "definition": "at an increasing rate of speed; fast and then even faster. The car went faster and faster and I was afraid we would crash.  The cost of education goes up faster and faster every year."
        },
        {
            "id": 247,
            "phrase": "fast-talk someone into something",
            "definition": "to use deceitful talk to get someone to do something. You can’t fast-talk me into giving you money. How dumb do you think I am? _ Max tried to fast-talk Lefty into robbing a bank with him."
        },
        {
            "id": 248,
            "phrase": "fast-talk someone out of something",
            "definition": "to use deceitful talk to get someone not to do something or to give something up.  Don’t try to fast-talk me out of my share."
        },
        {
            "id": 249,
            "phrase": "fat and happy",
            "definition": "content, as if from being well-fed.  Since all the employees were fat and happy, there was little incentive to improve productivity. You look fat and happy. Has life been treating you well?"
        }
    ]
}