{
    "dictionary": [
        {
            "id": 0,
            "phrase": "Strike while the iron is hot.",
            "definition": "Prov. When you have an opportunity to do something, do it before you lose your chance.  This is the best time in the last ten years to buy a house. Strike while the iron is hot.  Ask Lisa for a favor now, while she’s in a good mood. Strike while the iron is hot."
        },
        {
            "id": 1,
            "phrase": "string along (with someone)",
            "definition": "1. to follow with someone.  Do you mind if I string along with you? _ I don’t mind if you string along. 2. to agree with someone’s policies and actions.  Okay. I will string along with you this time, but I don’t know about the future. I would appreciate it if you would string along just this one time."
        },
        {
            "id": 2,
            "phrase": "string someone along",
            "definition": "to maintain someone’s attention or interest, probably insincerely.  You are just stringing me along because you like to borrow my car. You are not a real friend.  Rachel strung her along for the sake of old times."
        },
        {
            "id": 3,
            "phrase": "string someone up†",
            "definition": "to hang someone.  The sheriff swore he would string Tex up whenever he caught him. He never strung up Tex."
        },
        {
            "id": 4,
            "phrase": "string something out†",
            "definition": "to unwind, stretch, or straighten something, such as wire, and extend it.  The workers strung the wires out before installing them. They strung out the wires first."
        },
        {
            "id": 5,
            "phrase": "string something together",
            "definition": "to connect things, such as beads, together, as with string.  I spent all afternoon stringing beads together.  My pearls broke and I had to take them to a jeweler to have them strung together again."
        },
        {
            "id": 6,
            "phrase": "strip down",
            "definition": "to remove one’s clothing.  The doctor told Joe to strip down for his examination.  Joe stripped down for the examination."
        },
        {
            "id": 7,
            "phrase": "strip for something",
            "definition": "to take off one’s clothing for something.  Todd went into the locker room and stripped for his shower.  All the recruits stripped for their medical examination."
        },
        {
            "id": 8,
            "phrase": "strip someone or something of something",
            "definition": "to take something, such as status or property, away from someone or something.  The court stripped him of all his property.  We stripped him of his rights when we put him in jail."
        },
        {
            "id": 9,
            "phrase": "strip something away† (from someone or something)",
            "definition": "to remove or peel something from someone or something.  The emergency room nurse stripped the clothing away from the burn victim. He stripped away the victim’s clothing. Jamie stripped away the old paint from the bathroom wall."
        },
        {
            "id": 10,
            "phrase": "strip something in†",
            "definition": "to insert something into a line of print by gluing or a strip of paper.  You will have to strip the accent in.  Strip in a grave accent right here."
        },
        {
            "id": 11,
            "phrase": "strip to something",
            "definition": "to take off one’s clothing down to a particular level, usually to one’s skin, the waist, or some euphemistic way of expressing nudity or near nudity.  Tom stripped to the waist and continued to labor in the hot sun.  Tom stripped to the bare essentials and got ready to be examined by the doctor."
        },
        {
            "id": 12,
            "phrase": "strive after something",
            "definition": "to try very hard to obtain something.  I am always striving after perfection.  Ted was striving after a promotion and finally got it."
        },
        {
            "id": 13,
            "phrase": "strive against something",
            "definition": "to work against something.  He worked hard, striving against failure at every turn.  Things were difficult. I had to strive against quitting almost every day."
        },
        {
            "id": 14,
            "phrase": "strive for something",
            "definition": "to try to obtain or bring about something.  I am striving for the best possible result.  Mary strives for perfection in everything she does."
        },
        {
            "id": 15,
            "phrase": "strive to do something",
            "definition": "to try hard to do something.  She strove very hard to do what she had set out to do.  Please strive to do it as best you can."
        },
        {
            "id": 16,
            "phrase": "strive toward something",
            "definition": "to work toward a goal. I always strive toward perfection.  Mary strove toward doing her best at all times."
        },
        {
            "id": 17,
            "phrase": "a stroke of genius",
            "definition": "an act of genius; a very clever and innovative idea or task.  Your idea of painting the rock wall red was a stroke of genius."
        },
        {
            "id": 18,
            "phrase": "a stroke of luck",
            "definition": "a bit of luck; a lucky happening.  I had a stroke of luck and found Tom at home when I called. He’s not usually there.  Unless I have a stroke of luck, I’m not going to finish this report by tomorrow."
        },
        {
            "id": 19,
            "phrase": "stroke someone’s ego",
            "definition": "to flatter and praise someone. If you have trouble with him, just take a few minutes and stroke his ego. You’ll soon have him eating out of your hand."
        },
        {
            "id": 20,
            "phrase": "stroll around",
            "definition": "to walk around casually.  I think I will stroll around a bit this evening.  Would you like to stroll around a little and see the sights?"
        },
        {
            "id": 21,
            "phrase": "stroll through something",
            "definition": "to walk casually through something or some place. Would you like to stroll through the park with me? _ Let’s stroll through a few shops and see what the prices are like here."
        },
        {
            "id": 22,
            "phrase": "the strong, silent type",
            "definition": "a strong, quiet man. Clark looks like the strong, silent type. Actually he is slightly deaf and that’s fat, not muscle."
        },
        {
            "id": 23,
            "phrase": "strong-arm tactics",
            "definition": "force; the use of force.  No more strong-arm tactics. You need to be more subtle.  Strongarm tactics are out. The boss says be gentle and don’t hurt anybody."
        },
        {
            "id": 24,
            "phrase": "struggle against someone or something",
            "definition": "to strive or battle against someone or something.  There is no point in struggling against me. I will win out. He struggled against the disease for a year before he died."
        },
        {
            "id": 25,
            "phrase": "struggle along under something",
            "definition": "to make do as well as one can under a particular burden.  I will have to struggle along under these poor conditions for quite a while.  I am sorry you have to struggle along under such burdens."
        },
        {
            "id": 26,
            "phrase": "struggle along (with someone or something)",
            "definition": "to make do as well as one can with someone or something.  I really need someone who can work faster, but I’ll struggle along with Walter.  We struggled along the best we could."
        },
        {
            "id": 27,
            "phrase": "struggle for something",
            "definition": "to strive to obtain something.  I was struggling for a law degree when I won the lottery.  I had to struggle for everything that came my way."
        },
        {
            "id": 28,
            "phrase": "struggle on with something",
            "definition": "to make do as well as one can with something.  I will have to struggle on with the car that I have. We will struggle on with what we have, hoping for better someday."
        },
        {
            "id": 29,
            "phrase": "struggle through (something)",
            "definition": "to get through something in the best way possible.  I am going to struggle through this dull book to the very end.  The course was dull, but I struggled through."
        },
        {
            "id": 30,
            "phrase": "struggle to do something",
            "definition": "to strive or battle to do something.  She struggled hard to meet her deadlines.  We had to struggle to make ends meet."
        },
        {
            "id": 31,
            "phrase": "struggle to the death",
            "definition": "a bitter struggle ending in death.  The wolf and the elk fought in a struggle to the death."
        },
        {
            "id": 32,
            "phrase": "struggle with someone for something",
            "definition": "to fight with someone to obtain something.  Max struggled with Lefty for the gun, and it went off.  Timmy struggled with Bobby for the bicycle, and finally David took it away from both of them."
        },
        {
            "id": 33,
            "phrase": "struggle with someone or something",
            "definition": "to fight or battle with someone or something.  Fred struggled with Tom for a while and finally gave in. Tom struggled with the disease for a while and finally succumbed to it."
        },
        {
            "id": 34,
            "phrase": "strum something on something",
            "definition": "to brush or play with the fingers some stringed instrument, such as a guitar. She strummed a nice little melody on her guitar.  He strummed the accompaniment on the guitar."
        },
        {
            "id": 35,
            "phrase": "strung out",
            "definition": "1. extended in time; overly long.  Why was that lecture so strung out? She talked and talked.  It was strung out because there was very little to be said. 2. Sl. doped or drugged.  Bob acted very strangely—as if he were strung out or something.  I’ve never seen Bob or any of his friends strung out."
        },
        {
            "id": 36,
            "phrase": "strut around",
            "definition": "to stride around pompously.  Stop strutting around in your new jeans and get to work! _ Tex was strutting around, showing off his new boots."
        },
        {
            "id": 37,
            "phrase": "strut in(to some place)",
            "definition": "to stride pompously into a place.  He strutted into the house as if he owned the place.  Betty strutted in and sat down."
        },
        {
            "id": 38,
            "phrase": "strut one’s stuff",
            "definition": "Sl. to walk proudly and show off one’s best features or talents.  Get out there on that stage and strut your stuff! _ I’m going to strut my stuff and become a star."
        },
        {
            "id": 39,
            "phrase": "strut out of some place",
            "definition": "to stride pompously or showily out of some place.  The clowns strutted out of the tent and joined the parade through the big top. Tex strutted out of the saloon and got on his horse."
        },
        {
            "id": 40,
            "phrase": "stub something out†",
            "definition": "to put out something, such as a cigarette or cigar, by crushing the burning end against a hard object.  Max stubbed his cigar out and tossed it into the street.  He stubbed out his cigar."
        },
        {
            "id": 41,
            "phrase": "(stuck) in a rut",
            "definition": "kept in an established way of living or working that never changes.  David felt like he was stuck in a rut, so he went back to school.  Anne was tired of being in a rut, so she moved to Los Angeles."
        },
        {
            "id": 42,
            "phrase": "stuck in traffic",
            "definition": "to be caught in a traffic jam. I am sorry I am late. I was stuck in traffic.  Our taxi was stuck in traffic and I thought I would never get to the airport on time."
        },
        {
            "id": 43,
            "phrase": "*stuck on someone or something",
            "definition": "attached, as if by glue, to someone or something. (*Typically: be ~; become ~; get ~.) _The gum is stuck on me. How do I get it off ? _ The gum is stuck on the f loor."
        },
        {
            "id": 44,
            "phrase": "stuck on something",
            "definition": "to be locked into an idea, cause, or purpose.  Mary is really stuck on the idea of going to France this spring. You’ve proposed a good plan, Jane, but you’re stuck on it. We may have to make some changes. Fig. to be confused by something, such as a puzzle or a task. (Typically: be ~; become ~; get ~.) _ I’m stuck on this question about the tax rates."
        },
        {
            "id": 45,
            "phrase": "stuck with someone or something",
            "definition": "burdened with someone or something; left having to care for or deal with someone or something. Please don’t leave me stuck with your aunt. She talks too much.  My roommate quit school and left me stuck with the telephone bill."
        },
        {
            "id": 46,
            "phrase": "study for something",
            "definition": "to try to learn in preparation for an examination.  I have to study for my calculus exam.  Have you studied for your exam yet?"
        },
        {
            "id": 47,
            "phrase": "study up on someone or something",
            "definition": "to learn all one can about someone or something.  I have to study up on Abraham Lincoln in preparation for my speech.  John studied up on seashells."
        },
        {
            "id": 48,
            "phrase": "stuff and nonsense",
            "definition": "foolishness; foolish talk.  Come on! Don’t give me all that stuff and nonsense! _ I don’t understand this book. It’s all stuff and nonsense as far as I am concerned."
        },
        {
            "id": 49,
            "phrase": "stuff someone or something with something",
            "definition": "to fill up someone or something with something.  She stuffed the kids with pancakes and sent them to school.  Dale stuffed the doll with f luffy material and gave it back to Timmy.  He was afraid he would stuff himself with food as he usually did."
        },
        {
            "id": 50,
            "phrase": "stuff someone’s head with something",
            "definition": "to fill someone’s brain with certain kinds of thoughts.  Who has been stuffing your head with that nonsense? _ Tex thought that the government was stuffing peoples’ heads with all sorts of propaganda."
        },
        {
            "id": 51,
            "phrase": "stuff something down someone’s throat",
            "definition": "to force someone to hear, learn, endure, etc., some kind of information.  I don’t like the nonsense they are stuffing down our throats.  Please don’t try to stuff those lies down our throats."
        },
        {
            "id": 52,
            "phrase": "stuff something down something",
            "definition": "to force something down inside of something.  Don stuffed the caulif lower leaves down the garbage disposal and turned it on.  Timmy stuffed the leaves down the hole and covered them with dirt."
        },
        {
            "id": 53,
            "phrase": "stuff something up†",
            "definition": "to plug something by stuffing something in its opening.  He stuffed the hole up with old newspapers.  Liz stuffed up the hole with paper."
        },
        {
            "id": 54,
            "phrase": "stuff something up something",
            "definition": "to force something upward or up into something. He tried to hide the book by stuffing it up the chimney.  Sam stuffed the money he found up the downspout, where he thought no one would find it."
        },
        {
            "id": 55,
            "phrase": "stuff the ballot box",
            "definition": "to fill a ballot box with illegal votes or with more votes than the number of actual voters.  The politician was charged with stuffing the ballot box.  The ballot box was stuffed with lots of votes for the crooked politician."
        },
        {
            "id": 56,
            "phrase": "stumble into someone or something",
            "definition": "to trip and lurch into someone or something.  Not seeing the brick in the path, Carl tripped and stumbled into Alice.  Jamie stumbled into the wall. "
        },
        {
            "id": 57,
            "phrase": "stumble on someone or something",
            "definition": " to trip over someone or something.  There were three of us sleeping in the small tent. Each of us would stumble on the others whenever we went out or came in.  I stumbled on the curb and twisted my ankle."
        },
        {
            "id": 58,
            "phrase": "stumble over someone or something",
            "definition": "to trip over someone or something.  Tom stumbled over Bill, who was napping on the f loor. Don’t stumble over the laundry basket."
        },
        {
            "id": 59,
            "phrase": "stumble through something",
            "definition": "to get through a sequence of something awkwardly and falteringly.  The cast stumbled through the first act and barely finished the second.  Mary stumbled through her speech and f led from the stage."
        },
        {
            "id": 60,
            "phrase": "a stumbling block",
            "definition": "something that prevents or obstructs progress.  We’d like to buy that house, but the high price is a stumbling block.  Jim’s age is a stumbling block to getting another job. He’s over sixty."
        },
        {
            "id": 61,
            "phrase": "stump for someone",
            "definition": "to go about making political speeches in support of someone.  The vice president was out stumping for members of Congress who were running this term.  Since all the politicians were out stumping for one another, there was no one in the capital to vote on important legislation."
        },
        {
            "id": 62,
            "phrase": "stump someone",
            "definition": "to confuse or puzzle someone.  I have a question that will really stump you. When was the Achaean League established?"
        },
        {
            "id": 63,
            "phrase": "sub for someone or something",
            "definition": "to substitute for someone or something. I have to sub for Roger at work this weekend.  Will pliers sub for the wrench you wanted?"
        },
        {
            "id": 64,
            "phrase": "subdivide something into something",
            "definition": "to divide something into parts.  They subdivided the land into several valuable parcels. Sam tried to subdivide his large lot into three smaller lots, but the zoning commission wouldn’t let him do it."
        },
        {
            "id": 65,
            "phrase": "subject someone or something to something",
            "definition": "to cause someone to endure someone or something.  I didn’t mean to subject you to Uncle Harry.  I am sorry I have to subject you to all this questioning."
        },
        {
            "id": 66,
            "phrase": "subject to something",
            "definition": "likely to have something, such as a physical disorder.  The sick man was subject to dizzy spells.  I am subject to frequent headaches."
        },
        {
            "id": 67,
            "phrase": "subjugate someone to someone",
            "definition": "to suppress someone in someone else’s favor.  The army sought to subjugate everyone to the king."
        },
        {
            "id": 68,
            "phrase": "submerge someone or something in something",
            "definition": "to immerse someone or something in a liquid.  The preacher submerged Jeff in the water of the river as part of the baptism ceremony.  Submerge the fish in the marinade for at least two hours."
        },
        {
            "id": 69,
            "phrase": "submerge someone or something under something",
            "definition": "to put someone or something below the surface of a liquid.  The maid submerged her mistress under the surface of the water for a moment and brought her up and dried her off. They submerged themselves under the surface of the water and had a look around."
        },
        {
            "id": 70,
            "phrase": "submit someone or something to something",
            "definition": "to allow someone or something to undergo the effects of something.  I hate to submit you to all this questioning, but that is the way we do things here.  Don’t submit your car to a lot of misuse."
        },
        {
            "id": 71,
            "phrase": "submit to something",
            "definition": "to surrender to something; to agree to something. He submitted to the cross-examination.  She will probably refuse to submit to surgery."
        },
        {
            "id": 72,
            "phrase": "subordinate someone or something to someone or something else",
            "definition": "to put someone in an inferior position to someone else; to put something in an inferior position to something else.  I am going to have to subordinate you to the other manager, because she has more experience. The first thing you learn is that you must subordinate yourself to your boss."
        },
        {
            "id": 73,
            "phrase": "subpoena someone to do something",
            "definition": "to formally deliver a document forcing someone to do something for a legal process. The attorney subpoenaed a number of witnesses to testify. I subpoenaed four witnesses to appear but none of them showed up."
        },
        {
            "id": 74,
            "phrase": "subscribe to something",
            "definition": "1. to agree with a policy. I don’t subscribe to the scheme you have just described. You don’t have to subscribe to the policy to accept it. 2. to hold a standing order for a magazine or other periodical, or for a computer service.  I subscribe to three magazines, and I enjoy them all.  I don’t subscribe to any of them anymore."
        },
        {
            "id": 75,
            "phrase": "subsist on something",
            "definition": "to exist on something; to stay alive on something.  We can barely subsist on this amount of money. We need more! _ They are able to do no more than subsist on what Mrs. Harris is paid."
        },
        {
            "id": 76,
            "phrase": "substitute for someone or something",
            "definition": "to serve as a replacement for someone or something. I have to substitute for Roger at work this weekend.  Do you think that this will substitute for the one you wanted?"
        },
        {
            "id": 77,
            "phrase": "subtract something from something else",
            "definition": "to deduct or take away something from something else.  Please subtract the cost of the meal from my fee.  I demanded that they subtract the extra charge from my bill."
        },
        {
            "id": 78,
            "phrase": "succeed as something",
            "definition": "to flourish or prosper as a type of person.  I hope I succeed as a bank teller.  Jamie succeeded as an investigator."
        },
        {
            "id": 79,
            "phrase": "succeed at something",
            "definition": "to prosper or flourish in some task.  I hope I can succeed at the task you have assigned me.  I am sure you will succeed at it."
        },
        {
            "id": 80,
            "phrase": "succeed in something",
            "definition": "to prosper or flourish in some position or office.  I hope you succeed in your new job.  We knew you would succeed in doing what you wanted to do."
        },
        {
            "id": 81,
            "phrase": "succeed someone as something",
            "definition": "to take the place of someone as something; to supplant someone in something.  Jeff will succeed Claude as president of the organization.  You are not allowed to succeed yourself as president."
        },
        {
            "id": 82,
            "phrase": "succeed to something",
            "definition": "to fall heir to something; to take something over. Carl will succeed to the throne when he is of age. Mary succeeded to the throne at the age of three months."
        },
        {
            "id": 83,
            "phrase": "succumb to something",
            "definition": "to yield to something, especially a temptation, fatal disease, a human weakness, etc.  He finally succumbed to his pneumonia. She did not succumb to the disease until she was very old."
        },
        {
            "id": 84,
            "phrase": "such and such",
            "definition": "someone or something whose name has been forgotten or should not be said.  Mary said that such and such was coming to her party, but I forgot their names. If you walk into a store and ask for such and such and they don’t have it, you go to a different store."
        },
        {
            "id": 85,
            "phrase": "such as it is",
            "definition": "Cliché in the imperfect state that one sees it; in the less-than-perfect condition in which one sees it.  This is where I live. This is my glorious home—such as it is. I’ve worked for days on this report, and I’ve done the best that I can do. It’s my supreme effort—such as it is."
        },
        {
            "id": 86,
            "phrase": "Such is life!",
            "definition": "That is the way things happen! (Usually in reference to an unfortunate outcome.) _Oh, well. Everything can’t be perfect. Such is life! _So I failed my test. Such is life! I can take it again some time."
        },
        {
            "id": 87,
            "phrase": "suck someone or something down†",
            "definition": "[for a vacuum or water currents] to pull someone or something downward. The savage currents sucked the swimmers down to their death.  The current sucked down the f loating trees."
        },
        {
            "id": 88,
            "phrase": "suck someone or something under",
            "definition": "[for a current or waves] to pull someone or something beneath the surface of the water.  The strong rip tide almost sucked me under! _ It almost sucked our boat under."
        },
        {
            "id": 89,
            "phrase": "suck someone’s hind tit",
            "definition": "Sl. to be forced to do someone’s bidding no matter how unpleasant or impossible. (Fig. on the idea of the last of a litter of animals to get its mother’s milk. Potentially offensive. Use only with discretion.) _ What am I supposed to do—suck his hind tit? _ She acts like everybody has to suck her hind tit to keep their jobs."
        },
        {
            "id": 90,
            "phrase": "suck something from something",
            "definition": "to draw something out of something by the application of a vacuum. Freddie used his straw to suck the last of the cola from the can.  The machine sucked the water from the bottom of the barrel."
        },
        {
            "id": 91,
            "phrase": "suck something in†",
            "definition": "to draw something into one’s mouth by sucking.  She sucked the milk shake in so hard she nearly collapsed the straw. Liz sucked in the fresh air."
        },
        {
            "id": 92,
            "phrase": "suck something up†",
            "definition": "to pick something up by suction, as with a vacuum cleaner, or through a straw. Will this vacuum suck all this dirt up? _The vacuum cleaner sucked up all the dirt."
        },
        {
            "id": 93,
            "phrase": "suck up to someone",
            "definition": "Sl. to attempt to gain influence with or favor from someone.  In school, Richard was always sucking up to the teacher.  Don’t suck up to me. It won’t do any good."
        },
        {
            "id": 94,
            "phrase": "a sucker for someone or something",
            "definition": "someone who is prejudiced in favor of someone or something; someone who is drawn to someone or something.  I’m a sucker for a pretty face.  Ted is a sucker for any dessert with whipped cream on it.  I don’t know why I volunteered for this job. I’m a sucker for punishment I guess."
        },
        {
            "id": 95,
            "phrase": "sucker list",
            "definition": "a list of potential dupes; a list of people who might be taken in by deception.  I’m sure on their sucker list. They are trying to get me to give a lecture and receive a free clock or something.  Here’s the sucker list. Call them all and try to get them interested."
        },
        {
            "id": 96,
            "phrase": "sue for something",
            "definition": "to file a lawsuit in order to get something.  If you so much as harm a hair on my head, I will sue for damages. Ted sued for back pay in his dispute with a former employer."
        },
        {
            "id": 97,
            "phrase": "sue someone for something",
            "definition": "to file a lawsuit against someone in order to get something.  I will sue you for damages if you do anything else to my car! _ She sued her employer for failure to provide a safe workplace."
        },
        {
            "id": 98,
            "phrase": "sue the pants off (of ) someone",
            "definition": "Sl. to sue someone for a lot of money. (Of is usually retained before pronouns.) _If they harm me in any way, I’ll sue the pants off of them.  He sued the pants off his landlord."
        },
        {
            "id": 99,
            "phrase": "suffer a setback",
            "definition": "to have a minor or temporary failure.  We suffered a setback when much of our vineyard was damaged by a fungus."
        },
        {
            "id": 100,
            "phrase": "suffer from something",
            "definition": "to endure or experience unpleasantness, a disease, or a health condition.  Jeff is suffering from the f lu.  I’m afraid that you must suffer from the disease until it has run its course.  Toby is really suffering from the cold."
        },
        {
            "id": 101,
            "phrase": "suffer under someone",
            "definition": "to endure the punishments or bad treatment of someone. The citizens suffered badly under the rule of the cruel king.  We suffered under Carlos and we will suffer under his successor."
        },
        {
            "id": 102,
            "phrase": "suffice for someone or something",
            "definition": "to be sufficient for someone or something.  This serving will suffice for me. Did you get enough? _ Will this suffice for you?"
        },
        {
            "id": 103,
            "phrase": "Sufficient unto the day is the evil thereof.",
            "definition": "Prov. You should not worry about things that might happen in the future.; It is enough to worry about things that are happening today. (Biblical.) _ Jane: I can’t get to sleep; I keep thinking about the interview I have to do tomorrow. Alan: If the interview is tomorrow, worry about it tomorrow. Sufficient unto the day is the evil thereof."
        },
        {
            "id": 104,
            "phrase": "suffix something onto something",
            "definition": "to add an inflection or other part of a word onto another word.  The students were told to suffix the correct plural marker onto all the nouns in the list.  What do you get when you suffix -ed onto a verb like talk?"
        },
        {
            "id": 105,
            "phrase": "suffuse something with something",
            "definition": "to saturate something with something, usually a color.  The sun suffused the afternoon sky with orange and yellow.  The bright light suffused the leaves with a golden glow."
        },
        {
            "id": 106,
            "phrase": "suggest itself to someone",
            "definition": "[for an idea] to seem to present itself to someone.  A new scheme suggested itself to Alice as she looked at the records of the last attempt.  As you read this, does anything suggest itself to you?"
        },
        {
            "id": 107,
            "phrase": "suggest something to someone",
            "definition": "to make a suggestion of something to someone.  The waiter suggested the roast beef to all his customers. What did you suggest to the people at the other table? They look quite pleased with their meal."
        },
        {
            "id": 108,
            "phrase": "*suggestive of something",
            "definition": "reminiscent of something; suggesting something. (*Typically: be ~; become ~.) _ Bill’s homemade soup is suggestive of his mother’s.  The new movie was suggestive of an old one I had seen on TV."
        },
        {
            "id": 109,
            "phrase": "suit one’s actions to one’s words",
            "definition": "to behave in accordance with what one has said; to do what one has promised or threatened to do.  Mr. Smith suited his actions to his words and punished the children.  John threatened to quit, and when he didn’t get his way, he suited his actions to his words."
        },
        {
            "id": 110,
            "phrase": "suit (oneself) up",
            "definition": "to get into one’s uniform, especially an athletic uniform.  The coach told the team to suit up for the game by three o’clock. It’s time to suit up! _She suited herself up and went out on the court."
        },
        {
            "id": 111,
            "phrase": "suit someone or something to something",
            "definition": "to match someone or something to something. I am sorry, but we don’t suit the worker to the job. We find a job that suits the worker.  Let’s try to suit a new sports jacket to the slacks you have on."
        },
        {
            "id": 112,
            "phrase": "suit someone’s fancy",
            "definition": "to appeal to someone’s imagination, fantasy, or preferences.  Does this handbag suit your fancy, or would you prefer something larger? _ I think a big bowl of ice cream would suit my fancy quite nicely."
        },
        {
            "id": 113,
            "phrase": "Suit yourself.",
            "definition": "Inf. You decide the way you want it.; Have it your way. Mary: I think I want the red one. Tom: Suit yourself. John (reading the menu): The steak sounds good, but it’s hard to pass up the fried chicken. Sally: Suit yourself. I’ll have the steak."
        },
        {
            "id": 114,
            "phrase": "*suited for something",
            "definition": "appropriate for something. (*Typically: be ~; become ~.) _ Do you think I am suited for this kind of work? _Those clothes are not suited for outdoor work."
        },
        {
            "id": 115,
            "phrase": "sum and substance",
            "definition": "a summary; the gist.  Can you quickly tell me the sum and substance of your proposal? _ In trying to explain the sum and substance of the essay, Thomas failed to mention the middle name of the hero."
        },
        {
            "id": 116,
            "phrase": "sum (something) up†",
            "definition": "to give a summary of something.  I would like to sum this lecture up by listing the main points I have covered. It is time for me to sum up. She summed up the president’s speech in three sentences."
        },
        {
            "id": 117,
            "phrase": "summon someone before someone or something",
            "definition": "to request or order someone to appear before someone or a group.  The president summoned the committee before her.  The judge summoned Donna before the court."
        },
        {
            "id": 118,
            "phrase": "summon someone to someone or something",
            "definition": "to order or request someone to come to someone or something.  Uncle Fred summoned the waitress to him. He summoned her to our table."
        },
        {
            "id": 119,
            "phrase": "summon something up†",
            "definition": "to call forth particular qualities, such as strength, courage, wisdom, etc.  She summoned her courage up and went into the room.  Liz summoned up all her courage."
        },
        {
            "id": 120,
            "phrase": "the sun belt",
            "definition": "the southern U.S. states, where it is generally warm and sunny.  I want to retire to the sun belt.  The population of the sun belt is exploding."
        },
        {
            "id": 121,
            "phrase": "Sunday best",
            "definition": "one’s best clothing, which one would wear to church.  We are in our Sunday best, ready to go.  I got mud on my Sunday best."
        },
        {
            "id": 122,
            "phrase": "Sunday driver",
            "definition": "a slow and leisurely driver who appears to be sightseeing and enjoying the view, holding up traffic in the process. (Also a term of address.) _I’m a Sunday driver, and I’m sorry. I just can’t bear to go faster. Move over, you Sunday driver!"
        },
        {
            "id": 123,
            "phrase": "Sunday-go-to-meeting clothes",
            "definition": "Rur. one’s best clothes.  John was all dressed up in his Sunday-go-to-meeting clothes.  I hate to be wearing my Sunday-go-to-meeting clothes when everyone else is casually dressed."
        },
        {
            "id": 124,
            "phrase": "sunny-side up",
            "definition": "[of eggs] with yolks facing up and not turned over or cooked through; straight up.  I’ll have my eggs sunny-side up, with toast and coffee. People who like sunny-side up eggs wouldn’t dream of eating a whole raw egg."
        },
        {
            "id": 125,
            "phrase": "superimpose something on(to) someone or something",
            "definition": "to cover an image of someone or something with an image of something. We superimposed a mustache onto Toby’s face, and he looked just like the suspect.  When we superimposed the mustache on him, we knew he was guilty."
        },
        {
            "id": 126,
            "phrase": "supply and demand",
            "definition": "the availability of things or people as compared to the need to utilize the things or people; the availability of goods compared to the number of willing customers for the goods.  Sometimes you can find what you want by shopping around and other times almost no store carries the items you are looking for. It depends entirely on supply and demand. (Alludes to a principle of market economics.) _ Sometimes customers ask for things we do not carry in stock and other times we have things in abundance that no one wants to buy. Whether or not we can make money off of a product depends entirely on supply and demand."
        },
        {
            "id": 127,
            "phrase": "supply someone or something with something",
            "definition": "to provide something to someone or something. We will supply you with all the pencils you need. We supplied the committee with ice water."
        },
        {
            "id": 128,
            "phrase": "supply something (to someone or something) (from something)",
            "definition": "to provide someone or something with something from some source. I supplied ice cream to the new restaurant from a very expensive source. We supplied nuts from a pushcart.  Frank supplied nothing at all to them."
        },
        {
            "id": 129,
            "phrase": "supposed to do something",
            "definition": "expected or intended to do something; obliged or allowed to do something.  You’re supposed to say “excuse me” when you burp.  Mom says you’re supposed to come inside for dinner now."
        },
        {
            "id": 130,
            "phrase": "*sure as hell",
            "definition": "Inf. very sure. (Use discretion with hell. *Also: as ~.) _ As sure as hell, Ill be there on time.  As sure as hell he did it!"
        },
        {
            "id": 131,
            "phrase": "Sure as shooting!",
            "definition": "Inf. Absolutely yes! (An elaboration of Sure.) _Bill: Are you going to be there Monday night? Bob: Sure as shooting! _Bob: Will you take this over to the main office? Bill: Sure as shooting!"
        },
        {
            "id": 132,
            "phrase": "Sure thing.",
            "definition": "Inf. I certainly will.  Sue: Will you be at the reception? Bob: Sure thing. Bill: You remember my cousin, Tom, don’t you? Bob: Sure thing. Hi, Tom."
        },
        {
            "id": 133,
            "phrase": "surf and turf",
            "definition": "fish and beef; lobster and beef. (A dinner serving incorporating both expensive seafood and an expensive cut of beef. Alludes to the sea and to the pasture. Fixed order.) _Walter ordered the surf and turf, but Alice ordered only a tiny salad.  No surf and turf for me. I want fish and fish alone."
        },
        {
            "id": 134,
            "phrase": "surf the Net",
            "definition": "to browse around in the contents of the Internet.  I spend an hour a day or more surfing the Net."
        },
        {
            "id": 135,
            "phrase": "surge in(to something)",
            "definition": "to burst or gush into something or some place.  The water surged into the valley after the dam broke.  The doors opened and the people surged in."
        },
        {
            "id": 136,
            "phrase": "surge out (of something)",
            "definition": "to burst forth or gush out of something or some place.  The water surged out of the huge crack in the dam. We saw the crack where the water surged out."
        },
        {
            "id": 137,
            "phrase": "surge up",
            "definition": "to rush or gush upwards.  A spring of fresh water surged up under the stone and f lowed out on the ground.  The oil surged up and blew out into the open air in a tall black column."
        },
        {
            "id": 138,
            "phrase": "surpass someone or something in something",
            "definition": "to exceed someone or something in some deed or quality.  I will never be able to surpass Jill in speed or agility. My car surpasses yours in almost every respect."
        },
        {
            "id": 139,
            "phrase": "surprise someone by something",
            "definition": "to astonish someone by doing or being something.  You surprised me by your forthrightness.  No one was surprised by the way it happened."
        },
        {
            "id": 140,
            "phrase": "surprise someone with something",
            "definition": "to astonish someone by presenting or showing something.  I surprised her with a bouquet of roses.  He surprised Roger with a new car."
        },
        {
            "id": 141,
            "phrase": "surrender someone or something to someone or something",
            "definition": "to give up someone or something to someone or something.  You must surrender your child to the nurse for the child’s own good. She will give her right back.  He surrendered his car to the bank."
        },
        {
            "id": 142,
            "phrase": "surrender to someone or something",
            "definition": "to give in to someone or something; to yield to someone or something.  The robber surrendered to the cops.  I will never surrender to my baser passions."
        },
        {
            "id": 143,
            "phrase": "surround someone or something with someone or something",
            "definition": "to encircle or enclose someone or something with people, something, or things.  We surrounded him with his friends as he lay in the hospital bed.  We surrounded the tree with wire netting to protect it against rabbits.  They surrounded the display of jewels with guards."
        },
        {
            "id": 144,
            "phrase": "the survival of the fittest",
            "definition": "the idea that the most able or fit will survive (while the less able and less fit will perish). (This is used literally as a principle of the theory of evolution.) _ In college, it’s the survival of the fittest. You have to keep working in order to survive and graduate.  I don’t give my houseplants very good care, but the ones I have are really f lourishing. It’s the survival of the fittest, I guess."
        },
        {
            "id": 145,
            "phrase": "susceptible to something",
            "definition": "1. easily persuaded; easily influenced.  The students were susceptible to the allure of drugs. The young revolutionaries were susceptible to propaganda. 2. likely to contract a sickness; likely to become sick.  People with AIDS are susceptible to pneumonia.  Infants and the elderly are more susceptible to illness than other people."
        },
        {
            "id": 146,
            "phrase": "suspect someone of something",
            "definition": "to think or believe that someone has done something. I suspect the clerk of stealing. Ted was suspected of leaving the door unlocked when he left last Friday."
        },
        {
            "id": 147,
            "phrase": "suspend someone from something",
            "definition": "to prevent someone from participating in something. (Usually as a form of discipline.) _ The principal suspended the student from classes for a week. Ted was suspended from school for three days."
        },
        {
            "id": 148,
            "phrase": "suspend someone or something from something",
            "definition": "to hang someone or something from something. The hangman suspended the thief from a gibbet as a warning to others.  Jill suspended each decoration from a different branch."
        },
        {
            "id": 149,
            "phrase": "suspend something by something",
            "definition": "to hang something by something.  The workers carefully positioned the stone that was suspended by a steel cable.  Will suspended the decoration by a fine thread."
        },
        {
            "id": 150,
            "phrase": "suss someone out†",
            "definition": "Sl. to try to figure someone out.  I can’t seem to suss Tom out. What a strange guy.  I don’t have any luck sussing out people I don’t know well."
        },
        {
            "id": 151,
            "phrase": "sustain someone in something",
            "definition": "to stand by or support someone through some problem.  She knew she could count on her friends to sustain her in times of trouble.  We will sustain you in the difficult times the best we can."
        },
        {
            "id": 152,
            "phrase": "swab something down†",
            "definition": "to wash or scrub something, such as the deck of a ship.  The sailors were told to swab the deck down each day.  Swab down the deck!"
        },
        {
            "id": 153,
            "phrase": "swab something out†",
            "definition": "to wash or wipe something out in order to make it clean.  The doctor swabbed my ear out carefully.  The doctor swabbed out my ear carefully."
        },
        {
            "id": 154,
            "phrase": "swallow one’s pride",
            "definition": "to forget one’s pride and accept something humiliating.  I had to swallow my pride and admit that I was wrong.  When you’re trying to master a new skill, you find yourself swallowing your pride quite often."
        },
        {
            "id": 155,
            "phrase": "swallow someone or something up†",
            "definition": "to eat or gobble up someone or something.  The fairy-tale wolf threatened to swallow the pig up in one bite.  The wolf swallowed up the meat in one bite."
        },
        {
            "id": 156,
            "phrase": "swallow something down†",
            "definition": "to swallow something. Here, take this pill and swallow it down.  Liz swallowed down the pill."
        },
        {
            "id": 157,
            "phrase": "swallow something hook, line, and sinker",
            "definition": "to believe something completely. (These terms refer to fishing and fooling a fish into being caught.) _ I made up a story about why I was so late. The boss swallowed it hook, line, and sinker. I feel like a fool. I swallowed her lies hook, line, and sinker."
        },
        {
            "id": 158,
            "phrase": "swamp someone or something with something",
            "definition": "to cover or deluge someone or something with something.  The f lood swamped our property with river water. The many orders for their product swamped the small business with too much to do."
        },
        {
            "id": 159,
            "phrase": "swan song",
            "definition": "the last work or performance of a playwright, musician, actor, etc., before death or retirement.  His portrayal of Lear was the actor’s swan song.  We didn’t know that her performance last night was the singer’s swan song."
        },
        {
            "id": 160,
            "phrase": "swap notes (on someone or something)",
            "definition": "to share information on someone or something. The two girls sat around swapping notes on guys they knew.  The mechanics were swapping notes on rude customers they had dealt with in the last month."
        },
        {
            "id": 161,
            "phrase": "swap someone or something for someone or something else",
            "definition": "to trade someone or something for someone or something else.  I will swap my shortstop for your second baseman.  There are times when I would gladly swap you for a new car—even an old car!"
        },
        {
            "id": 162,
            "phrase": "swap someone or something with someone",
            "definition": "to exchange a person or thing for someone else’s person or thing. The representatives of the two countries swapped spies with each other.  Can I swap jackets with you?"
        },
        {
            "id": 163,
            "phrase": "swap with someone",
            "definition": "to exchange someone or something with someone.  I like yours better. I’ll swap with you.  If you don’t want the sandwich you have, I will swap with you."
        },
        {
            "id": 164,
            "phrase": "swarm (all) over someone or something",
            "definition": "to gather and move all about on someone or throughout something or some place.  The ants swarmed all over our picnic table.  The children swarmed over the furniture."
        },
        {
            "id": 165,
            "phrase": "swarm around someone or something",
            "definition": "to gather or crowd around someone or something, in the manner of a swarm of bees. The little children swarmed around the lady with the candy.  The bees swarmed around the f lowers."
        },
        {
            "id": 166,
            "phrase": "swarm in(to something)",
            "definition": "[for a throng] to crowd into something or some place. People were swarming into the auditorium to hear the guitarist.  They swarmed in and ran for the best seats."
        },
        {
            "id": 167,
            "phrase": "swarm out of something",
            "definition": "to move out of something in great numbers.  The bees swarmed out of the hive.  People swarmed out of the park at the end of the game."
        },
        {
            "id": 168,
            "phrase": "swarm through something",
            "definition": "to gather in a crowd and move through something or some place.  The shoppers swarmed through the store, buying everything in sight.  The locusts swarmed through the field, eating the entire harvest."
        },
        {
            "id": 169,
            "phrase": "swarm with someone or something",
            "definition": "to be abundant or crowded with moving people or things. The playground was swarming with children, and I couldn’t find my own.  The picnic blanket swarmed with ants."
        },
        {
            "id": 170,
            "phrase": "swathe someone or something in something",
            "definition": "to wrap or drape someone or something in something. Molly swathed her children in sheets to turn them into ghosts on Halloween.  She swathed the statue in black velvet for the unveiling ceremony."
        },
        {
            "id": 171,
            "phrase": "swathe someone or something with something",
            "definition": "to wrap or drape someone or something with something.  The sculptor swathed his unfinished pieces with heavy drapes.  The designer swathed the window with billows of taffeta."
        },
        {
            "id": 172,
            "phrase": "sway back and forth",
            "definition": "to swing or bend from one direction to another.  The pendulum swayed back and forth, counting off the seconds.  Mary was swaying back and forth, keeping time to the music."
        },
        {
            "id": 173,
            "phrase": "sway from side to side",
            "definition": "to swing or bend from one side to the other.  The car swayed from side to side as we started out, indicating that something was seriously wrong. He swayed from side to side with the rhythm of the music."
        },
        {
            "id": 174,
            "phrase": "sway someone to something",
            "definition": "to convince someone to do something.  I think I can sway her to join our side.  We could not sway Ted to our position."
        },
        {
            "id": 175,
            "phrase": "swear at someone or something",
            "definition": "to curse someone or something.  Please don’t swear at the children.  Scott swore at the police station as he drove by."
        },
        {
            "id": 176,
            "phrase": "swear by someone or something",
            "definition": "to utter an oath on someone or something.  I swear by Jupiter that I will be there on time.  She swore by her sainted mother that she would never do it again.  The sheriff swore by his badge that he would lock her up if she ever did it again."
        },
        {
            "id": 177,
            "phrase": "swear like a trooper",
            "definition": "to curse and swear with great facility. (The trooper here refers to a soldier.) _ Mrs. Wilson was known to swear like a trooper on occasion. The clerk started swearing like a trooper, and the customer started crying."
        },
        {
            "id": 178,
            "phrase": "swear off (something)",
            "definition": "to pledge to avoid or abstain from something.  I’ve sworn off desserts. I am on a diet.  No dessert for me. I’ve sworn off."
        },
        {
            "id": 179,
            "phrase": "swear someone in† (as something)",
            "definition": "to administer an oath to someone who then officially begins in office.  The judge swore Alice in as street commissioner.  The judge swore in Alice as the new director."
        },
        {
            "id": 180,
            "phrase": "swear someone to something",
            "definition": "to cause someone to take an oath pledging something, such as silence or secrecy, about something.  I swore Larry to secrecy, but he told anyway.  We were sworn to silence about the new product."
        },
        {
            "id": 181,
            "phrase": "swear something out† against someone",
            "definition": "to file a criminal complaint against someone. Walter swore a warrant out against Jeff.  He swore out a warrant against Tony."
        },
        {
            "id": 182,
            "phrase": "swear something to someone",
            "definition": "to pledge or promise something to someone.  I had to swear my allegiance to the general before I could become one of his bodyguards.  We swore our loyalty to our country."
        },
        {
            "id": 183,
            "phrase": "swear to something",
            "definition": "to claim that what one says is absolutely true.  It is true. I swear to it.  I think I have remembered it all, but I couldn’t swear to it."
        },
        {
            "id": 184,
            "phrase": "swear (up)on someone or something",
            "definition": "to take an oath on someone or something. (Upon is formal and less commonly used than on.) _He swore upon the Bible to tell the truth.  I swear on the memory of my sainted mother that I am telling the truth."
        },
        {
            "id": 185,
            "phrase": "sweat for something",
            "definition": "to work very hard for something. I sweat for every dollar I bring in. Ted really sweats for his salary."
        },
        {
            "id": 186,
            "phrase": "sweat something off†",
            "definition": "to get rid of excess fat or weight by exercising or taking a steam bath to produce sweat.  I think I can sweat a lot of this fat off. Tony tried to sweat off some of his excess weight."
        },
        {
            "id": 187,
            "phrase": "sweat something out†",
            "definition": "to get rid of something in one’s body by sweating.  I have a bit of a cold, and I am going to try to sweat it out.  I took a steamy shower, trying to sweat out my cold."
        },
        {
            "id": 188,
            "phrase": "sweep along",
            "definition": "to glide along smoothly, as if flying.  The sailboat swept along, pushed by the strong wind.  The fallen leaves blew up against the fence, swept along by a strong wind."
        },
        {
            "id": 189,
            "phrase": "sweep down on someone or something",
            "definition": "to flow or rush down onto someone or something.  The storm swept down on the campers.  A f lash flood swept down on the streambed."
        },
        {
            "id": 190,
            "phrase": "sweep in(to some place)",
            "definition": "to dash or run into some place.  The kids swept into the candy store and bought little bits of things.  They swept in and spent all of a dollar before they left."
        },
        {
            "id": 191,
            "phrase": "sweep off",
            "definition": "to exit quickly.  He stopped only brief ly, then swept off again.  Mary swept off, leaving Ted standing there confused."
        },
        {
            "id": 192,
            "phrase": "sweep out of some place",
            "definition": "to exit from some place quickly with style or grace.  The famous actress swept out of the room in a grand fashion.  She swept out of her dressing room and walked on stage just as her cue was uttered."
        },
        {
            "id": 193,
            "phrase": "sweep over someone",
            "definition": "to pass over and cover someone.  The waves swept over us and nearly drowned us.  The f lood swept over the farmers who would not leave their homes."
        },
        {
            "id": 194,
            "phrase": "sweep someone or something aside†",
            "definition": "to push or brush someone or something aside. The guards swept the spectators aside as the king’s coach approached.  They swept aside the spectators."
        },
        {
            "id": 195,
            "phrase": "sweep someone or something away†",
            "definition": "to dispose of someone or something by pushing or brushing away.  The waves nearly swept us away.  The waves caused by the storm swept away all the debris on the beach."
        },
        {
            "id": 196,
            "phrase": "sweep something back†",
            "definition": "to push or move something backward in the shape of a curve.  He took the brush and swept his hair back in a huge wave.  She swept back her hair in a striking arrangement."
        },
        {
            "id": 197,
            "phrase": "sweep something down†",
            "definition": "to clean something by sweeping.  Please sweep this f loor down whenever you make a mess here.  Jeff will sweep down the f loor before he goes home."
        },
        {
            "id": 198,
            "phrase": "sweep something out†",
            "definition": "to clean something out by sweeping. Someone has to sweep the garage out. Don’t sweep out this room. I’ll do it."
        },
        {
            "id": 199,
            "phrase": "sweep something under the carpet",
            "definition": "to hide dirt by brushing it away under the edge of a carpet.  He was in such a hurry with the cleaning that he just swept the dirt under the carpet.  She swept the dirt under the carpet, hoping no one would find it."
        },
        {
            "id": 200,
            "phrase": "sweep something up†",
            "definition": "to clean up and remove something, such as dirt, by sweeping.  Please sweep these crumbs up.  Can you sweep up these crumbs?"
        },
        {
            "id": 201,
            "phrase": "sweep through (something)",
            "definition": "to move through something or some place quickly and with grand flourishes.  She swept through the room, speaking to no one.  She swept through in a great hurry."
        },
        {
            "id": 202,
            "phrase": "sweep up",
            "definition": "to clean up by sweeping.  Would you sweep up this time? _ Please give me a few minutes to sweep up before you come to visit."
        },
        {
            "id": 203,
            "phrase": "sweep up after someone",
            "definition": "to clean up the dirt left on the floor by someone.  Do you mind sweeping up after the kids? _ I had to sweep up after your party and I am not happy about it!"
        },
        {
            "id": 204,
            "phrase": "sweet and sour",
            "definition": "a combination of fruity sweet and sour, but not necessarily salty, flavors. (Typically referring to certain Chinese-American foods.) _ I prefer sweet-andsour pork to anything else on the menu.  Alice does not care for sweet-and-sour dishes, but she will usually eat whatever we serve her."
        },
        {
            "id": 205,
            "phrase": "sweet nothings",
            "definition": "affectionate but unimportant or meaningless words spoken to a loved one.  Jack was whispering sweet nothings in Joan’s ear when they were dancing.  The two lovers sat in the cinema exchanging sweet nothings."
        },
        {
            "id": 206,
            "phrase": "*sweet on someone",
            "definition": "Rur. fond of someone. (*Typically: be ~; become ~.) _ Tom is sweet on Mary. He may ask her to marry him.  Mary’s sweet on him, too."
        },
        {
            "id": 207,
            "phrase": "sweeten someone up†",
            "definition": "to make someone more pleasant.  I had hoped that a week in the Caribbean would sweeten him up.  The trip sweetened him up, but not for long."
        },
        {
            "id": 208,
            "phrase": "sweeten something up†",
            "definition": "to make something taste sweeter.  Where is the sugar? I need to sweeten this up a little.  A little sugar will sweeten up the coffee."
        },
        {
            "id": 209,
            "phrase": "sweeten the pot",
            "definition": "to increase the amount of money bet in a card game with hopes of encouraging other players to bet more enthusiastically.  John sweetened the pot hoping others would follow."
        },
        {
            "id": 210,
            "phrase": "sweeten (up) the deal",
            "definition": "to make a bargain or a business transaction more appealing by adding value to the transaction.  The dealer sweetened the deal by throwing in free car washes.  He wasn’t willing to do anything to sweeten the deal, so I left. She sweetened up the deal with a little extra money."
        },
        {
            "id": 211,
            "phrase": "sweet-talk someone",
            "definition": "Rur. to talk convincingly to someone with much flattery.  I didn’t want to help her, but she sweet-talked me into it.  He sweet-talked her for a while, and she finally agreed to go to the dance with him."
        },
        {
            "id": 212,
            "phrase": "swell out",
            "definition": "to bulge outward; to expand outward.  The sides of the box swelled out because it was too full.  The west wall of the garage swelled out just before the building collapsed."
        },
        {
            "id": 213,
            "phrase": "swell up",
            "definition": "to enlarge; to inflate; to bulge out.  I struck my thumb with a hammer and it swelled up something awful."
        },
        {
            "id": 214,
            "phrase": "swell with something",
            "definition": "to expand from a particular cause.  My knee joints swelled with arthritis.  His nose swelled after it was struck by the door."
        },
        {
            "id": 215,
            "phrase": "*a swelled head",
            "definition": "a state of being conceited. (*Typically: get ~; have ~; give someone ~.) _ John got a swelled head after he won the prize.  Don’t get a swelled head from all this success."
        },
        {
            "id": 216,
            "phrase": "swerve (away) (from someone or something)",
            "definition": "to turn sharply away from someone or something.  The car swerved away from Carla just in time.  It swerved away just in time."
        },
        {
            "id": 217,
            "phrase": "swerve into someone or something",
            "definition": "to turn sharply and directly into someone or something. (Usually an accident.) _ The car almost swerved into a pedestrian.  The bus swerved into a truck."
        },
        {
            "id": 218,
            "phrase": "swift and sure",
            "definition": "fast and certain. (As with the flight of a well-aimed arrow.) _ The response of the governor to the criticism by the opposing party was swift and sure.  The boxer’s punch was swift and sure and resulted in a quick knockout and a very short match."
        },
        {
            "id": 219,
            "phrase": "swill something down†",
            "definition": "to drink something, especially an alcoholic drink, in great gulps.  The guy took a quart of beer and swilled it down in a few seconds.  He swilled down a quart of beer."
        },
        {
            "id": 220,
            "phrase": "swim around",
            "definition": "to swim here and there.  I just like to get into the pool and swim around. I saw only one fish swimming around in your aquarium."
        },
        {
            "id": 221,
            "phrase": "swim before someone’s eyes",
            "definition": "[for something, such as spots or visions] to appear in one’s field of vision.  I was getting feverish and spots swam before my eyes.  Visions of total destruction swam before my eyes as the bus skidded in the snow."
        },
        {
            "id": 222,
            "phrase": "swim for it",
            "definition": "to escape by swimming.  I escaped from the guard, dived into the river, and swam for it.  Max swam for it, but he didn’t get away."
        },
        {
            "id": 223,
            "phrase": "swim for someone or something",
            "definition": "to travel toward someone or something by swimming. I swam for George, who was farther out, holding onto a f loat.  I am going to swim for the island."
        },
        {
            "id": 224,
            "phrase": "swim in something",
            "definition": "to swim in a body of water.  Is it safe to swim in this water? _ Can we swim in your pool?"
        },
        {
            "id": 225,
            "phrase": "swim into something",
            "definition": "to enter something swimming.  They swam into a lovely grotto.  Ted swam into the cove and got out on the beach."
        },
        {
            "id": 226,
            "phrase": "swim toward someone or something",
            "definition": "to swim in the direction of someone or something.  Jeff swam toward the drowning man and helped him. I swam toward the boat."
        },
        {
            "id": 227,
            "phrase": "swim with something",
            "definition": "to swim in the same direction as the movement of water. Fred had no trouble swimming with the current. Please swim with the current and not against it."
        },
        {
            "id": 228,
            "phrase": "swimming in something",
            "definition": "having lots of something.  Right now we are swimming in merchandise. In a month it will be gone. The Wilmington-Thorpes are just swimming in money."
        },
        {
            "id": 229,
            "phrase": "swimming with someone or something",
            "definition": "engulfed with someone or something.  The scene of the crime was swimming with cops and reporters.  The hotel was swimming with out-of-town visitors."
        },
        {
            "id": 230,
            "phrase": "swing around (to something)",
            "definition": "to move one’s body or view around to another position.  She swung around to the left, where she could see better. The bear suddenly swung around and charged."
        },
        {
            "id": 231,
            "phrase": "swing at someone or something",
            "definition": "to strike at someone or something. Max swung at the cop—a serious mistake.  The batter swung at the ball and missed."
        },
        {
            "id": 232,
            "phrase": "swing for something",
            "definition": "[for someone] to die by hanging for committing a crime. The sheriff swore that Tex would swing for the killing.  Max said he would not swing for something that Lefty had done."
        },
        {
            "id": 233,
            "phrase": "swing from something",
            "definition": "to hang or dangle from something. The child was swinging from an exercise bar on her swing set.  Ted was swinging from the edge of the cliff, waiting to be rescued."
        },
        {
            "id": 234,
            "phrase": "swing into high gear",
            "definition": "to begin operating at a fast pace; to increase the rate of activity.  During the winter season we swing into high gear around here. The chef swings into high gear around six o’clock in preparation for the theater crowd."
        },
        {
            "id": 235,
            "phrase": "swing into something",
            "definition": "to enter something by swinging.  The monkey swung into its cage, and I quickly locked the cage door.  I grabbed a rope and swung into the cave, where my pursuer couldn’t see me."
        },
        {
            "id": 236,
            "phrase": "swing something",
            "definition": "to make something happen. I hope I can swing a deal that will make us all a lot of money.  We all hope you can swing it."
        },
        {
            "id": 237,
            "phrase": "swing to something",
            "definition": "to change to a different position or attitude.  The mood of the country is swinging to conservatism.  Soon the attitudes of the people will swing to the opposite side."
        },
        {
            "id": 238,
            "phrase": "swing with someone or something",
            "definition": "Sl. to appreciate someone or something.  Man, I can really swing with that color. Glorious! _I can really swing with John. He and I are real close."
        },
        {
            "id": 239,
            "phrase": "swirl about someone or something",
            "definition": "[for something, such as dust or a fluid] to circle and wind about someone or something.  The snow swirled about me as I walked along.  The smoke swirled about the tiny campfire."
        },
        {
            "id": 240,
            "phrase": "swirl around",
            "definition": "[for dust or a fluid] to circle around. The liquid swirled around in the f lask as Toby shook it up.  Dust swirled around the room in the sunlight."
        },
        {
            "id": 241,
            "phrase": "swish around",
            "definition": "[for a fluid] to slosh or rush around. All that water I drank is swishing around in my stomach.  I can hear the water swishing around in the pipes."
        },
        {
            "id": 242,
            "phrase": "switch around",
            "definition": "to change, swing, or turn around.  The horse switched around and ran the other way.  I switched around and sat looking the other way for a while."
        },
        {
            "id": 243,
            "phrase": "switch (around) (with someone or something)",
            "definition": "to exchange or trade with someone or something. (The optional elements cannot be transposed.) _ I liked Jill’s lunch, and she liked mine, so I switched around with her.  I liked Jill’s, and she liked mine, so we switched around with each other."
        },
        {
            "id": 244,
            "phrase": "switch back (to something)",
            "definition": "1. to return to using or doing something.  I decided to switch back to my old shampoo.  I switched back and was glad I did. 2. [for a road] to reverse upon itself.  The mountain road switched back twenty times in three miles.  It switched back every now and then."
        },
        {
            "id": 245,
            "phrase": "switch from someone to someone else",
            "definition": "to change one’s choice from one person to another.  I had chosen Jeff, but I will switch from him to Judy.  Tom wanted to try a new barber, so he switched from Nick to Bruno."
        },
        {
            "id": 246,
            "phrase": "switch from something to something else",
            "definition": "to change one’s choice from one thing to another. We switched from oil to gas heat in our house.  I don’t like to switch from one brand to another."
        },
        {
            "id": 247,
            "phrase": "switch into something",
            "definition": "to change [one’s clothes] into something else.  Let me switch into something a little more dressy if we are going to a nice restaurant. I have to switch into something more comfortable."
        },
        {
            "id": 248,
            "phrase": "switch off",
            "definition": "[for something] to turn itself off.  At midnight, all the lights switched off automatically.  The television switched off after I went to sleep."
        },
        {
            "id": 249,
            "phrase": "switch on",
            "definition": "1. [for something] to turn itself on.  Exactly at midnight, the lights switched on.  The radio switched on early in the morning to wake us up. 2. Sl. [for someone] to become alert or excited.  The wild music made all the kids switch on and start to dance. About midnight, Ed switches on and becomes a real devil."
        }
    ]
}