{
    "dictionary": [
        {
            "id": 0,
            "phrase": "keep someone in ignorance (about someone or something)",
            "definition": "to prevent someone from learning specific information about someone or something.  I think we had better keep them all in ignorance about the money for a while. I don’t know about her. I have kept myself in ignorance on purpose."
        },
        {
            "id": 1,
            "phrase": "keep someone in sight",
            "definition": "to make sure that a person is visible at all times.  He looks suspicious. Keep him in sight at all times.  I cannot keep him in sight day and night."
        },
        {
            "id": 2,
            "phrase": "keep someone in stitches",
            "definition": "to cause someone to laugh loud and hard, for a period of time.  The comedian kept us in stitches for nearly an hour. The teacher kept the class in stitches, but the students didn’t learn anything."
        },
        {
            "id": 3,
            "phrase": "keep someone on",
            "definition": "to retain someone in employment longer than is required or was planned.  She worked out so well that we decided to keep her on. Liz was kept on as a consultant."
        },
        {
            "id": 4,
            "phrase": "keep someone on (something)",
            "definition": "to make or help someone stay mounted on something, such as a horse, bicycle, etc.  Her father kept her on the bicycle as she was learning to ride it.  I couldn’t keep myself on the horse."
        },
        {
            "id": 5,
            "phrase": "keep someone on tenterhooks",
            "definition": "to keep someone in suspense.  Don’t keep me on tenterhooks! Tell me your news! _We were all kept on tenterhooks waiting to find out what happened."
        },
        {
            "id": 6,
            "phrase": "keep someone or an animal in†",
            "definition": "to make someone or an animal stay inside.  I will have to keep Billy in until his cold is better. Keep the dog in. It’s too cold for her to go out.  Keep in the children and the animals until it warms up."
        },
        {
            "id": 7,
            "phrase": "keep someone or an animal in line",
            "definition": "to make certain that someone behaves properly.  It’s very hard to keep Bill in line. He’s sort of rowdy.  The teacher had to struggle to keep the class in line."
        },
        {
            "id": 8,
            "phrase": "keep someone or something apart",
            "definition": "to keep someone away from someone else; to keep something away from something else.  Try to keep the dogs and cats apart.  Can you keep Bill and Bob apart?"
        },
        {
            "id": 9,
            "phrase": "keep someone or something at a distance",
            "definition": "to retain some amount of physical distance from someone or something.  Please try to keep Tom at a distance. He just gets in the way.  I wanted to keep the smelly plant at a distance."
        },
        {
            "id": 10,
            "phrase": "keep someone or something away (from someone or something)",
            "definition": "to maintain a physical distance between someone or something and someone or something, in any combination.  I will try to keep the smokers away from you.  Try to keep the dog away from the roast."
        },
        {
            "id": 11,
            "phrase": "keep someone or something back†",
            "definition": "to hold someone or something in reserve.  Keep back some of the food for an emergency.  We are keeping Karen back until the other players have exhausted themselves."
        },
        {
            "id": 12,
            "phrase": "keep someone or something by someone",
            "definition": "to make someone or something stay next to someone. Try to keep the twins by you until we have taken a few more pictures.  Please keep this package by you until we are ready to present it."
        },
        {
            "id": 13,
            "phrase": "keep someone or something down",
            "definition": "to hold someone or something in a hidden or protected position. Try to keep Sam down where no one can see him.  Please keep the noise down so Fred won’t know it’s a party when he comes in."
        },
        {
            "id": 14,
            "phrase": "keep someone or something for someone",
            "definition": "1. to retain and care for someone or something. I would be happy to keep Rover for you while you are away.  Would you keep my dog for me? 2. to keep someone or something in reserve for someone.  John wanted to return to the accounting department, but I will keep him here for you for last-minute changes.  I am keeping some birthday cake here for you, since you will miss the party."
        },
        {
            "id": 15,
            "phrase": "keep someone or something from doing something",
            "definition": "to prevent someone or something from doing something.  Would you please keep your dog from digging in my garden? _Her lack of a degree kept her from advancing."
        },
        {
            "id": 16,
            "phrase": "keep someone or something going",
            "definition": "to sustain someone or something. I try to eat just enough food to keep me going. Enjoying food is just not an issue any more."
        },
        {
            "id": 17,
            "phrase": "keep someone or something in mind (for someone or something)",
            "definition": "to remember to bring up someone or something in regard to someone or something.  Would you keep me in mind for the vice president job? _ I will keep a position in mind for John, since he is graduating soon."
        },
        {
            "id": 18,
            "phrase": "keep someone or something in order",
            "definition": "to keep people or things in the proper sequence. Please try to keep the children in order until their turn to perform comes. Can you keep these books in order for me?"
        },
        {
            "id": 19,
            "phrase": "keep someone or something in some place",
            "definition": "to house or maintain someone or something in some place. We keep the boys in an apartment just off campus. It’s cheaper than three dormitory rooms.  We can keep your dog in the garage until you return."
        },
        {
            "id": 20,
            "phrase": "keep someone or something in with someone or something",
            "definition": "to locate people or things together, in any combination.  I will keep Tom in with me until he gets his own room. We will keep the cat in with Tom until there is room elsewhere."
        },
        {
            "id": 21,
            "phrase": "keep someone or something on (the) (right) track",
            "definition": "to make sure that someone or some process continues to progress properly.  You have to watch him and keep him on the right track.  I will do what I can to keep the process on the track."
        },
        {
            "id": 22,
            "phrase": "keep someone or something out (of something)",
            "definition": "1. to prevent someone or something from getting into something or some place. Keep your kids out of my yard. She just couldn’t keep herself out of the cookie jar. 2. to keep the subject of someone or something out of a discussion.  Keep the kids out of this! I don’t want to talk about them.  They kept Dorothy out of the discussion."
        },
        {
            "id": 23,
            "phrase": "keep someone or something out of the way",
            "definition": "to prevent someone or something from getting in the way.  Please keep your children out of the way."
        },
        {
            "id": 24,
            "phrase": "keep someone or something together",
            "definition": "to keep things or a group of people together; to keep something, including a group of people, from falling apart.  I hope we can keep our club together for a few more years.  We will keep it together for a while longer. Keep your toys together. Don’t scatter them all over the house."
        },
        {
            "id": 25,
            "phrase": "keep someone or something under something",
            "definition": "to store, hide, or cache someone or something beneath something.  Keep Max under the packing crate until the police go away.  I keep a box of extra sweaters under the bed."
        },
        {
            "id": 26,
            "phrase": "keep (someone or something) within bounds",
            "definition": "to cause someone or something to remain constrained or be reasonable; to cause someone to act or something to be in good taste.  I know you want artistic freedom, but if you want an audience, you are going to have to keep within bounds.  Try to keep the children within bounds.  Do keep your behavior within bounds."
        },
        {
            "id": 27,
            "phrase": "keep someone posted",
            "definition": "to keep someone informed (of what is happening); to keep someone up to date.  If the price of corn goes up, I need to know. Please keep me posted.  Keep her posted about the patient’s status."
        },
        {
            "id": 28,
            "phrase": "keep someone, something, or an animal back (from someone or something)",
            "definition": "to make someone, something, or an animal stay in a position away from someone or something. Keep everyone back from the injured lady. Please keep the dogs back from the turtle."
        },
        {
            "id": 29,
            "phrase": "keep someone up",
            "definition": "to hold someone upright.  Try to keep him up until I can get his bed made.  Keep her up for a few minutes longer."
        },
        {
            "id": 30,
            "phrase": "keep something by",
            "definition": "to keep something handy; to keep something in reserve, ready to be used.  Keep this extra glue by in case you need it.  This money had been kept by for just such an emergency."
        },
        {
            "id": 31,
            "phrase": "keep something down",
            "definition": "to make the level of noise lower and keep it lower. Please keep it down. You are just too noisy.  Keep the noise down, or I will call the police."
        },
        {
            "id": 32,
            "phrase": "keep something from someone",
            "definition": "not to tell something to someone. Why did you keep the news from me? I needed to know.  This matter shouldn’t have been kept from me."
        },
        {
            "id": 33,
            "phrase": "keep something on†",
            "definition": "to continue to wear an article of clothing. I’m going to keep my coat on. It’s a little chilly in here.  I’ll keep on my coat, thanks."
        },
        {
            "id": 34,
            "phrase": "keep something on an even keel",
            "definition": "to keep something in a steady and untroubled state.  The manager cannot keep the firm on an even keel any longer. When the workers are unhappy, it is difficult to keep the factory on an even keel."
        },
        {
            "id": 35,
            "phrase": "keep something on its feet",
            "definition": "to keep something stable and viable.  It takes a lot of effort to keep this old firm on its feet. We may have to go out of business.  Can we keep this business on its feet another year?"
        },
        {
            "id": 36,
            "phrase": "keep something to a minimum",
            "definition": "to make something as small, few, or little as possible. Do what you can to keep construction dust to a minimum. The dust should be kept to a minimum."
        },
        {
            "id": 37,
            "phrase": "keep something to oneself",
            "definition": "to keep something a secret.  I want you to keep this news to yourself. This should be kept to yourself."
        },
        {
            "id": 38,
            "phrase": "keep something under one’s hat",
            "definition": "to keep something a secret; to keep something in one’s mind (only). (If the secret stays under your hat, it stays in your mind. Note the use of but in the examples.) _ Keep this under your hat, but I’m getting married. I’m getting married, but keep it under your hat."
        },
        {
            "id": 39,
            "phrase": "keep something under wraps",
            "definition": "to keep something concealed (until some future time). We kept the plan under wraps until after the election.  The automobile company kept the new model under wraps until most of the old models had been sold."
        },
        {
            "id": 40,
            "phrase": "keep something until some time",
            "definition": "to retain something until a certain time.  Can you keep this box until I call for it next week? _ The package will be kept until Monday."
        },
        {
            "id": 41,
            "phrase": "keep something up†",
            "definition": "to hold or prop something up.  Keep your side of the trunk up. Don’t let it sag.  Keep up your side of the trunk."
        },
        {
            "id": 42,
            "phrase": "keep something with someone",
            "definition": "to leave something in the care of someone.  Can I keep my bicycle with you while I am gone? _ I can keep your bicycle with me."
        },
        {
            "id": 43,
            "phrase": "keep the ball rolling",
            "definition": "to keep a rolling ball moving.  You have to throw hard enough to keep the ball rolling all the way to the bowling pins."
        },
        {
            "id": 44,
            "phrase": "keep the home fires burning",
            "definition": "to keep things going at one’s home or other central location. (From a World War I song.) _My uncle kept the home fires burning when my sister and I went to school.  The manager stays at the office and keeps the home fires burning while I’m out selling our products."
        },
        {
            "id": 45,
            "phrase": "keep the wolf from the door",
            "definition": "to maintain oneself at a minimal level; to keep from starving, freezing, etc.  I don’t make a lot of money, just enough to keep the wolf from the door. We have a small amount of money saved, hardly enough to keep the wolf from the door."
        },
        {
            "id": 46,
            "phrase": "keep things straight (in one’s mind)",
            "definition": "to correctly distinguish one thing from other things.  These two bottles look so much alike. It’s hard to keep them straight."
        },
        {
            "id": 47,
            "phrase": "Keep this to yourself.",
            "definition": "a phrase introducing something that is meant to be a secret.  Andy: Keep this to yourself, but I’m going to Bora Bora on my vacation. Henry: Sounds great. Can I go too? _John: Keep this to yourself. Mary and I are breaking up. Sue: I won’t tell a soul."
        },
        {
            "id": 48,
            "phrase": "keep time",
            "definition": "to maintain a musical rhythm.  Bob had to drop out of the band because he couldn’t keep time. Since he can’t keep time, he can’t march, and he can’t play the drums."
        },
        {
            "id": 49,
            "phrase": "keep to oneself",
            "definition": "to be solitary; to stay away from other people.  Ann tends to keep to herself. She doesn’t have many friends.  I try to keep to myself each morning so I can get some work done."
        },
        {
            "id": 50,
            "phrase": "keep to something",
            "definition": "to adhere to an agreement; to follow a plan; to keep a promise.  Please keep to the agreed-upon plan.  Can you keep to what we agreed on?"
        },
        {
            "id": 51,
            "phrase": "keep to the straight and narrow",
            "definition": "to behave properly and correctly; to stay out of trouble.  If you keep to the straight and narrow, you can’t help but win in the end.  I always keep to the straight and narrow."
        },
        {
            "id": 52,
            "phrase": "keep together",
            "definition": "to remain as a group.  We will keep together to the very end.  Our group decided to keep together."
        },
        {
            "id": 53,
            "phrase": "keep under something",
            "definition": "to remain beneath something.  Keep under the packing crate, Max.  I ordered the dog to keep under the table."
        },
        {
            "id": 54,
            "phrase": "keep up appearances",
            "definition": "to make things look all right whether they are or not.  We must keep up appearances even if it means little sacrifices here and there.  Things may be unpleasant, but we will keep up appearances."
        },
        {
            "id": 55,
            "phrase": "Keep up the good work.",
            "definition": "Please keep doing the good things that you are doing now. (A general phrase of encouragement.) _Father: Your grades are fine, Bill. Keep up the good work. Bill: Thanks, Dad.  “Nice play,” said the coach. “Keep up the good work!”"
        },
        {
            "id": 56,
            "phrase": "keep up (with someone or something)",
            "definition": "to advance at the same rate as someone or something; to be just as productive as someone or something. Don’t work so fast. I can’t keep up with you. You’re running so fast that I cannot keep up with you. I don’t make enough money to keep up with your spending."
        },
        {
            "id": 57,
            "phrase": "keep up with the Joneses",
            "definition": "to try to match the lifestyle of one’s neighbors.  I am tired of trying to keep up with the Joneses. Let’s just move if we can’t afford to live here.  We never try to keep up with the Joneses."
        },
        {
            "id": 58,
            "phrase": "keep up with the times",
            "definition": "to work to appear contemporary and fashionable.  I am too old-fashioned. I have to keep up with the times better.  I don’t care about keeping up with the times."
        },
        {
            "id": 59,
            "phrase": "keep watch on someone or something",
            "definition": "to monitor someone or something. Keep watch on the lady in the big coat. She may be a shoplifter.  Try to keep watch on the committee’s work."
        },
        {
            "id": 60,
            "phrase": "keep watch over someone or something",
            "definition": "to supervise someone or something; to take care of someone or something. Please keep watch over the project. Will you keep watch over Timmy for a minute?"
        },
        {
            "id": 61,
            "phrase": "keep within something",
            "definition": "to remain within a thing or within the boundaries of something.  If you keep within the tourist area, you will be safe. Please keep within the yard."
        },
        {
            "id": 62,
            "phrase": "Keep your chin up.",
            "definition": "an expression of encouragement to someone who has to bear some emotional burdens. (Fixed order.) _Fred: I really can’t take much more of this. Jane: Keep your chin up. Things will get better.  John: Smile, Fred. Keep your chin up. Fred: I guess you’re right. I just get so depressed when I think of this mess I’m in."
        },
        {
            "id": 63,
            "phrase": "Keep your head down.",
            "definition": "Lie low, try not to be noticed.  My advice to you is to keep your head down for the moment.  Keep your head down. It’ll blow over."
        },
        {
            "id": 64,
            "phrase": "Keep your mouth shut (about someone or something).",
            "definition": "Do not tell anyone about someone or something.  Bob: Are you going to see the doctor? Mary: Yes, but keep your mouth shut about it.  Bob: Isn’t Tom’s uncle in tax trouble? Jane: Yes, but keep your mouth shut about him."
        },
        {
            "id": 65,
            "phrase": "Keep your opinions to yourself!",
            "definition": "I do not want to hear your opinions! _ Jane: I think this room looks drab. Sue: Keep your opinions to yourself! I like it this way! _ Sally: You really ought to do something about your hair. It looks like it was in a hurricane. John: Keep your opinions to yourself. This is the latest style where I come from."
        },
        {
            "id": 66,
            "phrase": "Keep your shop and your shop will keep you.",
            "definition": "Prov. If you work hard at running your business, then your business will always make enough of a profit to support you. When Grandpa turned his hardware store over to me, he said, “It’s hard work, but it’s a good living. Keep the shop and the shop will keep you.”"
        },
        {
            "id": 67,
            "phrase": "key someone up†",
            "definition": "to cause someone to be anxious or excited.  The excitement of the moment really keyed me up.  Thoughts of their vacation keyed up the children so much they couldn’t sleep."
        },
        {
            "id": 68,
            "phrase": "the key to success",
            "definition": "the secret to someone’s success. Bob said that the key to his success is working hard, being on time, and being extremely lucky."
        },
        {
            "id": 69,
            "phrase": "kick about someone or something",
            "definition": "to complain about someone or something. Why are you kicking about your cousin? What has he done now? _ They kicked about our regulations, but they finally accepted them. kick something kick against someone or something to give someone or something a blow with the foot. I kicked against the side of the television set, and it came on.  He kicked against the giant of a man, but it had no effect."
        },
        {
            "id": 70,
            "phrase": "kick at someone or something",
            "definition": "to make kicking motions toward someone or something.  The horse kicked at me, but I knew it was just a threat.  The boys kicked at the can aimlessly."
        },
        {
            "id": 71,
            "phrase": "kick back",
            "definition": "1. Inf. to relax; to lean back and relax.  I really like to kick back and relax.  It’s time to kick back and enjoy life. 2. Inf. [for an addict] to return to an addiction or a habit, after having “kicked the habit.” _ Lefty kicked back after only a few days of being clean.  A lot of addicts kick back very soon."
        },
        {
            "id": 72,
            "phrase": "kick back (at someone or something)",
            "definition": "to kick at someone or something in revenge.  She kicked at me, so I kicked back at her.  If you kick me, I’ll kick back."
        },
        {
            "id": 73,
            "phrase": "kick in (on something) (for someone or something)",
            "definition": "to contribute to something for someone or something.  Would you like to kick in on a gift for Joel? _ I’ll be happy to kick in on a gift.  Sure, I would like to kick in for the gift."
        },
        {
            "id": 74,
            "phrase": "a kick in the guts",
            "definition": "Sl. a severe blow to one’s body or spirit.  The news was a kick in the guts, and I haven’t recovered yet.  I didn’t need a kick in the guts like that."
        },
        {
            "id": 75,
            "phrase": "kick one’s heels up†",
            "definition": "to act frisky; to be lively and have fun. (Somewhat literal when said of hoofed animals.) _ I like to go to an old-fashioned square dance and really kick up my heels.  For an old man, your uncle is really kicking his heels up."
        },
        {
            "id": 76,
            "phrase": "kick oneself (for doing something)",
            "definition": "to regret doing something.  I could just kick myself for going off and not locking the car door. Now the car has been stolen.  Don’t kick yourself. It’s insured."
        },
        {
            "id": 77,
            "phrase": "kick out (at someone or something)",
            "definition": "to thrust one’s foot outward at something. The ostrich kicked out at the men trying to catch her.  The mule kicked out and just missed me."
        },
        {
            "id": 78,
            "phrase": "kick over the traces",
            "definition": "to do what one is meant not to do; to rebel against authority. (Alludes to a horse that steps on the wrong side of the straps that link it to whatever it is pulling.) _ At the age of sixty, Walter kicked over the traces and ran away to Brazil.  All these young kids seem to want to kick over the traces."
        },
        {
            "id": 79,
            "phrase": "kick some ass (around)",
            "definition": "Sl. to take over and start giving orders; to raise hell. (Potentially offensive. Use only with discretion.) _ Do I have to come over there and kick some ass around? _ Willie is just the one to kick some ass over there."
        },
        {
            "id": 80,
            "phrase": "kick someone or something aside†",
            "definition": "to get someone or something out of the way by kicking. The bully kicked Timmy aside and grabbed our cake. I kicked aside the cats and came into the room."
        },
        {
            "id": 81,
            "phrase": "kick someone or something away†",
            "definition": "to force someone or something away by kicking.  Fred kicked the intruder away from the gun he had dropped on the f loor.  Then he kicked away the gun.  The kickboxer kicked the mugger away."
        },
        {
            "id": 82,
            "phrase": "kick something around†",
            "definition": "to move something around by kicking it, as in play. Kick the ball around awhile and then try to make a goal.  The boys kicked a can around, making a lot of noise. Don’t kick around all the dirt. You’ll make a mess."
        },
        {
            "id": 83,
            "phrase": "kick something back (to someone or something)",
            "definition": "to move something back to someone, something, or some place by kicking.  I kicked the ball back to Walter.  He kicked it to me, and I kicked it back."
        },
        {
            "id": 84,
            "phrase": "kick something down†",
            "definition": "to break down something by kicking.  I was afraid they were going to kick the door down.  Don’t kick down the door!"
        },
        {
            "id": 85,
            "phrase": "kick something in†",
            "definition": "to break through something by kicking.  Tommy kicked the door in and broke the new lamp.  He kicked in the door by accident. "
        },
        {
            "id": 86,
            "phrase": "kick something in† (on something) (for someone or something)",
            "definition": "to contribute something, such as money, on some- thing for someone or something.  I will kick a few bucks in on some f lowers for the receptionist. I will kick in a few bucks on the gift for Marge."
        },
        {
            "id": 87,
            "phrase": "kick something off†",
            "definition": "to begin something; to hold a party or ceremony to mark the start of something. (Alludes to starting a football game by kicking off the ball for the first play.) _ The city kicked the centennial celebration off with a parade.  They kicked off the celebration with a parade."
        },
        {
            "id": 88,
            "phrase": "kick up",
            "definition": "to cause trouble or discomfort.  The ignition in my car is kicking up again. I will have to have it looked into.  Aunt Jane’s arthritis is kicking up. She needs to see the doctor again."
        },
        {
            "id": 89,
            "phrase": "kid around (with someone)",
            "definition": "to tease and joke with someone.  I like to kid around with John. We are great friends.  Yes, John and I used to kid around a lot."
        },
        {
            "id": 90,
            "phrase": "kid’s stuff",
            "definition": "a very easy task.  Climbing that hill is kid’s stuff.  Driving an automatic car is kid’s stuff."
        },
        {
            "id": 91,
            "phrase": "kid someone about someone or something",
            "definition": "to tease someone about someone or something.  You wouldn’t kid me about Jody, would you? _Please don’t kid me about my long hair!"
        },
        {
            "id": 92,
            "phrase": "kill for something",
            "definition": "Sl. to be willing to go to extremes to get something that one really wants or needs. (An exaggeration.) _ I could kill for a cold beer."
        },
        {
            "id": 93,
            "phrase": "kill someone or an animal off†",
            "definition": "to kill all of a group of people or creatures.  Lefty set out to kill Max and his boys off.  Something killed off all the dinosaurs."
        },
        {
            "id": 94,
            "phrase": "kill someone with kindness",
            "definition": "to be enormously kind to someone. You are just killing me with kindness. Why? _ Don’t kill them with kindness."
        },
        {
            "id": 95,
            "phrase": "kill the fatted calf",
            "definition": "to prepare an elaborate banquet (in someone’s honor). (From the biblical story recounting the return of the prodigal son.) _When Bob got back from college, his parents killed the fatted calf and threw a great party.  Sorry this meal isn’t much, John. We didn’t have time to kill the fatted calf."
        },
        {
            "id": 96,
            "phrase": "Kill the goose that lays the golden egg(s).",
            "definition": "Prov. To destroy something that is profitable to you.  Fred’s wife knew he wasn’t happy in his job, even though it paid well; still, she felt that advising him to leave it would be killing the goose that laid the golden eggs."
        },
        {
            "id": 97,
            "phrase": "kill time",
            "definition": "to use something up, especially time.  I killed time reading a novel.  The employees were not encouraged to kill time."
        },
        {
            "id": 98,
            "phrase": "kill two birds with one stone",
            "definition": "to solve two problems at one time with a single action.  John learned the words to his part in the play while peeling potatoes. He was killing two birds with one stone.  I have to cash a check and make a payment on my bank loan. I’ll kill two birds with one stone by doing them both in one trip to the bank."
        },
        {
            "id": 99,
            "phrase": "killed outright",
            "definition": "killed immediately. The driver was killed outright in the accident.  Twenty people were killed outright in the explosion."
        },
        {
            "id": 100,
            "phrase": "killer instinct",
            "definition": "Cliché an inborn desire or ability to be ruthless.  Fred has a real killer instinct. He’s a difficult boss to work for."
        },
        {
            "id": 101,
            "phrase": "*a king’s ransom",
            "definition": "a great deal of money. (To pay an amount as large as one might have to pay to get back a king held for ransom. *Typically: cost ~; pay ~; spend ~.) _ I would like to buy a nice watch, but I don’t want to pay a king’s ransom for it.  It’s a lovely house. I bet it cost a king’s ransom."
        },
        {
            "id": 102,
            "phrase": "kink up",
            "definition": "[for something] to develop kinks or tangles. The leather parts tend to shrink and kink up in the damp weather.  My hair kinks up in this weather."
        },
        {
            "id": 103,
            "phrase": "kiss and make up",
            "definition": "[for two people who have been arguing] to kiss each other and apologize.  John apologized to his wife for disagreeing with her, and they finally kissed and made up."
        },
        {
            "id": 104,
            "phrase": "kiss and tell",
            "definition": "to participate in something secret and private, and then tell other people about it. (In actual use, it usually refers to a person of the opposite sex even when it does not refer to actual kissing.) _The project was supposed to be a secret between Jane and me, but she spread it all around. I didn’t think she was the type to kiss and tell. I am willing to discuss it with you, but only if you promise not to kiss and tell."
        },
        {
            "id": 105,
            "phrase": "the kiss of death",
            "definition": "an act that puts an end to someone or something.  The mayor’s veto was the kiss of death for the new law.  Fainting on stage was the kiss of death for my acting career."
        },
        {
            "id": 106,
            "phrase": "kiss off",
            "definition": "1. Sl. to die.  The cat is going to have to kiss off one of these days soon.  The cat kissed off after eighteen years of joy and devotion. 2. Sl. death. (Usually kiss-off.) _ When the time comes for the kiss-off, I hope I’m asleep.  The kiss-off came wrapped in lead, and it was instant. 3. Sl. the dismissal of someone or something. (Usually kiss-off.) _ The kiss-off was when I lost the Wilson contract.  Pete got the kiss-off and is now looking for a new job."
        },
        {
            "id": 107,
            "phrase": "kiss someone off†",
            "definition": "Sl. to kill someone.  Max kissed Lefty off with a small gun he carried in his boot.  He kissed off Lefty with a small gun."
        },
        {
            "id": 108,
            "phrase": "kiss someone on something",
            "definition": "to kiss someone on a particular place. He kissed her right on the tip of her nose. She was kissed on the tip of her nose."
        },
        {
            "id": 109,
            "phrase": "kiss someone or something off†",
            "definition": "to dismiss someone or something lightly; to abandon or write off someone or something.  I kissed off about $200 on that last deal.  They kissed me off and that was the end of that job."
        },
        {
            "id": 110,
            "phrase": "kiss someone’s ass",
            "definition": "Sl. to fawn over someone; to flatter and curry favor with someone. (Potentially offensive. Use ass with discretion.) _ What does he expect me to do? Kiss his ass? _ I won’t kiss your ass for anything."
        },
        {
            "id": 111,
            "phrase": "kiss something away† (from something)",
            "definition": "to kiss something and make something bad go away, such as tears, grief, pain, etc. She kissed the tears of pain and disappointment away from her son’s face. She kissed away his tears. She kissed the tears away."
        },
        {
            "id": 112,
            "phrase": "kiss something good-bye",
            "definition": "to anticipate or experience the loss of something.  If you leave your camera on a park bench, you can kiss it good-bye.  You kissed your wallet good-bye when you left it in the store."
        },
        {
            "id": 113,
            "phrase": "kiss the dust",
            "definition": "Sl. to fall to the earth, because of death or because of being struck.  I’ll see that you kiss the dust before sunset, cowboy! _ You’ll kiss the dust before I will, Sheriff."
        },
        {
            "id": 114,
            "phrase": "kiss up to someone",
            "definition": "Sl. to flatter someone; to curry favor with someone.  Edgar is in kissing up to the boss again.  Stop kissing up to me."
        },
        {
            "id": 115,
            "phrase": "kissing cousins",
            "definition": "relatives who know one another well enough to kiss when they meet.  Joe and I are kissing cousins, though we ain’t seen one another since we was kids. Technically, we’re second cousins once removed, but I just say we’re kissing cousins."
        },
        {
            "id": 116,
            "phrase": "kith and kin",
            "definition": "friends and relatives; people known to someone.  I was delighted to find all my kith and kin waiting for me at the airport to welcome me home. I sent cards to my kith and kin, telling them of my arrival."
        },
        {
            "id": 117,
            "phrase": "klutz around",
            "definition": "Inf. to go about acting stupidly or clumsily.  Stop klutzing around and get your act together.  Why are you klutzing around so much?"
        },
        {
            "id": 118,
            "phrase": "*knee-deep in something",
            "definition": "1. Fig. heavily involved in something. (*Typically: be ~; get ~.) _ Right now, we are knee-deep in trouble. 2. Fig. having plenty of something. (*Typically: be ~; stand ~.) _ We are knee-deep in orders and loving it."
        },
        {
            "id": 119,
            "phrase": "*knee-high by the 4th of July",
            "definition": "grown as tall as it should. (Corn seedlings are proverbially supposed to be as high as someone’s knee by July 4th.) (*Typically: be ~; become ~; grow ~.) _What with this drought, I don’t think the crop will be knee-high by the 4th of July.  It’s gonna be a good year. Knee-high by the 4th of July."
        },
        {
            "id": 120,
            "phrase": "a knee-jerk reaction",
            "definition": "an automatic or reflex reaction; an immediate reaction made without examining causes or facts.  With one of his typical knee-jerk reactions, he said no immediately, citing some moral argument that no one understood."
        },
        {
            "id": 121,
            "phrase": "kneel down",
            "definition": "to get down on one’s knees.  Please kneel down and fold your hands. You should at least kneel down and be quiet."
        },
        {
            "id": 122,
            "phrase": "kneel down (before someone or something)",
            "definition": "to show respect by getting down on one’s knees in the presence of someone or something.  We were told to kneel down in front of the altar.  Kneel down when the queen enters!"
        },
        {
            "id": 123,
            "phrase": "knit one’s brow",
            "definition": "to cause one’s brow to wrinkle.  Bob knitted his brow when he was confused.  Jane knitted her brow because she was angry."
        },
        {
            "id": 124,
            "phrase": "knit something together†",
            "definition": "to join things together by knitting.  Terry knitted the parts of the sweater together.  Sally knitted together the two parts of the glove."
        },
        {
            "id": 125,
            "phrase": "knit together",
            "definition": "[for broken bones] to join or grow together.  The bones are knitting together exactly as expected.  If the bones don’t knit together properly, we will have to do something a little more drastic."
        },
        {
            "id": 126,
            "phrase": "knock about (somewhere)",
            "definition": "to travel around; to act as a vagabond.  I’d like to take off a year and knock about Europe.  If you’re going to knock about, you should do it when you’re young."
        },
        {
            "id": 127,
            "phrase": "knock against someone or something",
            "definition": "to bump against someone or something.  Mickey knocked against Mary and said he was sorry. I didn’t mean to knock against your sore knee."
        },
        {
            "id": 128,
            "phrase": "knock at something",
            "definition": "to knock [on something] at a particular location. I could hear someone knocking at the door next to mine.  Who is knocking at the door?"
        },
        {
            "id": 129,
            "phrase": "knock away (at something)",
            "definition": "to continue to knock at something.  The loose shutter kept knocking away at the side of the house. It knocked away all night, keeping me awake."
        },
        {
            "id": 130,
            "phrase": "Knock it off!",
            "definition": "Inf. Be quiet!; Stop that noise! Stop doing that! _ John: Hey, you guys! Knock it off! Bob: Sorry. Bill: Sorry. I guess we got a little carried away.  Sue: All right. Knock it off! Bill: Yeah. Let’s get down to business."
        },
        {
            "id": 131,
            "phrase": "knock off (doing something)",
            "definition": "to stop doing something.  Knock off shoveling snow now, and come in for a hot drink.  I wish he would knock off practicing for a while."
        },
        {
            "id": 132,
            "phrase": "knock off (work)",
            "definition": "to quit work, for the day or for a break.  What time do you knock off work? _ I knock off about five-thirty."
        },
        {
            "id": 133,
            "phrase": "knock on something",
            "definition": "to rap or tap, often with the knuckles, on something.  She knocked on the door several times.  Knock on it again. Maybe she didn’t hear you."
        },
        {
            "id": 134,
            "phrase": "knock on wood",
            "definition": "to rap on something made of wood. (Said as a wish for good luck. Usually a phrase attached to another statement. Sometime said while knocking or rapping on real wood.) _ I think I am well at last—knock on wood.  I knock on wood when I wish something were true."
        },
        {
            "id": 135,
            "phrase": "knock one’s head (up) against a brick wall",
            "definition": "to be totally frustrated. Trying to get a raise around here is like knocking your head up against a brick wall.  No need to knock your head against a brick wall over this problem."
        },
        {
            "id": 136,
            "phrase": "knock one’s knees together",
            "definition": "[for one’s knees] to shake together from fright. I stood there freezing for ten minutes, knocking my knees together in the cold.  It takes a lot of energy to knock your knees together."
        },
        {
            "id": 137,
            "phrase": "knock oneself out (to do something) (for someone or something)",
            "definition": "to make a great effort to do something for someone or some group. (As if one had worked oneself into unconsciousness.) _ I knocked myself out to plan this party for you! _ She knocked herself out for us.  I don’t know why I knock myself out to do these things for you. You are not at all appreciative.  He knocked himself out to get there on time."
        },
        {
            "id": 138,
            "phrase": "knock over something",
            "definition": "1. Sl. to steal something. (The over is usually before the object in this expression.) _The gang knocked over an armored car. Some cheap crook knocked over a load of television sets. 2. Sl. to rob a place. (The over is usually before the object in this expression.) _ Max knocked over two banks in one week.  He was the kind of punk who would try to knock over a filling station."
        },
        {
            "id": 139,
            "phrase": "knock some heads together",
            "definition": "to scold some people; to get some people to do what they are supposed to be doing.  If you kids don’t quiet down and go to sleep, I’m going to come up there and knock some heads together.  The government is in a mess. We need to go to Washington and knock some heads together."
        },
        {
            "id": 140,
            "phrase": "knock someone back (an amount of money",
            "definition": ") to cost an amount of money.  That trip to Spain knocked me back almost $3,500.  How much did that new furniture knock us back?"
        },
        {
            "id": 141,
            "phrase": "knock someone into something",
            "definition": "to strike one, sending one into something.  The blow knocked him into the wall.  Max knocked Lefty into a lamp post."
        },
        {
            "id": 142,
            "phrase": "knock someone or something down†",
            "definition": "to thrust someone or something to the ground by hitting. The force of the blast knocked us down. It knocked down everyone in the room."
        },
        {
            "id": 143,
            "phrase": "knock someone or something over†",
            "definition": "to push or strike someone or something, causing the person or the thing to fall. ; knock something over.) _ I am sorry. I didn’t mean to knock you over. Are you hurt? _ Who knocked over this vase?"
        },
        {
            "id": 144,
            "phrase": "knock someone out†",
            "definition": "to knock someone unconscious. (Someone includes oneself.) _ Fred knocked Mike out and left him there in the gutter.  Fred knocked out Mike."
        },
        {
            "id": 145,
            "phrase": "knock someone over (with a feather)",
            "definition": "to leave someone stunned or surprised by something extraordinary. (Fixed order.) _ I was so surprised that you could have knocked me over with a feather.  Todd could have knocked me over with a feather when he told me his news."
        },
        {
            "id": 146,
            "phrase": "knock someone’s block off",
            "definition": "Sl. to hit someone hard in the head. Wilbur almost knocked Tom’s block off by accident. He threatened to knock my block off if I didn’t do as I was told."
        },
        {
            "id": 147,
            "phrase": "knock someone some skin",
            "definition": "Sl. to slap hands with someone, a sign of friendship. Hey, man, knock me some skin! _ Pete knocked Sam some skin, and they left the building together."
        },
        {
            "id": 148,
            "phrase": "knock someone up†",
            "definition": "Inf. to make a woman pregnant.  They say it was Willie who knocked her up.  He did not knock up Sue. I did."
        },
        {
            "id": 149,
            "phrase": "knock something against something",
            "definition": "to strike something against something.  He knocked a chair against the table and tipped both pieces of furniture over.  A chair was knocked against the table, upsetting a vase."
        },
        {
            "id": 150,
            "phrase": "knock something back†",
            "definition": "Sl. to drink down a drink of something, especially something alcoholic.  I don’t see how he can knock that stuff back.  John knocked back two beers in ten minutes."
        },
        {
            "id": 151,
            "phrase": "knock something down†",
            "definition": "1. Sl. to drink a portion of liquor.  Here, knock this down and let’s go.  He knocked down a bottle of beer and called for another. 2. Sl. to earn a certain amount of money.  I’m lucky to knock down twenty thousand.  She must knock down about twenty thou a year."
        },
        {
            "id": 152,
            "phrase": "knock something into a cocked hat",
            "definition": "to demolish a plan, a story, etc.  I knocked his plans into a cocked hat.  This bad weather has knocked everything into a cocked hat."
        },
        {
            "id": 153,
            "phrase": "knock something off†",
            "definition": "1. to manufacture or make something, especially in haste.  I’ll see if I can knock another one off before lunch.  They knocked off four window frames in an hour. 2. to knock off some amount from the price of something, lowering its price.  The store manager knocked 30 percent off the price of the coat. Can’t you knock something off on this damaged item? 2. to copy or reproduce a product.  The manufacturer knocked off a famous designer’s coat.  They are well known for knocking off cheap versions of expensive watches. "
        },
        {
            "id": 154,
            "phrase": "knock something out†",
            "definition": "1. to create something hastily. He knocked a few out as samples.  He knocked out a few of them quickly, just so we could see what they were going to look like. 2. Fig. to put something out of order; to make something inoperable. The storm knocked the telephone system out.  The high winds will probably knock out electrical service all over town."
        },
        {
            "id": 155,
            "phrase": "knock something out of someone",
            "definition": "to beat someone until something emerges or dissipates. Max knocked the truth out of the spy.  Lefty knocked the story out of Max."
        },
        {
            "id": 156,
            "phrase": "knock something out of something",
            "definition": "to beat or knock on something until something comes out. Timmy knocked the stuffing out of his pillow.  Someone knocked the coins out of my piggy bank."
        },
        {
            "id": 157,
            "phrase": "knock something over†",
            "definition": "to tip something over.  Someone knocked the chair over.  Who knocked over the flower pot?"
        },
        {
            "id": 158,
            "phrase": "knock something to someone",
            "definition": "to hit something, such as a ball, to someone.  The coach knocked the ball to each player in turn. The ball was knocked to the guy out in center field."
        },
        {
            "id": 159,
            "phrase": "knock something together†",
            "definition": "to assemble something hastily.  I knocked this model together so you could get a general idea of what I had in mind. See if you can knock together a quick snack. This thing has just been knocked together!"
        },
        {
            "id": 160,
            "phrase": "knock the bejeebers out of someone or something",
            "definition": "Inf. to beat someone or something severely.  If I catch you doing that again, I’ll knock the bejeebers out of you.  He grabbed the poor dog and just knocked the bejeebers out of it."
        },
        {
            "id": 161,
            "phrase": "knock the habit",
            "definition": "to stop using drugs; to break a drug addiction.  I just can’t knock the habit.  He tried to knock the habit by drinking lots of booze."
        },
        {
            "id": 162,
            "phrase": "knock the hell out of someone or something",
            "definition": "Inf. to strike someone or something very hard. (Use hell with discre- tion.) _The bully knocked the hell out of Sam. You really knocked the hell out of my front bumper."
        },
        {
            "id": 163,
            "phrase": "knock the (living) daylights out of someone",
            "definition": "Inf. to beat someone severely.  If you do that again, I will knock the living daylights out of you. Fred wants to knock the living daylights out of his enemy, Mike “Fingers” Moran."
        },
        {
            "id": 164,
            "phrase": "knock the props out from under someone",
            "definition": "to destroy someone’s emotional, financial, or moral underpinnings; to destroy someone’s confidence.  When you told Sally that she was due to be fired, you really knocked the props out from under her."
        },
        {
            "id": 165,
            "phrase": "knock the wind out of someone’s sails",
            "definition": "to bring someone to an abrupt halt by a heavy blow to the body, presumably knocking the person’s wind out. (Alludes to a ship being slowed by positioning another ship to block off the wind from the first ship’s sails.) _ Fred hit Mike and really knocked the wind out of his sails. Fred ran into the side of the garage and knocked the wind out of his sails."
        },
        {
            "id": 166,
            "phrase": "knock through something",
            "definition": "to break through something.  They knocked through the wall and put in a doorway. The wall had to be knocked through before we could install a doorway."
        },
        {
            "id": 167,
            "phrase": "knock (up) against someone or something",
            "definition": "to bump against someone or something.  The loose shutter knocked up against the side of the house. The large branch knocked against the garage in the storm."
        },
        {
            "id": 168,
            "phrase": "knock-down, drag-out fight",
            "definition": "a serious fight; a serious argument.  Boy, they really had a knock-down, drag-out fight.  Stop calling each other names, or you’re going to end up with a real knock-down, drag-out fight."
        },
        {
            "id": 169,
            "phrase": "knocked in",
            "definition": "Sl. arrested. (Underworld.) _ Would you believe that Larry has never been knocked in? _When Lefty was knocked in, they found his heat on him."
        },
        {
            "id": 170,
            "phrase": "knocked out",
            "definition": "unconscious.  The losing boxer lay on the canvas, knocked out."
        },
        {
            "id": 171,
            "phrase": "knocked up",
            "definition": "battered; beaten.  Sally was a little knocked up by the accident.  This book is a little knocked up, so I’ll lower the price."
        },
        {
            "id": 172,
            "phrase": "knot something together†",
            "definition": "to tie something together in a knot.  Knot these strings together and trim the strings off the knot.  Are the ropes knotted together properly? _ Quickly knot together the two loose ends!"
        },
        {
            "id": 173,
            "phrase": "know a trick or two",
            "definition": "to know some special way of dealing with a problem.  I think I can handle all of this with no trouble. I know a trick or two.  I may be a senior citizen, but I still know a trick or two. I think I can help you with this."
        },
        {
            "id": 174,
            "phrase": "know about someone or something",
            "definition": "to have information or expertise about someone or something.  I know about John and what he does.  I know about cars, but I can’t fix this one!"
        },
        {
            "id": 175,
            "phrase": "know all the angles",
            "definition": "to know all the tricks and artifices of dealing with someone or something. Ask my accountant about taxes. He knows all the angles.  Larry knows all the angles. That’s how he keeps out of the slammer."
        },
        {
            "id": 176,
            "phrase": "know as much about something as a hog knows about Sunday",
            "definition": "Rur. to have no knowledge of something.  Don’t let Jim make dessert for the picnic. He knows as much about pies as a hog knows about Sunday. I had quite a time changing the tire, since I know as much about cars as a hog knows about Sunday."
        },
        {
            "id": 177,
            "phrase": "know at a glance that...",
            "definition": "to know [something] without much evidence; to know or understand something without a lot of observation.  I knew at a glance that Bobbie was severely injured and had to be gotten to a hospital as soon as possible."
        },
        {
            "id": 178,
            "phrase": "know better (than to do something)",
            "definition": "to be wise enough, experienced enough, or well trained enough not to have done something wrong.  Mary should have known better than to accept a lift from a stranger.  Children should know better than to play in the road."
        },
        {
            "id": 179,
            "phrase": "know from something",
            "definition": "to know about something. (Used on the eastern seaboard.) _ Do you know from thermostats? _ You don’t know from anything!"
        },
        {
            "id": 180,
            "phrase": "know no more about something than a frog knows about bedsheets",
            "definition": "Rur. to have no knowledge of something. Don’t let Bill fix your car. He knows no more about cars than a frog knows about bedsheets.  When I first started studying French literature, I knew no more about it than a frog knows about bedsheets."
        },
        {
            "id": 181,
            "phrase": "know of someone or something",
            "definition": "to be aware of the existence of someone or something.  I think I know of someone who can help you.  I didn’t know of Wally’s arrival."
        },
        {
            "id": 182,
            "phrase": "know one for what one is",
            "definition": "to recognize someone as some type of person or thing.  I know you for what you are, you devil.  We know him for the thief he is."
        },
        {
            "id": 183,
            "phrase": "know one’s ABCs",
            "definition": "to know the alphabet; to know the most basic things (about something). Bill can’t do it. He doesn’t even know his ABCs.  You can’t expect to write a letter when you don’t even know your ABCs."
        },
        {
            "id": 184,
            "phrase": "know one’s place",
            "definition": "to know the behavior appropriate to one’s position or status in life.  I know my place. I won’t speak unless spoken to.  People around here are expected to know their place. You have to follow all the rules."
        },
        {
            "id": 185,
            "phrase": "know someone as someone",
            "definition": "to know someone by a different name. I know her as Candy La Tour. She has been known as Mary Rogers since her marriage."
        },
        {
            "id": 186,
            "phrase": "know someone by sight",
            "definition": "to recognize a person’s face, but not know the name. I’m afraid I don’t know her by sight.  I know all my employees by sight."
        },
        {
            "id": 187,
            "phrase": "know someone from someone",
            "definition": "to tell the difference between one person and another. I don’t know Fred from his twin brother.  I know Bill from Bob, but I can’t tell most identical twins apart."
        },
        {
            "id": 188,
            "phrase": "know someone or something as something",
            "definition": "to recognize someone or something as something. I know Mr. Franklin as a fine man.  I know this name as a very fine brand."
        },
        {
            "id": 189,
            "phrase": "know someone or something by name",
            "definition": "to recognize the name but not the appearance of someone or something.  I only know her by name. I have no idea what she looks like.  I know this brand of sausage by name, but I have never tasted it."
        },
        {
            "id": 190,
            "phrase": "know someone or something by something",
            "definition": "to recognize someone or something by a certain characteristic.  I know her by her perfume.  I know this committee only by its reputation, which is not good, by the way."
        },
        {
            "id": 191,
            "phrase": "know something by heart",
            "definition": "to know something perfectly; to have memorized something perfectly.  I know my speech by heart.  I went over and over it until I knew it by heart."
        },
        {
            "id": 192,
            "phrase": "know something from memory",
            "definition": "to have memorized something so that one does not have to consult a written version; to know something well from seeing it very often. (Almost the same as know something by heart.) _ Mary didn’t need the script because she knew the play from memory. The conductor went through the entire concert without sheet music. He knew it from memory."
        },
        {
            "id": 193,
            "phrase": "know something from something",
            "definition": "to tell the difference between one thing and another. (Often with a negative.) _ You don’t know a smoked herring from a squid! _ She didn’t know a raven from a crow, and who does?"
        },
        {
            "id": 194,
            "phrase": "know something inside out",
            "definition": "to know something thoroughly; to know about something thoroughly.  I know my geometry inside out. I studied and studied for my driver’s test until I knew the rules inside out."
        },
        {
            "id": 195,
            "phrase": "know something only too well",
            "definition": "to know something very well; to know something from unpleasant experience. (Note the variation in the examples.) _ I know the problem only too well.  I know only too well the kind of problem you must face."
        },
        {
            "id": 196,
            "phrase": "know something through and through",
            "definition": "to know something very well.  I want you to know this project through and through before the staff meeting.  I know my part in the play through and through."
        },
        {
            "id": 197,
            "phrase": "Know thyself.",
            "definition": "Prov. Be aware of your own limitations; know what you are capable of doing. (This was the motto inscribed on the temple of Apollo at Delphi.) _The motto of the ballet corps was “Know thyself ”; every dancer was expected to know how far she could stretch, and not hurt herself by trying to exceed her limits. “Know thyself,” the high school guidance counselor admonished us, “and try to find a career that makes the most of your abilities.”"
        },
        {
            "id": 198,
            "phrase": "know when one is not wanted",
            "definition": "to sense when one’s presence is not welcome; to know when one is not among friends. (Usually said when someone feels hurt by being ignored by people.) _ I’m leaving this place! I know when I’m not wanted! _She doesn’t know when she’s not wanted. Can’t she tell she’s out of place?"
        },
        {
            "id": 199,
            "phrase": "know where all the bodies are buried",
            "definition": "to know all the secrets and intrigue from the past; to know all the relevant and perhaps hidden details. He is a good choice for president because he knows where all the bodies are buried.  Since he knows where all the bodies are buried, he is the only one who can advise us."
        },
        {
            "id": 200,
            "phrase": "know where it’s at",
            "definition": "to be alert and know how the world—or some part of it—really works. Man, you just don’t know where it’s at! _ I don’t know where cool jazz is at."
        },
        {
            "id": 201,
            "phrase": "know where one is coming from",
            "definition": "to understand someone’s motivation; to understand and relate to someone’s position.  I know where you’re coming from. I’ve been there.  We all know where he’s coming from. That’s why we are so worried."
        },
        {
            "id": 202,
            "phrase": "know where someone stands (on someone or something)",
            "definition": "to know what someone thinks or feels about something.  I don’t know where John stands on this issue.  I don’t even know where I stand."
        },
        {
            "id": 203,
            "phrase": "know where something is at",
            "definition": "to know where something is located. (Without at, this sense is standard English. See also know where it’s at.) _Do you know where the hammer is at? _ I don’t know where my glasses are at."
        },
        {
            "id": 204,
            "phrase": "know whereof one speaks",
            "definition": "to know well the subject that one is speaking about.  You are wrong! You do not know whereof you speak.  He simply doesn’t know whereof he speaks."
        },
        {
            "id": 205,
            "phrase": "know which side one’s bread is buttered on",
            "definition": "Prov. to be aware of where your money comes from; to be loyal to the person or thing that will benefit you the most.  Wife: Please be sure not to upset Grandma. You know we can’t do without the money she sends us every month. Husband: Don’t worry. I know which side my bread is buttered on."
        },
        {
            "id": 206,
            "phrase": "Knowledge is power.",
            "definition": "Prov. The more you know, the more you can control.  Child: How come I have to study something) history? I don’t care what all those dead people did hundreds of years ago. Mother: Knowledge is power. If you know something about the past, it may help you to anticipate the future."
        },
        {
            "id": 207,
            "phrase": "known fact",
            "definition": "something that is generally recognized as a fact.  That grass is green is a known fact.  It is a known fact that John was in Chicago on the night of the murder."
        },
        {
            "id": 208,
            "phrase": "known quantity",
            "definition": "someone whose character, personality, and behavior are recognized and understood.  We need not worry about how John will behave. He is a known quantity.  Lisa is a known quantity and I am sure she will not surprise us by voting with the opposition."
        },
        {
            "id": 209,
            "phrase": "knuckle down (to something)",
            "definition": "to get busy doing something. I want you to knuckle down to your work and stop worrying about the past.  Come on. Knuckle down. Get busy."
        },
        {
            "id": 210,
            "phrase": "*a knuckle sandwich",
            "definition": "Inf. a punch. (*Typically: ask for ~; get ~; give someone ~; want ~.) _A: Nyah! Your mother smokes cigars! B: You want a knuckle sandwich?"
        },
        {
            "id": 211,
            "phrase": "knuckle under (to someone or something)",
            "definition": "to submit to someone or something; to yield or give in to someone or something. You have to knuckle under to your boss if you expect to keep your job.  I’m too stubborn to knuckle under."
        },
        {
            "id": 212,
            "phrase": "kowtow to someone or something",
            "definition": "to grovel to someone or something. I won’t kowtow to anyone! _You don’t expect me to go in there and kowtow to that committee, do you?"
        },
        {
            "id": 213,
            "phrase": "label someone or something as something",
            "definition": "to designate someone or something as something.  She labeled him as an uncouth person.  We labeled the committee as a worthless organization."
        },
        {
            "id": 214,
            "phrase": "label someone or something with something",
            "definition": "to mark or identify someone or something with something.  They labeled each person who had paid the admission fee with a symbol stamped on the hand.  I labeled each book with my name."
        },
        {
            "id": 215,
            "phrase": "labor at something",
            "definition": "to work hard at something.  He is laboring at his gardening and won’t be back in the house until dinnertime.  What are you laboring at so intensely?"
        },
        {
            "id": 216,
            "phrase": "labor for someone or something",
            "definition": "to work on behalf of someone or something.  I labored for them all day, and they didn’t even thank me.  I have labored for this cause for many years."
        },
        {
            "id": 217,
            "phrase": "labor for something",
            "definition": "to work in order to get something, such as money.  I was laboring for a pittance, so I decided to get another job.  I labor for the love of it."
        },
        {
            "id": 218,
            "phrase": "a labor of love",
            "definition": "a task that is either unpaid or badly paid and that one does simply for one’s own satisfaction or pleasure or to please someone whom one likes or loves. Jane made no money out of the biography she wrote. She was writing about the life of a friend and the book was a labor of love. Mary hates knitting, but she made a sweater for her boyfriend. What a labor of love."
        },
        {
            "id": 219,
            "phrase": "labor over someone or something",
            "definition": "to work hard on someone or something.  The surgeon labored over the patient for four hours.  I labored over this painting for months before I got it the way I wanted it."
        },
        {
            "id": 220,
            "phrase": "labor under an assumption",
            "definition": "to function or operate believing something; to go about living while assuming something [that may not be so].  I was laboring under the idea that we were going to share the profits equally.  Are you laboring under the notion that you are going to be promoted?"
        },
        {
            "id": 221,
            "phrase": "lace someone into something",
            "definition": "to tighten the laces of something someone is wearing.  Sally helped Billy lace himself into his boots.  The maid laced Gloria into her corset."
        },
        {
            "id": 222,
            "phrase": "lace someone up†",
            "definition": "to tie someone’s laces; to help someone get dressed in a garment having laces. Would you please lace me up? I can’t reach the ties in the back.  I laced up Sally, as she requested."
        },
        {
            "id": 223,
            "phrase": "lace something up†",
            "definition": "to tie the laces of something.  Lace your shoes up, Tommy.  Lace up your shoes."
        },
        {
            "id": 224,
            "phrase": "lace something with something",
            "definition": "to adulterate something with something, often with something alcoholic. Someone laced the punch with strong whiskey.  Who laced my coffee with brandy?"
        },
        {
            "id": 225,
            "phrase": "lack for something",
            "definition": "to lack something.  We don’t lack for new ideas.  We lack for nothing, thank you."
        },
        {
            "id": 226,
            "phrase": "Ladies first.",
            "definition": "an expression of courtesy indicating that women should go first, as in going through a doorway.  Bob stepped back and made a motion with his hand indicating that Mary should go first. “Ladies first,” smiled Bob."
        },
        {
            "id": 227,
            "phrase": "a ladies’ man",
            "definition": "a man who likes the company of women and whose company is liked by women, the suggestion being that he likes to flirt with them.  John is a real ladies’ man. He hates all-male parties. The new boss is always f lirting with the women in the office. He’s a bit of a ladies’ man."
        },
        {
            "id": 228,
            "phrase": "ladle something up†",
            "definition": "to scoop something up in a ladle.  Jerry ladled a cool dipper of water up and quenched his thirst.  Please ladle up the soup and serve it."
        },
        {
            "id": 229,
            "phrase": "lady of the evening",
            "definition": "Euph. a prostitute.  I saw several ladies of the evening down on Main Street.  He was approached by a lady of the evening."
        },
        {
            "id": 230,
            "phrase": "lag behind in something",
            "definition": "to fall behind in something.  I am lagging behind in my car payments.  She is lagging behind in her homework assignments."
        },
        {
            "id": 231,
            "phrase": "lag behind (someone or something)",
            "definition": "to linger behind someone or something; to fall behind someone or something.  Come on up here. Don’t lag behind us or you’ll get lost.  Please don’t lag behind the donkeys. Come up here with the rest of the hikers."
        },
        {
            "id": 232,
            "phrase": "laid back",
            "definition": "1. calm and relaxed. Willie is not what I would call laid back. You are really one laid-back guy! 2. intoxicated. He’s a little laid back and can’t come to the phone.  How can those guys work when they are laid back by noon?"
        },
        {
            "id": 233,
            "phrase": "laid out",
            "definition": "1. intoxicated.  Man, you got yourself laid out! _ I’m too laid out to go to work today. 2. well-dressed.  Look at those silks! Man are you laid out! _ She is all laid out in her Sunday best."
        },
        {
            "id": 234,
            "phrase": "laid up",
            "definition": "[of people or things] immobilized for recuperation or repairs. I was laid up for two weeks after my accident.  My car is laid up for repairs.  I was laid up with the f lu for a week."
        },
        {
            "id": 235,
            "phrase": "lam into someone or an animal",
            "definition": "to attack someone or an animal.  Paul was so angry that he lammed into his friend and struck him in the side.  The angry coachman lammed into the poor horses."
        },
        {
            "id": 236,
            "phrase": "lame duck",
            "definition": "1. Fig. someone who is in the last period of a term in an elective office and cannot run for reelection.  You can’t expect much from a lame duck.  As a lame duck, there’s not a lot I can do. 2. Fig. having to do with someone in the last period of a term in an elective office. (Used as an adjective; sometimes lame-duck.) _You don’t expect much from a lame-duck president.  Lame-duck Congresses tend to do things they wouldn’t dare do otherwise."
        },
        {
            "id": 237,
            "phrase": "land a blow",
            "definition": "to strike someone.  He kept moving, and I found it almost impossible to land a blow. The boxer landed a blow to the face of his opponent."
        },
        {
            "id": 238,
            "phrase": "land a job",
            "definition": "to find a job and be hired.  As soon as I land a job and start to bring in some money, I’m going to get a stereo.  I managed to land a job at a factory."
        },
        {
            "id": 239,
            "phrase": "land at some place",
            "definition": "1. [for a ship] to come to port at a place.  The ship landed at the wharf and the passengers got off.  We landed at the island’s main city and waited for customs to clear us. 2. [for an airplane] to return to earth at an airport. We landed at O’Hare at noon.  We were to land at Denver, but there was bad weather."
        },
        {
            "id": 240,
            "phrase": "land in something",
            "definition": "[for an airplane] to return to earth in or near a particular city.  We landed in Chicago on time.  They could not land in San Francisco, so they f lew on to Sacramento."
        },
        {
            "id": 241,
            "phrase": "Land o’ Goshen!",
            "definition": "Rur. My goodness gracious! (A mild oath. Goshen was an agricultural region in Egypt occupied by the Israelites before the Exodus.) _ Land o’ Goshen, it’s sure good to see you.  Land o’ Goshen! Look at that rain come down!"
        },
        {
            "id": 242,
            "phrase": "the land of Nod",
            "definition": "a state of sleep. (Humorous. From the fact that people sometimes nod when they are falling asleep.) _ The baby is in the land of Nod.  Look at the clock! It’s time we were all in the land of Nod."
        },
        {
            "id": 243,
            "phrase": "land someone in something",
            "definition": "to cause someone to end up in something.  His criminal activity finally landed him in jail.  You really landed yourself in a fine mess!"
        },
        {
            "id": 244,
            "phrase": "land something at some place",
            "definition": "to bring a boat, ship, or airplane to rest or to port at or near a place.  The captain landed the boat at a small island in hopes of finding a place to make repairs.  They had to land the plane at a small town because of a medical emergency."
        },
        {
            "id": 245,
            "phrase": "land up somehow",
            "definition": "to end up in some way. If you keep eating all those sweets, you’ll land up sick.  Do you want to land up without a job?"
        },
        {
            "id": 246,
            "phrase": "land up somehow or somewhere",
            "definition": "to finish somehow or somewhere; to come to be in a certain state or place at the end. We set out for Denver but landed up in Salt Lake City.  He’s so extravagant that he landed up in debt."
        },
        {
            "id": 247,
            "phrase": "land (up)on someone or something",
            "definition": "to light on someone or something. (Upon is formal and less commonly used than on.) _ A bee landed upon her and frightened her.  The spoon I dropped landed on the cake and ruined the icing."
        },
        {
            "id": 248,
            "phrase": "land-office business",
            "definition": "a large amount of business done in a short period of time.  We always do a landoffice business at this time of year. We keep going. Never do land-office business—just enough to make out."
        },
        {
            "id": 249,
            "phrase": "a landslide victory",
            "definition": "a victory by a large margin; a very substantial victory, particularly in an election.  The mayor won a landslide victory in the election.  The younger candidate won a landslide victory in the presidential election."
        }
    ]
}