{
    "dictionary": [
        {
            "id": 0,
            "phrase": "boxed in",
            "definition": "in a bind; having few alternatives.  I really feel boxed in around here.  I got him boxed in. He’ll have to do it our way."
        },
        {
            "id": 1,
            "phrase": "boxed on the table",
            "definition": "Sl. died on the (operating) table. (Medical.) _ The surgeon did the best job possible, but the patient boxed on the table.  Another patient boxed on the table. That’s three this month."
        },
        {
            "id": 2,
            "phrase": "Boy howdy!",
            "definition": "Rur. an exclamation of excited surprise.  Bob: Well, I finally got here. Fred: Boy howdy! Am I glad to see you! _ Bill: How do you like my horse? Fred: That’s one fine-looking filly! Boy howdy!"
        },
        {
            "id": 3,
            "phrase": "Boys will be boys.",
            "definition": "Prov. Boys are expected to be irresponsible or boisterous. (Also said ironically about men.) _ You can’t blame David for breaking the window with his baseball. Boys will be boys. My husband can’t resist driving eighty miles an hour in his new sports car. Boys will be boys."
        },
        {
            "id": 4,
            "phrase": "brace oneself for something",
            "definition": "to hang onto something or prop oneself against something in preparation for something that might cause one to fall, blow away, wash away, etc.  Hold onto the rail. Brace yourself. Here comes another huge wave."
        },
        {
            "id": 5,
            "phrase": "brace someone or something up†",
            "definition": "to prop up or add support to someone or something.  They braced the tree up for the expected windstorm.  They braced up the tree again after the storm."
        },
        {
            "id": 6,
            "phrase": "brace up",
            "definition": "to take heart; to be brave.  Brace up! Things could be worse.  I told John to brace up because things would probably get worse before they got better."
        },
        {
            "id": 7,
            "phrase": "brag about someone or something",
            "definition": "to boast about someone or something; to talk proudly about someone or something.  He bragged about how selfish he was.  Jill brags a lot about her kids."
        },
        {
            "id": 8,
            "phrase": "brain someone",
            "definition": "to strike a person hard on the skull as if to knock out the person’s brains. (Often said as a vain threat.) _ I thought he was going to brain me, but he only hit me on the shoulder.  If you don’t do it, I’ll brain you."
        },
        {
            "id": 9,
            "phrase": "brainwash someone with something",
            "definition": "to drive specific knowledge or propaganda into someone’s brain, by constant repetition and psychological conditioning.  The dictator brainwashed his people with lie after lie. You have brainwashed yourself with your own propaganda."
        },
        {
            "id": 10,
            "phrase": "branch off (from something)",
            "definition": "to separate off from something; to divide away from something.  A small stream branched off from the main channel.  An irrigation ditch branched off here and there."
        },
        {
            "id": 11,
            "phrase": "branch out (from something)",
            "definition": "[for a branch] to grow out of a branch or trunk. (Having to do with plants and trees.) _ A twig branched out of the main limb and grew straight up.  The bush branched out from the base."
        },
        {
            "id": 12,
            "phrase": "branch out (into something)",
            "definition": "to diversify and go into new areas.  I have decided to branch out into some new projects.  Business was very good, so I decided to branch out."
        },
        {
            "id": 13,
            "phrase": "(brand) spanking new",
            "definition": "very new; just purchased and never before used.  My car is spanking new.  Look at that brand spanking new car!"
        },
        {
            "id": 14,
            "phrase": "brass someone off†",
            "definition": "Sl. to make someone angry. (Primarily military. As angry as the “brass,” or officers, might get about something.) _ You really brass me off.  The private brassed off the sergeant."
        },
        {
            "id": 15,
            "phrase": "brave something out†",
            "definition": "to endure something; to put up with something courageously. I don’t know if all the men can brave the attack out.  The soldiers braved out the attack."
        },
        {
            "id": 16,
            "phrase": "The bread always falls on the buttered side.",
            "definition": "Prov. When things go wrong, they go completely wrong. Not only did my phone break, but it broke today—today of all days, when I’m expecting a really important call. The bread always falls on the buttered side.  When the painting fell off the wall, it landed on a priceless porcelain vase and broke it. The bread always falls on the buttered side."
        },
        {
            "id": 17,
            "phrase": "bread and water",
            "definition": "the most minimal meal possible; a meal as once was given to prisoners. (Usually used in reference to being in prison or jail.) _ Wilbur knew that if he got in trouble again it would be at least a year on bread and water.  This dinner is terrible again. I would rather have bread and water! Why don’t we ever have pizza?"
        },
        {
            "id": 18,
            "phrase": "Bread is the staff of life.",
            "definition": "Prov. Food is necessary for people to survive.  Miranda likes to give money to charities that feed people. “Other services are important,” she reasons, “but bread is the staff of life.” _ Jill: Want to go to lunch with us, Bob? Bob: No. I must work on my novel while inspiration lasts. Jill: Don’t forget to eat. Bread is the staff of life, you know."
        },
        {
            "id": 19,
            "phrase": "bread-and-butter letter",
            "definition": "a letter or note written to follow up on a visit; a thank-you note.  When I got back from the sales meeting, I took two days to write bread-andbutter letters to the people I met.  I got sort of a breadand- butter letter from my nephew, who wants to visit me next summer."
        },
        {
            "id": 20,
            "phrase": "break a code",
            "definition": "to figure out a code; to decipher a secret code.  The intelligence agents finally broke the enemy’s code.  When they broke the code, they were able to decipher messages."
        },
        {
            "id": 21,
            "phrase": "Break a leg!",
            "definition": "Good luck! (A special theatrical way of wishing a performer good luck. Saying “good luck” is considered by actors to be a jinx.) _“Break a leg!” shouted the stage manager to the heroine. Let’s all go and do our best. Break a leg!"
        },
        {
            "id": 22,
            "phrase": "break a record",
            "definition": "to destroy a previously set high record by setting a new one.  The athlete broke all the school records in swimming. The league record was broken after thirty years."
        },
        {
            "id": 23,
            "phrase": "break a story",
            "definition": "[for a media outlet] to be the first to broadcast or distribute the story of an event.  The Tribune broke the story before the Herald could even send a reporter to the scene."
        },
        {
            "id": 24,
            "phrase": "break against something",
            "definition": "[for something] to crash against something.  The waves broke against the barrier.  The glass broke against the side of the sink."
        },
        {
            "id": 25,
            "phrase": "break bread with someone",
            "definition": "to eat a meal with someone.  Please come by and break bread with us sometime.  I would like to break bread with you."
        },
        {
            "id": 26,
            "phrase": "break camp",
            "definition": "to close down a campsite; to pack up and move on.  Early this morning we broke camp and moved on northward.  Okay, everyone. It’s time to break camp. Take those tents down and fold them neatly."
        },
        {
            "id": 27,
            "phrase": "break down",
            "definition": "[for something] to fall apart; [for something] to stop operating.  The air-conditioning broke down, and we got very warm.  The car broke down on the long trip."
        },
        {
            "id": 28,
            "phrase": "break down (and cry)",
            "definition": "to surrender to demands or emotions and cry. Max finally broke down and confessed.  I was afraid I would break down and cry from the sadness I felt."
        },
        {
            "id": 29,
            "phrase": "break even",
            "definition": "for income to equal expenses. (This implies that money was not made or lost.) _ Unfortunately, my business just managed to break even last year.  I made a bad investment, but I broke even."
        },
        {
            "id": 30,
            "phrase": "break for something",
            "definition": "1. to stop working for something else, such as lunch, coffee, etc. We should break now for lunch.  I want to break for coffee. 2. to run suddenly toward something; to increase dramatically one’s speed while running.  At the last moment, the deer broke for the woods.  The deer broke for cover at the sound of our approach."
        },
        {
            "id": 31,
            "phrase": "break ground (for something)",
            "definition": "to start digging the foundation for a building. The president of the company came to break ground for the new building.  This was the third building this year for which this company has broken ground. When do they expect to break ground at the new site?"
        },
        {
            "id": 32,
            "phrase": "break in (on someone)",
            "definition": "1. to burst into a place and violate someone’s privacy. The police broke in on him at his home and arrested him. They needed a warrant to break in. 2. to interrupt someone’s conversation.  If you need to talk to me, just break in on me.  Feel free to break in if it’s an emergency."
        },
        {
            "id": 33,
            "phrase": "break in (on something)",
            "definition": "to interrupt something; to intrude upon something.  I didn’t mean to break in on your discussion.  Please don’t break in on us just now. This is important."
        },
        {
            "id": 34,
            "phrase": "break into a gallop",
            "definition": "[for a horse] to begin to gallop; [for a horse] to speed up to a gallop.  The pony broke into a gallop, racing to get home.  Near the stables, the horse broke into a fast gallop."
        },
        {
            "id": 35,
            "phrase": "break into something",
            "definition": "to begin to perform or utter suddenly, especially with song, speech, chattering, tears, etc.  Suddenly, she broke into song.  As soon as the movie started, the people behind me broke into loud chattering."
        },
        {
            "id": 36,
            "phrase": "break in(to something or some place)",
            "definition": "to force entry into a place criminally; to enter some place forcibly for the purpose of robbery or other illegal acts.  The thugs broke into the liquor store.  They broke in and took all the money."
        },
        {
            "id": 37,
            "phrase": "Break it up!",
            "definition": "Stop fighting!; Stop arguing! (Fixed order.) _Tom: I’m going to break your neck! Bill: I’m going to mash in your face first! Bob: All right, you two, break it up! _ When the police officer saw the boys fighting, he came over and hollered, “Break it up! You want me to arrest you?”"
        },
        {
            "id": 38,
            "phrase": "break new ground",
            "definition": "to begin to do something that no one else has done; to pioneer [in an enterprise].  Dr. Anderson was breaking new ground in cancer research.  They were breaking new ground in consumer electronics."
        },
        {
            "id": 39,
            "phrase": "break off (from something)",
            "definition": "[for a piece of something] to become separated from the whole.  This broke off from the lamp. What shall I do with it? _ This piece broke off."
        },
        {
            "id": 40,
            "phrase": "break one’s stride",
            "definition": "to deviate from a rhythmic stride while walking, running, or marching.  After I broke my stride, I never could pick up enough speed to win the race."
        },
        {
            "id": 41,
            "phrase": "break one’s word",
            "definition": "not to do what one said one would do; not to keep one’s promise. (Compare this with keep one’s word.) _ Don’t say you’ll visit your grandmother if you can’t go. She hates people to break their word. If you break your word, she won’t trust you again."
        },
        {
            "id": 42,
            "phrase": "break out",
            "definition": "1. to burst forth suddenly, as with a fire, a riot, giggling, shouting, etc.  A fire broke out in the belfry.  A round of giggling broke out when the teacher tripped. 2. Sl. to leave.  It’s late, man. Time to break out.  We broke out a little after midnight. "
        },
        {
            "id": 43,
            "phrase": "break out in a cold sweat",
            "definition": "or Fig. to become frightened or anxious and begin to sweat. I was so frightened, I broke out in a cold sweat. Larry broke out in a cold sweat when he cut his hand."
        },
        {
            "id": 44,
            "phrase": "break out in a rash",
            "definition": "[for the skin] to erupt with a rash. I knew Dan had the chicken pox, because he broke out in a rash and had a dry cough.  The baby breaks out in a rash all the time."
        },
        {
            "id": 45,
            "phrase": "break out (in pimples)",
            "definition": "to erupt with something such as a rash, a cold sweat, or pimples. After being in the woods, I broke out in a rash. I think it’s poison ivy. I hate to break out like that.  Whenever I eat chocolate, I break out in pimples the next day."
        },
        {
            "id": 46,
            "phrase": "break out (of something)",
            "definition": "to escape from something, often by destructive means, especially from prison.  The convicts plotted to break out of prison.  You don’t have the guts to break out of jail!"
        },
        {
            "id": 47,
            "phrase": "break out (with a rash)",
            "definition": "[for the skin] to erupt with pimples, hives, or lesions, from a specific disease such as measles, chicken pox, rubella, etc.  Nick and Dan broke out with chicken pox.  They both broke out at the same time."
        },
        {
            "id": 48,
            "phrase": "break out with something",
            "definition": "to utter or emit laughter, a shout, or a cry.  The kids broke out with a cheer.  They broke out with laughter every time they saw the lady with the red wig."
        },
        {
            "id": 49,
            "phrase": "break over something",
            "definition": "[for waves] to lift high and tumble over a barrier. The waves broke over the rocks at the shore.  Huge waves broke over the bow of the ship."
        },
        {
            "id": 50,
            "phrase": "break silence",
            "definition": "to give information about a topic that no one was mentioning or discussing.  The press finally broke silence on the question of the plagiarized editorial."
        },
        {
            "id": 51,
            "phrase": "break someone down†",
            "definition": "to force someone to give up and tell secrets or agree to do something. After threats of torture, they broke the spy down. They broke down the agent by threatening violence."
        },
        {
            "id": 52,
            "phrase": "break someone in†",
            "definition": "to train someone to do a new job; to supervise someone who is learning to do a new job.  Who will break the new employee in? _ I have to break in a new receptionist."
        },
        {
            "id": 53,
            "phrase": "break someone or something of something",
            "definition": "to cause someone or something to stop practicing a habit. We worked hard to break the dog of making a mess on the carpet.  I don’t think I can break her of the habit.  Tom broke himself of biting his nails."
        },
        {
            "id": 54,
            "phrase": "break someone’s fall",
            "definition": "to cushion a falling person; to lessen the impact of a falling person.  When the little boy fell out of the window, the bushes broke his fall. The old lady slipped on the ice, but a snowbank broke her fall."
        },
        {
            "id": 55,
            "phrase": "break someone’s heart",
            "definition": "to cause someone great emotional pain.  It just broke my heart when Tom ran away from home.  Sally broke John’s heart when she refused to marry him."
        },
        {
            "id": 56,
            "phrase": "break someone up†",
            "definition": "to cause a person to laugh, perhaps at an inappropriate time.  John told a joke that really broke Mary up.  The comedian’s job was to break up the audience by telling jokes."
        },
        {
            "id": 57,
            "phrase": "break something away† (from something)",
            "definition": "to break a part or piece of something away from the whole.  She broke a bit away and popped it into her mouth.  Todd broke away a piece from the bar of candy."
        },
        {
            "id": 58,
            "phrase": "break something down†",
            "definition": "to tear something down; to destroy something. They used an ax to break the door down. We broke down the wall with big hammers."
        },
        {
            "id": 59,
            "phrase": "break something down† (for someone)",
            "definition": "to explain something to someone in simple terms or in an orderly fashion. (Alludes to breaking a complex problem into smaller segments which can be explained more easily. See also break something down (into something).) _ She doesn’t understand. You will have to break it down for her.  I can help. This is a confusing question. Let me break down the problem for you."
        },
        {
            "id": 60,
            "phrase": "break something down† (into something)",
            "definition": "1. to reduce a compound or its structure to its components. Heat will break this down into sodium and a few gases.  Will heat break down this substance into anything useful? _We broke it into little pieces. 2. to reduce a large numerical total to its subparts and explain each one.  She broke the total down into its components.  Please break down the total into its parts again. I’ll break the total down for you. 3. to discuss the details of something by examining its subparts.  Let’s break this problem down into its parts and deal with each one separately.  Breaking down complex problems into their components is almost fun.  Let’s break this issue down and discuss it."
        },
        {
            "id": 61,
            "phrase": "break something free (from something)",
            "definition": "to force something to detach from something; to get something out of the hold of something else.  I broke the gun free from her grasp.  Someone broke the light fixture free from its mounting."
        },
        {
            "id": 62,
            "phrase": "break something in†",
            "definition": "to crush or batter something to pieces; to break something down. Why are you breaking the door in? Here’s the key! _ Who broke in the door?"
        },
        {
            "id": 63,
            "phrase": "break something loose from something",
            "definition": "to loosen a part of something; to loosen and remove a part of something.  The mechanic broke the strap loose from the tailpipe.  The bracket was broken loose from the wall."
        },
        {
            "id": 64,
            "phrase": "break something on something",
            "definition": "to strike and break something against something else.  She broke the glass on the countertop.  He broke his arm on the steps."
        },
        {
            "id": 65,
            "phrase": "break something out (of something)",
            "definition": "to remove something from something else by force.  Carefully, she broke the gemstone out of the side of the rock face.  She broke the gemstone out carefully."
        },
        {
            "id": 66,
            "phrase": "break something to pieces",
            "definition": "to shatter something. I broke my crystal vase to pieces.  I dropped a glass and broke it to pieces."
        },
        {
            "id": 67,
            "phrase": "break something to someone",
            "definition": "to disclose some news or information to someone. (Often said of unpleasant news.) _I hate to be the one to break this to you, but there is trouble at home.  We broke the bad news to Ken gently."
        },
        {
            "id": 68,
            "phrase": "break something up†",
            "definition": "to destroy something.  The storm broke the docks up on the lake. The police broke up the gambling ring."
        },
        {
            "id": 69,
            "phrase": "break something up† (into something)",
            "definition": "to break something into smaller pieces. We broke the crackers up into much smaller pieces.  Please break up the crackers into smaller pieces if you want to feed the ducks."
        },
        {
            "id": 70,
            "phrase": "break the back of something",
            "definition": "to end the domination of something; to reduce the power of something.  The government has worked for years to break the back of organized crime.  This new medicine should break the back of the epidemic."
        },
        {
            "id": 71,
            "phrase": "break the bank",
            "definition": "to use up all one’s money. (Alludes to casino gambling, in the rare event when a gambler wins more money than the house has on hand.) _It will hardly break the bank if we go out to dinner just once.  Buying a new dress at a discount price won’t break the bank."
        },
        {
            "id": 72,
            "phrase": "break the ice",
            "definition": "1. Fig. to attempt to become friends with someone.  He tried to break the ice, but she was a little cold.  A nice smile does a lot to break the ice. 2. Fig. to initiate social interchanges and conversation; to get something started.  It’s hard to break the ice at formal events.  Sally broke the ice at the auction by bidding $20,000 for the painting."
        },
        {
            "id": 73,
            "phrase": "break the news (to someone)",
            "definition": "to tell someone some important news, usually bad news.  The doctor had to break the news to Jane about her husband’s cancer.  I hope that the doctor broke the news gently."
        },
        {
            "id": 74,
            "phrase": "break the silence",
            "definition": "to make a noise interrupting a period of silence. The wind broke the silence by blowing the door closed."
        },
        {
            "id": 75,
            "phrase": "break the spell",
            "definition": "to put an end to a magic spell.  The wizard looked in his magic book to find out how to break the spell. 2. to do something that ends a desirable period of figurative enchantment.  At the end of the second movement, some idiot broke the spell by applauding."
        },
        {
            "id": 76,
            "phrase": "break through (something)",
            "definition": "to break something and pass through. The firefighters broke through the wall easily.  The robbers broke through the glass window of the shop."
        },
        {
            "id": 77,
            "phrase": "break through (to someone or something)",
            "definition": "to force [one’s way] through an obstruction and reach someone or something on the other side.  The miners broke through to their trapped friends.  They broke through the thin wall easily."
        },
        {
            "id": 78,
            "phrase": "break up",
            "definition": "[for something] to fall apart; to be broken to pieces. (Typically said of a ship breaking up on rocks.) _In the greatest storm of the century, the ship broke up on the reef.  It broke up and sank. "
        },
        {
            "id": 79,
            "phrase": "break up (with someone)",
            "definition": "to end a romantic relationship with someone. Tom broke up with Mary and started dating Lisa.  We broke up in March, after an argument."
        },
        {
            "id": 80,
            "phrase": "break wind",
            "definition": "Euph. to expel gas from the anus. Someone in the bus broke wind. It smelled terrible.  He broke wind with an embarrassing noise."
        },
        {
            "id": 81,
            "phrase": "breaking and entering",
            "definition": "the crime of forcing one’s way into a place. (A criminal charge.) _ Wilbur was charged with four counts of breaking and entering.  It was not an act of breaking and entering. The thief just opened the door and walked right in."
        },
        {
            "id": 82,
            "phrase": "the breaking point",
            "definition": "the point at which something will break.  The mule’s back was strained to the breaking point with masses of bundles and straw."
        },
        {
            "id": 83,
            "phrase": "a breath of fresh air",
            "definition": "an influx of air that is not stale or smelly, especially from outdoors.  You look ill, John. What you need is a breath of fresh air."
        },
        {
            "id": 84,
            "phrase": "breathe a sigh of relief",
            "definition": "to sigh in a way that signals one’s relief that something has come to an end.  At the end of the contest, we all breathed a sigh of relief."
        },
        {
            "id": 85,
            "phrase": "breathe down someone’s neck",
            "definition": "1. Fig. to keep close watch on someone; to watch someone’s activities intently. (Alludes to someone standing very close behind a person.) _ I can’t work with you breathing down my neck all the time. Go away.  I will get through my life without your help. Stop breathing down my neck. 2. Fig. [for someone or something] to represent an approaching deadline.  The project deadline is breathing down my neck. The due date for this paper is breathing down my neck."
        },
        {
            "id": 86,
            "phrase": "breathe easy",
            "definition": "to assume a relaxed state after a stressful period. After this crisis is over, I’ll be able to breathe easy again.  He won’t be able to breathe easy until he pays off his debts."
        },
        {
            "id": 87,
            "phrase": "breathe in",
            "definition": "to inhale; to take air into the lungs.  Now, relax and breathe in. Breathe out. Breathe in deeply; enjoy the summer air."
        },
        {
            "id": 88,
            "phrase": "breathe into something",
            "definition": "to exhale into something; to expel one’s breath into something.  I was told to breathe into a tube that was connected to a machine of some type."
        },
        {
            "id": 89,
            "phrase": "breathe one’s last",
            "definition": "Euph. to die.  She breathed her last at about two o’clock that afternoon.  Cradled in his wife’s arms, he breathed his last."
        },
        {
            "id": 90,
            "phrase": "breathe out",
            "definition": "to exhale.  Now, breathe out, then breathe in.  The doctor told me to breathe out slowly."
        },
        {
            "id": 91,
            "phrase": "breathe something in†",
            "definition": "to take something into the lungs, such as air, medicinal vapors, gas, etc. Breathe the vapor in slowly. It will help your cold.  Breathe in that fresh air!"
        },
        {
            "id": 92,
            "phrase": "breathe something into something",
            "definition": "to revive something; to introduce something new or positive into a situation.  Her positive attitude breathed new life into the company.  The project breathed a new spirit into the firm."
        },
        {
            "id": 93,
            "phrase": "breathe something (of something) (to someone)",
            "definition": "to tell something to someone. (Usually in the negative.) _Don’t breathe a word of this to anyone! _I won’t breathe a word!"
        },
        {
            "id": 94,
            "phrase": "breathe something out†",
            "definition": "to exhale something.  At last, he breathed his last breath out, and that was the end.  Breathe out your breath slowly."
        },
        {
            "id": 95,
            "phrase": "breathe (up)on someone or something",
            "definition": "to exhale on someone or something. (Upon is more formal and less commonly used than on.) _Please don’t breathe upon the food.  Don’t breathe on me!"
        },
        {
            "id": 96,
            "phrase": "Breeding will tell.",
            "definition": "Prov. One’s character or lack of it will become known.  From the beginning, he appeared to be courteous, and now he clearly has proven himself to be so. Breeding will tell."
        },
        {
            "id": 97,
            "phrase": "breeze along",
            "definition": "to travel along casually, rapidly, and happily; to go through life in a casual and carefree manner.  Kristine was just breezing along the road when she ran off onto the shoulder. We just breezed along the highway, barely paying attention to what we were doing.  Don’t just breeze along through life!"
        },
        {
            "id": 98,
            "phrase": "breeze away",
            "definition": "to leave quickly or abruptly. She said nothing more. She just breezed away.  I breezed away without stopping to say good-bye."
        },
        {
            "id": 99,
            "phrase": "breeze in(to some place)",
            "definition": "to enter a place quickly, in a happy and carefree manner.  She breezed into the con- ference room and sat down at the head of the table. Jerry breezed in and said hello."
        },
        {
            "id": 100,
            "phrase": "breeze off",
            "definition": "to leave quickly or abruptly. Don’t just breeze off! Stay and talk.  Lily breezed off in a huffy manner."
        },
        {
            "id": 101,
            "phrase": "breeze out (of some place)",
            "definition": "to leave a place quickly. She was here for a moment and then suddenly breezed out.  She breezed out of the room in an instant."
        },
        {
            "id": 102,
            "phrase": "breeze through (something)",
            "definition": "1. Fig. to complete some task rapidly and easily. I breezed through my calculus assignment in no time at all.  It was not hard. I just breezed through. 2. Fig. to travel through a place rapidly.  They breezed through every little town without stopping.  We didn’t stop. We just breezed through."
        },
        {
            "id": 103,
            "phrase": "Brevity is the soul of wit.",
            "definition": "Prov. Jokes and humorous stories are funnier if they are short.  Dale took ten minutes to tell that joke; he obviously doesn’t know that brevity is the soul of wit.  The comedian was in the middle of a long, tedious story when someone in the audience shouted, “Brevity is the soul of wit!”"
        },
        {
            "id": 104,
            "phrase": "brew a plot",
            "definition": "to plot something; to make a plot. The children brewed an evil plot to get revenge on their teacher. We brewed a plot so that we would not have to help with dinner."
        },
        {
            "id": 105,
            "phrase": "brew something up†",
            "definition": "to brew something, as in making coffee or tea. Can somebody brew some coffee up? _ Let me brew up a pot of tea, and then we’ll talk."
        },
        {
            "id": 106,
            "phrase": "brew up",
            "definition": "to build up; [for something] to begin to build and grow. (Typically said of a storm.) _ A bad storm is brewing up in the west.  Something serious is brewing up in the western sky."
        },
        {
            "id": 107,
            "phrase": "bribe someone into doing something",
            "definition": "to pay money to get someone to do something. You can’t bribe me into doing anything! _ Max bribed Lily into leaving early."
        },
        {
            "id": 108,
            "phrase": "brick something up†",
            "definition": "to fill up an opening with bricks.  He bricked the doorway up.  Why did he brick up the opening?"
        },
        {
            "id": 109,
            "phrase": "bricks and mortar",
            "definition": "buildings; the expenditure of money on buildings rather than something else. (The buildings referred to can be constructed out of anything.) _ The new president of the college preferred to invest in new faculty members rather than bricks and mortar. Sometimes people are happy to donate millions of dollars for bricks and mortar, but they never think of the additional cost of annual maintenance."
        },
        {
            "id": 110,
            "phrase": "brick(s)-and-mortar",
            "definition": "[of commercial establishements] based in buildings rather than relying on online sales over the Internet. Many of the dot-com business owners have never been involved in a brick-and-mortar business."
        },
        {
            "id": 111,
            "phrase": "bridge over something",
            "definition": "to make a bridge or passage over something. They bridged over each of the streams as they came to them.  I think we can bridge over this little river in a few days if we work hard."
        },
        {
            "id": 112,
            "phrase": "bridge the gap",
            "definition": "to make a bridge that reaches across a space.  The engineers decided to bridge the gap with a wooden structure."
        },
        {
            "id": 113,
            "phrase": "bridle at someone or something",
            "definition": "to show that one is offended by someone or something.  She bridled at the suggestion that she should go. Tony bridled at Max. Max was going to have to be dealt with."
        },
        {
            "id": 114,
            "phrase": "bright and breezy",
            "definition": "cheery and alert. You look all bright and breezy this morning.  Bright and breezy people on a gloomy day like this make me sick."
        },
        {
            "id": 115,
            "phrase": "bright and early",
            "definition": "very early in the morning or the workday. Yes, I’ll be there bright and early. I want to see you here on time tomorrow, bright and early, or you’re fired!"
        },
        {
            "id": 116,
            "phrase": "*bright as a button",
            "definition": "intelligent; quick-minded. (Usually used to describe children. *Also: as ~.) _ Why, Mrs. Green, your little girl is as bright as a button.  You can’t fool Jane. She may be only six years old, but she’s bright as a button."
        },
        {
            "id": 117,
            "phrase": "*bright as a new pin",
            "definition": "bright and clean; shiny. (*Also: as ~.) _After Joe cleaned the house, it was as bright as a new pin. My kitchen f loor is bright as a new pin since I started using this new f loor wax."
        },
        {
            "id": 118,
            "phrase": "*a bright idea",
            "definition": "a clever thought or new idea. (*Typically: have ~; get ~; give someone ~.) _ Now and then I get a bright idea.  John hardly ever gets a bright idea."
        },
        {
            "id": 119,
            "phrase": "brighten up",
            "definition": "to become brighter; to lighten, especially with sunshine. The sky is brightening up a little. When the morning sky brightens up just a little, the birds begin to sing."
        },
        {
            "id": 120,
            "phrase": "bright-eyed and bushy-tailed",
            "definition": "awake and alert. (Often used ironically, as in the first example. The idea is that one is like a frisky animal, such as a squirrel.) _ Jill: Hi, Jane! How are you on this beautiful morning? Jane: Bright-eyed and bushy-tailed, just as you might expect, since I’ve only had three hours of sleep. Despite the early hour, Dennis was bright-eyed and bushy-tailed."
        },
        {
            "id": 121,
            "phrase": "brimming with something",
            "definition": "full of some kind of happy behavior.  The volunteer workers were brimming with goodwill.  The smiling children were brimming with joy."
        },
        {
            "id": 122,
            "phrase": "bring a charge against someone or something",
            "definition": "to file a complaint against someone or a group; to begin a legal process against someone or a group. (A charge can also be charges even if only one charge is involved.) _ We brought a charge against the town council.  Sam brought charges against Jeff."
        },
        {
            "id": 123,
            "phrase": "bring a dog to heel",
            "definition": "to make a dog heel; to make a dog stand or follow close to one’s heels.  A quiet command from his owner brought Fido to heel."
        },
        {
            "id": 124,
            "phrase": "bring a verdict in†",
            "definition": "[for a jury] to deliver its decision to the court. Do you think they will bring a verdict in today? _ The jury brought in their verdict around midnight."
        },
        {
            "id": 125,
            "phrase": "bring an amount of money in†",
            "definition": "to earn an amount of money; to draw or attract an amount of money.  My part-time job brings fifty dollars in every week.  She brings in a lot of money from her executive’s salary."
        },
        {
            "id": 126,
            "phrase": "bring home the bacon",
            "definition": "to earn a salary; to bring home money earned at a job.  I’ve got to get to work if I’m going to bring home the bacon.  Go out and get a job so you can bring home the bacon."
        },
        {
            "id": 127,
            "phrase": "bring one to one’s senses",
            "definition": "to cause someone to return to normal [after being out of control or irrational]. A gentle slap in the face brought him to his senses.  Liz was brought to her senses quickly."
        },
        {
            "id": 128,
            "phrase": "bring one to oneself",
            "definition": "to cause one to become rational; to cause one to act normal.  A glass of ice water thrown in her face brought Sally to herself.  I was brought to myself by some smelling salts."
        },
        {
            "id": 129,
            "phrase": "bring out the best in someone",
            "definition": "to cause someone to behave in the best manner. This kind of situation doesn’t exactly bring out the best in me.  Good weather brings out the best in me."
        },
        {
            "id": 130,
            "phrase": "bring someone back out",
            "definition": "[for an applauding audience] to succeed in bringing a performer back onto the stage for a curtain call or encore.  They brought her back out about seven times, cheering and applauding.  She was brought back out repeatedly for curtain calls."
        },
        {
            "id": 131,
            "phrase": "bring someone back to reality",
            "definition": "to force someone to face reality.  The rain shower brought her back to reality.  Liz was brought back to reality by a rude shock."
        },
        {
            "id": 132,
            "phrase": "bring someone before someone or something",
            "definition": "to bring a person to an authority, such as a judge, for criticism or discipline.  They brought Terri before the committee for her explanation. I brought you before me to explain your side of the story."
        },
        {
            "id": 133,
            "phrase": "bring someone down†",
            "definition": "to assist or accompany someone from a higher place to a lower place.  Please bring your friends down so I can meet them. She brought down her cousin, who had been taking a nap upstairs.  Aunt Mattie was brought down for supper."
        },
        {
            "id": 134,
            "phrase": "bring someone down to earth",
            "definition": "to help someone face reality; to help someone who is euphoric become more realistic.  The events helped bring us all down to earth. I hate to be the one to bring you down to earth, but things aren’t as good as you think."
        },
        {
            "id": 135,
            "phrase": "bring someone in† (on something)",
            "definition": "to include someone in some deed or activity.  I’m going to have to bring a specialist in on this.  Please bring in several specialists to advise on this case.  Let’s bring an expert in before we go any further."
        },
        {
            "id": 136,
            "phrase": "bring someone into the world",
            "definition": "to deliver a baby; to attend the birth of someone.  The doctor who brought me into the world died last week.  I was brought into the world by a kindly old doctor."
        },
        {
            "id": 137,
            "phrase": "bring someone on†",
            "definition": "to bring someone out onto the stage.  Now, for the next act, I’m going to bring a chorus on, and I’m sure you’ll love them.  Bring on the clowns!"
        },
        {
            "id": 138,
            "phrase": "bring someone or something along† (to something)",
            "definition": "to bring someone or something with one to some event.  I brought my uncle along to the party.  Please bring along your camera to the show."
        },
        {
            "id": 139,
            "phrase": "bring someone or something back†",
            "definition": "to make someone or something return. Would you please bring the child back? _ Bring back my child!"
        },
        {
            "id": 140,
            "phrase": "bring someone or something forth†",
            "definition": "to present or produce someone or something.  Bring the roast turkey forth! _ Bring forth the roast turkey!"
        },
        {
            "id": 141,
            "phrase": "bring someone or something forward",
            "definition": "to introduce someone or something; to move someone or something into a more visible position.  Please bring him forward so that we can examine him.  Please bring your chair forward so I can see you."
        },
        {
            "id": 142,
            "phrase": "bring someone or something into action",
            "definition": "to activate someone or something; to cause someone or something to bring someone or something into contact with someone 64 function as intended. The threats brought the police into action.  A kick in the side brought the television set into action."
        },
        {
            "id": 143,
            "phrase": "bring someone or something into contact with someone or something",
            "definition": "to cause things or people to touch or associate with one another.  She hasn’t been the same since I brought her into contact with the child who had chicken pox.  Don’t bring your hand in contact with the poison ivy.  Don’t bring him into contact with Fred."
        },
        {
            "id": 144,
            "phrase": "bring someone or something into disrepute",
            "definition": "to dishonor or discredit someone or something.  This embarrassing incident will bring the entire committee into disrepute.  My bankruptcy brought me into disrepute."
        },
        {
            "id": 145,
            "phrase": "bring someone or something into line (with someone or something)",
            "definition": "to make someone or something even with someone or something.  I brought the books into line with the others on the shelf. I brought Jimmy into line with the other scouts."
        },
        {
            "id": 146,
            "phrase": "bring someone or something into prominence",
            "definition": "to cause someone or something to become famous or renowned.  The award brought Mike into national prominence.  The current national need for engineers brought our school into prominence.  A terrible scandal brought Lily into prominence."
        },
        {
            "id": 147,
            "phrase": "bring someone or something into view",
            "definition": "to cause someone or something to be seen or to be visible.  A bright light brought the sleeping cattle into view.  Please bring your child into view."
        },
        {
            "id": 148,
            "phrase": "bring someone or something out in droves",
            "definition": "to lure or draw out people or other animals in great number. The availability of free drinks brought people out in droves.  The fresh grass sprouts brought the deer out in droves."
        },
        {
            "id": 149,
            "phrase": "bring someone or something to a halt",
            "definition": "to cause someone or something to stop immediately.  The explosion brought the lecture to a halt.  I brought the visitor to a halt at the front gate."
        },
        {
            "id": 150,
            "phrase": "bring someone or something to life",
            "definition": "to give vigor or vitality to someone or something; to reactivate someone or something.  A little singing and dancing would have brought the play to life.  Some coffee will bring you to life."
        },
        {
            "id": 151,
            "phrase": "bring someone or something to light",
            "definition": "to present or reveal someone or something to the public.  The newspaper someone or something story brought the problem to light.  I have brought some interesting facts to light in my article."
        },
        {
            "id": 152,
            "phrase": "bring someone or something to someone’s attention",
            "definition": "to make someone aware of someone or something. Thank you for bringing this to my attention.  I am grateful for your bringing her to my attention."
        },
        {
            "id": 153,
            "phrase": "bring someone or something to trial",
            "definition": "to bring a crime or a criminal into court for a trial.  At last, the thugs were brought to trial. We brought the case to trial a week later."
        },
        {
            "id": 154,
            "phrase": "bring someone or something under one’s control",
            "definition": "to achieve dominion over someone or something. The dictator was at last able to bring the army under his control.  Harry could not bring Ron under his control.  Walter could not be brought under Lily’s control."
        },
        {
            "id": 155,
            "phrase": "bring someone or something under someone or something",
            "definition": "to assign someone or something to someone or something; to put someone or something under the management of someone or something.  I had David brought under me, so I could keep an eye on his day-to-day work.  David was brought under my jurisdiction."
        },
        {
            "id": 156,
            "phrase": "bring someone or something up†",
            "definition": "to cause someone or something to go up with one from a lower place to a higher place. We brought them up and let them view the city from the balcony. Why did you bring up Tom? Wasn’t he comfortable down there?"
        },
        {
            "id": 157,
            "phrase": "bring someone or something up to something",
            "definition": "to raise someone or something to a particular standard, level, expectation, etc.  What do I have to do to bring Billy up to grade level? _ The lab was brought up to standards quickly."
        },
        {
            "id": 158,
            "phrase": "bring someone or something up-to-date",
            "definition": "to modernize someone or something. We brought the room up-to-date with a little paint and some modern furniture. I can bring you up-to-date with a new hairdo."
        },
        {
            "id": 159,
            "phrase": "bring someone or something within range (of someone or something)",
            "definition": "to cause someone or something to be in someone’s or something’s [gun] sights.  Don’t bring the hunters within range of the farmer’s gun sights.  The bait brought the geese within range of Jeff and his friends."
        },
        {
            "id": 160,
            "phrase": "bring someone out (on something)",
            "definition": "to make someone come onto the stage from the stage sides or wings.  Let’s applaud loudly and bring her out on stage again.  Lily was brought out on stage by the applause."
        },
        {
            "id": 161,
            "phrase": "bring someone over† from some place",
            "definition": "to bring someone from a place, from nearby, or from a great distance.  They brought over the neighbors from across the street.  A soprano was brought over from Moscow."
        },
        {
            "id": 162,
            "phrase": "bring someone over† ((to) some place)",
            "definition": "to bring a person for a visit to some place.  Why don’t you bring her over to our place for a visit? _ You should bring over your girlfriend for a visit."
        },
        {
            "id": 163,
            "phrase": "bring someone over† to something",
            "definition": "to bring someone for a visit and a meal or other event.  Please bring your friend over to dinner sometime.  I want to bring over my husband sometime."
        },
        {
            "id": 164,
            "phrase": "bring someone through something",
            "definition": "to help someone endure something, such as a disease, an emotional upset, or a stressful period.  The doctor brought Tom through the sickness.  Liz was brought through the ordeal by her friends."
        },
        {
            "id": 165,
            "phrase": "bring someone to",
            "definition": "to help someone return to consciousness.  We worked to bring him to before he went into shock.  He was finally brought to by the smelling salts."
        },
        {
            "id": 166,
            "phrase": "bring someone to a boil",
            "definition": "to make someone very angry. This really brought her to a boil. She was fit to be tied.  Lily was really brought to a boil by the news."
        },
        {
            "id": 167,
            "phrase": "bring someone to account",
            "definition": "to confront someone with a record of misdeeds and errors. The committee decided to bring Martha to account.  Martha was brought to account by the committee."
        },
        {
            "id": 168,
            "phrase": "bring someone to do something",
            "definition": "to cause someone to do something; to encourage someone to do something.  What brought you to do this? _ I was brought to do this by a guilty conscience."
        },
        {
            "id": 169,
            "phrase": "bring someone to heel",
            "definition": "to cause someone to act in a disciplined fashion; to force someone to act in a more disciplined manner. She tried to bring her husband to heel, but he had a mind of his own.  He was brought to heel by his demanding wife."
        },
        {
            "id": 170,
            "phrase": "bring someone to justice",
            "definition": "to punish someone for a crime.  The police officer swore she would not rest until she had brought the killer to justice. Years later, the rapist was found out and finally brought to justice."
        },
        {
            "id": 171,
            "phrase": "bring someone together",
            "definition": "to cause people to gather into a group.  He brought everyone together in the drawing room.  They were brought together in a large conference room."
        },
        {
            "id": 172,
            "phrase": "bring someone up† for something",
            "definition": "1. to suggest someone’s name for something.  I would like to bring Beth up for vice president.  I will bring up Beth for this office if you don’t. 2. to put someone’s name up for promotion, review, discipline, etc. We brought Tom up for promotion. The boss brought up Tom, too."
        },
        {
            "id": 173,
            "phrase": "bring someone up† on something",
            "definition": "to provide something while raising a child to adulthood. She brought her children up on fast food.  You shouldn’t bring up your children on that kind of entertainment!"
        },
        {
            "id": 174,
            "phrase": "bring someone up-to-date (on someone or something)",
            "definition": "to inform someone of the latest information about something.  Let me bring you up-to-date on what is happening in the village.  Please bring me up-to-date."
        },
        {
            "id": 175,
            "phrase": "bring something about†",
            "definition": "to make something happen.  Is she clever enough to bring it about? _Oh, yes, she can bring about anything she wants."
        },
        {
            "id": 176,
            "phrase": "bring something all together",
            "definition": "to organize something; to coordinate something or some event.  The party was a great success. Janet was the one who brought it all together. It was a difficult conference to organize, but Sam brought it all together."
        },
        {
            "id": 177,
            "phrase": "bring something around† (to someone or something)",
            "definition": "1. to move something, such as a vehicle, from one place to another, especially so it can be used.  Would you kindly have James bring the car around? _Tony will bring around the car to us. 2. to distribute something to someone or a group. (Said by a person who intends to receive what is brought.) _ Please bring the snacks around to us.  Carl is bringing around the snacks to us."
        },
        {
            "id": 178,
            "phrase": "bring something away† (from something)",
            "definition": "1. to come away from some event with some important insight or information.  I brought some valuable advice away from the lecture. She brought away some valuable advice from the meeting. 2. to move something away from something. (A request to move something away from something and toward the requester.) _ Bring the pitcher of water away from the fireplace.  Bring away the pitcher from the fireplace when you get up."
        },
        {
            "id": 179,
            "phrase": "bring something back†",
            "definition": "to restore an earlier style or practice.  Please bring the good old days back.  Bring back good times for all of us."
        },
        {
            "id": 180,
            "phrase": "bring something back to life",
            "definition": "to restore vitality to something, such as a performance, a story, etc.  The third act of the play had a clever twist that brought the whole drama back to life."
        },
        {
            "id": 181,
            "phrase": "bring something back† (to someone)",
            "definition": "to remind someone of something.  The funeral brought memories back.  The warm winds brought back the old feeling of loneliness that I had experienced so many times in the tropics."
        },
        {
            "id": 182,
            "phrase": "bring something before someone or something",
            "definition": "to bring a matter to the attention of someone or a group. I wanted to bring this matter before you before it got any worse.  I will have to bring this matter before the committee."
        },
        {
            "id": 183,
            "phrase": "bring something crashing down (around one)",
            "definition": "to cause a structure to collapse and fall (on oneself ).  He hit the tent pole and brought the tent crashing down.  When she removed the last vertical board, she brought the shed crashing down around her."
        },
        {
            "id": 184,
            "phrase": "bring something down†",
            "definition": "to move something from a higher place to a lower place.  Bring that box down, please.  And while you’re up there, please bring down the box marked “winter clothing.”"
        },
        {
            "id": 185,
            "phrase": "bring something down† on one(‘s head)",
            "definition": "to cause something to fall onto one’s head.  He jarred the shelves and all the books were brought down on his head.  When he hit the wall of the hut, he brought down the roof on himself."
        },
        {
            "id": 186,
            "phrase": "bring something down to something",
            "definition": "to make a concept simpler to understand by bringing it to a simpler level of understanding. Why don’t you bring all this down to my level? _ Everything was brought down to the child’s level."
        },
        {
            "id": 187,
            "phrase": "bring something home to someone",
            "definition": "to return home with a gift for someone.  I brought a box of candy home to the children.  The candy was brought home to Lily by Ken."
        },
        {
            "id": 188,
            "phrase": "bring something into being",
            "definition": "to cause something to be; to create something.  How can I bring my new scheme into being? _ The new scheme was brought into being by a lot of hard work."
        },
        {
            "id": 189,
            "phrase": "bring something into blossom",
            "definition": "to make a plant or tree bloom.  The special plant food brought the rosebush into blossom. The roses were brought into blossom by the lovely weather."
        },
        {
            "id": 190,
            "phrase": "bring something into focus",
            "definition": "to make something seen through lenses sharply visible. I adjusted the binoculars until I brought the bird sharply into focus. The flowers were brought into focus by adjusting the controls."
        },
        {
            "id": 191,
            "phrase": "bring something into play",
            "definition": "[in a ball game] to put the ball into the action of the game, such as after a timeout.  Fred brought the ball into play when he bounced it in from the sidelines."
        },
        {
            "id": 192,
            "phrase": "bring something into question",
            "definition": "to cause something to be doubted; to cause something to be questioned.  What you have just told me seems to bring the wisdom of the trip into question.  Your presence here has been brought into question."
        },
        {
            "id": 193,
            "phrase": "bring something into service",
            "definition": "to begin to use something; to start something up.  They are bringing a much larger boat into service next month.  A newer machine will be brought into service next year."
        },
        {
            "id": 194,
            "phrase": "bring something off†",
            "definition": "to cause something to happen; to carry out a plan successfully. Do you think you can bring it off ? _ She brought off her plan without a hitch!"
        },
        {
            "id": 195,
            "phrase": "bring something on†",
            "definition": "1. to cause something to happen; to cause a situation to occur.  What brought this event on? _ What brought on this catastrophe? 2. to cause a case or an attack of a disease.  What brought on your coughing fit? _ Something in the air brought it on."
        },
        {
            "id": 196,
            "phrase": "bring something on someone",
            "definition": "to cause something to go wrong for someone.  You brought it on yourself. Don’t complain.  Max brought this problem on all of us."
        },
        {
            "id": 197,
            "phrase": "bring something out†",
            "definition": "to issue something; to publish something; to present something [to the public].  I am bringing a new book out.  I hear you have brought out a new edition of your book. "
        },
        {
            "id": 198,
            "phrase": "bring something out† (in someone)",
            "definition": "to cause a particular quality to be displayed by a person, such as virtue, courage, a mean streak, selfishness, etc.  You bring the best out in me.  This kind of thing brings out the worst in me."
        },
        {
            "id": 199,
            "phrase": "bring something out of mothballs",
            "definition": "to bring something out of storage and into use; to restore something to active service. They were going to bring a number of ships out of mothballs, but the war ended before they needed them."
        },
        {
            "id": 200,
            "phrase": "bring something to a boil",
            "definition": "to heat liquid to its boiling point; to make something boil.  First, you must bring the soup to a boil."
        },
        {
            "id": 201,
            "phrase": "bring something to a dead end",
            "definition": "to cause something to reach a point from which it can go no further. The accident brought the project to a dead end.  The study was brought to a dead end by the loss of federal funding."
        },
        {
            "id": 202,
            "phrase": "bring something to a head",
            "definition": "to cause something to come to the point when a decision has to be made or action taken. The latest disagreement between management and the union has brought matters to a head. There will be an all-out strike now.  It’s a relief that things have been brought to a head. The disputes have been going on for months."
        },
        {
            "id": 203,
            "phrase": "bring something to a standstill",
            "definition": "to cause a process or a job to reach a point at which it must stop.  The accident brought the work to a standstill.  The strike brought construction to a standstill."
        },
        {
            "id": 204,
            "phrase": "bring something to a successful conclusion",
            "definition": "to complete something successfully. They brought the battle to a successful conclusion.  The case was brought to a successful conclusion by the prosecutor."
        },
        {
            "id": 205,
            "phrase": "bring something to fruition",
            "definition": "to make something come into being; to achieve a success.  Do you think you can bring this plan to fruition? _ The plan was brought to fruition by the efforts of everyone."
        },
        {
            "id": 206,
            "phrase": "bring something to light",
            "definition": "to make something known. The scientists brought their findings to light. We must bring this new evidence to light."
        },
        {
            "id": 207,
            "phrase": "bring something to rest",
            "definition": "to cause a machine, vehicle, or process to stop.  Jill brought the car to rest against the curb.  The car was brought to rest against the curb."
        },
        {
            "id": 208,
            "phrase": "bring something to someone’s aid",
            "definition": "to bring something with which to help someone. The officer brought medical supplies to our aid. An ambulance was brought to the injured man’s aid."
        },
        {
            "id": 209,
            "phrase": "bring something to someone’s attention",
            "definition": "to make someone aware of something; to mention or show something to someone.  I would like to bring this problem to your attention.  If there is something I should know about, please bring it to my attention."
        },
        {
            "id": 210,
            "phrase": "bring something to the fore",
            "definition": "to move something forward; to make something more prominent or noticeable.  All the talk about costs brought the question of budgets to the fore. The question of budget planning was brought to the fore."
        },
        {
            "id": 211,
            "phrase": "bring something together†",
            "definition": "to assemble things; to gather things together.  Thank you for bringing everything together so we can begin work.  We brought together all the tools that we needed."
        },
        {
            "id": 212,
            "phrase": "bring something up†",
            "definition": "to vomit something up; to cough something up.  See if you can get him to bring the penny up.  I did, and he brought up a nickel instead!"
        },
        {
            "id": 213,
            "phrase": "bring something (up)on oneself",
            "definition": "to be the cause of one’s own trouble. (Upon is more formal and less commonly used than on.) _ It’s your own fault. You brought it upon yourself.  You brought it all on yourself."
        },
        {
            "id": 214,
            "phrase": "bring something with",
            "definition": "(Inf. or regional.) to carry something along with [oneself].  Are you going to bring your umbrella with? _ I brought it with. Don’t worry."
        },
        {
            "id": 215,
            "phrase": "bring something within a range",
            "definition": "to adjust something into a particular range; to adjust a parameter.  Let’s try to bring your cholesterol within the normal range with diet.  It was brought within the normal range by an expensive drug."
        },
        {
            "id": 216,
            "phrase": "bring the house down†",
            "definition": "to cause a house to collapse. The most severe earthquake in years finally brought the house down.  The earthquake brought down all the houses on the hillside."
        },
        {
            "id": 217,
            "phrase": "bring up the rear",
            "definition": "to move along behind everyone else; to be at the end of the line. (Originally referred to marching soldiers. Fixed order.) _Here comes John, bringing up the rear.  Hurry up, Tom! Why are you always bringing up the rear?"
        },
        {
            "id": 218,
            "phrase": "bristle at something",
            "definition": "to show sudden anger or other negative response to something. (Alludes to a dog or cat raising the hair on its back in anger or as a threat.) _ She bristled at the suggestion.  I knew Lily would bristle at the appearance of Max."
        },
        {
            "id": 219,
            "phrase": "*broad as a barn door",
            "definition": "very broad or wide. (*Also: as ~.) _ Jim’s backside is as broad as a barn door.  The weight lifter’s chest is broad as a barn door."
        },
        {
            "id": 220,
            "phrase": "broad in the beam",
            "definition": "[of a ship] wide at amidships.  This old tub is broad in the beam and sits like a ball in the water, but I love her."
        },
        {
            "id": 221,
            "phrase": "broaden out",
            "definition": "to become wider; to expand.  The river broadened out and became deeper.  The road broadens out here."
        },
        {
            "id": 222,
            "phrase": "broaden something out†",
            "definition": "to make something wider; to expand something.  Now, broaden this part out a little, so it looks like a cloud, not a painted pillow. Broaden out the river in your painting so it looks very wide.  The photographic view of the valley can be broadened out by using a different lens."
        },
        {
            "id": 223,
            "phrase": "broken dreams",
            "definition": "wishes or desires that cannot be fulfilled.  We all have our share of broken dreams, but they were never all meant to come true anyway."
        },
        {
            "id": 224,
            "phrase": "a broken reed",
            "definition": "an unreliable or undependable person. (On the image of a useless, broken reed in a reed instrument.) _You can’t rely on Jim’s support. He’s a broken reed. Mr. Smith is a broken reed. His deputy has to make all the decisions."
        },
        {
            "id": 225,
            "phrase": "browbeat someone into something",
            "definition": "to bully or intimidate someone into something.  It won’t do any good to try to browbeat me into it.  I was browbeaten into doing it once. I refuse to do it again."
        },
        {
            "id": 226,
            "phrase": "*brown as a berry",
            "definition": "very brown from the sun; quite suntanned. (*Also: as ~.) _ She was out in the sun so much that she became as brown as a berry."
        },
        {
            "id": 227,
            "phrase": "brown out",
            "definition": "[for the electricity] to diminish in power and dim the lights, causing a brownout. (Something less than a blackout, when there is no power.) _ The power kept browning out.  The lights started to brown out, and I thought maybe there was a power shortage."
        },
        {
            "id": 228,
            "phrase": "brown someone off†",
            "definition": "Sl. to make someone angry.  You really brown me off!"
        },
        {
            "id": 229,
            "phrase": "browned (off )",
            "definition": "Sl. angry. I am really browned off at you! _ The boss really got browned—to say the least; he fired me!"
        },
        {
            "id": 230,
            "phrase": "browse among something",
            "definition": "1. [for an animal] to wander about among plants and trees, selecting and eating some. The deer were browsing among the vegetables in my garden.  The cows were browsing among the grasses in the field. 2. [for someone] to look at or survey different items of reading material.  I browsed among the books on the rack until I found what I wanted.  I browsed among the books for something suitable."
        },
        {
            "id": 231,
            "phrase": "browse on something",
            "definition": "[for an animal] to feed on some kind of plant material. The deer browsed on the tender shoots in my garden.  The rabbit browsed on my carrots."
        },
        {
            "id": 232,
            "phrase": "bruit something about",
            "definition": "to spread a rumor around; to gossip something around.  You really shouldn’t bruit that incident about, you know.  The story was bruited about all over the office."
        },
        {
            "id": 233,
            "phrase": "brush over someone or something",
            "definition": "to deal lightly with an important person or matter; to just barely mention someone or something.  I want to hear more. You only brushed over the part I was interested in.  You only brushed over the bit about your girlfriend. Tell us more about her."
        },
        {
            "id": 234,
            "phrase": "brush someone off†",
            "definition": "to remove something, such as dust or lint, from someone by brushing.  The bathroom attendant brushed Mr. Harris off and was rewarded with a small tip. The porter had never brushed off such a miserly man before."
        },
        {
            "id": 235,
            "phrase": "brush someone or something aside†",
            "definition": "to push or shove someone or something out of the way.  Don’t just brush me aside. I almost fell over.  I brushed aside the branch, not realizing it was poison ivy."
        },
        {
            "id": 236,
            "phrase": "brush something away† (from something)",
            "definition": "to remove something from something by brushing; to get dirt or crumbs off something by brushing.  He brushed a bit of lint away from Tom’s collar. She brushed away the crumbs from the table."
        },
        {
            "id": 237,
            "phrase": "brush something down†",
            "definition": "to clean and groom fur or fabric by brushing.  Why don’t you brush your coat down? It’s very linty.  I brushed down my trousers, and they looked much better."
        },
        {
            "id": 238,
            "phrase": "brush something up†",
            "definition": "to improve one’s knowledge of something or one’s ability to do something.  I need to brush my French up a little bit.  I need to brush up my French."
        },
        {
            "id": 239,
            "phrase": "brush (up) against someone or something",
            "definition": "to touch someone or something lightly in passing. I brushed up against the freshly painted wall as I passed.  I guess I brushed against Walter as I walked by."
        },
        {
            "id": 240,
            "phrase": "brush up (on something)",
            "definition": "to improve one’s knowledge of something or one’s ability to do something.  I need to brush up on my German. My German is weak. I had better brush up."
        },
        {
            "id": 241,
            "phrase": "a brush with death",
            "definition": "an instance of nearly dying.  After a brush with death, Claire seemed more friendly and outgoing."
        },
        {
            "id": 242,
            "phrase": "*the brush-off",
            "definition": "rejection; being cast aside and ignored. (*Typically: get ~; give someone ~.) _ Don’t talk to Tom. He’ll just give you the brush-off.  I went up to her and asked for a date, but I got the brush-off."
        },
        {
            "id": 243,
            "phrase": "bubble over",
            "definition": "[for boiling or effervescent liquid] to spill or splatter over the edge of its container.  The pot bubbled over and put out the f lame on the stove. The stew bubbled over."
        },
        {
            "id": 244,
            "phrase": "bubble up (through something)",
            "definition": "[for a liquid] to seep up or well up through something, such as from between rocks, through a crack in the floor, or through a hole in the bottom of a boat.  The water bubbled up through a crack in the basement f loor."
        },
        {
            "id": 245,
            "phrase": "buck for something",
            "definition": "Sl. to work ambitiously for something, such as a promotion.  I’m just bucking for recognition and, of course, a 20 percent raise.  You can tell by her attention to the boss that she’s bucking for promotion."
        },
        {
            "id": 246,
            "phrase": "buck someone off†",
            "definition": "[for a horse or similar animal] to rear up in an attempt to shake off its rider.  The horse tried to buck Sharon off, but she held on tight.  The horse bucked off its rider."
        },
        {
            "id": 247,
            "phrase": "The buck stops here.",
            "definition": "The need to act or take responsibility, that other people pass on to still other people, ulti- mately ends up here. (An expression made famous by U.S. President Harry Truman, about the finality of decisions a president must make. See also pass the buck.) _ After everyone else has avoided making the decision, I will have to do it. The buck stops here."
        },
        {
            "id": 248,
            "phrase": "buck up",
            "definition": "to cheer up; to perk up. Come on, now, buck up. Things can’t be all that bad.  She began to buck up when I showed her the results of the tests."
        },
        {
            "id": 249,
            "phrase": "buckle down (to something)",
            "definition": "to settle down to something; to begin to work seriously at something.  If you don’t buckle down to your job, you’ll be fired.  You had better buckle down and get busy."
        }
    ]
}