{
    "dictionary": [
        {
            "id": 0,
            "phrase": "So long.",
            "definition": "Good-bye. So long, see ya later. It’s been good talking to you. So long."
        },
        {
            "id": 1,
            "phrase": "so mad I could scream",
            "definition": "very mad.  I am just so mad I could scream! Why is he such a jerk? _ She makes me so mad I could scream."
        },
        {
            "id": 2,
            "phrase": "So many countries, so many customs.",
            "definition": "Prov. People in different countries have different ways of behaving.  In the last place I visited, it was considered rude to put your hands on the table at dinner, but here, it’s rude to keep them under the table. So many countries, so many customs."
        },
        {
            "id": 3,
            "phrase": "so much for someone or something",
            "definition": "that is the last of someone or something; there is no need to consider someone or something anymore.  It just started raining. So much for our picnic this afternoon.  So much for John. He just called in sick and can’t come to work today."
        },
        {
            "id": 4,
            "phrase": "So much for that.",
            "definition": "That is the end of that.; We will not be dealing with that anymore.  John tossed the stub of a pencil into the trash. “So much for that,” he muttered, fishing through his drawer for another.  Mother: Here, try some carrots. Child (brushing the spoon aside): No! No! Mother: Well, so much for that."
        },
        {
            "id": 5,
            "phrase": "so much the better",
            "definition": "even better; all to the better. Please come to the picnic. If you can bring a salad, so much the better.  The f lowers look lovely on the shelf. It would be so much the better if you put them on the table."
        },
        {
            "id": 6,
            "phrase": "So’s your old man!",
            "definition": "Inf. The same to you!; Drop dead! (Old. A catch phrase indicating basic disagreement or hostility.) _Bill: You’re acting like an idiot! Tom: So’s your old man! _ I don’t know what you said, but so’s your old man!"
        },
        {
            "id": 7,
            "phrase": "so soon",
            "definition": "early; before the regular time; ahead of schedule.  I got there early because my bus arrived so soon.  Because the meeting ended so soon, I had some extra time."
        },
        {
            "id": 8,
            "phrase": "So, sue me.",
            "definition": "If you are so angry, why don’t go ahead and sue me. (A rude way of brushing off an angry person.) _ A: You ran into my car! You didn’t even look where you were going! B: So, sue me."
        },
        {
            "id": 9,
            "phrase": "so to speak",
            "definition": "as one might say; said a certain way, even though the words are not exactly accurate.  John helps me with my taxes. He’s my accountant, so to speak. I just love my little poodle. She’s my baby, so to speak."
        },
        {
            "id": 10,
            "phrase": "(So) what else is new?",
            "definition": "Inf. This isn’t new. It has happened before; Not this again.  Mary: Taxes are going up again. Bob: So what else is new? _ John: Gee, my pants are getting tight. Maybe I’m putting on a little weight. Sally: What else is new?"
        },
        {
            "id": 11,
            "phrase": "soak in(to something)",
            "definition": "[for moisture] to penetrate something.  The rain soaked into the parched ground as fast as it fell.  I’m glad it soaked in. I was afraid it would run off."
        },
        {
            "id": 12,
            "phrase": "soak one’s face",
            "definition": "Sl. to drink heavily.  They’re down at the tavern soaking their faces. Well, I guess I’ll go soak my face in a few beers."
        },
        {
            "id": 13,
            "phrase": "soak someone or something with something",
            "definition": "to get someone or something thoroughly wet with some liquid. The rain soaked us all with icy cold drops of water.  The storm soaked the land with much-needed moisture."
        },
        {
            "id": 14,
            "phrase": "soak someone to the skin",
            "definition": "[for water, rain, or other liquid] to work its way through someone’s clothing to the skin.  The storm soaked us all to the skin.  She soaked herself to the skin in the storm."
        },
        {
            "id": 15,
            "phrase": "soak something in something",
            "definition": "to leave something immersed in a liquid, intending for it to be absorbed.  Soak your feet in Epsom salts to make them feel better. I had to soak my elbow in ice water to take down the swelling."
        },
        {
            "id": 16,
            "phrase": "soak something up†",
            "definition": "to gather up moisture or a liquid, using an absorbent cloth, paper, etc.  Alice soaked the spill up with a sponge. She soaked up the spilled milk."
        },
        {
            "id": 17,
            "phrase": "soak through something",
            "definition": "[for liquid] to work its way through something, such as cloth or paper. Please wipe up that mess before it soaks through the tablecloth. It’s too late. The grape juice has soaked through the carpet into the mat."
        },
        {
            "id": 18,
            "phrase": "soaked to the skin",
            "definition": "wet clear through one’s clothing to the skin.  I was caught in the rain and got soaked to the skin.  Oh, come in and dry off! You must be soaked to the skin."
        },
        {
            "id": 19,
            "phrase": "so-and-so",
            "definition": "a despised person. (This expression is used in place of other very insulting terms. Often modified, as in the examples.) _You dirty so-and-so! I can’t stand you! _ Don’t you call me a so-and-so, you creep!"
        },
        {
            "id": 20,
            "phrase": "soap someone or something down†",
            "definition": "to cover someone or something thoroughly with soap or suds. Mother soaped Timmy down and rinsed him off in warm water.  She soaped down the f loor."
        },
        {
            "id": 21,
            "phrase": "sob oneself to sleep",
            "definition": "to cry until one falls asleep.  He sobbed himself to sleep for days after his grandpa died.  The child sobbed himself to sleep night after night."
        },
        {
            "id": 22,
            "phrase": "sob something out†",
            "definition": "to speak something out while sobbing.  Wally sobbed his story out while the police made notes.  He sobbed out his sad tale."
        },
        {
            "id": 23,
            "phrase": "sob something to someone",
            "definition": "to cry and tell one’s troubles to someone. He is always sobbing his sad tale to anyone who will listen.  Timmy sobbed his story to the teacher."
        },
        {
            "id": 24,
            "phrase": "sob story",
            "definition": "a sad story that is likely to draw tears. I’ve heard nothing but sob stories today. Isn’t anybody happy? _ She had quite a sob story, and I listened to the whole thing."
        },
        {
            "id": 25,
            "phrase": "*sober as a judge",
            "definition": "1. Cliché very formal, somber, or stuffy. (*Also: as ~.) _ You certainly look gloomy, Bill. You’re sober as a judge.  Tom’s as sober as a judge. I think he’s angry. 2. Cliché not drunk; alert and completely sober. (*Also: as ~.) _John’s drunk? No, he’s as sober as a judge.  You should be sober as a judge when you drive a car."
        },
        {
            "id": 26,
            "phrase": "sober someone up†",
            "definition": "to take actions that will cause a drunken person to become sober.  Some coffee ought to sober him up. He tried to sober himself up because he had to drive home.  They tried to sober up the guys who had been out all night."
        },
        {
            "id": 27,
            "phrase": "sober up",
            "definition": "to recover from alcohol or drug intoxication.  Barlowe had one hour to sober up and get to the station.  It took him a while to sober up."
        },
        {
            "id": 28,
            "phrase": "sock it to someone",
            "definition": "1. to punch someone; to punch one’s fist at someone.  Max really socked it to Lefty! _ Lefty socked it to Roger and knocked him down. 2. to tell bad news to someone in a straightforward manner.  I can take it. Sock it to me! _ I don’t care how bad it seems. Sock it to me!"
        },
        {
            "id": 29,
            "phrase": "sock someone or something in†",
            "definition": "[for fog] to cause someone or something to remain in place.  The heavy fog socked us in for six hours.  The fog socked in the airport for an hour."
        },
        {
            "id": 30,
            "phrase": "sock something away†",
            "definition": "to place something, such as money, into reserve; to store something in a secure place.  I try to sock a little money away each month for my vacation.  I will sock away some money."
        },
        {
            "id": 31,
            "phrase": "socked in",
            "definition": "fogged in.  The airport was completely socked in.  We couldn’t take off because we were socked in."
        },
        {
            "id": 32,
            "phrase": "A soft answer turneth away wrath.",
            "definition": "Prov. If you speak softly and meekly to someone who is angry with you, that person will calm down. (Biblical.) _ It won’t do any good for you to yell at John because he yelled at you. Remember that a soft answer turneth away wrath."
        },
        {
            "id": 33,
            "phrase": "soft in the head",
            "definition": "stupid; witless.  George is just soft in the head. He’ll never get away with his little plan.  You’re soft in the head if you think I’ll go along with that."
        },
        {
            "id": 34,
            "phrase": "*soft on someone",
            "definition": "1. Fig. romantically attracted to someone. (*Typically: be ~; get ~.) _Fred is soft on Martha, I’ve heard.  He looked like he was getting a little soft on Sally. 2. Fig. not severe enough on someone; too easy on someone or a class of people. (*Typically: be ~; get ~; grow ~.) _ The judge was viewed as being too soft on drug pushers.  The cops are soft on speeders in this town."
        },
        {
            "id": 35,
            "phrase": "soft sell",
            "definition": "a polite attempt to sell something; a very gentle sales pitch.  Some people won’t bother listening to a soft sell. You gotta let them know you believe in what you are selling.  I tried the soft sell, but that didn’t work."
        },
        {
            "id": 36,
            "phrase": "soft soap",
            "definition": "1. flattering talk; sweet talk.  I don’t mind a little soft soap. It won’t affect what I decide, though. Don’t waste my time with soft soap. I know you don’t mean it. 2. (Usually soft-soap.) to attempt to convince someone (of something) by gentle persuasion.  We couldn’t softsoap her into it.  Don’t try to soft-soap her. She’s an old battle-ax."
        },
        {
            "id": 37,
            "phrase": "soft touch",
            "definition": "1. a gentle way of handling someone or something.  Bess has a soft touch and can bring both sides together. Kelly lacks the kind of soft touch needed for this kind of negotiation. 2. a gullible person; a likely victim of a scheme.  John is a soft touch. You can always ask him for a few bucks. Here comes the perfect soft touch—a nerd with a gleam in his eye."
        },
        {
            "id": 38,
            "phrase": "soften one’s stance (on someone or something)",
            "definition": "to reduce the severity of one’s position regarding someone or something.  If he would soften his stance on the matter, I could easily become more cooperative."
        },
        {
            "id": 39,
            "phrase": "soften someone up†",
            "definition": "to prepare to persuade someone of something.  I will talk to Fred and soften him up for your request.  I will soften up your father before you ask him about it."
        },
        {
            "id": 40,
            "phrase": "soften something up†",
            "definition": "to take actions that will make something softer. Soften the butter up before you add it to the batter.  Please soften up the ice cream before you try to serve it."
        },
        {
            "id": 41,
            "phrase": "soften up",
            "definition": "[for something] to become softer. The butter softened up in the heat of the day.  The candles will probably soften up and bend over in this hot weather."
        },
        {
            "id": 42,
            "phrase": "soft-pedal something",
            "definition": "to play something down; to deemphasize something. (Alludes to the soft pedal on the piano, which reduces the volume.) _Try to soft-pedal the problems we have with the cooling system.  I won’t softpedal anything. Everyone must know the truth."
        },
        {
            "id": 43,
            "phrase": "soil one’s diaper(s)",
            "definition": "[for a baby] to excrete waste into its diaper. The baby soiled his diapers. I detect that someone has soiled his diaper."
        },
        {
            "id": 44,
            "phrase": "sold on someone or something",
            "definition": "convinced of the value of someone or something. I’m not yet sold on your idea.  The crowd was sold on Gary. Nothing he had done or could do would cool their enthusiasm."
        },
        {
            "id": 45,
            "phrase": "sold out",
            "definition": "[of a product] completely sold with no more items remaining; [of a store] having no more of a particular product.  The tickets were sold out so we couldn’t go to the concert.  I wanted new shoes like yours, but they were sold out."
        },
        {
            "id": 46,
            "phrase": "solicit for someone or something",
            "definition": "to seek money or other contributions for someone or something, such as a charitable cause.  I am soliciting for crippled children. Would you care to contribute? _Are you soliciting for a local cause?"
        },
        {
            "id": 47,
            "phrase": "solicit someone for something",
            "definition": "to attempt to persuade someone to give something, such as money, for a specific purpose.  The school band solicited the owners of the business for a contribution.  Fred solicited everyone in his department for at least a dollar."
        },
        {
            "id": 48,
            "phrase": "*solid as a rock",
            "definition": "Cliché very solid; dependable. (*Also: as ~.) _Jean has been lifting weights every day, and her arm muscles are solid as a rock. This company has always built power tools that are as solid as a rock."
        },
        {
            "id": 49,
            "phrase": "*some elbow room",
            "definition": "room to move about in; extra space to move about in. (*Typically: allow ~; get ~; have ~; give someone ~; need ~.) _This table is too crowded. We all need some elbow room."
        },
        {
            "id": 50,
            "phrase": "*some loose ends",
            "definition": "some things that are not yet finished; some problems not yet solved. (*Typically: are ~; have ~; leave~; tie ~ up†; take care of ~.) _ I have to stay in town this weekend and tie up some loose ends."
        },
        {
            "id": 51,
            "phrase": "*some shut-eye",
            "definition": "some sleep. (*Typically: get ~; have ~; use ~; need ~.) _I need to get home and get some shut-eye before I do anything else. We all could use some shut-eye."
        },
        {
            "id": 52,
            "phrase": "someone of note",
            "definition": "a person who is famous.  We invited a speaker of note to lecture at the next meeting.  The baseball player of note was inducted into the Hall of Fame."
        },
        {
            "id": 53,
            "phrase": "the someone or something from hell",
            "definition": "someone or something that is terrible or unbearable.  I just attended the meeting from hell! It was quite a strain on all of us.  We live next to the neighbors from hell. They are constantly fighting and their vicious dog terrorizes our kids."
        },
        {
            "id": 54,
            "phrase": "someone’s bread and butter",
            "definition": "someone’s basic income; someone’s livelihood—the source of one’s food.  I can’t miss another day of work. That’s my bread and butter.  I worked as a bartender for a year, and it was the tips that were my bread and butter."
        },
        {
            "id": 55,
            "phrase": "someone’s claim to fame",
            "definition": "someone’s reason for being wellknown or famous. Her claim to fame is that she can recite the entire works of Shakespeare."
        },
        {
            "id": 56,
            "phrase": "someone’s dirty laundry",
            "definition": "someone’s unpleasant secrets.  I don’t want to hear about her dirty laundry. Why do you feel it necessary to gossip about things like this?"
        },
        {
            "id": 57,
            "phrase": "someone’s fate is sealed",
            "definition": "the destiny of somene has been determined.  When the driver finally saw that the bridge was out, he knew his fate was sealed."
        },
        {
            "id": 58,
            "phrase": "someone’s hands are tied",
            "definition": "someone is not able to help or intervene.  I’m sorry. There’s nothing I can do. My hands are tied."
        },
        {
            "id": 59,
            "phrase": "someone’s level best",
            "definition": "one’s very best effort.  I will do my level best to find your husband.  Don’t go to a whole lot of trouble. Your level best is good enough."
        },
        {
            "id": 60,
            "phrase": "someone’s point is well taken",
            "definition": "someone’s idea or opinion is accepted and appreciated. Your point is well taken and I will see that it is not forgotten."
        },
        {
            "id": 61,
            "phrase": "someone’s train of thought",
            "definition": "someone’s pattern of thinking or sequence of ideas; what one was just thinking about.  My train of thought is probably not as clear as it should be.  I cannot seem to follow your train of thought on this matter. Will you explain it a little more carefully, please?"
        },
        {
            "id": 62,
            "phrase": "someone’s true colors",
            "definition": "a person’s true attitude, opinions, and biases.  When he lost his temper at his wife, I began to see his true colors."
        },
        {
            "id": 63,
            "phrase": "(someone’s) ups and downs",
            "definition": "a person’s good fortune and bad fortune.  I’ve had my ups and downs, but in general life has been good to me.  All people have their ups and downs."
        },
        {
            "id": 64,
            "phrase": "someone’s word is good",
            "definition": "someone can be believed and trusted.  You can believe her. Her word is good."
        },
        {
            "id": 65,
            "phrase": "someone’s word of honor",
            "definition": "someone’s trustworthy pledge or promise. He gave me his word of honor that he would bring the car back by noon today."
        },
        {
            "id": 66,
            "phrase": "something about someone or something",
            "definition": "something alluring or curious about someone or something.  There is something about Jane. I just can’t figure her out.  I love Mexican food. There’s just something about it."
        },
        {
            "id": 67,
            "phrase": "something else (again)",
            "definition": "something entirely different.  Borrowing is one thing, but stealing is something else.  Skindiving is easy and fun, but scuba diving is something else again."
        },
        {
            "id": 68,
            "phrase": "Something is better than nothing.",
            "definition": "Prov. It is better to get only some of what you want than to get nothing at all. better than nothing.) _ Fred: I only got $50 for all those books I sold. Jane: Something is better than nothing.  Jill: Is your camera very good? Jane: It’s better than nothing."
        },
        {
            "id": 69,
            "phrase": "something is killing someone",
            "definition": "something is causing someone pain.  Wow, my feet are killing me!"
        },
        {
            "id": 70,
            "phrase": "Something is rotten in (the state of) Denmark.",
            "definition": "Prov. Something suspicious is going on. (From Shakespeare’s play Hamlet.) _Jim: Look, there’s a light on in the office, even though it’s way past the time everyone should have left. John: Something is rotten in the state of Denmark. Jane: I wonder why Fred is coming in so late every morning. Jane: Something is rotten in Denmark."
        },
        {
            "id": 71,
            "phrase": "something never fails",
            "definition": "a particular thing always works.  My old folk remedy for hiccups never fails."
        },
        {
            "id": 72,
            "phrase": "something of sorts",
            "definition": "an inferior example of a kind of something.  Well, it’s a solution of sorts, I suppose.  It was a novel of sorts, but not what I’d ever have chosen."
        },
        {
            "id": 73,
            "phrase": "something of the sort",
            "definition": "something of the kind just mentioned. The tree isn’t exactly a spruce tree, just something of the sort.  Jane has a cold or something of the sort."
        },
        {
            "id": 74,
            "phrase": "something or other",
            "definition": "something unspecified; one thing or another. I can’t remember what Ann said—something or other. A messenger came by and dropped off something or other at the front desk."
        },
        {
            "id": 75,
            "phrase": "Something’s got to give.",
            "definition": "Emotions or tempers are strained, and there is going to be an outburst.  Alice: There are serious problems with Mary and Tom. They fight and fight. Sue: Yes, something’s got to give. It can’t go on like this.  Bill: Things are getting difficult at the office. Something’s got to give. Mary: Just stay clear of all the bickering."
        },
        {
            "id": 76,
            "phrase": "something’s up",
            "definition": "something is going to happen; something is going on. Everybody looks very nervous. I think something’s up. From the looks of all the activity around here, I think something’s up."
        },
        {
            "id": 77,
            "phrase": "*something to shout about",
            "definition": "something that causes one to show pride or enthusiasm about someone or something. (*Typically: be ~; have ~.) _ Getting into med school is really something to shout about. She’s something to shout about."
        },
        {
            "id": 78,
            "phrase": "something to that effect",
            "definition": "something like that just mentioned.  She said she wouldn’t be available until after three, or something to that effect.  I was told to keep out of the house—or something to that effect."
        },
        {
            "id": 79,
            "phrase": "(somewhere) in the neighborhood of something",
            "definition": "approximately a particular amount or measurement.  I take somewhere in the neighborhood of ten pills a day for my various ailments.  My rent is in the neighborhood of $700 per month."
        },
        {
            "id": 80,
            "phrase": "somewhere to hang (up) one’s hat",
            "definition": "a place to live; a place to call one’s home.  What I need is somewhere to hang up my hat. I just can’t stand all this traveling.  A home is a lot more than a place to hang your hat."
        },
        {
            "id": 81,
            "phrase": "son of a bitch",
            "definition": "1. Inf. a very horrible person. (Use with caution. Usually intended as a strong insult. Never used casually.) _ Bill called Bob a son of a bitch, and Bob punched Bill in the face.  This guy’s a son of a bitch. He treats everybody rotten. 2. Inf. a useless thing.  This car is a son of a bitch. It won’t ever start when it’s cold.  This bumpy old road needs paving. It’s a real son of a bitch. 3. Inf. a difficult task.  This job is a son of a bitch.  I can’t do this kind of thing. It’s too hard—a real son of a bitch."
        },
        {
            "id": 82,
            "phrase": "son of a sea biscuit",
            "definition": "Euph. a person, usually a male. (Sometimes a substitute for son of a bitch.) _Why, good to see you, you old son of a sea biscuit.  You son of a sea biscuit! You make me so mad I could slug you."
        },
        {
            "id": 83,
            "phrase": "*soon as possible",
            "definition": "at the earliest time. (*Also: as ~.) _I’m leaving now. I’ll be there as soon as possible. Please pay me soon as possible."
        },
        {
            "id": 84,
            "phrase": "sooner or later",
            "definition": "eventually; in the short term or in the long term.  He’ll have to pay the bill sooner or later.  She’ll get what she deserves sooner or later."
        },
        {
            "id": 85,
            "phrase": "Sooner than you think.",
            "definition": "an expression stating that something will happen sooner than a time expected or just mentioned.  Sally: I’m going to have to stop pretty soon for a rest. Mary: Sooner than you think, I’d say. I think one of our tires is low.  Tom: The stock market is bound to run out of steam pretty soon. Bob: Sooner than you think from the look of today’s news."
        },
        {
            "id": 86,
            "phrase": "The sooner the better.",
            "definition": "The sooner something [referred to] gets done, the better things will be.  Bob: When do you need this? Mary: The sooner the better.  Bob: Please get the oil changed in the station wagon. The sooner the better. Alice: I’ll do it today."
        },
        {
            "id": 87,
            "phrase": "sop something up†",
            "definition": "to mop or soak up a liquid.  Use this rag to sop the spilled milk up. The rag will sop up the mess a little at a time."
        },
        {
            "id": 88,
            "phrase": "sopping (wet)",
            "definition": "intoxicated. He’s soused—you know, sopping wet."
        },
        {
            "id": 89,
            "phrase": "*sore (at someone)",
            "definition": "angry at someone. (*Typically: be ~; get ~; make someone ~.) _When Mary hears what you said about her, she’ll get sore for sure.  Please don’t get sore at me."
        },
        {
            "id": 90,
            "phrase": "sorrow over someone or something",
            "definition": "to grieve or feel sad about someone or something.  There is no need to sorrow over Tom. He will come back.  He is sorrowing over the business he has lost because of the weather."
        },
        {
            "id": 91,
            "phrase": "Sorry (that) I asked.",
            "definition": "Now that I have heard the answer, I regret asking the question. Alice: Can we get a new car soon? The old one is a wreck. John: Are you kidding? There’s no way that we could ever afford a new car! Alice: Sorry I asked.  After he heard the long list of all the reasons he wouldn’t be allowed to go to the concert, Fred just shrugged and said, “Sorry that I asked.”"
        },
        {
            "id": 92,
            "phrase": "sort oneself out",
            "definition": "to pull oneself together; to figure out what to do about one’s problems. (Fig. on sort something out W.) _ I need a few days to sort myself out.  I need some time to sort myself out."
        },
        {
            "id": 93,
            "phrase": "sort something out†",
            "definition": "to sort something; to arrange according to class or category.  Let’s sort these cards out.  Would you please sort out your socks?"
        },
        {
            "id": 94,
            "phrase": "(soul) sister",
            "definition": "a black person’s female, black friend. Many of the top singing groups of the ’60s featured soul sisters."
        },
        {
            "id": 95,
            "phrase": "*sound as a bell",
            "definition": "in perfect condition or health; undamaged. (*Also: as ~.) _ The doctor says that the old man’s heart’s as sound as a bell.  I thought the vase was broken when it fell, but it was sound as a bell."
        },
        {
            "id": 96,
            "phrase": "*sound as a dollar",
            "definition": "1. Cliché very secure and dependable. (*Also: as ~.) _ This investment is as sound as a dollar. I wouldn’t put my money in a bank that isn’t sound as a dollar. 2. Cliché sturdy and well-constructed. (*Also: as ~.) _ This house is as sound as a dollar.  The garage is still sound as a dollar. Why tear it down?"
        },
        {
            "id": 97,
            "phrase": "sound asleep",
            "definition": "completely asleep; in a deep sleep.  I was sound asleep when the fire broke out."
        },
        {
            "id": 98,
            "phrase": "sound like a broken record",
            "definition": "to say the same thing over and over again. (Fig. on a scratch in a phonograph record causing the needle [or stylus] to stay in the same groove and play it over and over.) _ He’s always complaining about the way she treats him. He sounds like a broken record! _I hate to sound like a broken record, but we just don’t have enough people on the payroll to work efficiently."
        },
        {
            "id": 99,
            "phrase": "sound off",
            "definition": "to speak something loudly; to call out one’s name or one’s place in a numerical sequence.  All right, sound off, you guys! _ Each one sounded off."
        },
        {
            "id": 100,
            "phrase": "sound off (about something)",
            "definition": "1. to complain about something; to gripe about something. You are always sounding off about something that gripes your soul.  Just sound off if you’ve got a beef. 2. to speak out of turn about some- thing.  Who asked you to sound off about this? _ Don’t just sound off without raising your hand."
        },
        {
            "id": 101,
            "phrase": "sound someone out†",
            "definition": "to try to find out what someone thinks (about something). I don’t know what Jane thinks about your suggestion, but I’ll sound her out. Please sound out everyone in your department."
        },
        {
            "id": 102,
            "phrase": "sound something out†",
            "definition": "to pronounce the letters or syllables of a word as a means of figuring out what the word is. (Usually said to a child.) _This word is easy, Bobby. Try to sound it out."
        },
        {
            "id": 103,
            "phrase": "Soup’s on!",
            "definition": "Rur. The meal is ready to eat. (Said for any food, not just soup.) _Tom: Soup’s on! Bill: The camp chef has dished up another disaster.  John: Soup’s on! Come and get it! Mary: Well, I guess it’s time to eat again."
        },
        {
            "id": 104,
            "phrase": "soup something up†",
            "definition": "to increase the power of something.  He souped his car up so it will do nearly 120 miles per hour.  If only I could soup up this computer to run just a little faster."
        },
        {
            "id": 105,
            "phrase": "souped up",
            "definition": "made more powerful.  That souped-up car of John’s sure makes a lot of noise. Why do all cars driven by males under the age of twenty have to be souped up?"
        },
        {
            "id": 106,
            "phrase": "*sour as vinegar",
            "definition": "1. [of something] very sour. (*Also: as ~.) _This milk is as sour as vinegar. The juice they gave us is sour as vinegar. 2. [of someone] ill-natured and disagreeable. (Fig. on Q. *Also: as ~.) _ The old man greeted us ill-naturedly, his face as sour as vinegar.  Jill: Is Mary in a bad mood today? Jane: Yes, sour as vinegar."
        },
        {
            "id": 107,
            "phrase": "sour grapes",
            "definition": "something that one cannot have and so disparages as if it were never desirable.  Of course you want to buy this expensive jacket. Criticizing it is just sour grapes, but you still really want it."
        },
        {
            "id": 108,
            "phrase": "sow one’s wild oats",
            "definition": "to do wild and foolish things in one’s youth. (Often assumed to have some sort of sexual meaning.) _Jack was out sowing his wild oats last night, and he’s in jail this morning.  Mrs. Smith told Mr. Smith that he was too old to be sowing his wild oats."
        },
        {
            "id": 109,
            "phrase": "Sow the wind and reap the whirlwind",
            "definition": "Prov. to start some kind of trouble that grows much larger than you planned. (Biblical.) _ Our enemy has sown the wind by provoking this war, and they will reap the whirlwind when we vanquish them."
        },
        {
            "id": 110,
            "phrase": "space out",
            "definition": "to become giddy or disoriented.  Judy spaced out during the meeting and I didn’t understand a word she said.  I have a tendency to space out at the end of a hard day."
        },
        {
            "id": 111,
            "phrase": "space someone out†",
            "definition": "to cause someone to become giddy.  The circus clowns just spaced me out.  The hilarious spectacle spaced out the entire audience."
        },
        {
            "id": 112,
            "phrase": "spaced (out)",
            "definition": "silly; giddy.  I have such spaced-out parents! _ He’s so spaced!"
        },
        {
            "id": 113,
            "phrase": "spade something up†",
            "definition": "to turn over the soil in a garden plot with a spade.  Please go out and spade the garden up so I can plant the potatoes and onions. I will spade up the garden when I have time."
        },
        {
            "id": 114,
            "phrase": "spar with someone",
            "definition": "to box with someone for practice.  The champ needs someone to spar with every day.  Ted was sparring with his brother when the phone rang and saved him from further exertion."
        },
        {
            "id": 115,
            "phrase": "spare someone something",
            "definition": "to exempt someone from having to listen to or experience something.  I’ll spare you the details and get to the point. Please, spare me the story and tell me what you want."
        },
        {
            "id": 116,
            "phrase": "Spare the rod and spoil the child.",
            "definition": "Prov. You should punish a child when he or she misbehaves, because if you do not, the child will grow up expecting everyone to indulge him or her.  Jane: How can you allow your little boy to be so rude? Ellen: It distresses me to punish him. Jane: I can understand that, but spare the rod and spoil the child."
        },
        {
            "id": 117,
            "phrase": "spare tire",
            "definition": "1. a thickness in the waist; a roll of fat around one’s waist.  I’ve got to get rid of this spare tire.  The spare tire started when I was twenty-six. 2. an unneeded person; an unproductive person.  Gary is a spare tire. Send him home.  You spare tires over there! Get to work."
        },
        {
            "id": 118,
            "phrase": "spark something off†",
            "definition": "to ignite something flammable or explosive.  The lightning sparked a fire off.  The match sparked off a raging inferno."
        },
        {
            "id": 119,
            "phrase": "sparkle with something",
            "definition": "to glitter or twinkle because of something.  The crystal goblets sparkled with the light from the f lickering candles.  Her eyes sparkled with the ref lection of the candles."
        },
        {
            "id": 120,
            "phrase": "spatter on someone or something",
            "definition": "[for a liquid or something moist] to splash onto someone or something.  When Kelly painted the hallway, a lot of paint spattered on the f loor.  The hot fat spattered on me."
        },
        {
            "id": 121,
            "phrase": "spatter someone or something up†",
            "definition": "to get drops of a liquid or bits of something moist onto someone or something.  The painter spattered his partner up when he dropped the paint bucket accidentally.  The falling paint bucket spattered up the wall."
        },
        {
            "id": 122,
            "phrase": "spatter someone or something with something",
            "definition": "to splash someone or something with drops of a liquid or bits of something moist.  Frank spattered us with grapefruit juice as he was eating a half of grapefruit.  He even spattered the wall with juice."
        },
        {
            "id": 123,
            "phrase": "spatter something around†",
            "definition": "to scatter bits or drops of a liquid or something moist here and there. Ted spattered paint around everywhere when he redecorated his kitchen.  Don’t spatter around the paint."
        },
        {
            "id": 124,
            "phrase": "spatter something on(to) someone or something",
            "definition": "to scatter or splash bits or drops of a liquid or something moist onto someone or something.  Who spattered barbecue sauce onto the wall? _ The paint can fell and spattered paint on everyone."
        },
        {
            "id": 125,
            "phrase": "spaz around",
            "definition": "Sl. to waste time; to mess around. You kids are always spazzing around. Why don’t you do something useful? _ We’re just spazzing around. Leave us alone."
        },
        {
            "id": 126,
            "phrase": "spaz down",
            "definition": "Sl. to relax.  Spaz down, man! Chill out! _ We tried to get the crowd to spaz down, but they were very excited."
        },
        {
            "id": 127,
            "phrase": "spaz out",
            "definition": "1. Sl. to overreact to something; to become overly excited about something.  I knew you would spaz out! But my grades are not that bad! _Come on, don’t spaz out! 2. Sl. an emotional display. (Usually spaz-out.) _ There’s no need for a spaz-out! _She threw a hell of a spazout."
        },
        {
            "id": 128,
            "phrase": "speak about someone or something",
            "definition": "to mention or discuss someone or something.  And now I will speak about Abraham Lincoln. Let us speak about what happened yesterday."
        },
        {
            "id": 129,
            "phrase": "speak against someone or something",
            "definition": "1. to criticize someone or something. Many people are speaking against the mayor. She will not be reelected.  Please don’t speak against cats in my presence. 2. to testify or argue against someone or something. Judy spoke against the candidate at length.  The next speaker spoke against nuclear waste."
        },
        {
            "id": 130,
            "phrase": "speak down to someone",
            "definition": "to address someone in simpler terms than necessary; to speak condescendingly to someone.  There is no need to speak down to me. I can understand anything you are likely to say.  Sorry. Sometimes I tend to speak down to people over the telephone."
        },
        {
            "id": 131,
            "phrase": "speak for oneself",
            "definition": "to speak on one’s own behalf.  I can speak for myself. I don’t need you to speak for me.  Speak for yourself. What you say does not represent my thinking."
        },
        {
            "id": 132,
            "phrase": "speak for someone or something",
            "definition": "1. to testify or argue for someone or something.  I would be happy to speak for you in court. Just tell me when.  My attorney will speak for our position. 2. to lay claim to someone or something.  Fred is spoken for.  I want to speak for the red one."
        },
        {
            "id": 133,
            "phrase": "speak from something",
            "definition": "to draw authority or credibility in one’s speaking from something such as knowledge or experience.  Believe me, I speak from experience.  Listen to her. She speaks from a lot of knowledge and training."
        },
        {
            "id": 134,
            "phrase": "speak highly of someone or something",
            "definition": "1. [for someone] to say good things about someone or something.  She always speaks highly of you. Everyone spoke highly of this movie, but it is not good. 2. [for a fact] to reflect well on someone or something.  The success of your project speaks highly of you.  All of this good news speaks highly of your ability to inf luence people."
        },
        {
            "id": 135,
            "phrase": "speak ill of someone",
            "definition": "to say something bad about someone.  I refuse to speak ill of any of my friends.  Max speaks ill of no one and refuses to repeat gossip."
        },
        {
            "id": 136,
            "phrase": "speak of someone or something",
            "definition": "1. to mention or discuss someone or something. Were we speaking of Judy? I don’t recall.  We were speaking of the new law. 2. [for a type of behavior or action] to reflect a particular quality.  Jeff ’s behavior spoke of a good upbringing.  Her good singing voice speaks of years of training."
        },
        {
            "id": 137,
            "phrase": "speak off-the-cuff",
            "definition": "to speak without preparing a speech; to speak extemporaneously; to render a spoken opinion or estimate. (As if one’s notes had been written hastily on one’s cuff.) _She is capable of making sense and being convincing even when she speaks off-the-cuff. I find it very difficult to speak off-the-cuff."
        },
        {
            "id": 138,
            "phrase": "speak one’s mind",
            "definition": "to say frankly what one thinks (about something).  Please let me speak my mind, and then you can do whatever you wish.  You can always depend on John to speak his mind. He’ll let you know what he really thinks."
        },
        {
            "id": 139,
            "phrase": "speak out",
            "definition": "to speak loudly; to speak to be heard.  Please speak out. We need to hear you. They won’t hear you in the back row if you don’t speak out."
        },
        {
            "id": 140,
            "phrase": "speak out (about someone or something)",
            "definition": "to express oneself about someone or something; to tell what one knows about someone or something.  I could keep silent no longer. I had to speak out about the alleged accident.  I had to speak out!"
        },
        {
            "id": 141,
            "phrase": "speak out (against someone or something)",
            "definition": "to speak negatively and publicly about someone or something; to reveal something negative, in speech, about someone or something.  I don’t want to speak out against my friends, but I am afraid I have to.  The citizens spoke out against corruption in government."
        },
        {
            "id": 142,
            "phrase": "speak out of turn",
            "definition": "to say something unwise or imprudent; to say something at the wrong time. Excuse me if I’m speaking out of turn, but what you are proposing is quite wrong.  Bob was quite honest, even if he was speaking out of turn."
        },
        {
            "id": 143,
            "phrase": "speak out (on something)",
            "definition": "to say something frankly and directly; to speak one’s mind.  This law is wrong, and I intend to speak out on it until it is repealed.  You must speak out. People need to know what you think."
        },
        {
            "id": 144,
            "phrase": "speak someone’s language",
            "definition": "to say something that one agrees with or understands. I gotcha. Now you’re speaking my language.  Mary speaks Fred’s language. They get along fine."
        },
        {
            "id": 145,
            "phrase": "speak the same language",
            "definition": "[for two or more people] to communicate in a shared language.  These two people don’t speak the same language and need an interpreter."
        },
        {
            "id": 146,
            "phrase": "speak to someone",
            "definition": "to talk to someone.  I am angry with him and I refuse to speak to him.  Were you speaking to me?"
        },
        {
            "id": 147,
            "phrase": "speak to something",
            "definition": "[for something] to address, indicate, or signal something.  This event speaks to the need for good communication.  Your present state of employment speaks to your need for a better education."
        },
        {
            "id": 148,
            "phrase": "speak up",
            "definition": "to speak more loudly.  They can’t hear you in the back of the room. Please speak up. What? Speak up, please. I’m hard of hearing."
        },
        {
            "id": 149,
            "phrase": "speak up (against someone or something)",
            "definition": "to end one’s silence and speak negatively and publicly about someone or something. She finally spoke up against her cruel boss.  We all felt like we had to speak up and denounce this tyrant."
        },
        {
            "id": 150,
            "phrase": "speak up for someone or something",
            "definition": "to speak in favor of someone or something. If anybody says bad things about me, I hope you speak up for me.  I want to speak up for the rights of students."
        },
        {
            "id": 151,
            "phrase": "speak (up)on something",
            "definition": "to talk about a particular topic. (Upon is formal and less commonly used than on.) _This evening, I will speak upon the subject of Plato’s thoughts on the universe.  What will you speak on today?"
        },
        {
            "id": 152,
            "phrase": "speak volumes",
            "definition": "[for something that is seen] to reveal a great deal of information.  The unsightly yard and unpainted house speaks volumes about what kind of people live there."
        },
        {
            "id": 153,
            "phrase": "speak with a forked tongue",
            "definition": "to tell lies; to try to deceive someone.  Jean’s mother sounds very charming, but she speaks with a forked tongue. People tend to believe Fred because he seems plausible, but we know he speaks with a forked tongue."
        },
        {
            "id": 154,
            "phrase": "speak with someone (about someone or something)",
            "definition": "1. to talk with someone about someone or something; to discuss someone or something with someone. I was speaking with Fred about Don, who is a mutual friend.  I need to know something about Don. I will speak with his friend Fred. 2. to reprimand one about one’s dealing with someone or something.  He should not have insulted Kelly. I will speak with him about her.  He did what? I will speak with him!"
        },
        {
            "id": 155,
            "phrase": "speaking for oneself",
            "definition": "an expression indicating that one is expressing only one’s own opinion. Speaking for myself, I am ready to cancel the contract.  Sally is speaking for herself. She is not expressing our opinions."
        },
        {
            "id": 156,
            "phrase": "speaking (quite) candidly",
            "definition": "an expression introducing a frank or forthright statement.  “Speaking quite candidly, I find your behavior a bit offensive,” stated Frank, obviously offended.  Mary: Tell me what you really think about this skirt. Sally: Speaking candidly, I think you should get your money back."
        },
        {
            "id": 157,
            "phrase": "spear something out† (of something)",
            "definition": "to bring something forth from something by sticking it with something sharp and pulling.  Richard spears pickles right out of the jar with a fork.  He speared out a pickle."
        },
        {
            "id": 158,
            "phrase": "specialize in something",
            "definition": "to limit oneself to or be specially trained to practice one particular thing.  I specialize in tropical medicine.  What do you specialize in?"
        },
        {
            "id": 159,
            "phrase": "speculate about someone or something",
            "definition": "to make guesses about someone or something; to hypothesize about someone or something. I refuse to speculate about Sally. I don’t presume to guess what she will do.  We don’t speculate about the future."
        },
        {
            "id": 160,
            "phrase": "speculate in something",
            "definition": "to make risky business deals in the buying and selling of something.  Jeff made a fortune speculating in cotton.  I do not wish to speculate in anything. It is too risky."
        },
        {
            "id": 161,
            "phrase": "speculate on something",
            "definition": "to make a hypothesis about something. I really don’t want to speculate on what might happen next. Would you care to speculate on what might happen if you quit your job?"
        },
        {
            "id": 162,
            "phrase": "speed away (from someone or something)",
            "definition": "to move or drive away very fast from someone or something.  The taxi sped away from the passenger who had just alighted.  The car sped away from the accident.  The motorcycle sped away."
        },
        {
            "id": 163,
            "phrase": "speed someone or something up†",
            "definition": "to cause someone or something to move faster. We tried to speed him up, but he is just a very slow person. We sped up the process, but it still took too long."
        },
        {
            "id": 164,
            "phrase": "speed up",
            "definition": "to go faster.  Please speed up. We are late."
        },
        {
            "id": 165,
            "phrase": "*speeds of some amount",
            "definition": "a variety of speeds (of movement) of a certain level. (*Typically: clock someone at ~; have ~; hit ~; reach ~.) _The cops clocked him at speeds of up to one hundred miles per hour."
        },
        {
            "id": 166,
            "phrase": "spell disaster",
            "definition": "to indicate or predict disaster. What a horrible plan! It would spell disaster for all of us!"
        },
        {
            "id": 167,
            "phrase": "spell someone (at something)",
            "definition": "to take a turn at doing something while the person who was doing it can take a rest.  I will spell you at selling tickets while you go and grab a bite to eat."
        },
        {
            "id": 168,
            "phrase": "spell someone down†",
            "definition": "to win over someone in a spelling match.  Frank spelled everyone else down and won the spelling bee.  He spelled down almost everyone."
        },
        {
            "id": 169,
            "phrase": "spell something for someone",
            "definition": "to spell a word or name for someone’s benefit.  I don’t recognize that word. Would you please spell it for me? _It is a difficult name. I will have to spell it for you."
        },
        {
            "id": 170,
            "phrase": "spell something out†",
            "definition": "to spell something (with letters). I can’t understand your name. Can you spell it out? _ Please spell out all the strange words so I can write them down correctly."
        },
        {
            "id": 171,
            "phrase": "spell trouble",
            "definition": "to signify future trouble; to mean trouble. This letter that came today spells trouble. The sky looks angry and dark. That spells trouble."
        },
        {
            "id": 172,
            "phrase": "spend something for something",
            "definition": "to pay out an amount of money for something. I spent nearly forty dollars for that vase! _ How much did you spend for this house—if I may ask?"
        },
        {
            "id": 173,
            "phrase": "spend something on someone or something",
            "definition": "to pay out an amount of money for the benefit of someone or something.  How much did you spend on him for his birthday? _ I spent a lot on Mary’s gift."
        },
        {
            "id": 174,
            "phrase": "spend time in something",
            "definition": "to stay in something or some place for a period of time. I spent time in Barbados when I was younger.  I am afraid that you will have to spend some time in the hospital until the infection is cleared up."
        },
        {
            "id": 175,
            "phrase": "spending money",
            "definition": "cash, as opposed to money in the bank. I’m a little short of spending money at the present. Could I borrow ten dollars? _ I don’t have any spending money either."
        },
        {
            "id": 176,
            "phrase": "spew one’s guts (out)",
            "definition": "1. Sl. to empty one’s stomach; to vomit.  Fred is spewing his guts out because of that lousy fish you served.  He’s spewing his guts because he has the f lu. 2. Sl. to tell everything that one knows; to confess everything. (Underworld.) _Lefty was sitting there in the police station spewing his guts out about the bank job.  If he really is spewing his guts, the mob will cancel his Christmas."
        },
        {
            "id": 177,
            "phrase": "spew something out†",
            "definition": "to have something gush forth. The faucet spewed a little yellowish water out and stopped altogether.  The faucet spewed out some yellowish water."
        },
        {
            "id": 178,
            "phrase": "spew something up†",
            "definition": "to gush something upward.  The geyser spewed hot water and steam up every hour on the hour. The fountain spewed up a thin stream of cool, clear water."
        },
        {
            "id": 179,
            "phrase": "spice something up†",
            "definition": "to make some food or drink more spicy. Judy spiced the cider up by adding cinnamon and nutmeg.  She spiced up the chili too much."
        },
        {
            "id": 180,
            "phrase": "spiel something off†",
            "definition": "to recite a list of things very rapidly; to recite something very rapidly. I used to be able to spiel the names of the presidents off. Liz spieled off her gift list to the clerk."
        },
        {
            "id": 181,
            "phrase": "spiff something up†",
            "definition": "to polish and groom something very well; to make something clean and tidy.  See if you can spiff this place up a little.  I will spiff up the room a little."
        },
        {
            "id": 182,
            "phrase": "spiffed out",
            "definition": "Sl. to be dressed in one’s finest clothes and well-groomed. He got himself all spiffed out for the wedding reception.  Man, are you ever spiffed out!"
        },
        {
            "id": 183,
            "phrase": "spiffed up",
            "definition": "dressed up, groomed, and polished up nicely; clean and tidy.  See if you can get yourself a little spiffed up before we go out to dinner. We wouldn’t want the Wilmington-Thorpes to think you only have one suit. The house doesn’t have to be too spiffed up for the Franklins. They are used to clutter."
        },
        {
            "id": 184,
            "phrase": "spill one’s guts",
            "definition": "Sl. to tell all; to confess. I had to spill my guts about the broken window. I didn’t want you to take the blame. Mary spilled her guts about the window. She confessed that she was trying to shield Bob."
        },
        {
            "id": 185,
            "phrase": "spill out (of something)",
            "definition": "to scatter, flow, or drop out of something.  All the rice spilled out of the box onto the f loor.  The rice spilled out on the f loor."
        },
        {
            "id": 186,
            "phrase": "spill over",
            "definition": "1. [for a container] to overflow.  I hope your bucket of water doesn’t spill over.  The milk glass spilled over because it was filled too full. 2. [for the contents of a container] to overflow.  The bucket is too full. I don’t know why the water doesn’t spill over.  The milk spilled over because you overfilled the glass."
        },
        {
            "id": 187,
            "phrase": "spill over on(to) someone or something",
            "definition": "[for something] to scatter, flow, or drop (out of something) onto someone or something.  The bowl of milk spilled over onto the children when they jarred the table. The bowl spilled over on the f loor."
        },
        {
            "id": 188,
            "phrase": "spin a yarn",
            "definition": "to tell a tale.  Grandpa spun an unbelievable yarn for us.  My uncle is always spinning yarns about his childhood."
        },
        {
            "id": 189,
            "phrase": "spin around",
            "definition": "1. to turn around to face a different direction.  Jill spun around to face her accuser.  Todd spun around in his chair so he could see who was talking to him. 2. to rotate, possibly a number of times. The propellers spun around and soon the old plane began to taxi down the runway.  The merry-go-round spun around at a moderate speed."
        },
        {
            "id": 190,
            "phrase": "spin doctor",
            "definition": "someone who gives a twisted or deviously deceptive version of an event. (Usually in the context of manipulating the news for political reasons.) _ Things were going bad for the candidate, so he got himself a new spin doctor. A good spin doctor could have made the incident appear far less damaging."
        },
        {
            "id": 191,
            "phrase": "spin off",
            "definition": "[for something] to part and fly away from something that is spinning; [for something] to detach or break loose from something.  The blade of the lawn mower spun off, but fortunately no one was injured. The rustedon nut spun off easily after I got it loosened."
        },
        {
            "id": 192,
            "phrase": "spin one’s wheels",
            "definition": "to waste time; to remain in a neutral position, neither advancing nor falling back. (Fig. on a car that is running but is not moving because its wheels are spinning in mud, etc.) _ I’m just spinning my wheels in this job. I need more training to get ahead. The whole project was just spinning its wheels until spring."
        },
        {
            "id": 193,
            "phrase": "spin out",
            "definition": "[for a vehicle] to go out of control, spinning.  You nearly spun out on that last turn! _Cars were spinning out all over the highway when the ice storm hit."
        },
        {
            "id": 194,
            "phrase": "spin something off†",
            "definition": "[for something rotating] to release a part that flies away.  The propeller spun one of its blades off and then fell apart all together.  It spun off one of its blades."
        },
        {
            "id": 195,
            "phrase": "spin something out†",
            "definition": "to prolong something.  Was there really any need to spin the whole process out so long? _Why did they spin out the graduation ceremony for such a long time?"
        },
        {
            "id": 196,
            "phrase": "spiral down",
            "definition": "to descend in a spiral path.  The ancient trail spiraled down the mountain peak.  A path spiraled down and at the bottom was a small refreshment stand."
        },
        {
            "id": 197,
            "phrase": "spiral up",
            "definition": "to ascend in a spiral path.  The smoke spiraled up to the sky.  The trail spiraled up the slope to the top."
        },
        {
            "id": 198,
            "phrase": "The spirit is willing, but the flesh is weak.",
            "definition": "Prov. People cannot always do what they know they ought to do.; People are not always physically capable of doing what they are willing to do. (Biblical.) _Alan: Have you started the diet your doctor recommended? Fred: The spirit is willing, but the f lesh is weak."
        },
        {
            "id": 199,
            "phrase": "spirit someone or something away† (somewhere)",
            "definition": "to sneak someone or something away to another place. The police spirited the prisoner away before the crowd assembled in front of the jail.  They spirited away the celebrity."
        },
        {
            "id": 200,
            "phrase": "spirit someone or something off† (to some place)",
            "definition": "to hurry someone or something away, presumably unnoticed, to another place.  Aunt Jane spirited the children off to bed at half-past eight.  She spirited off the leftover roast beef."
        },
        {
            "id": 201,
            "phrase": "spit and polish",
            "definition": "orderliness; ceremonial precision and orderliness.  I like spit and polish. It comes from being in the military.  There is no such thing as too much spit and polish."
        },
        {
            "id": 202,
            "phrase": "spit at someone or something",
            "definition": "to expectorate on someone or something or in the direction of someone or something. The angry crowd cursed and spit at the prisoner as he was being taken back to jail.  Max actually spit at the police station door as he was dragged in."
        },
        {
            "id": 203,
            "phrase": "spit something on(to) something",
            "definition": "to expel something from the mouth onto something. You shouldn’t spit your gum onto the sidewalk! _Don’t spit your gum on the pavement."
        },
        {
            "id": 204,
            "phrase": "spit something out†",
            "definition": "to cast something from the mouth.  The food was so terrible that I spit it out.  I spit out the sweet potatoes."
        },
        {
            "id": 205,
            "phrase": "spit something up†",
            "definition": "Euph. to vomit something. She almost spit her dinner up.  Sally was afraid she was going to spit up her dinner."
        },
        {
            "id": 206,
            "phrase": "spit up",
            "definition": "Euph. to vomit.  The food was so bad, she was afraid she would spit up.  Mommy, I have to spit up!"
        },
        {
            "id": 207,
            "phrase": "spit (up)on someone or something",
            "definition": "1. to eject spit onto someone or something. (Upon is formal and less commonly used than on.) _ The angry crowd spit on the convict.  Don’t spit on the sidewalk. 2. to spew spittle onto someone or something while talking. (Upon is formal and less commonly used than on.) _ I always have a fear of accidentally spitting on someone in the first row while I am talking.  I regret spitting on you, but it was an accident."
        },
        {
            "id": 208,
            "phrase": "splash down",
            "definition": "[for a space capsule] to land in the water.  The capsule splashed down very close to the pickup ship."
        },
        {
            "id": 209,
            "phrase": "splash on someone or something",
            "definition": "to scatter [a liquid] on someone or something.  Try to keep from splashing on anybody.  Don’t splash on the wall!"
        },
        {
            "id": 210,
            "phrase": "splash over",
            "definition": "[for a volume of liquid] to overflow its container.  A lot of the coffee splashed over before I got to the table with the cup.  Don’t fill it so full and it won’t splash over."
        },
        {
            "id": 211,
            "phrase": "splash someone or something up†",
            "definition": "to scatter a liquid onto someone or something.  Don’t get that stuff all over. Don’t splash the place up! _ She splashed up the kitchen when she washed the dishes."
        },
        {
            "id": 212,
            "phrase": "splash someone or something with something",
            "definition": "to scatter or slosh someone or something with a liquid.  The whales at Sea World splashed everyone in the audience with water.  I splashed the side of the stove with pancake batter when I dropped the bowl."
        },
        {
            "id": 213,
            "phrase": "splash something about",
            "definition": "to scatter or slosh a liquid about.  Please don’t splash that about. It will stain anything you spill it on.  Don’t splash that stuff about!"
        },
        {
            "id": 214,
            "phrase": "splash something (all) over someone or something",
            "definition": "to cause a liquid to overflow or engulf someone or something.  Tony splashed water all over Nick. Who splashed milk all over the table?"
        },
        {
            "id": 215,
            "phrase": "splash something on(to) someone or something",
            "definition": "to make a liquid scatter onto someone or something. Accidentally, the lab assistant splashed acid onto his arm.  He splashed something on the counter."
        },
        {
            "id": 216,
            "phrase": "splatter someone or something up†",
            "definition": "to cover someone or something with drops of a liquid. The painter splattered his coworker up with both red and blue. Don’t splatter up the wall!"
        },
        {
            "id": 217,
            "phrase": "splay out",
            "definition": "to spread out; to extend out at an angle.  His feet splayed out so much that it was hard to see how he could stand up.  The legs of the table splayed out and gave it sturdy support."
        },
        {
            "id": 218,
            "phrase": "splice something (in)to something",
            "definition": "to connect something to something; to cut and join something into something to connect the two. The workers spliced the small wires into the main cable.  Let’s splice this rope into the larger one at the halfway point."
        },
        {
            "id": 219,
            "phrase": "splice something together†",
            "definition": "to connect things together, usually by twisting or tying a joint between the two.  I spent over an hour splicing the two ends of the ropes together, and it didn’t hold for even a minute.  He carefully spliced together the two ropes."
        },
        {
            "id": 220,
            "phrase": "split hairs",
            "definition": "to quibble; to try to make petty distinctions.  They don’t have any serious differences. They are just splitting hairs.  Don’t waste time splitting hairs. Accept it the way it is."
        },
        {
            "id": 221,
            "phrase": "split in something",
            "definition": "to divide into a certain number of groups. (The something can be half, thirds, two, quarters, etc.) _ Lightning struck the big tree and the trunk split in half.  The vase dropped and split in quarters."
        },
        {
            "id": 222,
            "phrase": "split off (from something)",
            "definition": "to separate away from something; to sever connection with and separate from something. A large iceberg split off from the glacier and made an enormous splash.  A giant chunk of ice split off and f loated away."
        },
        {
            "id": 223,
            "phrase": "split one’s sides (with laughter)",
            "definition": "to laugh so hard that one’s sides almost split. (Always an exaggeration.) _ The members of the audience almost split their sides with laughter.  When I heard what happened to Patricia, I almost split my sides."
        },
        {
            "id": 224,
            "phrase": "split people up†",
            "definition": "to separate two or more people (from one another).  If you two don’t stop chattering, I’ll have to split you up. I will have to split up that twosome in the corner."
        },
        {
            "id": 225,
            "phrase": "*a split second",
            "definition": "an instant; a tiny period of time. (*Typically: for ~; in ~.) _The lightning struck, and in a split second the house burst into f lames.  For a split second, it looked like she would fall."
        },
        {
            "id": 226,
            "phrase": "split someone or something up† (into something)",
            "definition": "to divide people or things up into something, such as groups.  I had to split the group up into two sections—there were so many who showed up.  I split up the class into two discussion sections."
        },
        {
            "id": 227,
            "phrase": "split someone or something with someone or something",
            "definition": "to divide someone or something with someone or a group of people.  I will split the campers with you. You lead your half on the hike, and I will lead my half.  Will you split your candy bar with me?"
        },
        {
            "id": 228,
            "phrase": "split something into something",
            "definition": "to divide or sever something into something. Jeff split the log into four parts. Please split this log in half so it will burn better."
        },
        {
            "id": 229,
            "phrase": "split the difference",
            "definition": "to divide the difference evenly (with someone else).  You want to sell for $120, and I want to buy for $100. Let’s split the difference and close the deal at $110.  I don’t want to split the difference. I want $120."
        },
        {
            "id": 230,
            "phrase": "split up (with someone)",
            "definition": "[for someone] to separate from someone; to break up a marriage or love affair. Jeff split up with Judy. I had heard that they had split up with each other."
        },
        {
            "id": 231,
            "phrase": "a splitting headache",
            "definition": "a severe headache, as if one’s head were splitting open. I’m sorry, I can’t. I have a splitting headache. Maybe Fred will play bridge with you. This splitting headache has been going on for hours."
        },
        {
            "id": 232,
            "phrase": "splurge on someone or something",
            "definition": "to spend a lot of money on someone or something.  I really splurged on my wife for her birthday.  Mary really splurged on that dinner!"
        },
        {
            "id": 233,
            "phrase": "spoiled rotten",
            "definition": "indulged in; greatly spoiled.  This kid is spoiled rotten! _ I was spoiled rotten when I was a child, so I’m used to this kind of wasteful luxury."
        },
        {
            "id": 234,
            "phrase": "spoiling for a fight",
            "definition": "argumentative; asking for a fight.  They were just spoiling for a fight, and they went outside to settle the matter.  She was grouchy, and you could tell she had been spoiling for a fight all day."
        },
        {
            "id": 235,
            "phrase": "spoken for",
            "definition": "taken; reserved (for someone).  I’m sorry, but this piece of cake is already spoken for.  Pardon me. Can I sit here, or is this seat spoken for?"
        },
        {
            "id": 236,
            "phrase": "sponge someone or something down†",
            "definition": "to remove the [excess] moisture from someone or something; to wipe someone or something with a sponge.  The fight manager sponged his boxer down.  I will sponge down the countertop."
        },
        {
            "id": 237,
            "phrase": "sponge something away†",
            "definition": "to absorb, wipe up, and wipe away something, as with a sponge.  Try sponging the stain away with some soda water.  I will sponge away the mess."
        },
        {
            "id": 238,
            "phrase": "sponge something from someone",
            "definition": "to beg or borrow money or food from someone. Gary tried to sponge a few bucks from me.  I can’t continue sponging food from my relatives."
        },
        {
            "id": 239,
            "phrase": "sponge something from something",
            "definition": "to remove moisture from something, as with a sponge. Liz sponged the sauce from her blouse.  We gently sponged the splattered paint from the carpet."
        },
        {
            "id": 240,
            "phrase": "sponge something up†",
            "definition": "to absorb or take up moisture, as with a sponge.  I had to sponge the spilled milk up from the f loor, the chair, the table, and the baby. What a mess! _ Liz sponged up the water."
        },
        {
            "id": 241,
            "phrase": "spook someone or something",
            "definition": "to startle or disorient someone or something.  A snake spooked my horse, and I nearly fell off. Your warning spooked me, and I was upset for the rest of the day."
        },
        {
            "id": 242,
            "phrase": "spoon something out†",
            "definition": "to serve something out, as with a spoon; to give something out, as with a spoon. The cook spooned the beans out, giving plenty to each camper. The cook spooned out the beans."
        },
        {
            "id": 243,
            "phrase": "spoon something up†",
            "definition": "to serve something that requires finding and bringing up out of a pot with a spoon. The cook spooned the hard-cooked eggs up one by one.  The cook spooned up chunks of meat from the stew."
        },
        {
            "id": 244,
            "phrase": "spoon-feed someone",
            "definition": "to treat someone with too much care or help; to teach someone with methods that are too easy and do not stimulate the learner to independent thinking.  The teacher spoon-feeds the students by dictating notes on the novel instead of getting the children to read the books.  You mustn’t spoon-feed the new recruits by telling them what to do all the time. They must use their initiative."
        },
        {
            "id": 245,
            "phrase": "the sport of kings",
            "definition": "horse racing.  The sport of kings has sure impoverished a lot of commoners."
        },
        {
            "id": 246,
            "phrase": "sport with someone or something",
            "definition": "to tease or play with someone or something.  What a tease you are! You are just sporting with me! _ The dog was sporting with a turtle down by the stream."
        },
        {
            "id": 247,
            "phrase": "a sporting chance",
            "definition": "a reasonably good chance.  If you hurry, you have a sporting chance of catching the bus.  The firm has only a sporting chance of getting the export order."
        },
        {
            "id": 248,
            "phrase": "spot someone as something",
            "definition": "to recognize someone to be something; to realize that someone is something. I spotted you as a troublemaker from the very beginning.  The guard spotted Max as a potential thief the moment he saw him."
        },
        {
            "id": 249,
            "phrase": "spot someone (something)",
            "definition": "1. Sl. to give an advantage to someone.  I’ll spot you twenty points.  No need to spot me. I’m the greatest! 2. Sl. to lend someone something.  Can you spot me a few bucks? _I can spot you a whole hundred!"
        }
    ]
}