{
    "dictionary": [
        {
            "id": 0,
            "phrase": "run-of-the-mill",
            "definition": "common or average; typical.  The restaurant we went to was nothing special—just run-of-themill.  The service was good, but the food was run-of-themill or worse."
        },
        {
            "id": 1,
            "phrase": "rush at someone or something",
            "definition": "to run at or charge toward someone or something. The dog rushed at us and scared us to death. Mary rushed at the door, but it slammed shut before she got there."
        },
        {
            "id": 2,
            "phrase": "rush for something",
            "definition": "to hurry to something.  All the people rushed for the exits when the game was over.  We rushed for the picnic tables as soon as they said that lunch was ready."
        },
        {
            "id": 3,
            "phrase": "rush hour",
            "definition": "the period of time when heavy traffic is moving into or out of a city.  This is the slowest rush hour I have ever been in. Traffic is almost in gridlock."
        },
        {
            "id": 4,
            "phrase": "rush in(to something)",
            "definition": "1. to run or hurry into a thing or a place.  Everyone rushed into the shelter when the rain started.  They all rushed in at once. 2. to begin doing something without the proper preparation.  Don’t rush into this job without thinking it through. Mary rushed in without thinking."
        },
        {
            "id": 5,
            "phrase": "rush off (from some place)",
            "definition": "to hurry away from some place. I’m sorry, but I will have to rush off from this meeting before it’s over. Mary had to rush off before the party was over."
        },
        {
            "id": 6,
            "phrase": "rush out (of something)",
            "definition": "to exit in a hurry.  Everyone rushed out of the room at the same time. They rushed out because they smelled smoke."
        },
        {
            "id": 7,
            "phrase": "rush someone into something",
            "definition": "to hurry someone into doing something. We rushed Harry into taking the job. Sally has always hated that dress. Sam rushed her into buying it."
        },
        {
            "id": 8,
            "phrase": "rush someone to the hospital",
            "definition": "to take someone to the hospital very quickly.  They had to rush her to the hospital because she had stopped breathing. We rushed Uncle Harry to the hospital after he complained of chest pains."
        },
        {
            "id": 9,
            "phrase": "rush something into print",
            "definition": "to print up something hastily. The story was so timely that the newspaper editor rushed it into print without checking all the details. We will rush the book into print as soon as the author finishes."
        },
        {
            "id": 10,
            "phrase": "rush something off† (to someone or something)",
            "definition": "to send something quickly to someone or something. I will rush your order off to you immediately.  I need to rush off this package to Walter."
        },
        {
            "id": 11,
            "phrase": "rush something through (something)",
            "definition": "to pass something through a physical area rapidly.  He rushed the ambulance through the gate to the stadium. Strong blowers rushed many cubic feet of air through the ductwork into all the rooms."
        },
        {
            "id": 12,
            "phrase": "rush through something",
            "definition": "to hurry to get something finished; to race through something.  Please don’t rush through this business. Get it right. Timmy rushed through dinner so he could go out and play."
        },
        {
            "id": 13,
            "phrase": "rush to conclusions",
            "definition": "to try to reach a conclusion too fast, probably with insufficient evidence; to jump to conclusions.  I hope that you don’t rush to any conclusions. I can explain this.  I’m afraid you are rushing to conclusions when you speak of canceling the performance."
        },
        {
            "id": 14,
            "phrase": "rush to someone or something",
            "definition": "to hurry to get to someone, something, or some event.  I rushed to the injured man to try to help him. We all rushed to the office to see what had happened."
        },
        {
            "id": 15,
            "phrase": "rust away",
            "definition": "to dissolve away into rust. In a few years, this car will rust away if you don’t take care of it.  The bridge is rusting away, little by little."
        },
        {
            "id": 16,
            "phrase": "rust belt",
            "definition": "the industrial north of the United States. (Patterned on sun belt.) _The economy in the rust belt is slowing down.  The salt they put on the roads in the winter made my car all rusty. I guess that’s why they call this area the rust belt."
        },
        {
            "id": 17,
            "phrase": "rust out",
            "definition": "to develop holes or weak places owing to rust.  Our hot water heater rusted out and f looded the basement."
        },
        {
            "id": 18,
            "phrase": "rustle something up†",
            "definition": "Rur. to manage to prepare a meal, perhaps on short notice.  I think I can rustle something up for dinner.  Please rustle up something to eat."
        },
        {
            "id": 19,
            "phrase": "sack out",
            "definition": "to go to bed or go to sleep.  It’s time for me to sack out.  Let’s sack out early tonight."
        },
        {
            "id": 20,
            "phrase": "sack something up†",
            "definition": "to put something into bags or sacks.  Please sack the groceries up and put them in the cart.  I will sack up your groceries."
        },
        {
            "id": 21,
            "phrase": "sacked out",
            "definition": "asleep.  Mary is sacked out in her room.  Here it is ten o’clock, and you are still sacked out!"
        },
        {
            "id": 22,
            "phrase": "sacred cow",
            "definition": "something that is regarded by some people with such respect and veneration that they do not like it being criticized by anyone in any way. (From the fact that the cow is regarded as sacred in India and is not eaten or mistreated.) _A university education is a sacred cow in the Smith family. Fred is regarded as a failure because he quit school at 16.  Don’t talk about eating meat to Pam. Vegetarianism is one of her sacred cows."
        },
        {
            "id": 23,
            "phrase": "sacrifice someone or something for someone or something",
            "definition": "to forfeit someone or something for the sake of someone or something.  Surely you won’t sacrifice your dear wife for a silly twit like Francine! _ Would you sacrifice your bank account for a chance to go to Europe?"
        },
        {
            "id": 24,
            "phrase": "sacrifice someone or something to someone or something",
            "definition": "to make an offering of or give up someone or something to someone or some power. The high priest prepared to sacrifice the prisoner to the gods.  I sacrificed a lot of money to a fancy lifestyle."
        },
        {
            "id": 25,
            "phrase": "sadder but wiser",
            "definition": "Cliché unhappy but knowledgeable [about someone or something—after an unpleasant event].  After the accident, I was sadder but wiser, and would never make the same mistake again.  We left the meeting sadder but wiser, knowing that we could not ever come to an agreement with Becky’s aunt."
        },
        {
            "id": 26,
            "phrase": "saddle an animal up†",
            "definition": "to put a saddle on a horse or some other beast of burden. Please saddle my horse up. I have to leave.  Would you saddle up my horse for me?"
        },
        {
            "id": 27,
            "phrase": "saddle someone with someone or something",
            "definition": "to burden someone with someone or something undesirable, annoying, or difficult to deal with. I apologize for saddling you with my young cousin all day. I didn’t mean to saddle you with my problems."
        },
        {
            "id": 28,
            "phrase": "saddle up",
            "definition": "to prepare one’s horse for riding by putting a saddle on it.  Let’s saddle up and go for a ride."
        },
        {
            "id": 29,
            "phrase": "saddled with someone or something",
            "definition": "burdened with someone or something.  I’ve been saddled with the children all day. Let’s go out tonight.  I don’t want to be saddled with your work."
        },
        {
            "id": 30,
            "phrase": "safe and sound",
            "definition": "unharmed and whole or healthy.  It was a rough trip, but we got there safe and sound.  I’m glad to see you here safe and sound."
        },
        {
            "id": 31,
            "phrase": "safeguard against someone or something",
            "definition": "to protect against someone or something. We will try to safeguard against accidents. How can I safeguard against prowlers?"
        },
        {
            "id": 32,
            "phrase": "safeguard someone or something against someone or something",
            "definition": "to protect someone or something against someone or something. We will take action that will safeguard you against a recurrence of the unpleasantness.  I will safeguard my family against the prowler."
        },
        {
            "id": 33,
            "phrase": "safety in numbers",
            "definition": "safety achieved by being concealed in or united with large numbers of people or other creatures.  We stayed close together, thinking that there was safety in numbers.  The elderly people went out together for a walk, knowing that there was safety in numbers."
        },
        {
            "id": 34,
            "phrase": "sag away (from something)",
            "definition": "to settle or droop down or away.  The cloth sagged away from the edge of the table."
        },
        {
            "id": 35,
            "phrase": "sag down",
            "definition": "to droop downward. The branch sagged down and nearly touched the ground.  When the rain got the drapes wet, they sagged down and touched the f loor."
        },
        {
            "id": 36,
            "phrase": "sag under something",
            "definition": "to droop under the burden of something.  The porch roof sagged under the weight of the snow.  The springs of the car sagged under the weight of all the passengers."
        },
        {
            "id": 37,
            "phrase": "sage advice",
            "definition": "very good and wise advice. My parents gave me some sage advice when I turned 18.  I asked my uncle for some of his sage advice."
        },
        {
            "id": 38,
            "phrase": "sail against something",
            "definition": "to operate a boat or ship, so as to move against the wind.  It takes skill and training to sail against the wind.  The huge cruise ship sailed against the wind all the way to St. Thomas."
        },
        {
            "id": 39,
            "phrase": "sail along (something)",
            "definition": "to travel on a course in a boat or plane. The huge white ship sailed along the Amazon River slowly and peacefully.  The boat sailed along peacefully."
        },
        {
            "id": 40,
            "phrase": "sail around",
            "definition": "to travel by water in a boat or ship.  We sailed around for about an hour and then went back to the shore.  Let’s go out and sail around before dinner."
        },
        {
            "id": 41,
            "phrase": "sail for some place",
            "definition": "to depart in a boat or ship for some place.  This ship sails for Bridgetown, Barbados, at noon today.  We will sail for home early in the morning."
        },
        {
            "id": 42,
            "phrase": "sail from some place to some place else",
            "definition": "to move or travel from one place to another in a boat or ship.  We sailed from San Juan to Acapulco. The ship sailed from its home port to Baltimore overnight."
        },
        {
            "id": 43,
            "phrase": "sail into someone",
            "definition": "to attack someone; to chastise someone. (Based on sail into someone or something.) _ The angry coach sailed into the players.  The teacher sailed into Timmy for breaking the window."
        },
        {
            "id": 44,
            "phrase": "sail into someone or something",
            "definition": "1. to crash into someone or something with a boat or ship.  The boat sailed into the dock, causing considerable damage.  I was in my skiff when a larger boat sailed into me. 2. to crash into someone or something.  The missile sailed into the soldiers, injuring a few.  The car sailed into the lamppost."
        },
        {
            "id": 45,
            "phrase": "sail in(to something)",
            "definition": "to travel into something or some place in a boat or ship.  We sailed into the harbor nearly an hour late. We sailed in at noon."
        },
        {
            "id": 46,
            "phrase": "sail (right) through something",
            "definition": "to travel through something in a boat or ship. The line of boats sailed right through the Grenadines in the daylight hours.  We sailed through the narrows without a pilot."
        },
        {
            "id": 47,
            "phrase": "sail under false colors",
            "definition": "to sail with false identification. (Pirates often sailed under the national flag of the ship they planned on attacking.) _ The ship, sailing under false colors, suddenly started to pursue our ship.  Bluebeard the pirate was known for sailing under false colors."
        },
        {
            "id": 48,
            "phrase": "sail up a river",
            "definition": "to travel upstream on a river in a boat or ship. We sailed up the Amazon River in a large, seagoing ship.  It was not possible to sail up the Mississippi as far as we wanted."
        },
        {
            "id": 49,
            "phrase": "sally forth",
            "definition": "to go forth; to leave and go out.  The soldiers sallied forth from behind the stone wall. Well, it’s time to sally forth and drive to work."
        },
        {
            "id": 50,
            "phrase": "the salt of the earth",
            "definition": "the most worthy of people; a very good or worthy person. (A biblical reference, Matthew 5:13.) _ Mrs. Jones is the salt of the earth. She is the first to help anyone in trouble.  Frank’s mother is the salt of the earth. She has five children of her own and yet fosters three others."
        },
        {
            "id": 51,
            "phrase": "salt something away†",
            "definition": "to store and preserve a foodstuff by salting it.  The farmer’s wife salted a lot of fish and hams away for the winter.  She salted away a lot of food."
        },
        {
            "id": 52,
            "phrase": "salt something down†",
            "definition": "to place salt on something, such as icy roads.  I won’t go out until midmorning, after they have salted the roads down.  I hope they salt down the roads soon."
        },
        {
            "id": 53,
            "phrase": "salt something with something",
            "definition": "to put a variety of salt or a salt substitute onto some food.  Oscar salts his food with a salt substitute. Did you salt your meat with salt or something else?"
        },
        {
            "id": 54,
            "phrase": "salute someone with something",
            "definition": "to greet someone with a formal hand salute.  He failed to salute the officer with the proper salute and was reprimanded.  David saluted the captain with the appropriate salute and passed on by."
        },
        {
            "id": 55,
            "phrase": "salvage something from someone or something",
            "definition": "to rescue or save something from someone or something. The baby got into the eggs, but I was able to salvage about six of them from him before they were broken all over the place. I salvaged a good pair of shoes from the trash."
        },
        {
            "id": 56,
            "phrase": "the same as someone or something",
            "definition": "identical to someone or something.  Can you build me a birdhouse the same as yours? _Have you noticed that Mary looks the same as her mother?"
        },
        {
            "id": 57,
            "phrase": "same difference",
            "definition": "the same; no difference at all.  Pink, fuchsia, what does it matter? Same difference.  Whether you go or I go, it’s the same difference."
        },
        {
            "id": 58,
            "phrase": "Same here.",
            "definition": "Me too!; I agree! _Bob: I’ll have chocolate ice cream! Bill: Same here.  Mary: I’ll vote for the best candidate. Tom: Same here!"
        },
        {
            "id": 59,
            "phrase": "same o(l)’ same o(l)’",
            "definition": "Sl. the same old thing as one has had before or is used to. I’m getting tired of the same ol’ same ol’.  Why not something different? Do you like the same o’ same o’?"
        },
        {
            "id": 60,
            "phrase": "the same old story",
            "definition": "something that occurs or has occurred in the same way often. Jim’s got no money. It’s the same old story. He’s spent it all on clothing. The company is getting rid of workers. It’s the same old story—a shortage of orders."
        },
        {
            "id": 61,
            "phrase": "The same to you.",
            "definition": "The same comment applies to you. (This can be a polite or a rude comment.) _ Bill: Have a pleasant evening. Bob: Thank you. The same to you.  Mary: You’re the most horrible person I’ve ever met! John: The same to you!"
        },
        {
            "id": 62,
            "phrase": "sand something down†",
            "definition": "1. to make something smooth by rubbing it with sandpaper. (To act on the main body of the object, not the imperfections.) _ You should sand the board down before you paint it.  Please sand down the board. 2. to remove bumps or imperfections on the surface of something by rubbing them with sandpaper. (To act on the imperfections, not the main body of the object.) _ Sand these bumps down, will you? _ Sand down these bumps, please."
        },
        {
            "id": 63,
            "phrase": "the sands of time",
            "definition": "the accumulated tiny amounts of time; time represented by the sand in an hourglass. The sands of time will make you grow old like everyone else.  My only enemy is the sands of time."
        },
        {
            "id": 64,
            "phrase": "sandwich someone or something between people or things",
            "definition": "to enclose someone or something on both sides between people or things in any combination.  We had to sandwich the children between us because there were no other seats close by.  We had to sandwich the package between Ed and the side of the bus."
        },
        {
            "id": 65,
            "phrase": "satiate someone or an animal with something",
            "definition": "to provide enough of something for someone or an animal.  The waiters set out to satiate the guests with whatever sinful desserts they desired.  The zookeeper satiated the tigress with a huge leg of beef."
        },
        {
            "id": 66,
            "phrase": "satisfy someone or an animal with something",
            "definition": "to use something to please or content someone or an animal.  Do you think I can satisfy Mrs. Franklin with payment for her broken window? _ A dog biscuit will satisfy the dog until its regular feeding time."
        },
        {
            "id": 67,
            "phrase": "saturate someone or something with something",
            "definition": "to drench someone or something thoroughly with something. The rain saturated them all with cooling water. Irrigation saturated the field with the moisture they needed."
        },
        {
            "id": 68,
            "phrase": "Saturday night special",
            "definition": "a small, easily obtainable pistol.  There was another killing last night with a Saturday night special.  That’s the tenth shooting done with a Saturday night special this week."
        },
        {
            "id": 69,
            "phrase": "saunter along",
            "definition": "to walk along slowly; to ramble along.  Bob sauntered along, looking as if he didn’t have a care in the world.  I was just sauntering along, minding my own business, when all of a sudden a mugger jumped out and swiped my purse."
        },
        {
            "id": 70,
            "phrase": "save a bundle (on something)",
            "definition": "to save a lot of money on the purchase of something. I managed to save a bundle on a car by buying a used one."
        },
        {
            "id": 71,
            "phrase": "Save it!",
            "definition": "Inf. Stop talking.; Shut up!; Tell it to me later.  I’ve heard enough. Save it! _ Save it! You talk too much!"
        },
        {
            "id": 72,
            "phrase": "save (money) on something",
            "definition": "to save money or some amount of money on the purchase of something.  I can save a lot of money on this purchase by buying it somewhere else.  I am sure you can save on a new car if you shop wisely."
        },
        {
            "id": 73,
            "phrase": "save (money) toward something",
            "definition": "to accumulate money toward the purchase of something.  I am saving my money toward the purchase of a big-screen TV.  I’m saving toward a new car."
        },
        {
            "id": 74,
            "phrase": "save money up† (for something)",
            "definition": "to accumulate an amount of money for the purchase of something.  I’m saving my money up for a car.  Save up your money for a car."
        },
        {
            "id": 75,
            "phrase": "save one’s breath",
            "definition": "to refrain from talking, explaining, or arguing.  There is no sense in trying to convince her. Save your breath. Tell her to save her breath. He won’t listen to her."
        },
        {
            "id": 76,
            "phrase": "save (one’s) face",
            "definition": "to preserve one’s good standing, pride, or high position (after a failure). The ambassador was more interested in saving his face than winning the argument.  Most diplomats are concerned with saving face."
        },
        {
            "id": 77,
            "phrase": "save oneself (for marriage)",
            "definition": "Euph. to remain a virgin until marriage.  No, I can’t. I love you, but I’m saving myself for marriage.  His buddies teased him, asking if he was saving himself."
        },
        {
            "id": 78,
            "phrase": "save someone or something from someone or something",
            "definition": "to rescue someone or something from someone or something.  The cop was able to save the kid from his attackers. I managed to save some old photographs from the fire."
        },
        {
            "id": 79,
            "phrase": "save something for someone or something",
            "definition": "to reserve something for someone or something.  Please save some cake for me.  I am saving this cake for tomorrow."
        },
        {
            "id": 80,
            "phrase": "save something up†",
            "definition": "to save something; to accumulate something.  I’m saving up cans for recycling.  If you’d only save your money up, you could buy anything you want."
        },
        {
            "id": 81,
            "phrase": "save the day",
            "definition": "to produce a good result when a bad result was expected.  The team was expected to lose, but Sally made three points and saved the day.  Your excellent speech calmed the crowd and saved the day."
        },
        {
            "id": 82,
            "phrase": "save (up) (for something)",
            "definition": "to accumulate money in order to buy something.  I can’t buy a car because I am saving up for college.  I don’t have the money now, but I am saving up."
        },
        {
            "id": 83,
            "phrase": "saved by the bell",
            "definition": "Cliché saved by the timely intervention of someone or something. (Alludes to a boxer who is saved from being counted out by the bell that ends a round.) _ I was going to have to do my part, but someone knocked on the door and I didn’t have to do it. I was saved by the bell.  I wish I had been saved by the bell."
        },
        {
            "id": 84,
            "phrase": "saving grace",
            "definition": "Cliché the one thing that saves or redeems someone or something that would otherwise be a total disaster.  Her saving grace is that she has a lot of money.  The saving grace for the whole evening was the good music played by the band."
        },
        {
            "id": 85,
            "phrase": "savor of something",
            "definition": "to taste like something.  This casserole savors of nutmeg.  The meat savors of too much garlic."
        },
        {
            "id": 86,
            "phrase": "saw into something",
            "definition": "to cut into something with a saw.  The carpenter sawed into the beam and had it cut in two in no time at all.  Be careful not to saw into the table."
        },
        {
            "id": 87,
            "phrase": "saw something down†",
            "definition": "to cut something down with a saw.  We are going to have to saw that dead tree down before it falls on the house.  I’ll saw down the tree."
        },
        {
            "id": 88,
            "phrase": "saw through something",
            "definition": "to cut through something with a saw.  I can’t saw through this wood. It’s too hard! _ I can saw through it!"
        },
        {
            "id": 89,
            "phrase": "say a mouthful",
            "definition": "to say a lot; to say something very important or meaningful.  When you said things were busy around here, you said a mouthful. It is terribly busy.  You sure said a mouthful, Bob. Things are really busy."
        },
        {
            "id": 90,
            "phrase": "Say cheese!",
            "definition": "Inf. an expression used by photographers to get people to smile, which they must do while saying the word cheese. “All of you please stand still and say cheese!” said the photographer. “Is everybody ready? Say cheese!” asked Mary, aiming the camera."
        },
        {
            "id": 91,
            "phrase": "say grace",
            "definition": "to say a prayer of gratitude before or after a meal.  Grandfather always says grace at Thanksgiving.  A local preacher said grace at the banquet."
        },
        {
            "id": 92,
            "phrase": "Say hello to someone (for me).",
            "definition": "Please convey my good wishes to someone. (The someone can be a person’s name or a pronoun. See also Give my best to someone.; Remember me to someone.) _ Andy: Good-bye, Tom. Say hello to your brother for me. Tom: Sure. Bye, Andy.  Sally: Well, good-bye. Mary: Bye. Sally: And say hello to Jane. Mary: Sure. Bye-bye."
        },
        {
            "id": 93,
            "phrase": "Say no more.",
            "definition": "Inf. I agree.; I will do it.; I concede, no need to continue talking.  John: Someone ought to take this stuff outside. Bill: Say no more. Consider it done.  Mary: Shouldn’t we turn here if we plan to visit Jane? Alice: Say no more. Here we go."
        },
        {
            "id": 94,
            "phrase": "say something about someone or something",
            "definition": "1. to make remarks about someone or something.  What did you say about me? _I think that Fran must have said something about me to you. 2. to indicate or reveal something about someone or something. They all cheered. That really says something about Tom’s popularity.  The fact that almost no one came to his party says something about Walter, I think."
        },
        {
            "id": 95,
            "phrase": "say something against someone or something",
            "definition": "to speak out against someone or something; to make a case against someone or something.  I would never say anything against you! _ No one would say anything against your work."
        },
        {
            "id": 96,
            "phrase": "say something for something",
            "definition": "[for something] to imply something good about something.  The speed with which we were able to sell the house says something for the state of the real estate market.  The number of new cars on the road says something for the state of the nation’s economy."
        },
        {
            "id": 97,
            "phrase": "say something in a roundabout way",
            "definition": "to imply something without saying it; to say something indirectly; to speak using circumlocution.  Why don’t you say what you mean? Why do you always say something in a roundabout way? _What did she mean? Why did she say it in a roundabout way?"
        },
        {
            "id": 98,
            "phrase": "say something out loud",
            "definition": "to say something so it can be heard; to say something that others might be thinking, but not saying.  Yes, I said it, but I didn’t mean to say it out loud.  If you know the answer, please say it out loud."
        },
        {
            "id": 99,
            "phrase": "say something over (and over (again))",
            "definition": "to repeat something, perhaps many times.  I have said it over and over again! Why don’t you listen? _ Why do you keep saying it over?"
        },
        {
            "id": 100,
            "phrase": "say something (right) to someone’s face",
            "definition": "to say something (unpleasant) directly to someone.  She knew I thought she was rude because I said it right to her face.  I thought she felt that way about me, but I never thought she’d say it to my face."
        },
        {
            "id": 101,
            "phrase": "say something to oneself",
            "definition": "to mutter something to oneself so that no one else can hear.  He said something to himself, but I didn’t catch what it was.  I said the answer to myself and no one else was supposed to hear it."
        },
        {
            "id": 102,
            "phrase": "say something to someone",
            "definition": "to tell something to someone.  He didn’t say anything to me. Did someone say something to you?"
        },
        {
            "id": 103,
            "phrase": "say something to something",
            "definition": "to say yes or no to a proposal, request, etc.  I hope you will say yes to my proposal.  Nothing was said to your request at the last meeting."
        },
        {
            "id": 104,
            "phrase": "say the word",
            "definition": "to give a signal to begin; to say yes or okay.  I’m ready to start any time you say the word.  We’ll all shout “Happy Birthday!” when I say the word."
        },
        {
            "id": 105,
            "phrase": "Say what?",
            "definition": "Inf. What did you say?; Please repeat what you said.  Sally: Would you like some more salad? Fred: Say what? Sally: Salad? Would you like some more salad? _ John: Put this one over there. Sue: Say what? John: Never mind, I’ll do it."
        },
        {
            "id": 106,
            "phrase": "Say when.",
            "definition": "Inf. Tell me when I have given you enough of something, usually a liquid. (Sometimes answered simply with When.) _ Tom (pouring milk into Fred’s glass): Say when, Fred. Fred: When.  John: Do you want some more juice? Mary: Yes. John: Okay. Say when."
        },
        {
            "id": 107,
            "phrase": "Says you!",
            "definition": "Inf. That’s just what you say!; You don’t know what you are talking about! _ Fred: You are fat and ugly. Tom: Says you! _ Mary: People who go around correcting other people were found to be very annoying in a recent survey. Bill: Says you!"
        },
        {
            "id": 108,
            "phrase": "scab over",
            "definition": "[for a wound] to form a scab. The wound soon scabbed over and the injury was well on its way to healing.  I hope this shaving cut scabs over before I have to leave for work."
        },
        {
            "id": 109,
            "phrase": "scale something down†",
            "definition": "to reduce the size or cost of something.  The bad economy forced us to scale the project down.  Liz scaled down the project."
        },
        {
            "id": 110,
            "phrase": "scale something to something",
            "definition": "to design or adjust the size of one thing to match or complement the size of another thing.  The architect sought to scale the office building to the buildings surrounding it.  The playhouse will have to be scaled to the main house."
        },
        {
            "id": 111,
            "phrase": "scamper along",
            "definition": "[for a child or small animal] to run along nimbly.  The rabbit scampered along, unaware that a fox was following it.  It is time for Timmy to scamper along home."
        },
        {
            "id": 112,
            "phrase": "scamper away",
            "definition": "[for a child or small animal] to run away nimbly.  The rabbit scampered away across the lawn.  The children scampered away when they heard the teacher coming."
        },
        {
            "id": 113,
            "phrase": "scar over",
            "definition": "[for an injury] to form and leave a scar.  The wound will scar over, but your arm will never be the same as it was before the accident."
        },
        {
            "id": 114,
            "phrase": "scare someone or an animal off†",
            "definition": "to frighten someone or an animal away.  The dog’s barking scared the burglar off.  The barking scared off the prowler."
        },
        {
            "id": 115,
            "phrase": "scare someone or something away† (from someone or something)",
            "definition": "to frighten someone or something away from someone or something.  He put on a gruff exterior to scare everyone away from him.  The bear scared away a lot of people from the campground."
        },
        {
            "id": 116,
            "phrase": "scare someone or something up†",
            "definition": "Rur. to search for and find someone or something.  Go out in the kitchen and scare some food up.  I’ll see if I can scare up somebody to fix the broken chair."
        },
        {
            "id": 117,
            "phrase": "scare someone out of something",
            "definition": "to startle someone; to frighten someone into losing something, such as a year’s worth of growth, ten years of life, etc. You nearly scared me out of my skin! _ The bad news scared Roger out of ten years’ growth."
        },
        {
            "id": 118,
            "phrase": "scare someone stiff",
            "definition": "to frighten someone severely. (Stiff = dead.) _ That loud noise scared me stiff.  The robber jumped out and scared us stiff."
        },
        {
            "id": 119,
            "phrase": "scare something out of someone",
            "definition": "to frighten someone very badly. (The something can be the living daylights, the wits, the hell, the shit, etc. Use discretion with shit.) _ Gee, you scared the living daylights out of me! _ The police tried to scare the truth out of her.  The door blew shut and scared the hell out of me."
        },
        {
            "id": 120,
            "phrase": "scare the pants off (of ) someone",
            "definition": "to frighten someone very badly. (Of is usually retained before pronouns.) _ Wow! You nearly scared the pants off me! _ The explosion scared the pants off of everyone."
        },
        {
            "id": 121,
            "phrase": "scared silly",
            "definition": "frightened very much.  I was scared silly by the loud explosion. We were scared silly to go into the park after dark."
        },
        {
            "id": 122,
            "phrase": "scared stiff",
            "definition": "badly frightened.  We were scared stiff by the robber.  I was scared stiff when the dog growled at me."
        },
        {
            "id": 123,
            "phrase": "scarf out",
            "definition": "Sl. to overeat.  I scarf out whenever we have pizza. My brother scarfs out every day—around the clock!"
        },
        {
            "id": 124,
            "phrase": "scarf something down†",
            "definition": "Sl. to eat something, perhaps in a hurry; to swallow something, perhaps in a hurry.  Are you going to scarf this whole thing down? _ Here, scarf down this sandwich."
        },
        {
            "id": 125,
            "phrase": "scavenge (around) for someone or something",
            "definition": "to search everywhere for someone or something. We had to scavenge for a person who would agree to run for president in my place.  Sam scavenged around for a socket wrench."
        },
        {
            "id": 126,
            "phrase": "scheme against someone or something",
            "definition": "to plot or conspire against someone or something. A group of generals was plotting against the government.  They schemed against the king until he caught them and put an end to it."
        },
        {
            "id": 127,
            "phrase": "scheme for something",
            "definition": "to plot and plan for something, perhaps using deception. She is scheming for a raise. Ted is always scheming for a way to miss work."
        },
        {
            "id": 128,
            "phrase": "schiz(z) out",
            "definition": "Sl. to freak out; to lose mental control.  What a day! I nearly schizzed out.  I schizzed out during the test. Got an F."
        },
        {
            "id": 129,
            "phrase": "the school of hard knocks",
            "definition": "the school of life’s experiences, as opposed to a formal, classroom education.  I didn’t go to college, but I went to the school of hard knocks. I learned everything by experience."
        },
        {
            "id": 130,
            "phrase": "school of thought",
            "definition": "a particular philosophy or way of thinking about something.  One school of thought holds that cats cause allergic reactions.  I come from the school of thought that believes people should always be polite."
        },
        {
            "id": 131,
            "phrase": "school someone in something",
            "definition": "to train, discipline, or coach someone in something.  The voice coach schooled the singer in excellent breathing techniques. We were schooled in oratory and debate.  She schooled herself in patience."
        },
        {
            "id": 132,
            "phrase": "scoff at someone or something",
            "definition": "to show ridicule or scorn for someone or something. The directors scoffed at her when she presented her plan.  They scoffed at my new hat, not realizing how stylish it was."
        },
        {
            "id": 133,
            "phrase": "scold someone about something",
            "definition": "to rebuke or chastise someone about something.  How many times have I scolded you about that? _Please don’t scold me about something I didn’t do."
        },
        {
            "id": 134,
            "phrase": "scold someone for something",
            "definition": "to rebuke or chastise someone for doing something.  The manager scolded the worker for misplacing the door key.  The teacher scolded all the students for their bad behavior."
        },
        {
            "id": 135,
            "phrase": "scoop something up†",
            "definition": "to gather and remove something by scooping, dipping, or bailing. Karen scooped the nuts up and put them in a bag.  Jill scooped up all the money she had won and left the poker table."
        },
        {
            "id": 136,
            "phrase": "scoot down (to some place)",
            "definition": "to go (down) somewhere in a hurry. I want you to scoot down to the store and get me a dozen eggs. Okay? _ I’ll scoot down as soon as I finish reading the newspaper."
        },
        {
            "id": 137,
            "phrase": "scoot over",
            "definition": "to slide sideways while seated. Scoot over and let me sit down. If you scoot over, we can get another person in this row."
        },
        {
            "id": 138,
            "phrase": "scoot over to someone or something",
            "definition": "to travel or move over to someone or something or some place in a hurry.  Scoot over to Don and ask him to come here for a minute. We all scooted over to the stadium for the football game."
        },
        {
            "id": 139,
            "phrase": "scope (on) someone",
            "definition": "Sl. to evaluate a member of the opposite sex visually.  He scoped every girl who came in the door.  He wouldn’t like it if somebody scoped on him. Or would he?"
        },
        {
            "id": 140,
            "phrase": "scope someone or something out†",
            "definition": "Sl. to look someone or something over; to check someone or something out.  Hey, scope the new car out! _ Dave was scoping out all the girls."
        },
        {
            "id": 141,
            "phrase": "score against someone or something",
            "definition": "to make a point or goal against someone or some team.  Because of his bad ankle, Fred was unable to score against his defender.  We never scored against the visiting team."
        },
        {
            "id": 142,
            "phrase": "score something for something",
            "definition": "1. to arrange music for one or more musical instruments; to arrange music for a particular type of voice or voices.  The arranger scored the music for two pianos.  The arranger scored the song for a four-part chorus. 2. to scratch something, such as glass, for breaking.  Valerie scored the piece of glass for breaking and then snapped it off.  The worker scored the pane of glass for snapping off."
        },
        {
            "id": 143,
            "phrase": "score something (up†) against someone or something",
            "definition": "to tally up a score against someone or some team.  Tara scored a few points against Sally. The Bears scored up thirteen points against the Giants."
        },
        {
            "id": 144,
            "phrase": "score with someone or a group",
            "definition": "Inf. to please someone or a group.  Her rendition of “Old Kentucky Home” really scored with the audience.  You really score with me."
        },
        {
            "id": 145,
            "phrase": "scour something for someone or something",
            "definition": "to look carefully and thoroughly in something for someone or something.  I scoured the entire roster of members for a person who would agree to run for president.  The police scoured the entire area for any sign of the suspects."
        },
        {
            "id": 146,
            "phrase": "scour something out†",
            "definition": "to clean something out by scouring.  Would you scour the pans out? _ Please scour out the pans—don’t just wash them."
        },
        {
            "id": 147,
            "phrase": "scour something out of something",
            "definition": "to clean something out of something by scouring.  Did you scour the rust out of the pan? _Please scour the burned material out of the bowl."
        },
        {
            "id": 148,
            "phrase": "scout around (for someone or something)",
            "definition": "to look around for someone or something.  I don’t know who would do a good job for you, but I’ll scout around for a likely candidate.  You stay here. I’ll scout around."
        },
        {
            "id": 149,
            "phrase": "scout someone or something out†",
            "definition": "to search for and discover someone or something.  I will scout a new salesclerk out for you if you want.  I’ll scout out a new clerk for you."
        },
        {
            "id": 150,
            "phrase": "scout someone or something up†",
            "definition": "to search for and find someone or something.  I’ll scout up a costume for the Halloween party.  Can you scout a date up for Friday night?"
        },
        {
            "id": 151,
            "phrase": "scowl at someone or something",
            "definition": "to make a frown of disapproval or displeasure at someone or something.  Why are you scowling at me? I didn’t do anything wrong! _Mary scowled at her noisy cat."
        },
        {
            "id": 152,
            "phrase": "scramble for someone or something",
            "definition": "to push and struggle to get to someone or something. All the teenagers scrambled for the rock star but couldn’t catch him. The children scrambled for the candy as it fell from the piñata."
        },
        {
            "id": 153,
            "phrase": "scrape by (something)",
            "definition": "to manage just to get by something.  I scraped by the man standing at the gate and got into the theater without a ticket. Mary scraped by the cart that was blocking the crowded hallway."
        },
        {
            "id": 154,
            "phrase": "scrape something away† (from something)",
            "definition": "to scratch or rasp something off something.  Ted scraped the rough places away from the fender he was repairing. Ted scraped away the rough places."
        },
        {
            "id": 155,
            "phrase": "scrape something out†",
            "definition": "to empty something by scraping.  Scrape the pan out. Don’t leave any of that good sauce inside.  Please scrape out the pan."
        },
        {
            "id": 156,
            "phrase": "scrape something together†",
            "definition": "to gather things together by scraping. The waiter scraped all the crumbs together and removed them from the table with a little gadget.  Karen scraped together all the trimmings and set them aside."
        },
        {
            "id": 157,
            "phrase": "scrape the bottom of the barrel",
            "definition": "to select from among the worst; to choose from what is left over.  You’ve bought a bad-looking car. You really scraped the bottom of the barrel to get that one.  The worker you sent over was the worst I’ve ever seen. Send me another—and don’t scrape the bottom of the barrel."
        },
        {
            "id": 158,
            "phrase": "scrape through (something)",
            "definition": "to move through something, scraping or rubbing the sides. The car, going at a very high speed, scraped through the tunnel.  It just managed to scrape through."
        },
        {
            "id": 159,
            "phrase": "scratch at something",
            "definition": "to scratch something. You shouldn’t scratch at a chigger bite because it might get infected.  Don’t scratch at it!"
        },
        {
            "id": 160,
            "phrase": "scratch someone or something from something",
            "definition": "to mark the name of someone or something off a list.  We were obliged to scratch Dave from the list. The judges scratched the large collie from the eligibility list."
        },
        {
            "id": 161,
            "phrase": "scratch someone or something out†",
            "definition": "to mark out the name of someone or something. I scratched John out and wrote in George instead.  I scratched out John and forgot about him."
        },
        {
            "id": 162,
            "phrase": "scratch someone or something up†",
            "definition": "to damage or mar someone or something by scratching.  Being thrown clear of the car in the accident didn’t break any bones, but it scratched her up a lot. Who scratched up my coffee table?"
        },
        {
            "id": 163,
            "phrase": "scratch someone’s back",
            "definition": "to scratch, usually with the fingers, the parts of someone’s back that they cannot reach.  Please scratch my back between my shoulder blades."
        },
        {
            "id": 164,
            "phrase": "scratch something away†",
            "definition": "to rub or scrape something off by scratching.  Look at the finish on this furniture. The cat has almost scratched it away! _That cat scratched away the finish on the table!"
        },
        {
            "id": 165,
            "phrase": "scratch the surface",
            "definition": "to scratch something just on the surface, not extending the mark below the finish into the wood, stone, marble, below. There is no serious damage done to the bench. You only scratched the surface."
        },
        {
            "id": 166,
            "phrase": "scream at someone or something",
            "definition": "to yell or screech at someone or something.  Why are you screaming at me? _ Go scream at the dog, not me!"
        },
        {
            "id": 167,
            "phrase": "scream down (on someone or something)",
            "definition": "[for something, such as birds or bombs] to dive down on someone or something, with a loud noise or very swiftly.  The bombs screamed down on the helpless peasants.  As the bombs screamed down, some people ran and some prayed."
        },
        {
            "id": 168,
            "phrase": "scream for something",
            "definition": "to yell or shriek for something.  The teenage audience applauded and screamed for more.  The children said they were screaming for ice cream."
        },
        {
            "id": 169,
            "phrase": "scream someone down†",
            "definition": "to scream loudly at someone; to outscream someone. (Compare this with shout someone down.) _ The angry crowd screamed down the politician.  They screamed her down and drove her from the platform."
        },
        {
            "id": 170,
            "phrase": "scream something out†",
            "definition": "to say something in a very loud voice.  She screamed his name out for everyone to hear.  Liz screamed out the winner’s name."
        },
        {
            "id": 171,
            "phrase": "scream with something",
            "definition": "to scream because of something, such as pain, anger, rage, etc. Frank screamed with pain when the car door closed on his fingers.  The teacher screamed with rage when the student talked back."
        },
        {
            "id": 172,
            "phrase": "screeching (drunk)",
            "definition": "Sl. intoxicated; very drunk.  How can anybody be so screeching drunk on four beers? _ She’s not just drunk; she’s screeching."
        },
        {
            "id": 173,
            "phrase": "screen someone or something (off†) (from someone or something)",
            "definition": "to make someone or something out of sight or blocked off to someone or something by erecting a screen.  We screened her off from the patient in the next bed.  We screened off the yard from the street."
        },
        {
            "id": 174,
            "phrase": "screw around",
            "definition": "1. Inf. to mess around; to waste time.  Stop screwing around and get to work! _ I’m not screwing around, I’m thinking. 2. Inf. to play sexually; to indulge in sexual intercourse.  A few couples were screwing around at the party.  They say that Ted and Alice are screwing around a lot."
        },
        {
            "id": 175,
            "phrase": "screw around with someone or something",
            "definition": "Inf. to fiddle with or mess around with someone or something. Andy screwed around with his clock until he broke it.  Look, chum! Don’t screw around with me!"
        },
        {
            "id": 176,
            "phrase": "screw off",
            "definition": "Inf. to waste time.  Stop screwing off and get busy! _ I’m not screwing off. This is my lunch hour."
        },
        {
            "id": 177,
            "phrase": "screw someone around",
            "definition": "Inf. to harass or bother someone. Don’t screw me around, man! I bite back! _Max got tired of being screwed around by Lefty."
        },
        {
            "id": 178,
            "phrase": "screw someone or something up†",
            "definition": "Inf. to interfere with someone or something; to mess up someone or something.  Try again and don’t screw it up this time.  You really screwed up my brother by not being on time."
        },
        {
            "id": 179,
            "phrase": "screw someone out of something",
            "definition": "Inf. to cheat someone out of something.  I think you screwed me out of ten bucks on that deal.  Max screwed me out of what was due me."
        },
        {
            "id": 180,
            "phrase": "screw someone over†",
            "definition": "Sl. to give someone a very bad time; to scold someone severely. Those guys really screwed you over. What started it? _Don’t think you can screw over me and my friends. I won’t let you."
        },
        {
            "id": 181,
            "phrase": "screw someone up†",
            "definition": "Inf. to confuse someone mentally.  Please don’t screw me up again! _You screwed up my train of thought."
        },
        {
            "id": 182,
            "phrase": "screw something down†",
            "definition": "to secure something to the floor or a base by the use of screws. You had better screw these seats down or someone will knock them over. Please screw down the shelf."
        },
        {
            "id": 183,
            "phrase": "screw something into something",
            "definition": "to twist something that is threaded into something.  I screwed all the screws into the back of the computer and turned it on.  Please screw this bracket into the wall."
        },
        {
            "id": 184,
            "phrase": "screw something (on)(to something)",
            "definition": "to attach something to something by the use of screws or other threaded fasteners. Screw the bracket onto the wall, will you? _Screw on the bracket to the wall."
        },
        {
            "id": 185,
            "phrase": "screw something up†",
            "definition": "to attach something to a higher place by the use of screws.  The bracket holding the shelf up has come loose. Will you please screw it up again? _ Please screw up this loose bracket."
        },
        {
            "id": 186,
            "phrase": "screw up",
            "definition": "1. Inf. to mess up.  I hope I don’t screw up this time. The waiter screwed up again. 2. Inf. a mess; a blunder; utter confusion. (Usually screw-up.) _ This is the chef ’s screw-up, not mine.  One more screw-up like that and you’re fired."
        },
        {
            "id": 187,
            "phrase": "screw up one’s courage",
            "definition": "to build up one’s courage.  I guess I have to screw up my courage and go to the dentist.  I spent all morning screwing up my courage to take my driver’s test."
        },
        {
            "id": 188,
            "phrase": "screwed, blued, and tattooed",
            "definition": "1. Sl. taken advantage of _ I got a bad deal. I got screwed, blued, and tattooed.  When John bought his wreck of a car, he got screwed, blued, and tattooed. 2. Sl. intoxicated. Who wants to go out and get screwed, blued, and tattooed? _ All four of them went out and got screwed, blued, and tattooed."
        },
        {
            "id": 189,
            "phrase": "screwed up",
            "definition": "Inf. ruined; messed up.  This is a really screwed up schedule. Let’s start over again.  Your schedule is completely screwed up."
        },
        {
            "id": 190,
            "phrase": "scribble away (at something)",
            "definition": "to write hard and fast at some task.  He scribbled away at his notes as the lecturer droned on.  Jane sat in the library scribbling away."
        },
        {
            "id": 191,
            "phrase": "scribble something down†",
            "definition": "to write something down fast and not too neatly.  He scribbled the figure down and raced for the telephone. Liz scribbled down the telephone number."
        },
        {
            "id": 192,
            "phrase": "scrimp on something",
            "definition": "to try to economize on the use of something; to fail to use enough of something.  Please don’t scrimp on the quality of the food.  There is enough money. You don’t have to scrimp on anything."
        },
        {
            "id": 193,
            "phrase": "scrounge around (for someone or something)",
            "definition": "to look around all over for someone or something.  I scrounged around for Jamie, but she was nowhere to be found. I will try to scrounge around for a replacement part that will do the job."
        },
        {
            "id": 194,
            "phrase": "scrounge someone or something up†",
            "definition": "to find someone or something somewhere; to dig someone or something up.  I can’t think of anyone just now, but I will scrounge someone up.  They scrounged up an escort for Liz."
        },
        {
            "id": 195,
            "phrase": "scrub someone or something down†",
            "definition": "to clean someone or something thoroughly by rubbing. The mother scrubbed the baby down gently and put lotion on her.  Please scrub down this f loor."
        },
        {
            "id": 196,
            "phrase": "scrub someone or something off†",
            "definition": "to clean someone or something by rubbing.  Mother scrubbed Timmy off.  Liz scrubbed off the countertop."
        },
        {
            "id": 197,
            "phrase": "scrub something away†",
            "definition": "to clean something away by rubbing.  See if you can scrub that rust away.  Scrub away that rust if you can."
        },
        {
            "id": 198,
            "phrase": "scrub something out†",
            "definition": "to clean out the inside of something by rubbing or brushing.  Please scrub these pots out and put them away.  Jim will scrub out the pots."
        },
        {
            "id": 199,
            "phrase": "scrub up",
            "definition": "to clean oneself up.  You have to scrub up before dinner.  Please go scrub up before you come to the table."
        },
        {
            "id": 200,
            "phrase": "scrunch down",
            "definition": "to squeeze or huddle down into a smaller shape.  Mary scrunched down, trying to hide behind the chair.  The children scrunched down so they wouldn’t be seen."
        },
        {
            "id": 201,
            "phrase": "scrunch down into something",
            "definition": "to squeeze down into a small area or container.  Fred scrunched down into his seat, hoping no one would see him there.  Don’t scrunch down into your seat. It’s bad for your posture."
        },
        {
            "id": 202,
            "phrase": "scrunch something down† (into something)",
            "definition": "1. to squeeze something into a smaller size or shape.  He scrunched the wad of paper down into a hard ball.  Liz scrunched down the cloth into a pad for the hot pan.  Scrunch the boxes down before you throw them away. 2. to pack something tightly into something.  Dave scrunched his clothing down into the drawer and closed it.  Dave scrunched down his clothing into the suitcase."
        },
        {
            "id": 203,
            "phrase": "scrunch something up†",
            "definition": "to crush or crunch up. I pounded the biscuits and scrunched them up into crumbs.  He scrunched up the note and threw it upon the fire."
        },
        {
            "id": 204,
            "phrase": "scuff something up†",
            "definition": "to scrape or scratch something. Who scuffed my f loor up? _Please don’t scuff up my freshly polished f loors!"
        },
        {
            "id": 205,
            "phrase": "scuffle with someone",
            "definition": "to struggle or have a fight with someone.  The two prisoners scuffled with each other a little till a guard came along and saw them. The cowboys scuff led with the deputies when they came out of the saloon."
        },
        {
            "id": 206,
            "phrase": "scurry along",
            "definition": "to run or scamper along fast. The children scurried along, trotting to school.  We scurried along the trail, keeping watch out for things that might trip us up."
        },
        {
            "id": 207,
            "phrase": "scuttle across something",
            "definition": "to hurry across something. (Said especially of a small animal.) _ A tiny mouse scuttled across the kitchen f loor and startled me. A rabbit scuttled across my path."
        },
        {
            "id": 208,
            "phrase": "scuttle away",
            "definition": "[for a small animal] to run away.  The otters scuttled away as we approached.  A skunk scuttled away quickly—thank heavens."
        },
        {
            "id": 209,
            "phrase": "scuzz someone out†",
            "definition": "Sl. to nauseate someone. He had this unreal face that almost scuzzed me out! _ It’s not nice to scuzz out people like that, especially when you hardly know them."
        },
        {
            "id": 210,
            "phrase": "a sea change",
            "definition": "a major change or transformation.  This is not the time for a sea change in our manufacturing division. There are too many orders at the moment."
        },
        {
            "id": 211,
            "phrase": "seal someone’s fate",
            "definition": "to determine finally the fate of someone.  His lying and cheating sealed his fate. He was convicted and sent to prison."
        },
        {
            "id": 212,
            "phrase": "seal something (up†) (with something)",
            "definition": "to fasten something closed with something.  Please seal this box up with twine.  Would you seal up this box with tape?"
        },
        {
            "id": 213,
            "phrase": "sealed (up)",
            "definition": "Sl. settled; secured; cinched.  The matter was sealed by Monday morning. The contract was sealed up just in time."
        },
        {
            "id": 214,
            "phrase": "seam something with something",
            "definition": "to join the edges of something together with something.  The worker seamed the two parts of the carpet with a special tool. She seamed the material with a strip of cloth to strengthen the seam."
        },
        {
            "id": 215,
            "phrase": "the seamy side of life",
            "definition": "the most unpleasant or roughest aspect of life. (A reference to the inside of a garment where the seams show.) _ Doctors in that area really see the seamy side of life.  Mary saw the seamy side of life when she worked as a volunteer in the homeless shelter."
        },
        {
            "id": 216,
            "phrase": "search after someone or something",
            "definition": "to look for someone or something. (Perhaps over a long period of time.) _ We searched after a suitable candidate for weeks. I am searching after a part for my ’57 Chevy."
        },
        {
            "id": 217,
            "phrase": "search for someone or something",
            "definition": "to look very hard for someone or something.  I searched for Ted everywhere, but he was already gone.  I have searched for my glasses high and low."
        },
        {
            "id": 218,
            "phrase": "Search me.",
            "definition": "Inf. I do not know.; You can search my clothing and my person, but you won’t find the answer to your question anywhere near me. (The two words have equal stress.) _ Jane: What time does Mary’s f light get in? Sally: Search me.  John: What kind of paint should I use on this fence? Bill: Search me."
        },
        {
            "id": 219,
            "phrase": "search someone for something",
            "definition": "to feel, touch, pat, frisk, or examine electronically a person’s body, looking for something hidden underneath the clothes.  The police searched the suspect for hidden weapons.  The airport guard used an electronic instrument to search the passengers for weapons."
        },
        {
            "id": 220,
            "phrase": "search someone or something out†",
            "definition": "to seek and find someone or something. I will search Fred out. I know he’s here somewhere.  We have to search out the key to the safedeposit box."
        },
        {
            "id": 221,
            "phrase": "search something for someone or something",
            "definition": "to examine something, looking for someone or something.  Everyone searched the house for little Wally, but he was not to be found.  I searched all my coat pockets for the note, but I didn’t find it."
        },
        {
            "id": 222,
            "phrase": "search through something",
            "definition": "to examine all the things found in something.  I searched through my books for the answer.  My drawers were searched through thoroughly."
        },
        {
            "id": 223,
            "phrase": "season something with something",
            "definition": "to make something more flavorful with specific spices and herbs.  I always season my stews with lots of freshly ground black pepper. The chili was seasoned with cumin and allspice, among other things."
        },
        {
            "id": 224,
            "phrase": "secede from something",
            "definition": "to withdraw from something.  Which was the first state to secede from the Union? _ We do not want to secede from the organization, but we will if we must."
        },
        {
            "id": 225,
            "phrase": "second-guess someone",
            "definition": "to try to predict what some person will do before it is known to anyone, including the person.  There is no point in trying to second-guess Bob. He is completely unpredictable."
        },
        {
            "id": 226,
            "phrase": "second hand",
            "definition": "from another person or source, not directly from personal experience or observation.  I wasn’t present at the meeting. I heard about it at second hand.  Frank tells stories about the Gulf War, but he got them second hand. He wasn’t actually in the desert with the troops."
        },
        {
            "id": 227,
            "phrase": "*second nature to someone",
            "definition": "easy and natural for someone. (*Typically: be ~; become ~.) _ Swimming is second nature to Jane.  Flying a helicopter is no problem for Bob. It’s become second nature to him."
        },
        {
            "id": 228,
            "phrase": "*second thoughts (about someone or something)",
            "definition": "new doubts about someone or something. (*Typically: get ~; have ~; give someone ~.) _ I’m beginning to get second thoughts about Tom.  You’re giving me second thoughts about going there.  I’m having second thoughts also."
        },
        {
            "id": 229,
            "phrase": "second to none",
            "definition": "better than everything else. This is an excellent car—second to none.  Her suggestion was second to none, and the manager accepted it eagerly."
        },
        {
            "id": 230,
            "phrase": "secure something against someone, something, or an animal",
            "definition": "1. to fasten something against the entry of someone, an animal, or something.  Jane secured the doors and windows against the prowler who was roving around the neighborhood. You had better secure the henhouse against coyotes. 2. to obtain a legal order involving someone or something.  I secured an injunction against Harry. If he bothers you again, he’ll have to go into court to explain himself.  We can’t secure an injunction against this ruling."
        },
        {
            "id": 231,
            "phrase": "security against something",
            "definition": "something that keeps something safe; something that protects; a protection. Insurance provides security against the financial losses owing to theft, loss, or damage.  A good education is a security against unemployment."
        },
        {
            "id": 232,
            "phrase": "seduce someone from something",
            "definition": "to lure someone away from something.  The crooked agent seduced Jerry from his usual honest behavior.  Frank was seduced from his proper ways by the offer of money."
        },
        {
            "id": 233,
            "phrase": "see a man about a dog",
            "definition": "to leave for some unmentioned purpose. (Often refers to going to the rest room.) _ I don’t know where Tom went. He said he had to see a man about a dog.  When John said he was going to see a man about a dog, I thought he would be gone for only a minute."
        },
        {
            "id": 234,
            "phrase": "see about someone or something",
            "definition": "to investigate someone or something; to check on something that someone has said.  I don’t know who is going on the trip. You ask Jill, and I’ll see about Jerry.  I will see about your request."
        },
        {
            "id": 235,
            "phrase": "see after someone or something",
            "definition": "to take care of someone or something. (The same as but less common than look after someone or something.) _Would you please see after Walter? He looks a little pale.  I will see after the committee while they are meeting."
        },
        {
            "id": 236,
            "phrase": "see ahead (of someone or something)",
            "definition": "to be able to see into the distance in front of someone or something. The fog was so thick I couldn’t see ahead of the car.  I can’t see ahead, so I will have to stop."
        },
        {
            "id": 237,
            "phrase": "see around something",
            "definition": "to see what is on the other side of or partially concealed by something. I could not see around the truck in front of me.  Do you think I can see around corners?"
        },
        {
            "id": 238,
            "phrase": "see beyond something",
            "definition": "to be able to perceive into the distance beyond something. Can you see beyond the big tree there, where the barn is on the horizon? _ I can’t see beyond the end of the road. I think I need glasses."
        },
        {
            "id": 239,
            "phrase": "see double",
            "definition": "to see two of everything instead of one, owing to a medical disorder.  When I was driving, I saw two people on the road instead of one. I’m seeing double. There’s something wrong with my eyes.  Mike at first thought he was seeing double when he saw Mary with her sister. He didn’t know she had a twin."
        },
        {
            "id": 240,
            "phrase": "see fit (to do something)",
            "definition": "to decide to do something.  If I see fit to return, I’ll bring Bill with me.  She’ll do it if she sees fit."
        },
        {
            "id": 241,
            "phrase": "See if I care!",
            "definition": "Inf. I do not care if you do it! _Mary: That does it! I’m going home to Mother! John: See if I care! _Sue: I’m putting the sofa here, whether you like it or not. Bill: Go ahead! See if I care!"
        },
        {
            "id": 242,
            "phrase": "See no evil, hear no evil, speak no evil.",
            "definition": "Prov. Ignore any evil that you come in contact with; be virtuous even though there is evil around you. (Often represented by three monkeys, one of which is covering his eyes, one his ears, and one his mouth.) _Jill: Do you have any idea why Fred is staying in the office so late every night? Jane: Not me. Like the three little monkeys, I see no evil, hear no evil, speak no evil."
        },
        {
            "id": 243,
            "phrase": "see one’s way (clear) (to do something)",
            "definition": "to find it possible to do something.  I’d be happy if you could see your way clear to attend our meeting. I wanted to be there, but I couldn’t see my way clear."
        },
        {
            "id": 244,
            "phrase": "see over something",
            "definition": "to be able to have a view over something such as a wall, fence, etc.  I couldn’t see over the fence, but I could hear what was going on.  We could not see over the wall."
        },
        {
            "id": 245,
            "phrase": "see red",
            "definition": "to be angry.  Whenever I think of the needless destruction of trees, I see red. Bill really saw red when the tax bill arrived."
        },
        {
            "id": 246,
            "phrase": "see someone about someone or something",
            "definition": "to confer with someone about someone or something. Jill has to see the boss about one of her office staff members.  I will have to see Jill about getting permission to go."
        },
        {
            "id": 247,
            "phrase": "see someone across something",
            "definition": "to accompany someone across a dangerous area.  Paul saw his mother across the field, which contained a number of hazards.  Timmy offered to see the elderly lady across the street."
        },
        {
            "id": 248,
            "phrase": "see someone as someone or something",
            "definition": "to visualize someone as some other person or type of person.  I see you as a perfect candidate for the job.  I don’t see you as mayor."
        },
        {
            "id": 249,
            "phrase": "see someone as something",
            "definition": "to consider someone or something; to deem someone or something as something.  The manager saw the skilled employee as a godsend. John saw the new salesman as a threat to his territory."
        }
    ]
}