{
    "dictionary": [
        {
            "id": 0,
            "phrase": "language that would fry bacon",
            "definition": "Rur. profanity; swearing; curse words. (“Hot” language.) _ He carried on in language that would fry bacon.  I was shocked when I heard that sweet little girl use language that would fry bacon."
        },
        {
            "id": 1,
            "phrase": "languish in some place",
            "definition": "1. to become dispirited in some place; to weaken and fade away in some place.  Claire languished in prison for her crime. I spent over three days languishing in a stuffy hotel room.  We languished in the airport waiting room while they refueled the plane. 2. to suffer neglect in a place.  The bill languished in the Senate for months on end.  The children languished in the squalid conditions until the court intervened."
        },
        {
            "id": 2,
            "phrase": "languish over someone or something",
            "definition": "to pine over someone or something. There is no point in languishing over Tim. He’ll never come back.  She wasted half her life languishing over her lost opportunities."
        },
        {
            "id": 3,
            "phrase": "the lap of luxury",
            "definition": "a luxurious situation.  I rather enjoy living in the lap of luxury.  You call this pigpen the lap of luxury?"
        },
        {
            "id": 4,
            "phrase": "lap over (something)",
            "definition": "[for something] to extend or project over the edge or boundary of something. The lid lapped over the edge of the barrel, forming a little table.  The blanket did not lap over enough to keep me warm."
        },
        {
            "id": 5,
            "phrase": "lap something up†",
            "definition": "[for an animal] to lick something up.  The dog lapped the ice cream up off the f loor.  The dog lapped up the ice cream."
        },
        {
            "id": 6,
            "phrase": "lap (up) against something",
            "definition": "[for waves] to splash gently against something.  The waves lapped up against the shore softly. The waves lapped against the side of the boat all night long, and I couldn’t sleep."
        },
        {
            "id": 7,
            "phrase": "lapse from grace",
            "definition": "to fall out of favor with God.  The child was told that if he ever smoked even one cigarette, he would lapse from grace for certain. It is easy, these days, to lapse from grace."
        },
        {
            "id": 8,
            "phrase": "lapse into something",
            "definition": "to weaken or slip into something, especially a coma.  The survivor of the crash lapsed into a coma. Aunt Mary lapsed into unconsciousness and died."
        },
        {
            "id": 9,
            "phrase": "*large as life",
            "definition": "in person; actually, and sometimes surprisingly, present at a place. (*Also: as ~.) _ I thought Jack was away, but there he was as large as life.  Jean was not expected to appear, but she turned up large as life."
        },
        {
            "id": 10,
            "phrase": "larger than life",
            "definition": "[of someone] having an aura of greatness, perhaps not supported by the real person.  Perry seemed larger than life to those who had only read about him. To the rest of us, he was a boor.  To the children, the star athlete who spoke at the school assembly seemed larger than life."
        },
        {
            "id": 11,
            "phrase": "lash against something",
            "definition": "[for something, such as wind or water] to beat or whip heavily against something.  The angry waves lashed against the hull of the boat, frightening the people huddled inside.  The wind lashed against the house and kept us awake all night."
        },
        {
            "id": 12,
            "phrase": "lash at someone or something",
            "definition": "to thrash or beat someone or something violently.  The rain lashed at the windows.  The mule driver lashed at his beasts with his whip."
        },
        {
            "id": 13,
            "phrase": "lash back (at someone or something)",
            "definition": "to strike or fight back against someone or something—physically or verbally.  Randy lashed back at his attackers and drove them away.  If you threaten Fred, he’ll lash back."
        },
        {
            "id": 14,
            "phrase": "lash down on someone or something",
            "definition": "[for rain] to beat down on someone or something.  The wind and rain lashed down on us.  The rain lashed down on the young plants and pounded them into the soil."
        },
        {
            "id": 15,
            "phrase": "lash into someone or an animal",
            "definition": "to attack someone or an animal— physically or verbally. Dad lashed into my brother, who had smashed up the car again.  Walter lashed into the cat for tearing the upholstery."
        },
        {
            "id": 16,
            "phrase": "lash into something",
            "definition": "to begin to eat something with vigor.  Mary lashed into the huge ice cream sundae, and ate almost the whole thing.  The workers lashed into their lunches and did not say a word until they had finished."
        },
        {
            "id": 17,
            "phrase": "lash someone or something down†",
            "definition": "to tie someone or something down.  The villain lashed Nell down to the railroad tracks. He lashed down the innocent victim. Lash that cask down so it doesn’t wash overboard."
        },
        {
            "id": 18,
            "phrase": "lash someone or something to something",
            "definition": "to tie someone or something to something.  The boys lashed one of their number to a tree and danced around him like savages.  Abe lashed the cask to the deck.  Frank lashed himself to the mast."
        },
        {
            "id": 19,
            "phrase": "lash something about",
            "definition": "to whip or fling something about violently. The big cat lashed its tail threateningly. The strong wind lashed the tall grass about."
        },
        {
            "id": 20,
            "phrase": "lash something together",
            "definition": "to tie something or things together.  Let’s lash these logs together and make a raft.  Lash two or three of the poles together to make them stronger."
        },
        {
            "id": 21,
            "phrase": "last but not least",
            "definition": "Cliché last in sequence, but not last in importance. (Often said when introducing people.) _The speaker said, “And now, last but not least, I’d like to present Bill Smith, who will give us some final words.” _ And last but not least, here is the final graduate."
        },
        {
            "id": 22,
            "phrase": "last for something",
            "definition": "1. to exist for a period of time; to serve or function for a period of time.  This condition has lasted for some time.  Enjoy it while you can. It won’t last forever. 2. to hold out or survive for a period of time.  It’s so hot in here. I don’t think I can last for another minute. Can you last for another few minutes while I get this window open?"
        },
        {
            "id": 23,
            "phrase": "last (from something) until something",
            "definition": "to endure from one point in time to another.  The meeting lasted from noon until midnight.  The party lasted until the food ran out."
        },
        {
            "id": 24,
            "phrase": "the last hurrah",
            "definition": "a final appearance, as at the end of one’s career; the last time for doing something.  Tom is retiring, and we are having a little party as his last hurrah right now. He won’t be here the next time you visit our offices."
        },
        {
            "id": 25,
            "phrase": "*the last laugh (on someone)",
            "definition": "laughter or ridicule at someone who has laughed at or ridiculed you. (*Typically: get ~; have ~; give someone ~.) _ John laughed when I got a D on the final exam. I got the last laugh, though. He failed the course.  Mr. Smith said I was foolish when I bought an old building. I had the last laugh when I sold it a month later for twice what I paid for it."
        },
        {
            "id": 26,
            "phrase": "last out",
            "definition": "to hold out; to endure.  How long can you last out? _ I don’t think we can last out much longer without food and water."
        },
        {
            "id": 27,
            "phrase": "the last roundup",
            "definition": "death. (Old West.) _ To everyone’s surprise, he clutched the wound and faced the last roundup with a smile.  When I know I’m headed for the last roundup, I’ll write a will."
        },
        {
            "id": 28,
            "phrase": "last something out†",
            "definition": "to endure until the end of something.  Ed said that he didn’t think he could last the opera out and left.  He couldn’t last out the first act."
        },
        {
            "id": 29,
            "phrase": "last will and testament",
            "definition": "a will; the last edition of someone’s will.  The lawyer read Uncle Charles’s last will and testament to a group of expectant relatives. Fred dictated his last will and testament on his deathbed."
        },
        {
            "id": 30,
            "phrase": "*last-ditch effort",
            "definition": "a final effort; the last possible attempt. (*Typically: be ~; have ~; make ~.) _ I made one last-ditch effort to get her to stay. It was a lastditch effort. I didn’t expect it to work."
        },
        {
            "id": 31,
            "phrase": "latch on(to someone)",
            "definition": "to get hold of someone.  I don’t know where Jane is. Let me try to latch onto her."
        },
        {
            "id": 32,
            "phrase": "latch onto something",
            "definition": "1. Fig. to obtain something.  I have to latch onto a hundred bucks by Friday night.  I latched onto a good book about repairing plumbing. 2. Fig. to begin to understand something.  When Fred finally latched onto the principles of algebra, he began to get better grades.  Sue doesn’t quite latch onto the proper stance in golf."
        },
        {
            "id": 33,
            "phrase": "The latch string is always out.",
            "definition": "You are always welcome.  Come by anytime. The latch string is always out.  No need to call before you come over. For you folks, the latch string is always out."
        },
        {
            "id": 34,
            "phrase": "a late bloomer",
            "definition": "a plant that blooms later than similar plants or that blooms late in the season.  There are a few late bloomers in the garden, but by fall, we don’t care much anymore about f lowers."
        },
        {
            "id": 35,
            "phrase": "late in life",
            "definition": "when one is old.  Grandma injured her hip running. She’s exercising rather late in life. Isn’t it sort of late in life for your grandparents to buy a house?"
        },
        {
            "id": 36,
            "phrase": "late in the day",
            "definition": "far along in a project or activity; too late in a project or activity for action, decisions, etc., to be taken. It was a bit late in the day for him to apologize.  It’s late in the day to try to change the plans."
        },
        {
            "id": 37,
            "phrase": "the late unpleasantness",
            "definition": "Euph. the U.S. Civil War. (Old.) _The town courthouse was burned in the late unpleasantness.  Many of my ancestors lost their lives in the late unpleasantness."
        },
        {
            "id": 38,
            "phrase": "lather something up†",
            "definition": "to apply thick soapsuds to something, such as part of the body or all of it.  He lathered his face up in preparation for shaving.  He lathered up his face."
        },
        {
            "id": 39,
            "phrase": "laugh about someone or something",
            "definition": "to chuckle or giggle loudly about someone or something. Please don’t laugh about Sue. It’s not funny.  They were laughing about my haircut."
        },
        {
            "id": 40,
            "phrase": "laugh all the way to the bank",
            "definition": "to be very happy about money that has been earned by doing something that other people might think is unfair or that they criticized. He may not be in the nicest business, but he is doing well and can laugh all the way to the bank.  She makes tons of money doing what no one else will do and laughs all the way to the bank."
        },
        {
            "id": 41,
            "phrase": "Laugh and the world laughs with you; weep and you weep alone.",
            "definition": "Prov.When you are happy, people will want to be around you and share your happiness, but when you are sad, people will avoid you.  Nancy: When Harry and I were dating, all our friends invited us places and called to say hello. Now that we’ve broken up, they treat me as if I don’t exist. Jane: Laugh and the world laughs with you; weep and you weep alone."
        },
        {
            "id": 42,
            "phrase": "laugh at someone or something",
            "definition": "to chuckle or giggle loudly at someone or something, perhaps in ridicule.  Thank goodness, the audience laughed at all my jokes.  Don’t laugh at me! I’m doing my best! _ Everyone laughed at the love scene because it was so badly done."
        },
        {
            "id": 43,
            "phrase": "laugh away at someone or something",
            "definition": "to continue to laugh at someone or something.  They laughed away at Sue until she f led the room in embarrassment.  All the children at the party laughed away at the magician."
        },
        {
            "id": 44,
            "phrase": "laugh in someone’s face",
            "definition": "to laugh in derision directly to someone’s face; to show displeasure or ridicule at something one has said by laughing directly into one’s face.  It is very impolite to laugh in someone’s face! _After I heard what she had to say, I just laughed in her face."
        },
        {
            "id": 45,
            "phrase": "laugh one’s head off",
            "definition": "to laugh very hard and loudly, as if one’s head might come off. The movie was so funny I almost laughed my head off.  I laughed my head off at Mary’s joke."
        },
        {
            "id": 46,
            "phrase": "laugh oneself out of something",
            "definition": "to lose out on something because one has made light of it or laughed at it.  While you were howling with laughter about my hat, you laughed yourself out of a ride to town. The bus just pulled away.  You laugh too much. You just laughed yourself out of a job."
        },
        {
            "id": 47,
            "phrase": "laugh oneself silly",
            "definition": "to laugh very, very hard. I laughed myself silly when I heard that Steven was really going to give the graduation address."
        },
        {
            "id": 48,
            "phrase": "laugh someone off the stage",
            "definition": "to laugh rudely, forcing a person to leave a stage. The rude audience laughed the politician off the stage.  The children laughed the soprano off the stage. She really wasn’t very good, you know."
        },
        {
            "id": 49,
            "phrase": "laugh someone or something down†",
            "definition": "to cause someone to quit or cause something to end by laughing in ridicule.  Her singing career was destroyed when the audience laughed her down as an amateur.  The cruel audience laughed down the amateur singer.  They laughed down the magic act also."
        },
        {
            "id": 50,
            "phrase": "laugh someone out of something",
            "definition": "to force someone to leave a place by laughing in ridicule. The citizens laughed the speaker out of the hall.  We laughed the city council out of the auditorium."
        },
        {
            "id": 51,
            "phrase": "laugh something away†",
            "definition": "1. to spend an amount of time laughing.  We laughed the hour away listening to the comedian.  We laughed away the evening. 2. to get rid of something negative by laughing.  Kelly knows how to laugh her problems away, and it cheers up the rest of us too.  She laughed away her problems."
        },
        {
            "id": 52,
            "phrase": "laugh something off†",
            "definition": "to treat a serious problem lightly by laughing at it.  Although his feelings were hurt, he just laughed the incident off as if nothing had happened.  He laughed off the incident."
        },
        {
            "id": 53,
            "phrase": "laugh something out of court",
            "definition": "to dismiss something presented in earnest as ridiculous.  The committee laughed the suggestion out of court. Bob’s request for a large salary increase was laughed out of court."
        },
        {
            "id": 54,
            "phrase": "laugh up one’s sleeve",
            "definition": "to laugh secretly; to laugh quietly to oneself.  Jane looked very serious, but I knew she was laughing up her sleeve. I told Sally that her dress was darling, but I was laughing up my sleeve because her dress was too small."
        },
        {
            "id": 55,
            "phrase": "laugh with something",
            "definition": "to laugh in a particular manner.  Everyone was laughing with glee at the antics of the clown.  Max laughed with malice as he saw his plan beginning to work."
        },
        {
            "id": 56,
            "phrase": "laughingstock",
            "definition": "someone or something that is the target of ridicule.  After he passed out at the president’s dinner, he became the laughingstock of all his colleagues."
        },
        {
            "id": 57,
            "phrase": "launch forth ((up)on something)",
            "definition": "to set out on something; to begin on something, such as a journey or a long lecture or sermon. (Upon is formal and less commonly used than on.) _We launched forth on our trip before dawn.  What time shall we launch forth tomorrow morning?"
        },
        {
            "id": 58,
            "phrase": "launch into something",
            "definition": "to start in doing something. Now, don’t launch into lecturing me about manners again! _ Tim’s mother launched into a sermon about how to behave at the dinner table."
        },
        {
            "id": 59,
            "phrase": "launch (one’s lunch)",
            "definition": "Sl. to empty one’s stomach; to vomit.  When I saw that mess, I almost launched my lunch.  Watch out! She’s going to launch!"
        },
        {
            "id": 60,
            "phrase": "launch out on something",
            "definition": "to start out to do something or go somewhere. When are you going to launch out on your expedition? _ Ted and Bill launched out on their trip through the mountains."
        },
        {
            "id": 61,
            "phrase": "launch something against someone or something",
            "definition": "to set something going against someone or something.  The general launched an attack against the town.  Claire launched a gossip attack against James."
        },
        {
            "id": 62,
            "phrase": "lavish something (up)on someone",
            "definition": "to give something freely to someone; to squander something on someone. (Upon is formal and less commonly used than on.) _ The manager lavished all sorts of favors upon the new employee.  Susan lavished compliments on the cook."
        },
        {
            "id": 63,
            "phrase": "*a law unto oneself",
            "definition": "one who ignores laws or rules; one who sets one’s own standards of behavior. (*Typically: be ~; become ~.) _ You can’t get Bill to follow the rules. He’s a law unto himself.  Jane is a law unto herself. She’s totally unwilling to cooperate."
        },
        {
            "id": 64,
            "phrase": "lay a finger on someone or something",
            "definition": "to touch someone or something, even slightly, as with only a finger. Don’t you dare lay a finger on my pencil. Go get your own! _ If you lay a finger on me, I’ll scream."
        },
        {
            "id": 65,
            "phrase": "lay alongside something",
            "definition": "[for a ship] to rest afloat next to something.  The ship lay alongside a lovely island while a shore party searched for fresh water. Our ship lay alongside the narrow wooden pier."
        },
        {
            "id": 66,
            "phrase": "lay an egg",
            "definition": "[for a hen, etc.] to deposit an egg.  Old Red stopped laying eggs, so we stewed her for Sunday dinner."
        },
        {
            "id": 67,
            "phrase": "lay claim to something",
            "definition": "to place a claim on something.  Do you really think you can lay claim to that money after all these years? _ Someone came by and laid claim to the wallet you found."
        },
        {
            "id": 68,
            "phrase": "lay down",
            "definition": "to give up. Do you expect me to just lay down? _You really think I should just lay down and let them walk all over me?"
        },
        {
            "id": 69,
            "phrase": "lay down one’s arms",
            "definition": "to put one’s gun, sword, club, etc., down; to stop fighting; to surrender.  The prisoners were instructed to lay down their arms.  The soldiers laid down their arms and surrendered."
        },
        {
            "id": 70,
            "phrase": "lay down one’s life (for someone or something)",
            "definition": "to sacrifice one’s life for someone or something.  Would you lay down your life for your country? _ There aren’t many things for which I’d lay down my life."
        },
        {
            "id": 71,
            "phrase": "lay down the law (to someone) (about something)",
            "definition": "to scold someone; to make something very clear to someone in a very stern manner.  Wow, was she mad at Ed. She really laid down the law about drinking to him.  She laid down the law to Ed.  She laid down the law about drinking."
        },
        {
            "id": 72,
            "phrase": "lay for someone or something",
            "definition": "to lie in wait for someone or something.  The sheriff was laying for the outlaw.  Bill was laying for me when I came out of the saloon."
        },
        {
            "id": 73,
            "phrase": "lay hold of someone or something",
            "definition": "to grasp someone or something with the hands. Just wait till I lay hold of Bill! _ I can’t wait to lay hold of that fishing pole. I’m ready to catch a huge fish."
        },
        {
            "id": 74,
            "phrase": "lay into someone or something",
            "definition": "to attack, consume, or scold someone or something.  Bob laid into the big plate of fried chicken. The bear laid into the hunter. My father really laid into me when I got home."
        },
        {
            "id": 75,
            "phrase": "lay low and sing small",
            "definition": "Rur. to hide; to make oneself inconspicuous.  After he robbed the bank, the outlaw decided to lay low and sing small awhile.  Jane is looking for you, and she sure is angry. You’d best lay low and sing small."
        },
        {
            "id": 76,
            "phrase": "the lay of the land",
            "definition": "the arrangement of features on an area of land. (Also with lie, especially British English.) _ The surveyor mapped the lay of the land.  The geologist studied the lay of the land, trying to determine if there was oil below."
        },
        {
            "id": 77,
            "phrase": "lay off ((from) something)",
            "definition": "to cease doing something.  Lay off from your hammering for a minute, will you? _ That’s enough! Please lay off."
        },
        {
            "id": 78,
            "phrase": "lay off (someone or something)",
            "definition": "to leave someone or something alone.  Lay off the booze for a while, why don’t ya? _ Lay off me! I didn’t do anything!"
        },
        {
            "id": 79,
            "phrase": "lay (oneself) down",
            "definition": "to lie down.  Just lay yourself down there and try to sleep.  I’ll lay myself down here for just a few minutes."
        },
        {
            "id": 80,
            "phrase": "lay over (some place)",
            "definition": "to pause some place during one’s journey.  I had to lay over in San Antonio for a few hours before my plane left.  I want a bus that goes straight through. I don’t want to lay over."
        },
        {
            "id": 81,
            "phrase": "lay (some) rubber",
            "definition": "Sl. to spin one’s car tires when accelerating, leaving black marks on the street.  At that age all they want to do is get in the car and lay some rubber.  You wanna know how well I can lay some rubber in this thing?"
        },
        {
            "id": 82,
            "phrase": "lay someone away†",
            "definition": "Euph. to bury someone.  Yes, he has passed. We laid him away last week.  He laid away his uncle in a simple ceremony."
        },
        {
            "id": 83,
            "phrase": "lay someone down",
            "definition": "to ease someone into a reclining position; to ease someone into bed. The baby woke up when I tried to lay him down.  The nurse laid the disturbed patient down time and time again."
        },
        {
            "id": 84,
            "phrase": "lay someone off† (from something)",
            "definition": "to put an end to someone’s employment at something. The automobile factory laid five hundred people off from work.  They laid off a lot of people. We knew they were going to lay a lot of people off."
        },
        {
            "id": 85,
            "phrase": "lay someone or something in(to) something",
            "definition": "to place someone or something in something.  The women laid the king into the coffin and the funeral procession assembled.  The cook laid the salmon in the poaching liquid."
        },
        {
            "id": 86,
            "phrase": "lay someone out†",
            "definition": "1. Sl. to knock someone down with a punch; to knock someone unconscious.  Tom laid out Bill with one punch to the chin.  The policeman laid the thief out. 2. to prepare a corpse for burial or for a wake.  They laid out their uncle for the wake.  The women of the community used to lay their dead out. 3. Sl. to scold someone severely. Don’t lay me out! I didn’t do it! _She really laid out the guy but good. What did he do, rob a bank?"
        },
        {
            "id": 87,
            "phrase": "lay someone out in lavender",
            "definition": "to scold someone severely.  She was really mad. She laid him out in lavender and really put him in his place.  If you ever feel like you need to lay me out in lavender again, just forget it."
        },
        {
            "id": 88,
            "phrase": "lay someone to rest",
            "definition": "Euph. to bury a dead person.  They laid her to rest by her mother and father, out in the old churchyard.  We gather together today to lay our beloved son to rest."
        },
        {
            "id": 89,
            "phrase": "lay someone up†",
            "definition": "to cause someone to be ill in bed. A broken leg laid me up for two months.  Flu laid up everyone at work for a week or more."
        },
        {
            "id": 90,
            "phrase": "lay something against something",
            "definition": "to lean or place something against something. They laid the Christmas tree against the house where they could get to it easily when the time came. Lay this hot cloth against the sore and hold it there."
        },
        {
            "id": 91,
            "phrase": "lay something alongside ((of ) something)",
            "definition": "to place something next to something else, lengthwise. (Of is usually retained before pronouns.) _ Please lay the spoon alongside the knife.  Find the knife and lay the spoon alongside."
        },
        {
            "id": 92,
            "phrase": "lay something aside†",
            "definition": "to set something aside; to place something to one side, out of the way. He laid his papers aside and went out to welcome the visitor.  He laid aside his papers."
        },
        {
            "id": 93,
            "phrase": "lay something aside† for someone or something",
            "definition": "to put something aside, in reserve, for someone or something. I laid some cake aside for Tom, but someone else got it.  I laid aside some cake for Tom."
        },
        {
            "id": 94,
            "phrase": "lay something away† (for someone)",
            "definition": "to put something in storage for someone to receive at a later time. (Often said of a purchase that is held until it is paid for.) _ Please lay this away for me. I’ll pay for it when I have the money.  Please lay away this coat until I can get the money together."
        },
        {
            "id": 95,
            "phrase": "lay something before someone",
            "definition": "to present something to someone.  The cat laid the mouse before her mistress. Dave laid the present before her as a peace offering."
        },
        {
            "id": 96,
            "phrase": "lay something down† (on something)",
            "definition": "to place something down on something.  Lay the plates down on the table gently.  Please lay down your book and listen to me."
        },
        {
            "id": 97,
            "phrase": "lay something for someone or something",
            "definition": "to prepare something (for a meal) for the benefit of someone or a group. She laid a lovely picnic for the two of them. Would you lay the table for dinner for our guests?"
        },
        {
            "id": 98,
            "phrase": "lay something in†",
            "definition": "to get something and store it for future use.  They laid a lot of food in for the holidays.  We always lay in a large supply of firewood each November."
        },
        {
            "id": 99,
            "phrase": "lay something on†",
            "definition": "to supply something in abundance.  Look at him lay that butter on! What do you suppose the insides of his arteries look like? _ They laid on a beautiful buffet lunch."
        },
        {
            "id": 100,
            "phrase": "lay something on someone",
            "definition": "1. Sl. to present a plan or an idea to someone.  Here is this century’s greatest idea. Let me lay it on you.  I’m going to lay a great idea on you. 2. Sl. to attempt to make someone feel guilty about something.  Don’t lay that stuff on me. Face your own problem.  Every week she calls up to lay a guilt trip on me about something or other. "
        },
        {
            "id": 101,
            "phrase": "lay something on someone or something",
            "definition": "to place something on someone or something; to cover someone or something with something. As soon as he breathed his last, the nurse laid a cloth on him.  Ken laid the bundle of f lowers on the coffee table."
        },
        {
            "id": 102,
            "phrase": "lay something out†",
            "definition": "to spread something out.  The nurse laid the instruments out for the operation. The valet laid out the clothing for his employer."
        },
        {
            "id": 103,
            "phrase": "lay something over someone or something",
            "definition": "to cover someone or something with something. Here, lay this blanket over the baby.  Please lay a napkin over the bread before you take it to the table."
        },
        {
            "id": 104,
            "phrase": "lay something to something",
            "definition": "to attribute something to something.  I lay all our problems to the inadequacy of our training.  Mary laid her success to a good upbringing."
        },
        {
            "id": 105,
            "phrase": "lay something together",
            "definition": "to lay things side by side.  Lay all the logs together and stack them as high as you can.  Lay the red ones together and put all the others over there in a pile."
        },
        {
            "id": 106,
            "phrase": "lay something under something",
            "definition": "to place something beneath something.  Please lay a cloth under your workbench to catch the sawdust. Would you mind laying a sheet of plastic over the table?"
        },
        {
            "id": 107,
            "phrase": "lay something up†",
            "definition": "1. to acquire and store something. Try to lay as much of it up as you can.  I am trying to lay up some firewood for the winter. 2. [for something] to disable something.  The accident laid up the ship for repairs.  A wreck laid the bus up for months."
        },
        {
            "id": 108,
            "phrase": "lay the blame (for something) on someone",
            "definition": "to place the blame for something on someone. We could not possibly lay the blame for the accident on you.  Don’t try to lay the blame on me!"
        },
        {
            "id": 109,
            "phrase": "lay to",
            "definition": "to begin doing something, such as fighting or eating.  All right, you guys. Lay to. The stuff will get cold if you don’t eat it.  Lay to! Let’s get on with it."
        },
        {
            "id": 110,
            "phrase": "laze something away†",
            "definition": "to spend a period of time being lazy.  I just love to sit here and laze the day away.  I will laze away the entire day."
        },
        {
            "id": 111,
            "phrase": "leach away",
            "definition": "[for something] to erode or wash away gradually by leaching. The soft sandstone leached away under the constant rains.  The f lowerpots sat out in the rain, where all the nutrients in the soil leached away."
        },
        {
            "id": 112,
            "phrase": "leach in(to something)",
            "definition": "[for a substance] to seep or penetrate into something.  The salt leached into the soil and ruined it.  A tremendous amount of salt leached in."
        },
        {
            "id": 113,
            "phrase": "leach out of something",
            "definition": "[for a substance] to seep or drain out of something. All the nutrients leached out of the soil and nothing would grow.  The phosphorus leached out of the soil after a few years."
        },
        {
            "id": 114,
            "phrase": "lead back (to some place)",
            "definition": "[for a pathway] to return to a place. This path leads back to the camp. I hope it leads back. It seems to be going the wrong way."
        },
        {
            "id": 115,
            "phrase": "lead down to something",
            "definition": "[for a pathway or other trail] to run downward to something.  The trail led down to a spring at the bottom of the hill.  These stairs lead down to the furnace room."
        },
        {
            "id": 116,
            "phrase": "lead forth",
            "definition": "[for someone] to go on ahead; to precede someone. You lead forth, and I will follow. Wallace led forth, but no one came after him."
        },
        {
            "id": 117,
            "phrase": "lead in(to something)",
            "definition": "1. to begin something; to work into something.  Let me lead into the first number with a little talk about the composer.  I’ll lead in, then you pick up the melody. 2. to make a transition into something; to segue into something.  Now, we will lead into the second scene with a little soft orchestral music.  The soft music will lead in, then the curtains will open."
        },
        {
            "id": 118,
            "phrase": "lead off",
            "definition": "to be the first one to go or leave.  You lead off. I’ll follow.  Mary led off and the others followed closely behind."
        },
        {
            "id": 119,
            "phrase": "lead off (with someone or something)",
            "definition": "[for a person, process, or performance] to begin with someone or something.  The musical revue led off with a bassoon trio.  Sharon, the singer, will lead off tonight."
        },
        {
            "id": 120,
            "phrase": "lead on",
            "definition": "to continue to lead onward.  The guide led on and we followed. Lead on, my friend. We are right behind you!"
        },
        {
            "id": 121,
            "phrase": "lead someone astray",
            "definition": "to direct or guide someone in the wrong direction.  I am afraid that this young man has been leading you astray. I think you had better stop seeing him. No one can lead me astray. I know what I am doing."
        },
        {
            "id": 122,
            "phrase": "lead someone by something",
            "definition": "to guide someone by grasping a part and moving. Do you expect me to lead you around by the hand, showing you everything to do in your job? _ The cop grabbed Max and led him around by the collar."
        },
        {
            "id": 123,
            "phrase": "lead someone by the nose",
            "definition": "1. Fig. to force someone to go somewhere (with you); to lead someone by coercion.  John had to lead Tom by the nose to get him to the opera.  I’ll go, but you’ll have to lead me by the nose. 2. Fig. to guide someone very carefully and slowly. (As if the person were not very smart.) _ He will never find his way through the tax form unless you lead him by the nose.  Don’t lead me by the nose! I’m coming!"
        },
        {
            "id": 124,
            "phrase": "lead someone down (something)",
            "definition": "to help someone down something, such as stairs, a steep path, a ladder, etc. The usher led the couple down the aisle and seated them at the front.  I am going to the cellar myself. Let me lead you down."
        },
        {
            "id": 125,
            "phrase": "lead someone down to something",
            "definition": "to guide someone downward to something.  She led us down to a little room in the cellar, where the old trunk had been kept for all these years.  Would you please lead me down to the wine cellar?"
        },
        {
            "id": 126,
            "phrase": "lead someone on a merry chase",
            "definition": "to lead someone in a purposeless pursuit.  What a waste of time. You really led me on a merry chase.  Jane led Bill on a merry chase trying to find an antique lamp."
        },
        {
            "id": 127,
            "phrase": "lead someone or an animal to something",
            "definition": "to guide someone or an animal to something or some place.  Would you lead Paul to the place where the trunks are kept? _ The cat is so old that we had to lead her to her food."
        },
        {
            "id": 128,
            "phrase": "lead someone or something against someone or something",
            "definition": "to manage someone or a group in an attack on someone or something. The general led the entire company against the troops holding the city. They led two platoons against the enemy position."
        },
        {
            "id": 129,
            "phrase": "lead someone or something back† (to someone or something)",
            "definition": "to guide someone or something back to someone or something.  Someone will have to lead me back to camp. I just know I’ll get lost if I go by myself.  The park ranger led back the hikers to their tent.  I will lead them back."
        },
        {
            "id": 130,
            "phrase": "lead someone or something forth†",
            "definition": "to bring or usher someone or something forward.  The captain led the soldiers forth to the parade ground.  They led forth the army into battle."
        },
        {
            "id": 131,
            "phrase": "lead someone or something off†",
            "definition": "to guide someone or something away.  The guide led the hikers off on the adventure of their lives.  The dog owners led off their animals and they awaited the decision of the judges."
        },
        {
            "id": 132,
            "phrase": "lead someone to believe something",
            "definition": "to imply something to someone; to cause someone to believe something untrue.  But you led me to believe that this watch was guaranteed! _Did you lead her to believe that she was hired as a clerk?"
        },
        {
            "id": 133,
            "phrase": "lead someone to do something",
            "definition": "to cause someone to do something.  This agent led me to purchase a worthless piece of land.  My illness led me to quit my job."
        },
        {
            "id": 134,
            "phrase": "lead someone up something",
            "definition": "to guide someone upward along some route.  Would you please lead Tom up the path so he can leave his things at the cabin on the hill? _ Mary led the visitors up the stairs to the loft, which she had recently redecorated."
        },
        {
            "id": 135,
            "phrase": "lead the way",
            "definition": "to lead (someone) along the proper pathway.  You lead the way, and we’ll follow.  I feel better when you’re leading the way. I get lost easily."
        },
        {
            "id": 136,
            "phrase": "lead up to something",
            "definition": "to aim at or route movement to something.  A narrow path led up to the door of the cottage.  This road leads up to the house at the top of the hill."
        },
        {
            "id": 137,
            "phrase": "lead with someone or something",
            "definition": "to start out with someone or something.  The coach led with Walter as pitcher and Sam on first base.  We will lead with our best players."
        },
        {
            "id": 138,
            "phrase": "lead with something",
            "definition": "to tend to strike first with a particular fist—the right, the left, the best, etc. (Boxing.) _Watch that guy, Champ, he always leads with his right.  Get in there and lead with your left."
        },
        {
            "id": 139,
            "phrase": "leading question",
            "definition": "a question that suggests the kind of answer that the person who asks it wants to hear.  The mayor was angered by the reporter’s leading questions.  “Don’t you think that the police are failing to stop crime?” is an example of a leading question."
        },
        {
            "id": 140,
            "phrase": "a lead-pipe cinch",
            "definition": "something very easy to do; something entirely certain to happen.  I knew it was a leadpie cinch that I would be selected to head the publication committee."
        },
        {
            "id": 141,
            "phrase": "leaf out",
            "definition": "[for a plant] to open its leaf buds.  Most of the bushes leaf out in mid-April.  The trees leafed out early this year."
        },
        {
            "id": 142,
            "phrase": "leak in(to something)",
            "definition": "[for a fluid] to work its way into something.  Some of the soapy water leaked into the soil.  The rainwater is leaking in!"
        },
        {
            "id": 143,
            "phrase": "leak out",
            "definition": "[for information] to become known unofficially.  I hope that news of the new building does not leak out before the contract is signed.  When the story leaked out, my telephone would not stop ringing."
        },
        {
            "id": 144,
            "phrase": "leak out (of something)",
            "definition": "[for a fluid] to seep out of something or some place.  Some of the brake f luid leaked out of the car and made a spot on the driveway.  Look under the car. Something’s leaking out."
        },
        {
            "id": 145,
            "phrase": "leak something to someone",
            "definition": "to tell [otherwise secret] information to someone.  The government leaked a phony story to the press just to see how far it would travel. The government leaks things to the press occasionally, just to see the reaction."
        },
        {
            "id": 146,
            "phrase": "leak through something",
            "definition": "[for a fluid] to seep through something.  Rainwater leaked through the roof.  I was afraid that the crushed orange would leak through the paper bag."
        },
        {
            "id": 147,
            "phrase": "lean across someone or something",
            "definition": "to incline oneself across someone or something.  She leaned across me to reach the telephone and spilled my wine.  Laura leaned across the table and knocked my coffee over."
        },
        {
            "id": 148,
            "phrase": "lean against someone or something",
            "definition": "to prop oneself against someone or something. The child leaned against her sister to keep warm.  I leaned against the back of the chair and went right to sleep."
        },
        {
            "id": 149,
            "phrase": "lean and mean",
            "definition": "fit and ready for hard, efficient work.  Dave got himself lean and mean and is ready to play in Saturday’s game. The management is lean and mean and looks to turn a profit next year."
        },
        {
            "id": 150,
            "phrase": "lean back",
            "definition": "[for someone] to recline backwards, usually in a chair. Lean back and make yourself comfortable. Let’s lean back and be comfortable."
        },
        {
            "id": 151,
            "phrase": "lean back (against someone or something)",
            "definition": "to recline backwards, putting weight on someone or something.  Just lean back against me. I will prevent you from falling.  Relax and lean back. Nothing bad is going to happen."
        },
        {
            "id": 152,
            "phrase": "lean back (on someone or something)",
            "definition": "to recline backwards, pressing on someone or something.  Don’t lean back on me! I’m not a chair! _ Lean back on the couch and tell me what you are thinking."
        },
        {
            "id": 153,
            "phrase": "lean down",
            "definition": "to bend over.  Lean down and tie your shoe before you trip.  He leaned down and picked something up from the f loor."
        },
        {
            "id": 154,
            "phrase": "lean forward",
            "definition": "to bend forward.  Lean forward a minute so I can put a cushion behind your back.  When Betsy leaned forward, she lost her balance and fell."
        },
        {
            "id": 155,
            "phrase": "lean in(to something)",
            "definition": "to incline or press into something. You have to lean into the wind when you walk or you will be blown over.  As you walk into the wind, lean in a little bit. The north wall of the barn leans in a little. Is it going to fall?"
        },
        {
            "id": 156,
            "phrase": "lean on someone",
            "definition": "to try to make someone do something; to coerce someone to do something. (From lean on someone or something.) _ If she refuses to do it, lean on her a bit.  Don’t lean on me! I don’t have to do it if I don’t want to."
        },
        {
            "id": 157,
            "phrase": "lean on someone or something",
            "definition": "to incline or press on someone or something. Don’t lean on me. I’m not strong enough to support both of us.  Lean on the wall and rest a little while."
        },
        {
            "id": 158,
            "phrase": "lean out of something",
            "definition": "to hang or bend out of something or some place. She leaned out of the window so she could watch what was going on.  Don’t lean out of the car window. You will fall."
        },
        {
            "id": 159,
            "phrase": "lean over",
            "definition": "1. to bend over.  Lean over and pick the pencil up yourself! I’m not your servant! _As Kelly leaned over to tie her shoes, her chair slipped out from under her. 2. to tilt over.  The fence leaned over and almost fell.  As the wind blew, the tree leaned over farther and farther."
        },
        {
            "id": 160,
            "phrase": "lean something against someone or something",
            "definition": "to prop something against someone or something.  She leaned her spade against the house and wiped the sweat from her brow.  Bill leaned the mirror against his leg while he screwed the hook into the wall."
        },
        {
            "id": 161,
            "phrase": "lean something forward",
            "definition": "to tilt or bend something forward.  Lean the board forward a little bit, please.  Someone leaned this panel forward a little too much."
        },
        {
            "id": 162,
            "phrase": "*lean times (ahead)",
            "definition": "a future period of lowered income or revenue; a future period when there will be shortages of goods and suffering. (*Typically: be ~; cause ~; have ~; mean ~.) _The economy is going sour which means lean times ahead."
        },
        {
            "id": 163,
            "phrase": "lean toward doing something",
            "definition": "to tend toward doing something; to favor doing something.  The union is leaning toward accepting the proposal. My friends leaned toward swimming instead of shopping."
        },
        {
            "id": 164,
            "phrase": "lean toward someone or something",
            "definition": "1. to incline toward someone or something.  Tom is leaning toward Randy. I think he is going to fall on him. The tree is leaning toward the edge of the cliff. It will fall eventually. 2. to tend to favor [choosing] someone or something. I am leaning toward Sarah as the new committee head.  I’m leaning toward a new committee."
        },
        {
            "id": 165,
            "phrase": "leap at someone or something",
            "definition": "1. to jump toward someone or something.  The grasshopper leapt at me and scared me to death.  The cat leapt at the mouse and caught it. 2. to accept or choose someone or something eagerly.  We leapt at Carl when his department offered him to us.  When we had the chance to hire Carl, we leapt at it."
        },
        {
            "id": 166,
            "phrase": "leap down (from something)",
            "definition": "to hop down from something or some place. The performer leapt down from the stage and ran up the aisle. She leapt down and ran away."
        },
        {
            "id": 167,
            "phrase": "leap forward",
            "definition": "to jump or hop forward.  The little creature leapt forward and looked carefully at us.  As the frog leapt forward, the kitten jumped straight up and f led."
        },
        {
            "id": 168,
            "phrase": "*a leap of faith",
            "definition": "acceptance of an idea or conclusion largely on faith. (*Typically: be ~; make ~; require ~.) _ We had to make quite a leap of faith to accept his promise after the last time he let us down."
        },
        {
            "id": 169,
            "phrase": "leap out (of something)",
            "definition": "to jump outward from something. A mouse leapt out of the cereal box and frightened everyone.  I opened the box and a mouse leapt out."
        },
        {
            "id": 170,
            "phrase": "leap over something",
            "definition": "to jump over something.  The dog leapt over the hedge and chased the rabbit around the corner of the house.  Please don’t leap over my roses. You’ll damage them."
        },
        {
            "id": 171,
            "phrase": "leap up",
            "definition": "to jump upwards.  The dog leapt up and licked my cheek.  I leapt up so I could see over the wall for just a second."
        },
        {
            "id": 172,
            "phrase": "learn about someone or something",
            "definition": "to find out about someone or something.  What have you learned about Mr. Franklin and his business dealings? _I learned about what causes rain."
        },
        {
            "id": 173,
            "phrase": "learn by something",
            "definition": "to learn [something] from some kind of actual experience. The best way to learn is to learn by doing.  The best way to learn to sail is to learn by sailing."
        },
        {
            "id": 174,
            "phrase": "learn from someone or something",
            "definition": "to learn [something] from the experience of someone or something.  Pay attention to what Sarah does. I think you can learn from her.  This was quite an experience, and we all can learn from it."
        },
        {
            "id": 175,
            "phrase": "learn of someone or something",
            "definition": "to find out about someone or something.  I’m not in the telephone book. How did you learn of me? _ How did you learn of our company?"
        },
        {
            "id": 176,
            "phrase": "learn something by heart",
            "definition": "to learn something so well that it can be written or recited without thinking; to memorize something. The director told me to learn my speech by heart.  I had to go over it many times before I learned it by heart."
        },
        {
            "id": 177,
            "phrase": "learn something by rote",
            "definition": "to learn something by memorizing without giving any thought to what is being learned.  I learned history by rote; then I couldn’t pass the test that required me to think.  If you learn things by rote, you’ll never understand them."
        },
        {
            "id": 178,
            "phrase": "learn something from someone or something",
            "definition": "to find out something from someone or something.  I don’t know when the children are due to arrive. See what you can learn from Walter. I am sure we can learn something from this experience."
        },
        {
            "id": 179,
            "phrase": "learn something from the bottom up",
            "definition": "to learn something thoroughly, from the very basics; to learn all aspects of something, even the least important ones.  I learned my business from the bottom up.  I started out sweeping the f loors and learned everything from the bottom up."
        },
        {
            "id": 180,
            "phrase": "learn to live with something",
            "definition": "to learn to adapt to something unpleasant or painful. Finally the doctor told Marion that she was going to have to learn to live with her arthritis.  The f loor plan of the house we bought is not as spacious as we had thought, but we will learn to live with it."
        },
        {
            "id": 181,
            "phrase": "lease something back†",
            "definition": "to sell something, then rent it from the buyer.  We sold the building to a real estate firm and then leased it back. There was some tax saving involved.  We leased back the building."
        },
        {
            "id": 182,
            "phrase": "lease something from someone",
            "definition": "to rent something from someone.  We decided to lease the building from the owner rather than buying it.  The company always leases its cars from the dealership."
        },
        {
            "id": 183,
            "phrase": "lease something (out†) to someone",
            "definition": "to rent something to someone.  The company leases cars out to its customers.  Can you lease this building to me for two years? _ Lease out only the first two f loors."
        },
        {
            "id": 184,
            "phrase": "the least little thing",
            "definition": "the smallest possible thing.  He gets upset over the least little thing.  When she was a girl, she would throw a tantrum over the least little thing."
        },
        {
            "id": 185,
            "phrase": "least of all",
            "definition": "the thing of smallest importance. (Compare this with most of all.) _ There were many things wrong with the new house. Least of all, the water faucets leaked.  What a bad day. Many things went wrong, but least of all, I tore my shirt."
        },
        {
            "id": 186,
            "phrase": "leave a bad taste in someone’s mouth",
            "definition": "[for something] to leave a bad feeling or memory with someone.  The whole business about the missing money left a bad taste in his mouth.  It was a very nice hotel, but something about it left a bad taste in my mouth."
        },
        {
            "id": 187,
            "phrase": "leave a lot to be desired",
            "definition": "Cliché to be lacking something important; to be inadequate. (A polite way of saying that something is bad.) _ This report leaves a lot to be desired. I’m sorry to have to fire you, Mary, but your work leaves a lot to be desired."
        },
        {
            "id": 188,
            "phrase": "leave for some place",
            "definition": "to depart for some place.  We will leave for Denver at dawn.  When do we leave for Grandmother’s house?"
        },
        {
            "id": 189,
            "phrase": "leave go of someone or something",
            "definition": "Inf. to let go of someone or something. (Usually considered nonstandard.) _Leave go of me! _ Leave go of my hand!"
        },
        {
            "id": 190,
            "phrase": "leave it at that",
            "definition": "to leave a situation as it is.  This is the best we can do. We’ll have to leave it at that.  I can do no more. I will have to leave it at that."
        },
        {
            "id": 191,
            "phrase": "leave it to someone",
            "definition": "to depend on someone to behave in a certain way.  Leave it to Harry to mess things up.  She did it wrong again. Leave it to Janet! _ Jane: Will you do this as soon as possible? Mary: Leave it to me."
        },
        {
            "id": 192,
            "phrase": "Leave me alone!",
            "definition": "Stop harassing me!; Don’t bother me! _ John: You did it. You’re the one who always does it. Bill: Leave me alone! I never did it. Fred: Let’s give Bill a dunk in the pool. Bill: Leave me alone!"
        },
        {
            "id": 193,
            "phrase": "leave no stone unturned",
            "definition": "to search in all possible places. (As if one might search under every rock.) _Don’t worry. We’ll find your stolen car. We’ll leave no stone unturned.  In searching for a nice place to live, we left no stone unturned."
        },
        {
            "id": 194,
            "phrase": "a leave of absence",
            "definition": "a period of time away from one’s job, with the employer’s permission.  Mr. Takaguchi is on leave of absence because he is going back to school.  His leave of absence is expected to end next month."
        },
        {
            "id": 195,
            "phrase": "leave off something",
            "definition": "to quit something. I have to leave off working for a while so I can eat. I left off reading and went downstairs for supper."
        },
        {
            "id": 196,
            "phrase": "leave one’s mark on someone",
            "definition": "[for someone like a teacher] to affect the behavior and performance of another person.  The wise professor left her mark on her students. My father left his mark on me, and I will always remember all his good advice."
        },
        {
            "id": 197,
            "phrase": "leave one to one’s fate",
            "definition": "to abandon someone to whatever may happen—possibly death or some other unpleasant event.  We couldn’t rescue the miners and were forced to leave them to their fate.  Please don’t try to help. Just go away and leave me to my fate."
        },
        {
            "id": 198,
            "phrase": "leave someone cold",
            "definition": "to leave someone unaffected or bored.  He said it was dull, and it left him cold.  The music’s good, but the story left the producer cold."
        },
        {
            "id": 199,
            "phrase": "leave someone flat",
            "definition": "1. Fig. to fail to entertain or stimulate someone.  Your joke left me f lat. We listened carefully to his lecture, but it left us f lat. 2. Fig. to leave someone without any money—flat broke. Paying all my bills left me flat.  The robber took all my money and left me f lat. 3. Fig. to leave someone completely and suddently alone. I was at the dance with Harry, but when he met Alice, he left me f lat.  They just walked off and left us f lat."
        },
        {
            "id": 200,
            "phrase": "leave someone for dead",
            "definition": "to abandon someone as being dead. (The abandoned person may actually be alive.) _ He looked so bad that they almost left him for dead.  As the soldiers turned—leaving the enemy captain for dead— the captain fired at them."
        },
        {
            "id": 201,
            "phrase": "leave someone high and dry",
            "definition": "[for water] to recede and leave someone untouched.  The waters receded and left us high and dry."
        },
        {
            "id": 202,
            "phrase": "leave someone in peace",
            "definition": "to stop bothering someone; to go away and leave someone alone. (Does not necessarily mean to go away from a person.) _ Please go—leave me in peace.  Can’t you see that you’re upsetting her? Leave her in peace."
        },
        {
            "id": 203,
            "phrase": "leave someone in the lurch",
            "definition": "to leave someone waiting for or anticipating your actions.  Where were you, John? You really left me in the lurch. I didn’t mean to leave you in the lurch. I thought we had canceled our meeting."
        },
        {
            "id": 204,
            "phrase": "leave someone or something behind",
            "definition": "to fail or forget to bring someone or something along.  John was sick, so we had to leave him behind. Oh, I left my money behind."
        },
        {
            "id": 205,
            "phrase": "leave someone or something in one’s hands",
            "definition": "to give one control of or responsibility for someone or something.  You left the whole project in my hands! _ I have to leave the care of baby in your hands while I go to the doctor."
        },
        {
            "id": 206,
            "phrase": "leave someone or something in (something)",
            "definition": "to permit someone or something to remain in something.  We left the children in the house while we went out to greet the guests.  Did you leave the dog in the car? _ Poor puppy! I didn’t mean to leave you in."
        },
        {
            "id": 207,
            "phrase": "leave someone or something to someone",
            "definition": "to give or abandon someone or something to someone.  I leave Mr. Franklin to you. Good luck in dealing with him.  I leave the whole problem to you. Good luck."
        },
        {
            "id": 208,
            "phrase": "leave someone or something with someone or something",
            "definition": "to allow someone or something to remain with someone or something.  Can I leave Jimmy with you while I shop? _ Do you mind if I leave my papers with the committee, just in case they have time to look at them?"
        },
        {
            "id": 209,
            "phrase": "leave someone to it",
            "definition": "to withdraw and allow someone to finish something alone.  I hate to leave before the job is finished, but I’ll have to leave you to it.  I will leave them to it. I have to go home now."
        },
        {
            "id": 210,
            "phrase": "leave someone up in the air",
            "definition": "to leave someone waiting for a decision.  Please don’t leave me up in the air. I want to know what’s going to happen to me. Nothing was decided, and they left me up in the air."
        },
        {
            "id": 211,
            "phrase": "leave something aside†",
            "definition": "1. to leave something in reserve. Leave some of the sugar aside for use in the icing. Leave aside some cookies too. 2. to ignore something, especially a fact. Let’s leave the question of who will pay for it aside for a while. We will leave aside the current situation and talk about the future."
        },
        {
            "id": 212,
            "phrase": "leave something down",
            "definition": "to leave something in a lowered or low position.  Leave the window down, please. It’s hot in this car.  Leave the window down. This house is cold enough as it is."
        },
        {
            "id": 213,
            "phrase": "leave something for someone or an animal",
            "definition": "to allow something to remain for the use of someone or an animal.  I will leave this bread here for you, so you won’t starve.  Don’t clean it up. Leave it for the dog."
        },
        {
            "id": 214,
            "phrase": "leave something on†",
            "definition": "1. to continue to wear some article of clothing. I think I will leave my coat on. It’s chilly in here. I’ll leave on my coat. 2. to allow something [that can be turned off] to remain on.  Who left the radio on? _ Please leave on the light for me."
        },
        {
            "id": 215,
            "phrase": "leave something on someone or something",
            "definition": "to allow something to remain on someone or something.  Leave the coats on the children. We are taking them out to a movie almost immediately.  Who left this book on the table?"
        },
        {
            "id": 216,
            "phrase": "leave something open",
            "definition": "to leave a date or time unscheduled.  I left something open on Friday, just in case we want to leave work early.  Please leave an appointment open for Mrs. Wallace next week. She will be calling in to our office for an appointment."
        },
        {
            "id": 217,
            "phrase": "leave something to chance",
            "definition": "to allow something to be settled by chance.  Plan your day. Don’t leave anything to chance. It is not a good idea to leave any of this to chance."
        },
        {
            "id": 218,
            "phrase": "leave something to someone",
            "definition": "to will something to someone. My grandfather left his house to my mother.  I will leave this watch to one of my grandchildren."
        },
        {
            "id": 219,
            "phrase": "leave something up†",
            "definition": "to leave something in a raised or high position.  It’s still warm in here. Please leave the window up.  Please leave up the window. It’s so hot!"
        },
        {
            "id": 220,
            "phrase": "leave something up in the air",
            "definition": "to leave a matter undecided. (Alludes to something drifting in the air, moving neither up nor down.) _ Let’s get this settled now. I don’t want to leave anything up in the air over the weekend.  The whole matter was left up in the air for another week."
        },
        {
            "id": 221,
            "phrase": "leave the door open (for something)",
            "definition": "to provide for the possibility that something might happen.  I think that the matter is completely settled, although we have left the door open for one or two last-minute changes."
        },
        {
            "id": 222,
            "phrase": "leave the room",
            "definition": "1. to go out of the room. I had to leave the room to get drinks for everyone. 2. Euph. to leave to go to the toilet.  I have to leave the room. I’ll be back in a minute."
        },
        {
            "id": 223,
            "phrase": "leave with someone",
            "definition": "to depart in the company of someone.  I left with Frank early in the evening and did not see what happened to Tom and Edna.  Mary is gone. She left with Gerald."
        },
        {
            "id": 224,
            "phrase": "leave word for someone to do something",
            "definition": "to leave a message or a request for someone. I left word for you to come to my office.  We left word for her to hurry up and come home."
        },
        {
            "id": 225,
            "phrase": "leave word (with someone)",
            "definition": "to leave a message with someone (who will pass the message on to someone else).  If you decide to go to the convention, please leave word with my secretary. Leave word before you go. I left word with your brother. Didn’t he give you the message?"
        },
        {
            "id": 226,
            "phrase": "lecture at someone (about something)",
            "definition": "to talk to someone about something in the manner of a lecture.  There is no need to lecture at me about the problem. I know how serious the matter is.  Don’t lecture at me all the time!"
        },
        {
            "id": 227,
            "phrase": "lecture someone for something",
            "definition": "to give someone a talkingto about something.  Please don’t lecture me for being late. It won’t help now, will it? _ There is no point in lecturing us for something we didn’t do."
        },
        {
            "id": 228,
            "phrase": "leer at someone",
            "definition": "to gaze at someone flirtatiously or with lust. Why are you leering at that woman in the bikini? _ Stop leering at me!"
        },
        {
            "id": 229,
            "phrase": "The left hand doesn’t know what the right hand is doing.",
            "definition": "Prov. One part of an organization does not know what another part is doing. (Biblical.) _It was evident that the left hand did not know what the right hand was doing when we planned our potluck dinner party, since everyone brought dessert and no one brought a main dish."
        },
        {
            "id": 230,
            "phrase": "*a leg up",
            "definition": "a kind of help where someone provides a knee or crossed hand as a support for someone to place a foot on to get higher, as in mounting a horse or climbing over something. (*Typically: get ~; have ~; give someone ~.) _ I gave her a leg up, and soon she was on her horse. Can I give you a leg up? _Could I please have a leg up?"
        },
        {
            "id": 231,
            "phrase": "*a leg up on someone",
            "definition": "an advantage that someone else does not have. (*Typically: get ~; have ~; give someone ~.) _ I have a leg up on Walter when it comes to getting around town, since I have a car.  I want to practice indoors all winter and get a leg up on Ken, since he thinks he can beat me at tennis."
        },
        {
            "id": 232,
            "phrase": "a legend in one’s own (life)time",
            "definition": "someone who is very famous and widely known for doing something special.  The young golfer became a legend in his own lifetime."
        },
        {
            "id": 233,
            "phrase": "legislate against something",
            "definition": "to prohibit something; to pass a law against something.  You can’t just legislate against something. You have to explain to people why they shouldn’t do it.  The Congress has just legislated against insolvent banks."
        },
        {
            "id": 234,
            "phrase": "legislate for something",
            "definition": "to pass a law that tries to make something happen. The candidate pledged to legislate for tax relief.  We support your efforts to legislate for lower taxes."
        },
        {
            "id": 235,
            "phrase": "legwork",
            "definition": "the physical work accompanying a task. I don’t mind making the phone calls if you do the legwork. I have a gopher to do the legwork for me."
        },
        {
            "id": 236,
            "phrase": "lend color to something",
            "definition": "to provide an interesting accompaniment for something.  Your clever comments lent a great deal of color to the slide show of your vacation.  The excellent master of ceremonies will lend color to an otherwise dry panel discussion."
        },
        {
            "id": 237,
            "phrase": "lend oneself or itself to something",
            "definition": "[for someone or something] to be adaptable to something; [for someone or something] to be useful for something.  This room doesn’t lend itself to bright colors. John doesn’t lend himself to casual conversation.  I don’t think that this gown lends itself to outdoor occasions."
        },
        {
            "id": 238,
            "phrase": "lend someone a hand with something",
            "definition": "to help someone with something. (This need not involve “hands.”) _ Could you please lend us a hand with this? _ Can I lend you a hand with that?"
        },
        {
            "id": 239,
            "phrase": "lend something out† (to someone)",
            "definition": "to allow someone to borrow something. I lent my tuxedo out to a friend who was going to a dance, and now I haven’t anything to wear to the opera.  I lent out my copy of the book.  Sorry, I lent it out."
        },
        {
            "id": 240,
            "phrase": "lend something to someone",
            "definition": "to make a loan of something to someone.  Never lend money to a friend.  Would you be able to lend your coat to Fred?"
        },
        {
            "id": 241,
            "phrase": "Lend your money and lose your friend.",
            "definition": "Prov. You should not lend money to your friends; if you do, either you will have to bother your friend to repay the loan, which will make your friend resent you, or your friend will not repay the loan, which will make you resent your friend.  Bill: Joe needs a hundred dollars to pay his landlord. I’m thinking about lending it to him. Alan: Lend your money and lose your friend."
        },
        {
            "id": 242,
            "phrase": "lengthen out",
            "definition": "to stretch or grow longer. The days began to lengthen out and we knew summer was upon us. As we approached the end of the trail, the distance seemed to lengthen out."
        },
        {
            "id": 243,
            "phrase": "A leopard cannot change his spots.",
            "definition": "Prov. One cannot change the basic way one is.  Bill may say he’ll stop being so jealous after Cindy marries him, but I doubt he will. A leopard can’t change his spots."
        },
        {
            "id": 244,
            "phrase": "Less is more.",
            "definition": "Cliché fewer or small is better.  Simplicity now rules our lives. Less is more. Smaller houses and cars. The world will be a better place!"
        },
        {
            "id": 245,
            "phrase": "The less said (about something), the better.",
            "definition": "Prov. A way of indicating that you think something should not be talked about any further. Jane: How are things going with your divorce proceedings? Ellen: The less said, the better.  The less said about my financial situation, the better."
        },
        {
            "id": 246,
            "phrase": "less than pleased",
            "definition": "displeased. We were less than pleased to learn of your comments.  Bill was less than pleased at the outcome of the election."
        },
        {
            "id": 247,
            "phrase": "the lesser (of the two)",
            "definition": "the smaller one (of two); the one having the lesser amount. The last two pieces of pie were not quite the same size, and I chose the lesser of the two.  Faced with a basket containing too much and one with too little, Tom chose the lesser."
        },
        {
            "id": 248,
            "phrase": "the lesser of two evils",
            "definition": "the less bad thing of a pair of bad things.  I didn’t like either politician, so I voted for the lesser of two evils. Given the options of going out with someone I don’t like and staying home and watching a boring television program, I chose the lesser of the two evils and watched television."
        },
        {
            "id": 249,
            "phrase": "let alone someone or something",
            "definition": "not to mention or think of someone or something; not even to take someone or something into account. (Fixed order.) _Do I have a dollar? I don’t even have a dime, let alone a dollar.  I didn’t invite John, let alone the rest of his family."
        }
    ]
}