{
    "dictionary": [
        {
            "id": 0,
            "phrase": "stay up until a particular time",
            "definition": "to remain awake and out of bed until a particular time.  I stayed up until long past midnight last night.  Do you think Susie should stay up until midnight?"
        },
        {
            "id": 1,
            "phrase": "stay with someone or something",
            "definition": "to remain in the company of someone or something.  Please stay with me for a little while.  How long did you stay with the company?"
        },
        {
            "id": 2,
            "phrase": "stay within something",
            "definition": "to remain inside something. You will have to stay within the immediate area until things return to normal in the town.  Our dog just can’t seem to stay within our yard."
        },
        {
            "id": 3,
            "phrase": "*steady as a rock",
            "definition": "Cliché very steady and unmovable; very stable. (*Also: as ~.) _ His hand was steady as a rock as he made each incision. You must remain as steady as a rock when you are arguing with your supervisor."
        },
        {
            "id": 4,
            "phrase": "steal a base",
            "definition": "to sneak from one base to another in baseball.  The runner stole second base, but he nearly got put out on the way. Tom runs so slowly that he never tries to steal a base."
        },
        {
            "id": 5,
            "phrase": "steal a glance at someone or something",
            "definition": "to sneak a peek at someone or something.  He stole a glance at his brother, who appeared to be as frightened as he was.  Karen stole a glance at her watch and yawned."
        },
        {
            "id": 6,
            "phrase": "steal a march on someone or something",
            "definition": "to precede someone who has the same goal; to accomplish something before someone else does.  Jeff stole a march on all of us when he had his story published.  Our competitor stole a march on us and got the big contract."
        },
        {
            "id": 7,
            "phrase": "steal away (from someone or something)",
            "definition": "to sneak away from someone or something.  The thief stole away from the policeman.  We stole away from the boring lecture."
        },
        {
            "id": 8,
            "phrase": "steal from someone or something",
            "definition": "to rob someone or something.  You wouldn’t steal from a poor man, would you? _ Max didn’t feel bad about stealing from a bank."
        },
        {
            "id": 9,
            "phrase": "steal out of some place",
            "definition": "to sneak quietly out of some place.  The critic stole out of the theater, unable to endure any more of the abysmal play.  I stole out of the lecture and went back to my room."
        },
        {
            "id": 10,
            "phrase": "steal over someone or something",
            "definition": "1. [for a covering of some sort] to move slowly over someone or something. (As with the sun or the shade of a cloud.) _The shade stole over the sunbathers and ended their day.  Darkness stole over the land. 2. [for a feeling] to spread through someone gradually.  A feeling of gloom stole over the crowd.  A sense of high excitement stole over the boys as they waited."
        },
        {
            "id": 11,
            "phrase": "steal someone’s heart",
            "definition": "to capture someone’s affections; to cause someone to fall in love with oneself.  When I first met him, I knew he would steal my heart away. And he did."
        },
        {
            "id": 12,
            "phrase": "steal someone’s thunder",
            "definition": "to lessen someone’s force or authority.  What do you mean by coming in here and stealing my thunder? I’m in charge here! _ Someone stole my thunder by leaking my announcement to the press."
        },
        {
            "id": 13,
            "phrase": "steal something from someone or something",
            "definition": "to take the property belonging to someone or something without permission; to commit the theft of something from someone or something.  Max stole $50 from Henry.  Lefty stole an apple from the fruit stand."
        },
        {
            "id": 14,
            "phrase": "steal something off someone",
            "definition": "to rob something from someone.  I think that guy who walked past me stole my wallet off me! _Max stole a lot of money off tourists last season."
        },
        {
            "id": 15,
            "phrase": "steal up on someone or something",
            "definition": "to sneak up on someone or something. We will steal up on Tony and give him a scare.  The fox stole up on the hen and grabbed it."
        },
        {
            "id": 16,
            "phrase": "steam across something",
            "definition": "[for a ship] to cross a body of water under power. (Originally referred to steam engines, but now can be any sort of engine.) _ How long does it take to steam across the Atlantic these days? _We steamed across the bay in less than an hour."
        },
        {
            "id": 17,
            "phrase": "steam in((to) something)",
            "definition": "[for a vehicle, usually a ship] to enter something under power. (Originally referred to steam engines, but now can be any sort of engine.) _The ship steamed into the harbor and headed for the pier.  Right on time, the ship steamed in."
        },
        {
            "id": 18,
            "phrase": "steam out (of some place)",
            "definition": "[for a conveyance, usually a ship] to exit something under power. (Originally referred to steam engines, but now can be any sort of engine.) _ The huge diesel engines began to labor, and the ship steamed out of its berth.  It shuddered a couple of times and steamed out."
        },
        {
            "id": 19,
            "phrase": "steam someone’s beam",
            "definition": "Sl. to make someone angry.  Being stood up really steams my beam! _ Come on, don’t steam your beam. Remember how hard times are now."
        },
        {
            "id": 20,
            "phrase": "steam someone up†",
            "definition": "1. Sl. to get someone excited. Steam yourselves up and get in there and win this game! _ The coach can really steam up those guys. 2. Sl. to get someone angry.  This whole mess steamed me up but good.  The long critical statement simply steamed up my opponent in the debate."
        },
        {
            "id": 21,
            "phrase": "steam something up†",
            "definition": "to cause something to be covered with water vapor due to the presence of steam.  Our breaths steamed the windows up. The hot shower steamed up the mirror."
        },
        {
            "id": 22,
            "phrase": "steam up",
            "definition": "to become covered with a film of steam or water vapor.  The windows steamed up and we had to wipe them so we could see out.  The window has steamed up, and I can’t see."
        },
        {
            "id": 23,
            "phrase": "steamed (up)",
            "definition": "1. angry. Now, now, don’t get so steamed up! _ She is really massively steamed. 2. Sl. intoxicated and fighting. He was really steamed—and could hardly stand up.  By midnight, Larry was too steamed to drive home, and he had to spend the night."
        },
        {
            "id": 24,
            "phrase": "steaming (mad)",
            "definition": "very angry; very mad; very upset.  The steaming coach yelled at the clumsy players.  The principal was steaming mad when he found that his office had been vandalized."
        },
        {
            "id": 25,
            "phrase": "steel oneself for someone or something",
            "definition": "to prepare oneself for someone or something difficult or unpleasant; to get ready to face someone or something. Aunt Helen is coming for a visit. We should steel ourselves for her.  I think something is going wrong. We had better steel ourselves for a shock."
        },
        {
            "id": 26,
            "phrase": "steel someone against someone or something",
            "definition": "to fortify someone against someone or something; to prepare someone to endure someone or something.  I tried to steel Liz against Carl, who was bringing her some very bad news.  We steeled her against the bad news."
        },
        {
            "id": 27,
            "phrase": "a steely gaze",
            "definition": "Cliché an intense, staring gaze. The principal turned a steely gaze toward the frightened student and suddenly smiled."
        },
        {
            "id": 28,
            "phrase": "steep someone in something",
            "definition": "to immerse someone in some kind of knowledge or other experience; to saturate someone with some kind of experience or training. (Fig. on steep something in something.) _ Her parents steeped her in good literature and music.  She steeped herself in the legends of her people."
        },
        {
            "id": 29,
            "phrase": "steep something in something",
            "definition": "to soak something in a liquid.  I steeped the shirt in red dye.  You have to steep these herbs in steamy hot water for five minutes."
        },
        {
            "id": 30,
            "phrase": "steer away from someone or something",
            "definition": "to move or turn away from someone or something.  You had better steer away from Jeff. He is in a terrible mood. Try to steer away from the potholes. The road is full of them."
        },
        {
            "id": 31,
            "phrase": "steer clear (of someone or something)",
            "definition": "to avoid someone or something.  John is mad at me, so I’ve been steering clear of him.  Steer clear of that book. It has many errors in it."
        },
        {
            "id": 32,
            "phrase": "steer into something",
            "definition": "to turn or drive into something.  Try to steer into the right parking space this time.  Poor Wally steered into the curb."
        },
        {
            "id": 33,
            "phrase": "steer someone or something through something",
            "definition": "to guide someone or something through something that is confusing or treacherous.  I tried to steer Judy through the registration procedure, but I really didn’t know what I was doing.  Should I try to steer my car through all this foot traffic or take a different route?"
        },
        {
            "id": 34,
            "phrase": "steer something for something",
            "definition": "to aim oneself or one’s vehicle toward something. Jeff steered the car for the entrance to the tunnel and stepped on the gas.  The driver steered the bus for the center lane just in time."
        },
        {
            "id": 35,
            "phrase": "steer something toward someone or something",
            "definition": "to guide something in the direction of someone or something.  The farmer steered the tractor toward the sheriff, who had come to talk to the farmer.  Please steer the car toward the right side."
        },
        {
            "id": 36,
            "phrase": "steer through something",
            "definition": "to maneuver through something that is confusing or treacherous.  Do you think you can steer through this f looded tunnel? _ I can’t steer through this mess of leaves and mud on the road."
        },
        {
            "id": 37,
            "phrase": "steer toward someone or something",
            "definition": "to turn or drive toward someone or something.  He steered toward the empty parking space, but someone got there before he did.  Steer toward the house with the red door."
        },
        {
            "id": 38,
            "phrase": "stem from something",
            "definition": "[for an event] to result from something.  These problems all stem from your mismanagement. Our difficulties stem from the bad weather we have been having."
        },
        {
            "id": 39,
            "phrase": "step aside (for someone)",
            "definition": "to move out of someone’s way.  Would you step aside for my uncle and his walker? _ We had to step aside for the people in wheelchairs to get by."
        },
        {
            "id": 40,
            "phrase": "step back (from someone or something)",
            "definition": "to move away from someone or something; to move back so as to provide space around someone or something.  Please step back from the injured woman. Give her some air.  Step back and give her some air."
        },
        {
            "id": 41,
            "phrase": "step back on someone or something",
            "definition": "to move back and tread on someone or something in the process.  Jeff stepped back on Judy and made her yelp with pain.  Jeff stepped back on the cat."
        },
        {
            "id": 42,
            "phrase": "step between someone or something and someone or something else",
            "definition": "to move between things or people. Jeff stepped between Judy and the gunman. He stepped between Judy and the wall."
        },
        {
            "id": 43,
            "phrase": "step down (from something)",
            "definition": "to come down from something; to alight from something. Please step down from the platform.  She stepped down and went back to her chair."
        },
        {
            "id": 44,
            "phrase": "step forward",
            "definition": "to move forward one step or several steps.  The volunteer stepped forward.  I stepped forward and someone moved up behind me immediately."
        },
        {
            "id": 45,
            "phrase": "step inside (some place)",
            "definition": "to walk into a place. Please step inside my office, and we will discuss this matter.  Please step inside."
        },
        {
            "id": 46,
            "phrase": "step in(to some place)",
            "definition": "to walk into a place.  Tiffany stepped into the room and said hello to everyone.  She stepped in to say hello."
        },
        {
            "id": 47,
            "phrase": "step into someone’s shoes",
            "definition": "to take over a job or some role from someone. I was prepared to step into the boss’s shoes, so there was no disruption when he left for another job.  There was no one who could step into Alice’s shoes when she left, so everything came to a stop."
        },
        {
            "id": 48,
            "phrase": "step in(to the breach)",
            "definition": "[for someone] to assume a position or take on a responsibility when there is a need or an opportunity to do so.  The person who was supposed to help didn’t show up, so I stepped into the breach. The manager stepped into the breach when Jane got sick."
        },
        {
            "id": 49,
            "phrase": "step off",
            "definition": "to come off something by taking a step.  She came to the bottom step and stepped off.  Ed was afraid to dive in from the side of the pool, so he just stepped off."
        },
        {
            "id": 50,
            "phrase": "step on someone or something",
            "definition": "to tread on someone or something.  Ouch! You stepped on me! _ Don’t step on the f looring in that spot. It’s weak."
        },
        {
            "id": 51,
            "phrase": "step out into something",
            "definition": "to go out from a place into a different set of conditions.  Julie stepped out of her previous job into a whole new world.  Wally stepped out into the bright sunlight."
        },
        {
            "id": 52,
            "phrase": "step out of line",
            "definition": "to move out of a line of people.  If you step out of line, you will lose your place in it.  I had to step out of line to sit down on the curb and rest for a minute."
        },
        {
            "id": 53,
            "phrase": "step out (of something)",
            "definition": "1. to go out of a place.  She stepped out of the house without a coat and nearly froze to death.  Jamie stepped out and got wet in the rain. 2. to take one step to get out of pants of some type that have been dropped.  He stepped out of his pants and pulled off his shirt.  He dropped his pants and stepped out."
        },
        {
            "id": 54,
            "phrase": "step out (on someone)",
            "definition": "to be unfaithful to a spouse or lover. Jeff has been stepping out on Judy. I was not stepping out!"
        },
        {
            "id": 55,
            "phrase": "step outside",
            "definition": "1. to go outside, as if to get some fresh air.  I need to step outside for a minute to get a breath of air.  Tom and Harry stepped outside for a moment. 2. to go outside to fight or settle an argument. I find that insulting. Would you care to step outside? _Max invited Lefty to step outside."
        },
        {
            "id": 56,
            "phrase": "step over someone or something",
            "definition": "to walk so as to avoid stepping on someone or something. I stepped over Tom, who was napping on the f loor.  Please step over the things on the f loor. We are doing the spring cleaning."
        },
        {
            "id": 57,
            "phrase": "step over (to) some place",
            "definition": "to move to a place a few steps away.  Please step over here and I’ll show you some other merchandise.  If you will step over to the display case, I will show you some earrings."
        },
        {
            "id": 58,
            "phrase": "step right up",
            "definition": "to come right to where the speaker is; to come forward to the person speaking. (Used by people selling things, as at carnival sideshows.) _Please step right up and buy a ticket to see the show.  Don’t be shy! Step right up and buy one of these."
        },
        {
            "id": 59,
            "phrase": "step something down†",
            "definition": "to reduce the intensity or amount of something by one step or grade.  See if you can step the lights down a little.  Step down the lights just a little more."
        },
        {
            "id": 60,
            "phrase": "step something off†",
            "definition": "to measure a distance by counting the paces required to cover it.  She stepped the distance off and noted it on her pad.  Liz stepped off the number of feet from the window to the opposite wall."
        },
        {
            "id": 61,
            "phrase": "step something up†",
            "definition": "1. to make something more active.  I hope we can step the pace of business up in the next few days. We can step up business considerably by putting out a larger sign. 2. to make something go or run faster. The engineer stepped the motors up and the production line moved even faster. Please step up the speed of your activity."
        },
        {
            "id": 62,
            "phrase": "step up",
            "definition": "to increase.  Industrial production stepped up a large amount this last quarter.  Traffic has stepped up since the road was paved."
        },
        {
            "id": 63,
            "phrase": "step up to something",
            "definition": "to walk to something, especially a counter or a bar.  Jake stepped up to the ticket counter and bought a single ticket for the balcony.  When Wally stepped up to the ticket window, he learned that the show was sold out."
        },
        {
            "id": 64,
            "phrase": "step up to the plate",
            "definition": "[for a batter in baseball] to move near home plate in preparation for striking the ball when it is pitched. The batter stepped up to the plate and glared at the pitcher."
        },
        {
            "id": 65,
            "phrase": "step-by-step",
            "definition": "[walking] one step at a time.  The old man slowly moved across the lawn step-by-step."
        },
        {
            "id": 66,
            "phrase": "stew in one’s own juice",
            "definition": "to be left alone to suffer one’s anger or disappointment.  John has such a terrible temper. When he got mad at us, we just let him go away and stew in his own juice.  After John stewed in his own juice for a while, he decided to come back and apologize to us."
        },
        {
            "id": 67,
            "phrase": "stick around",
            "definition": "[for a person] to remain in a place.  The kids stuck around for a time after the party was over. Oh, Ann. Please stick around for a while. I want to talk to you later."
        },
        {
            "id": 68,
            "phrase": "stick at something",
            "definition": "to keep trying to do something; to stay on a task or job.  I hope he can stick at this job.  He doesn’t seem to be able to stick at anything for very long."
        },
        {
            "id": 69,
            "phrase": "stick in someone’s mind",
            "definition": "to remain in someone’s thinking.  The events of that day stuck in my mind for a very long time. The image of her smiling face stuck in Henry’s mind for a long time."
        },
        {
            "id": 70,
            "phrase": "stick in something",
            "definition": "to remain embedded in something; to remain held in something.  Do you think this will stick in the hole, or is it too small? _ A fish bone stuck in his throat for a while."
        },
        {
            "id": 71,
            "phrase": "stick it to someone",
            "definition": "Inf. to give someone a problem; to confront someone.  They stuck it to me about the stoppedup drain. He was late, and the boss really stuck it to him."
        },
        {
            "id": 72,
            "phrase": "stick man",
            "definition": "Sl. a police patrol officer (who carries a stick). The stick man is due here in about three minutes. Hurry.  I was a stick man for a few years till my feet went bad."
        },
        {
            "id": 73,
            "phrase": "stick one’s neck out (for someone or something)",
            "definition": "to take a risk.  Why should I stick my neck out to do something for her? What’s she ever done for me? _ He made a risky investment. He stuck his neck out for the deal because he thought he could make some big money."
        },
        {
            "id": 74,
            "phrase": "stick one’s nose up in the air",
            "definition": "to behave in a haughty manner.  Jeff stuck his nose up in the air and walked out.  Don’t stick your nose up in the air. Come down to earth with the rest of us."
        },
        {
            "id": 75,
            "phrase": "stick one’s tongue out†",
            "definition": "to cause one’s tongue to project outward. (A gesture of contempt.) _ Don’t stick your tongue out at me! _ She stuck out her tongue at me!"
        },
        {
            "id": 76,
            "phrase": "stick out",
            "definition": "to project outward.  You can’t lock your suitcase because there is a bit of cloth sticking out. Some cloth stuck out of the top of the drawer."
        },
        {
            "id": 77,
            "phrase": "stick out a mile",
            "definition": "to project outward very obviously. My nose sticks out a mile! I hate it! _ His stomach sticks out a mile. What do you suppose is in there?"
        },
        {
            "id": 78,
            "phrase": "stick out against something",
            "definition": "to be highly visible against a background of something. Your cold, red nose sticks out against your white, frozen face.  The red vase sticks out against the pale blue wallpaper."
        },
        {
            "id": 79,
            "phrase": "stick out (from someone or something)",
            "definition": "to project outward from someone or something.  His right arm, which was in a cast, stuck out from him like a crane.  His arm stuck out."
        },
        {
            "id": 80,
            "phrase": "stick out like a sore thumb",
            "definition": "to be very obvious.  That pimple really sticks out like a sore thumb.  Do you think I would stick out like a sore thumb at the party if I wear this coat?"
        },
        {
            "id": 81,
            "phrase": "stick out (of someone or something)",
            "definition": "to protrude from someone or something.  The arrow stuck out of him, wobbling as he staggered.  A dollar bill stuck out of the book. What a strange bookmark."
        },
        {
            "id": 82,
            "phrase": "stick shift",
            "definition": "1. having to do with a nonautomatic transmission or a car that has one.  I prefer a stick shift car— I don’t know why.  The stick shift models are cheaper— that’s why. 2. a nonautomatic transmission. I can’t drive a stick shift! _ My husband took the other car and stuck me with the stick shift."
        },
        {
            "id": 83,
            "phrase": "stick someone or something up†",
            "definition": "to rob someone or a business establishment. (Presumably with the aid of a gun.) _ Max tried to stick the drugstore up.  Max stuck up the store."
        },
        {
            "id": 84,
            "phrase": "stick someone with someone or something",
            "definition": "to burden someone with someone or something.  The dishonest merchant stuck me with a faulty television set.  John stuck me with his talkative uncle and went off with his friends."
        },
        {
            "id": 85,
            "phrase": "stick something down†",
            "definition": "to fasten something down, as with glue or paste.  Get some glue and stick down this wallpaper, please.  Stick this wallpaper down, would you?"
        },
        {
            "id": 86,
            "phrase": "stick something out†",
            "definition": "to endure something; to stay with something. (The something can be vaguely expressed using it.) _ I will stick it out as long as I can.  She stuck out the abuse as long as she could; then she started looking for another job."
        },
        {
            "id": 87,
            "phrase": "stick something out† to someone",
            "definition": "to hold something, such as one’s hand, out where someone can grasp it. She stuck her hand out to him, intending that he shake it. Ted stuck out his hand to Bill, but withdrew it suddenly."
        },
        {
            "id": 88,
            "phrase": "stick something through someone or something",
            "definition": "to push something so that it penetrates someone or something.  The good knight stuck his lance through the bad knight.  I stuck my fist through the f limsy wall."
        },
        {
            "id": 89,
            "phrase": "stick something together",
            "definition": "1. to glue or paste something together. Use glue to stick these pieces together. Please stick the pieces of the broken vase together with glue. 2. to assemble something, perhaps in haste. He just stuck the model plane together, making a mess of it.  Don’t stick the parts together so fast. It won’t look good."
        },
        {
            "id": 90,
            "phrase": "stick something up†",
            "definition": "1. to fasten something to a place where it can be seen; to put something on display, especially by gluing, tacking, or stapling.  Stick this notice up. Put a copy on every bulletin board.  Please stick up this notice. 2. to raise something; to hold something up.  She stuck her hand up because she knew the answer.  The elephant stuck up its trunk and trumpeted."
        },
        {
            "id": 91,
            "phrase": "stick to one’s guns",
            "definition": "to remain firm in one’s convictions; to stand up for one’s rights. (Fig. on a soldier remaining in place to fire a gun even when all appears to be lost.) _ I’ll stick to my guns on this matter. I’m sure I’m right.  Bob can be persuaded to do it our way. He probably won’t stick to his guns on this point."
        },
        {
            "id": 92,
            "phrase": "stick to one’s ribs",
            "definition": "[for food] to last long and fortify one well; [for food] to sustain one even in the coldest weather.  This oatmeal ought to stick to your ribs. You need something hearty on a cold day like this. I don’t want just a salad! I want something that will stick to my ribs."
        },
        {
            "id": 93,
            "phrase": "stick to someone or something",
            "definition": "to adhere to someone or something; to remain affixed to someone or something.  The tape stuck to me and I couldn’t get it off.  This stamp won’t stick to the envelope."
        },
        {
            "id": 94,
            "phrase": "stick to someone’s fingers",
            "definition": "to remain in someone’s possession; to be stolen by someone.  Other people’s watches tend to stick to Max’s fingers.  Watch that clerk. Your change tends to stick to his fingers."
        },
        {
            "id": 95,
            "phrase": "stick together",
            "definition": "to adhere to one another.  The noodles are sticking together. What shall I do? _ You need to keep the pieces separate while you fry them or else they will stick together."
        },
        {
            "id": 96,
            "phrase": "stick up",
            "definition": "to stand upright or on end; to thrust upward.  The ugly red f lower stuck up from the bouquet.  Why is the worst-looking f lower sticking up above all the rest?"
        },
        {
            "id": 97,
            "phrase": "stick up for someone or something",
            "definition": "to support someone or something; to speak in favor of someone or something.  Everyone was making unpleasant remarks about John, but I stuck up for him.  Our team was losing, but I stuck up for it anyway."
        },
        {
            "id": 98,
            "phrase": "Stick with it.",
            "definition": "Do not give up. Stay with your task.  Bill: I’m really tired of calculus. Father: Stick with it. You’ll be a better person for it.  Bill: This job is getting to be such a pain. Sue: True, but it pays well, doesn’t it? Stick with it."
        },
        {
            "id": 99,
            "phrase": "stick-in-the-mud",
            "definition": "a dull and old-fashioned person. Don’t be such an old stick-in-the-mud. Some stick-inthe- mud objected to the kind of music we wanted to play in church."
        },
        {
            "id": 100,
            "phrase": "Sticks and stones may break my bones, but words will never hurt me.",
            "definition": "Prov. You do not hurt me by calling me names. (A reply to someone who has called you names. Primarily used by children; sounds childish when used by adults.) _ Brother: You’re stupid and mean, and everybody hates you! Sister: Sticks and stones may break my bones, but words will never hurt me."
        },
        {
            "id": 101,
            "phrase": "*stiff as a poker",
            "definition": "rigid and inflexible; stiff and awkward. (Usually used to describe people. *Also: as ~.) _ This guy’s dead. He’s cold and as stiff as a poker.  John is not a very good dancer; he’s stiff as a poker."
        },
        {
            "id": 102,
            "phrase": "stiffen something up†",
            "definition": "to make something rigid or tense.  He added a little starch to the rinse water to stiffen his collars up a bit.  The cold draft has stiffened up my neck."
        },
        {
            "id": 103,
            "phrase": "stiffen up",
            "definition": "to become stiff.  The bread dough stiffened up as it got cold.  My knees began to stiffen up after I sat still for an hour."
        },
        {
            "id": 104,
            "phrase": "stigmatize someone as something",
            "definition": "to brand or label someone as something.  The opposition will try to stigmatize you as a spendthrift. Tony was stigmatized as a poor loser."
        },
        {
            "id": 105,
            "phrase": "*still as death",
            "definition": "Cliché immobile; completely still. (The reference to death gives this expression ominous connotations. *Also: as ~.) _George sat as still as death all afternoon. When the storm was over, everything was suddenly still as death."
        },
        {
            "id": 106,
            "phrase": "A still tongue makes a wise head.",
            "definition": "Prov. If you are wise, you do not talk very much.; You should only speak when you have judged that it is appropriate to do so.  Don’t chatter about whatever comes to your mind. A still tongue makes a wise head.  Kathy really offended Mr. Parker by talking so much about his ex-wife. She needs to learn that a still tongue makes a wise head."
        },
        {
            "id": 107,
            "phrase": "Still waters run deep.",
            "definition": "Prov. Quiet people are often very thoughtful.  Jill: I get the impression that Nathan is not very smart. He never says anything. Jane: Don’t be so sure. Still waters run deep, you know."
        },
        {
            "id": 108,
            "phrase": "stimulate someone or an animal into something",
            "definition": "to excite or cause someone or an animal to do something.  The promises of bonuses stimulated the workers into higher productivity for the week.  The morning light stimulates the birds into singing."
        },
        {
            "id": 109,
            "phrase": "sting someone for something",
            "definition": "Sl. to cheat someone of a particular amount; to make someone pay for something.  That guy stung me for twenty bucks! _ Toby was stung for the lunch bill."
        },
        {
            "id": 110,
            "phrase": "sting someone with something",
            "definition": "to use something to sting someone. The bee stung me with its stinger. The wasp can sting you with its poisonous barb."
        },
        {
            "id": 111,
            "phrase": "stink on ice",
            "definition": "Sl. to be really rotten. (So rotten as to reek even when frozen.) _This show stinks on ice. The whole idea stank on ice."
        },
        {
            "id": 112,
            "phrase": "stink something up†",
            "definition": "to make something or some place smell very bad.  Your cooking really stunk the place up! _ The rotten eggs will stink up the whole house."
        },
        {
            "id": 113,
            "phrase": "stink with something",
            "definition": "to smell very bad with the smell of something. The room stinks with a garlicky smell. Our garden stinks with the smell of something rotting."
        },
        {
            "id": 114,
            "phrase": "stinking rich",
            "definition": "very rich.  I’d like to be stinking rich for the rest of my life. Tiffany is stinking rich, and she acts like it."
        },
        {
            "id": 115,
            "phrase": "stinking with something",
            "definition": "having lots of something.  Mr. Wilson is just stinking with cash.  Those guys are stinking with jewelry."
        },
        {
            "id": 116,
            "phrase": "stir someone (in)to something",
            "definition": "to excite someone into doing something.  The events of the day stirred everyone into action.  The danger stirred them to action."
        },
        {
            "id": 117,
            "phrase": "stir someone up†",
            "definition": "to get someone excited; to get someone angry. (Fig. on stir something up.) _The march music really stirred the audience up.  The march stirred up the audience."
        },
        {
            "id": 118,
            "phrase": "stir something around",
            "definition": "to agitate or mix a liquid substance by moving it in a circular motion.  Stir the mixture around to mix it up.  You should stir the dressing around a bit before you serve it."
        },
        {
            "id": 119,
            "phrase": "stir something up†",
            "definition": "to mix something by stirring.  Please stir the pancake batter up before you use it. Please stir up the batter."
        },
        {
            "id": 120,
            "phrase": "stir up a hornet’s nest",
            "definition": "to create a lot of trouble. (Fig. on stir something up W.) _If you say that to her, you will be stirring up a hornet’s nest. There is no need to stir up a hornet’s nest."
        },
        {
            "id": 121,
            "phrase": "*stir-crazy",
            "definition": "crazy from being confined. (*Typically: be ~; become ~; go ~; get ~; make someone ~. Stir is a slang word for prison.) _ I am going to go stir-crazy if I don’t get out of this office."
        },
        {
            "id": 122,
            "phrase": "A stitch in time saves nine.",
            "definition": "Prov. If you fix a small problem right away, it will not become a bigger problem later.  Let’s patch the roof before that hole gets bigger. A stitch in time saves nine."
        },
        {
            "id": 123,
            "phrase": "stitch something up†",
            "definition": "to sew something together; to mend a tear or ripped seam.  I tore my shirt. Would you stitch it up, please? _ Please stitch up my shirt."
        },
        {
            "id": 124,
            "phrase": "stock in trade",
            "definition": "whatever goods, skills, etc., are necessary to undertake an activity of some kind.  Of course I am glad to help. Packing household goods is my stock in trade."
        },
        {
            "id": 125,
            "phrase": "stock something (up†) with something",
            "definition": "to load something with a supply of something.  Let’s stock the wine cellar with good vintages this year.  We will stock up our wine cellar with whatever is on sale."
        },
        {
            "id": 126,
            "phrase": "stock up (on something)",
            "definition": "to build up a supply of something in particular.  I need to stock up on food for the party.  We need fresh vegetables. We will have to stock up before the weekend."
        },
        {
            "id": 127,
            "phrase": "stock up (with something)",
            "definition": "to build up a supply of something.  You had better stock up with firewood before the first snowstorm.  Yes, I will stock up today."
        },
        {
            "id": 128,
            "phrase": "stoke something up†",
            "definition": "1. to poke or add fuel to a fire to make it burn hotter.  Grandpa had to go down each winter morning to stoke the fire up.  He stoked up the furnace every morning during the winter. 2. Sl. to start something, such as an engine.  Stoke this old car up so we can leave.  Stoke up your motorcycle and let’s get going."
        },
        {
            "id": 129,
            "phrase": "*stoked on someone or something",
            "definition": "Sl. excited by someone or something. (*Typically: be ~; get ~.) _ I am really stoked on that movie.  She was really stoked on Tom."
        },
        {
            "id": 130,
            "phrase": "stoked out",
            "definition": "Sl. exhausted. I ran all the way and got stoked out. Alex is totally stoked out from working in the hot sun."
        },
        {
            "id": 131,
            "phrase": "stomp on someone",
            "definition": "to stamp someone down. The angry crowd knocked him down and stomped on him.  The crowd stomped on the mugger."
        },
        {
            "id": 132,
            "phrase": "stone dead",
            "definition": "Rur. dead; unquestionably dead; long dead.  The cat was stone dead and stiff as a board by the time we got to him.  Old Tom is stone dead and in the ground."
        },
        {
            "id": 133,
            "phrase": "a stone’s throw away",
            "definition": "a short distance; a relatively short distance.  John saw Mary across the street, just a stone’s throw away.  Philadelphia is just a stone’s throw away from Camden, New Jersey."
        },
        {
            "id": 134,
            "phrase": "stool (on someone)",
            "definition": "Sl. to inform (on someone).  Jane would stool on anybody, even her own mother. Somebody stooled and ruined the whole layout."
        },
        {
            "id": 135,
            "phrase": "stoop down",
            "definition": "to dip, duck, or squat down. I had to stoop down to enter the tiny door.  Stoop down so you don’t bump your head."
        },
        {
            "id": 136,
            "phrase": "stoop over",
            "definition": "to bend over.  Carl stooped over to pick up his napkin and lost his balance.  As he stooped over, he lost his balance and fell."
        },
        {
            "id": 137,
            "phrase": "stoop to doing something",
            "definition": "to degrade oneself or condescend to doing something; to do something that is beneath one.  Whoever thought that the manager of the department would stoop to sweeping up? _ I never dreamed that Bill would stoop to stealing."
        },
        {
            "id": 138,
            "phrase": "stop at something",
            "definition": "1. to go as far as something and then stop.  I will stop at the end of the road.  The road stopped at the base of a mountain. 2. to stop briefly at something and then continue. I have to stop at the store for a minute.  Do you mind if I stop at a drug store? 3. to spend the night at some place. (Typically with motel, inn, bed and breakfast, and hotel.) _We stopped at a nice little inn for the night. When we travel, we like to stop at hotels that are run by one of the national chains."
        },
        {
            "id": 139,
            "phrase": "stop behind someone or something",
            "definition": "to bring oneself or one’s vehicle to a stop behind someone or something.  I stopped behind Fred at the red light. Fred stopped behind a minivan."
        },
        {
            "id": 140,
            "phrase": "stop dead in one’s tracks",
            "definition": "to stop completely still suddenly because of fear, a noise, etc.  I stopped dead in my tracks when I heard the scream. The deer stopped dead in its tracks when it heard the hunter step on a fallen branch."
        },
        {
            "id": 141,
            "phrase": "stop for someone",
            "definition": "to halt one’s vehicle to allow someone to get in.  I stopped for Jeff, but he didn’t want a ride.  I didn’t have time to stop for you. I hope you will forgive me."
        },
        {
            "id": 142,
            "phrase": "stop for something",
            "definition": "to halt one’s vehicle because of something or the need of something.  I had to stop for a red light.  We stopped for some gas."
        },
        {
            "id": 143,
            "phrase": "stop, look, and listen",
            "definition": "to exercise caution, especially at street corners and railroad crossings, by stopping, looking to the left and to the right, and listening for approaching vehicles or a train. Sally’s mother trained her to stop, look, and listen at every street corner.  It is a good practice to stop, look, and listen at a railroad crossing."
        },
        {
            "id": 144,
            "phrase": "stop off (some place) (for a period of time)",
            "definition": "to halt or pause for a certain period of time.  I need to stop off for a rest.  Let’s find a little town and stop off.  I have to stop off at the store for a minute.  We stopped off for a while at the park."
        },
        {
            "id": 145,
            "phrase": "stop on a dime",
            "definition": "to come to a stop in a very short distance.  This thing will stop on a dime.  Imagine a bus that could stop on a dime."
        },
        {
            "id": 146,
            "phrase": "stop on something",
            "definition": "to go as far as something [on the floor or the ground] and then stop.  Please stop on the line.  You are supposed to stop on the white line or behind it."
        },
        {
            "id": 147,
            "phrase": "stop one or something dead in one’s or something’s tracks",
            "definition": "to stop someone or something suddenly and completely. The gunshot stopped the killer dead in her tracks.  The arrow stopped the deer dead in its tracks."
        },
        {
            "id": 148,
            "phrase": "stop over (some place)",
            "definition": "to break one’s journey, usually overnight or even longer.  On our way to New York, we stopped over in Philadelphia for the night.  That’s a good place to stop over. There are some nice hotels in Philadelphia."
        },
        {
            "id": 149,
            "phrase": "stop short of a place",
            "definition": "not to go as far as something. The bus stopped short of the end of the road. The speeding car stopped short of the sidewalk where children were playing."
        },
        {
            "id": 150,
            "phrase": "stop short of doing something",
            "definition": "not to go as far as doing something. Fortunately Bob stopped short of hitting Tom.  The boss criticized Jane’s work but stopped short of firing her. Jack was furious but stopped short of hitting Tom."
        },
        {
            "id": 151,
            "phrase": "stop someone cold",
            "definition": "to halt someone immediately. When you told us the bad news, it stopped me cold."
        },
        {
            "id": 152,
            "phrase": "stop someone from doing something",
            "definition": "to prevent someone from doing something.  I can’t stop her from running away.  They couldn’t stop themselves from eating."
        },
        {
            "id": 153,
            "phrase": "stop something up† (with something)",
            "definition": "to plug or clog something with something.  Gary stopped the sink up with bacon grease.  He stopped up the sink with bacon grease.  Try not to stop the sink up."
        },
        {
            "id": 154,
            "phrase": "stop up",
            "definition": "[for something] to become clogged.  The sink stopped up again!"
        },
        {
            "id": 155,
            "phrase": "store something away†",
            "definition": "to put something away for future use; to set something aside. Store the extra rice away for use next week.  Please store away the extra food."
        },
        {
            "id": 156,
            "phrase": "store something in something",
            "definition": "to set something aside in something.  Can I store my bicycle in your garage? _ Do you mind if I store my coat in your locker?"
        },
        {
            "id": 157,
            "phrase": "store something up†",
            "definition": "to build up and lay away a supply of something.  The bears will store fat up for the long winter.  They store up fat for the winter."
        },
        {
            "id": 158,
            "phrase": "storm around",
            "definition": "to go about in a fury.  What is he storming around about? _ Martin was storming around all morning because he lost his car keys."
        },
        {
            "id": 159,
            "phrase": "storm at someone or something",
            "definition": "to direct one’s anger at someone or something.  She stormed at him because he was late again.  Richard was storming at the cat again."
        },
        {
            "id": 160,
            "phrase": "storm in(to some place)",
            "definition": "to burst into something or some place angrily. The army stormed into the town and took many of the citizens as prisoners.  Leonard stormed in, shouting at everyone."
        },
        {
            "id": 161,
            "phrase": "A storm is brewing.",
            "definition": "1. There is going to be a storm.  Look at the clouds. A storm is brewing.  A storm is brewing in the west. 2. There is going to be trouble or emotional upset.  He looks angry. A storm is brewing."
        },
        {
            "id": 162,
            "phrase": "storm out (of some place)",
            "definition": "to burst out of some place angrily.  Carol stormed out of the office in a rage.  She got mad and stormed out."
        },
        {
            "id": 163,
            "phrase": "stow away",
            "definition": "to conceal oneself in a vehicle, originally a ship, in order to travel without paying.  Don got to this country by stowing away on a cargo ship."
        },
        {
            "id": 164,
            "phrase": "stow something away†",
            "definition": "to pack something away.  I have to stow my clothes away before I go to bed.  Please stow away your things and get right to work."
        },
        {
            "id": 165,
            "phrase": "straddle the fence",
            "definition": "to support both sides of an issue. (As if one were partly on either side of a fence.) _ The mayor is straddling the fence on this issue, hoping the public will forget it. The legislator wanted to straddle the fence until the last minute, and that alone cost her a lot of votes."
        },
        {
            "id": 166,
            "phrase": "the straight and narrow",
            "definition": "a straight and law-abiding route through life. (Referring to a morally rigid and correct course of behavior. Fixed order.) _ You should have no trouble with the police if you stick to the straight and narrow.  Roger was the kind who followed the straight and narrow every day of his life."
        },
        {
            "id": 167,
            "phrase": "*straight as an arrow",
            "definition": "1. Cliché [of something] very straight. (*Also: as ~.) _ The road to my house is as straight as an arrow, so it should be very easy to follow. 2. Cliché [of someone] honest or forthright. (Straight here means honest. *Also: as ~.) _ Tom is straight as an arrow. I’d trust him with anything."
        },
        {
            "id": 168,
            "phrase": "the straight dope",
            "definition": "the true information; the full story.  He gave us the straight dope.  I want the straight dope. I can take it."
        },
        {
            "id": 169,
            "phrase": "*a straight face",
            "definition": "a face free from smiles or laughter. (*Typically: have ~; keep ~.) _ It’s hard to keep a straight face when someone tells a funny joke."
        },
        {
            "id": 170,
            "phrase": "(straight) from the horse’s mouth",
            "definition": "from an authoritative or dependable source.  I know it’s true! I heard it straight from the horse’s mouth! _ This comes straight from the horse’s mouth, so it has to be believed."
        },
        {
            "id": 171,
            "phrase": "straight from the shoulder",
            "definition": "very direct, without attenuation or embellishment.  Okay, I’ll give it to you straight from the shoulder. Right straight from the shoulder: clean out your desk; you’re through."
        },
        {
            "id": 172,
            "phrase": "straight low",
            "definition": "Sl. the absolute truth. (From lowdown = the story; the truth.) _ Can you give me the straight low on this mess? _Nobody ain’t gonna tell no warden the straight low; you can be sure of that."
        },
        {
            "id": 173,
            "phrase": "straight man",
            "definition": "someone who sets up jokes or gags so that someone else can say the punch line.  I need a straight man to set up all my jokes.  I’m tired of being a straight man for a has-been comic."
        },
        {
            "id": 174,
            "phrase": "straight out",
            "definition": "frankly; directly. Bob told Pam straight out that he didn’t want to marry her.  Jim was told straight out to start working harder."
        },
        {
            "id": 175,
            "phrase": "straight shooter",
            "definition": "an honest person.  I trust Mike; he’s a straight shooter. We need a straight shooter in office who will work for the people rather than some lobbyists."
        },
        {
            "id": 176,
            "phrase": "straight talk",
            "definition": "direct and honest talk.  It’s about time for a little straight talk around here.  If they want straight talk and can handle straight talk, give ’em straight talk."
        },
        {
            "id": 177,
            "phrase": "straight up",
            "definition": "1. Sl. upright.  A fine guy—really straight up.  She is one of the most straight up brokers in town. 2. Sl. [of a drink] served without ice; neat.  I’ll have a bourbon, straight up, please.  No, not straight up. Just a little ice. 3. Sl. [of eggs] cooked sunny-side up; having to do with eggs cooked with the yolks facing up. Two eggs, straight up, and a cup of coffee. I like my eggs straight up, but the white part has to be cooked solid."
        },
        {
            "id": 178,
            "phrase": "straighten out",
            "definition": "1. to become straight.  The road finally straightened out. The train tracks straightened out on the plain. 2. to improve one’s behavior or attitude.  I hope he straightens out before he gets himself into real trouble.  Fred had better straighten out soon if he wants to get a job."
        },
        {
            "id": 179,
            "phrase": "straighten someone or something up†",
            "definition": "1. to put someone or something into an upright position.  The fence is tilted. Please straighten that post up when you get a chance.  Bill, you’re slouching again. Straighten up your back. 2. to tidy up someone or something.  John straightened himself up a little before going out for dinner.  This room is a mess. Let’s straighten up this place, right now!"
        },
        {
            "id": 180,
            "phrase": "straighten someone out†",
            "definition": "1. to make someone’s body straight or orderly. The undertaker straightened Sam out in his coffin.  Straighten out your body so I can massage your back. 2. to cause someone to behave better or to have a better attitude; to reform someone.  You are terrible. Someone is going to have to straighten you out! _The principal straightened out the troublesome boys. 3. to help someone become less confused about something.  Can you straighten me out on this matter? _I will do what I can to straighten out the office staff on this question."
        },
        {
            "id": 181,
            "phrase": "straighten something out†",
            "definition": "1. to make something straighter.  I can’t straighten these heavy boxes out.  Please straighten out this line of people. 2. to bring order to something that is disorderly. See if you can straighten this mess out. Will you straighten out your room, please?"
        },
        {
            "id": 182,
            "phrase": "straighten up",
            "definition": "1. to sit or stand more straight.  Billy’s mother told him to straighten up or he’d fall out of his chair. John straightened up so he’d look taller. 2. to behave better.  Bill was acting badly for a while; then he straightened up.  Sally, straighten up, or I will punish you!"
        },
        {
            "id": 183,
            "phrase": "straighten up and fly right",
            "definition": "to improve one’s behavior or attitude and perform better. (Originally referred to an airplane.) _ If you want to keep out of trouble, you had better straighten up and f ly right.  Straighten up and f ly right or I will send you to the principal."
        },
        {
            "id": 184,
            "phrase": "strain after something",
            "definition": "[for a singer] to work very hard to reach a very high or a very low note.  Don’t strain after the note. Let it come naturally, like a cooling breeze.  She was straining after each note as if it hurt her to sing, which it probably did."
        },
        {
            "id": 185,
            "phrase": "strain at gnats and swallow camels",
            "definition": "Prov. to criticize other people for minor offenses while ignoring major offenses. (Biblical.) _ Jill: Look at that. Edward is combing his hair at his desk. How unprofessional. Jane: Don’t strain at gnats and swallow camels. There are worse problems than that around here."
        },
        {
            "id": 186,
            "phrase": "strain at the leash",
            "definition": "[for a dog] to pull very hard on its leash.  It’s hard to walk Fido, because he is always straining at the leash. I wish that this dog would not strain at the leash. It’s very hard on me."
        },
        {
            "id": 187,
            "phrase": "strain away (at something)",
            "definition": "to work very hard, continuously, at doing something.  She strained away at her weights, getting stronger every day.  She was straining away on the rowing machine when we came in."
        },
        {
            "id": 188,
            "phrase": "strain for an effect",
            "definition": "to work very hard to try to achieve some effect.  The actors were straining so hard for an effect that they forgot their lines.  Don’t strain for effect so much. The authors of this drama knew what they were doing, and it’s in the lines already."
        },
        {
            "id": 189,
            "phrase": "strain something through something",
            "definition": "to filter a liquid or a watery substance by pouring it through something.  Tony strained the strawberry jelly through cheesecloth.  We will have to strain the clabber to take out the curds."
        },
        {
            "id": 190,
            "phrase": "strand someone on something",
            "definition": "to abandon someone on something from which there is no escape. The shipwreck stranded our little group on a deserted beach.  We were stranded on the little island by a storm."
        },
        {
            "id": 191,
            "phrase": "stranger to something or some place",
            "definition": "someone who is new to an area or place.  Although John was a stranger to big cities, he enjoyed visiting New York.  You are a stranger to our town, and I hope you feel welcome."
        },
        {
            "id": 192,
            "phrase": "strap someone or something down†",
            "definition": "to tie or bind someone or something down to something.  The nurses strapped Gary down in preparation for the operation.  They strapped down the patient and gave him a sedative."
        },
        {
            "id": 193,
            "phrase": "*strapped for something",
            "definition": "needing something, usually money. (*Typically: be ~; get ~.) _ I am really strapped for cash. Can you lend me some? _Ted is strapped for money and cannot pay his bills."
        },
        {
            "id": 194,
            "phrase": "a straw man",
            "definition": "a weak proposition posited only to be demolished by a simple countering argument.  So you can knock down your own straw man! Big deal. The question is how can you deal with real problems."
        },
        {
            "id": 195,
            "phrase": "stray (away) (from something)",
            "definition": "to drift away from or wander away from a particular topic or location. (The option elements cannot be transposed.) _Please don’t stray from the general area of discussion.  Sally strayed away from her topic a number of times."
        },
        {
            "id": 196,
            "phrase": "stray in(to something)",
            "definition": "to wander into something.  The deer strayed into the town and ruined almost everyone’s garden. We left the gate open, and the cows strayed in and drank from the pond."
        },
        {
            "id": 197,
            "phrase": "stray onto something",
            "definition": "to wander onto an area, such as a parcel of land.  Your cows strayed onto my land and ate my marigolds! _If your horse strays onto my land one more time, it’s my horse!"
        },
        {
            "id": 198,
            "phrase": "streak across something",
            "definition": "to move across something very fast.  A comet streaked across the night sky.  Tom streaked across the street to get a cup of coffee."
        },
        {
            "id": 199,
            "phrase": "stream down (on someone or something)",
            "definition": "[for a liquid or light] to flow downward onto someone or something.  The water streamed down on all of them. The light broke through the clouds and streamed down on all of them.  The waterfall streamed down and soaked them all."
        },
        {
            "id": 200,
            "phrase": "stream in(to something)",
            "definition": "to flow or rush into something.  The people streamed into the hall, each seeking the best possible seat. Water streamed into the room from the broken pipe.  Complaints about the bawdy performance streamed in."
        },
        {
            "id": 201,
            "phrase": "stretch away (from something)",
            "definition": "to extend away from something.  A vast plain stretched away from the riverbank.  The plain stretched away as far as we could see."
        },
        {
            "id": 202,
            "phrase": "stretch away to some place",
            "definition": "to extend as far as some place.  The forest stretched away to the horizon.  The river stretched away to the sea."
        },
        {
            "id": 203,
            "phrase": "stretch forth (from something)",
            "definition": "to extend out or forth from something.  A path stretched forth from the cabin, leading deep into the woods.  Outside the cabin door, a path stretched forth."
        },
        {
            "id": 204,
            "phrase": "stretch one’s legs",
            "definition": "to walk around and loosen one’s leg muscles after sitting down or lying down for a time. We wanted to stretch our legs during intermission.  After sitting in the car all day, the travelers decided to stretch their legs."
        },
        {
            "id": 205,
            "phrase": "stretch out",
            "definition": "[for one] to extend and stretch one’s body to its full length.  She lay down, stretched out, and relaxed for the first time in days. I need a bigger bed. I can’t stretch out in this one."
        },
        {
            "id": 206,
            "phrase": "stretch out to someone or something",
            "definition": "to extend as far as someone or something. His arm stretched out to the guy next to him and established the correct amount of separation in the ranks. The beach stretched out to the horizon."
        },
        {
            "id": 207,
            "phrase": "stretch someone or something out†",
            "definition": "to extend or draw out someone or something.  Molly stretched the baby out to change his clothes.  She stretched out the baby, who had rolled into a ball."
        },
        {
            "id": 208,
            "phrase": "stretch something out† (to someone or something)",
            "definition": "to reach something out to someone or something.  Jeff stretched his hand out to Tiffany.  He stretched out his hand to the visitor."
        },
        {
            "id": 209,
            "phrase": "Stretch your arm no further than your sleeve will reach.",
            "definition": "Prov. Do not spend more money than you have.  Sue: I can get enough money for college if I take out several loans. Bill: I’d advise against it. Stretch your arm no further than your sleeve will reach."
        },
        {
            "id": 210,
            "phrase": "strew something (all) over something",
            "definition": "to sow or spread something over an area.  Clean this place up! You have strewn your clothing all over the place. The wind strewed the leaves over the lawns."
        },
        {
            "id": 211,
            "phrase": "strew something on someone or something",
            "definition": "to sow or spread something on someone or something. The wind strewed the dandelion seeds on Fred and his friends. A child went down the aisle, strewing f lowers on the white walkway ahead of the bride."
        },
        {
            "id": 212,
            "phrase": "strew something over someone or something",
            "definition": "to spread or scatter something over someone or something. The silo explosion strewed the grain over everyone in the vicinity.  The explosion strewed wreckage over a two-block area."
        },
        {
            "id": 213,
            "phrase": "strew something with something",
            "definition": "to cover something with bits of something.  Who strewed the sidewalk with rice and confetti? _ The yards were strewn with leaves and branches after the storm."
        },
        {
            "id": 214,
            "phrase": "*stricken with something",
            "definition": "afflicted or overwhelmed with something. (*Typically: be ~; become ~; get ~.) _ Albert was stricken with a strange disease.  Fred was stricken with remorse because of his rude remarks.  Tom was stricken with the f lu after his trip to Russia."
        },
        {
            "id": 215,
            "phrase": "strictly business",
            "definition": "1. a matter or issue that is all business and no pleasure.  This meeting is strictly business. We don’t have time for any leisure activity. 2. a person who is very businesslike and does not waste time with nonbusiness matters.  Joe is strictly business. I don’t think he has a sense of humor. At least I have never seen it."
        },
        {
            "id": 216,
            "phrase": "(strictly) from hunger",
            "definition": "Sl. very mediocre; acceptable only when nothing else is available.  This kind of entertainment is from hunger. The singer was strictly from hunger."
        },
        {
            "id": 217,
            "phrase": "(strictly) on the level",
            "definition": "honest; dependably open and fair.  How can I be sure you’re on the level? _ You can trust Sally. She’s strictly on the level."
        },
        {
            "id": 218,
            "phrase": "(strictly) on the up-and-up",
            "definition": "honest; fair and straight. Do you think that the mayor is on the up-and-up? _Yes, the mayor is strictly on the up-and-up."
        },
        {
            "id": 219,
            "phrase": "stride in(to some place)",
            "definition": "to walk with long steps into some place.  Jeff strode into the restaurant and demanded the best table.  He strode in and ordered roast chicken."
        },
        {
            "id": 220,
            "phrase": "stride out of some place",
            "definition": "to walk with long steps out of some place.  The angry customer strode out of the shop without purchasing anything. We strode out of the restaurant, pledging never to go there again."
        },
        {
            "id": 221,
            "phrase": "strike a balance (between two things)",
            "definition": "to find a satisfactory compromise between two extremes.  The political party must strike a balance between the right wing and the left wing.  Jane is overdressed for the party and Sally is underdressed. What a pity they didn’t strike a balance between them."
        },
        {
            "id": 222,
            "phrase": "strike a chord (with someone)",
            "definition": "to cause someone to remember something; to remind someone of something; to be familiar. The woman in the portrait struck a chord with me, and I realized that it was my grandmother.  His name strikes a chord, but I don’t know why."
        },
        {
            "id": 223,
            "phrase": "strike a match",
            "definition": "to light a match by rubbing it on a rough surface.  Mary struck a match and lit a candle.  When Sally struck a match to light a cigarette, Jane said quickly, “No smoking, please.”"
        },
        {
            "id": 224,
            "phrase": "strike a pose",
            "definition": "to position oneself in a certain posture.  Bob struck a pose in front of the mirror to see how much he had bulked up.  Lisa walked into the room and struck a pose, hoping she would be noticed."
        },
        {
            "id": 225,
            "phrase": "strike at someone or something",
            "definition": "to hit at or toward someone or something.  She struck at him, but he parried the blows.  The bear struck at the branch, hoping to break it and get at the honey."
        },
        {
            "id": 226,
            "phrase": "strike back (at someone or something)",
            "definition": "to return the blows of someone or something; to return the attack of someone or something.  The victim struck back at the mugger and scared him away.  The victim struck back in the courts."
        },
        {
            "id": 227,
            "phrase": "strike for something",
            "definition": "to conduct a work stoppage in order to gain something.  The workers were striking for longer vacations.  We are striking for higher pay."
        },
        {
            "id": 228,
            "phrase": "strike home with someone",
            "definition": "[for something] to awaken recognition and acceptance in a person.  What you said really strikes home with me.  Her comments struck home with her audience."
        },
        {
            "id": 229,
            "phrase": "strike it rich",
            "definition": "to acquire wealth suddenly. If I could strike it rich, I wouldn’t have to work anymore.  Sally ordered a dozen oysters and found a huge pearl in one of them. She struck it rich!"
        },
        {
            "id": 230,
            "phrase": "strike out",
            "definition": "[for a baseball batter] to be declared out after making three strikes. (Baseball.) _And so Drew Wilson strikes out for his second time in this game! _He struck out in the second inning, and the manager took him out then."
        },
        {
            "id": 231,
            "phrase": "strike out (at someone or something)",
            "definition": "to hit at someone or something with the intention of threatening or harming. Dave would strike out at anyone who came near him, but it was all bluff. He was mad, and when anyone came close, he struck out."
        },
        {
            "id": 232,
            "phrase": "strike out for some place",
            "definition": "to begin a journey to some place; to set out on a journey for some place.  We struck out for Denver, hoping to get there in a few hours.  The hikers struck out for the cabin but were delayed by a sudden storm."
        },
        {
            "id": 233,
            "phrase": "strike over something",
            "definition": "to mark out printed words by putting x’s over them or a line through them.  Please don’t strike over your errors. Erase them altogether. Betty struck over most of the misspellings."
        },
        {
            "id": 234,
            "phrase": "strike someone as something",
            "definition": "1. [for a thought or behavior] to affect someone a certain way. John’s rude behavior struck me as surprising. Mary’s attitude struck me as childish. 2. [for a person] to impress someone as something or a particular type of person.  You strike me as thoughtful.  You don’t strike me as the type of person to do something like that."
        },
        {
            "id": 235,
            "phrase": "strike someone funny",
            "definition": "to seem funny to someone.  Sally has a great sense of humor. Everything she says strikes me funny.  Why are you laughing? Did something I said strike you funny?"
        },
        {
            "id": 236,
            "phrase": "strike someone or something down†",
            "definition": "to knock someone or something down by striking.  Max struck Lefty down with one blow.  He struck down the weeds with a scythe."
        },
        {
            "id": 237,
            "phrase": "strike someone or something from something",
            "definition": "to remove someone or something from something, such as a list.  I will have to strike David from our rolls. He never shows up.  We struck the red car from the list of eligible racers."
        },
        {
            "id": 238,
            "phrase": "strike someone or something on something",
            "definition": "to hit someone or something on a particular place or part.  The ball struck me on my elbow, causing a great deal of pain.  I struck the bear on the paw, and that only made it madder."
        },
        {
            "id": 239,
            "phrase": "strike someone or something with something",
            "definition": "to hit someone or something with something.  Max struck Lefty with his fist.  The mayor struck the table with his fist."
        },
        {
            "id": 240,
            "phrase": "strike someone’s fancy",
            "definition": "to appeal to someone.  I’ll have some ice cream, please. Chocolate strikes my fancy right now.  Why don’t you go to the store and buy a CD that strikes your fancy?"
        },
        {
            "id": 241,
            "phrase": "strike something down†",
            "definition": "[for a court] to invalidate a ruling or law. The higher court struck the ruling of the lower court down.  The court struck down the ruling."
        },
        {
            "id": 242,
            "phrase": "strike something into something",
            "definition": "to knock something, such as a ball, into something. Johnny struck the ball into the vacant lot.  Ted struck golf ball after golf ball into the water."
        },
        {
            "id": 243,
            "phrase": "strike something out†",
            "definition": "to cross something out of a section of printing or writing. This is wrong. Please strike it out.  Strike out this sentence."
        },
        {
            "id": 244,
            "phrase": "strike something up†",
            "definition": "to begin something; to cause something to begin. (Typically, the playing of a band, a conversation, or a friendship.) _ We tried to strike a conversation up—to no avail.  I struck up a conversation with Molly."
        },
        {
            "id": 245,
            "phrase": "strike something (up)on something",
            "definition": "to hit or bang something on something else.  She struck her head upon the side of the bed.  Mary struck her elbow on the doorjamb."
        },
        {
            "id": 246,
            "phrase": "strike the right note",
            "definition": "to achieve the desired effect; to do something suitable or pleasing.  Meg struck the right note when she wore a dark suit to the interview. The politician’s speech failed to strike the right note with the crowd."
        },
        {
            "id": 247,
            "phrase": "strike up a conversation",
            "definition": "to start a conversation (with someone).  I struck up an interesting conversation with someone on the bus yesterday. It’s easy to strike up a conversation with someone when you’re traveling."
        },
        {
            "id": 248,
            "phrase": "strike up a friendship",
            "definition": "to become friends (with someone).  I struck up a friendship with John while we were on a business trip together. If you’re lonely, you should go out and try to strike up a friendship with someone you like."
        },
        {
            "id": 249,
            "phrase": "strike up the band",
            "definition": "to cause a (dance) band to start playing.  Strike up the band, maestro, so we all can dance the night away."
        }
    ]
}