{
    "dictionary": [
        {
            "id": 0,
            "phrase": "spout from something",
            "definition": "[for a liquid] to gush from something. A plume of water vapor spouted from the blowhole of the whale. Water spouted from the top of the fountain and flowed down the sides."
        },
        {
            "id": 1,
            "phrase": "spout off (about someone or something)",
            "definition": "1. to brag or boast about someone or something.  Stop spouting off about Tom. Nobody could be that good! _ Alice is spouting off about her new car. 2. to speak out publicly about someone or something; to reveal information publicly about someone or something.  I wish you wouldn’t spout off about my family affairs in public.  There is no point in spouting off about this problem."
        },
        {
            "id": 2,
            "phrase": "spout something out†",
            "definition": "to exude a liquid.  The hose spouted the cooling water out all over the children.  It spouted out cooling water."
        },
        {
            "id": 3,
            "phrase": "sprain one’s ankle",
            "definition": "to become pregnant.  She has, ah, sprained her ankle.  From the looks of her, she must have sprained her ankle some months ago."
        },
        {
            "id": 4,
            "phrase": "sprawl out",
            "definition": "to spread oneself out casually while lounging. (Usually done one time, not habitually. Compare this with sprawl about.) _He sprawled out and took up most of the space.  I need more room so I can sprawl out."
        },
        {
            "id": 5,
            "phrase": "spray someone or something with something",
            "definition": "to coat someone or something with a mist or stream of liquid.  The elephant sprayed us with water.  I sprayed the fence with white paint. He sprayed himself with some of the cologne."
        },
        {
            "id": 6,
            "phrase": "spread like wildfire",
            "definition": "[for something] to spread rapidly.  Rumors spread like wildfire when people are excited. This disease will spread like wildfire when it gets going."
        },
        {
            "id": 7,
            "phrase": "spread oneself too thin",
            "definition": "to do so many things at one time that you can do none of them well. It’s a good idea to get involved in a lot of activities, but don’t spread yourself too thin.  I’m too busy these days. I’m afraid I’ve spread myself too thin."
        },
        {
            "id": 8,
            "phrase": "spread out",
            "definition": "to separate and distribute over a wide area.  The sheriff told the members of the posse to spread out and continue their search. The wine spread out and stained a large area of the carpet."
        },
        {
            "id": 9,
            "phrase": "spread over someone or something†",
            "definition": "[for something] to cover someone or something gradually.  The shade slowly spread over the picnickers.  Dusk spread its final shadows over the land."
        },
        {
            "id": 10,
            "phrase": "spread someone or something around†",
            "definition": "to distribute people or things over an area.  Spread the good singers around so they can help the others in the choir. Liz spread around the seeds so they would dry."
        },
        {
            "id": 11,
            "phrase": "spread something around†",
            "definition": "to distribute news or gossip.  Please don’t spread this around, but Don ran away from home! _ Don’t spread around that story!"
        },
        {
            "id": 12,
            "phrase": "spread something on thick",
            "definition": "to distribute a thick layer of something.  This paint will cover well if you spread it on thick.  If you spread the paint on thick, you will only need one coat. "
        },
        {
            "id": 13,
            "phrase": "spread something out†",
            "definition": "to open, unfold, or lay something over a wider area.  Spread the wet papers out so they will dry.  She spread out the papers to dry them."
        },
        {
            "id": 14,
            "phrase": "spread something over someone or something",
            "definition": "to cause something to cover or be distributed over someone or something.  The cloud spread its shadow over everyone at the picnic.  We spread fertilizer over the prepared ground.  He spread the work over a few weeks."
        },
        {
            "id": 15,
            "phrase": "spread something under someone or something",
            "definition": "to extend or unfold something, such as a tarpaulin, beneath someone or something. Please spread some newspapers under Jimmy while he is working this clay.  Would you spread some newspapers under your work, please?"
        },
        {
            "id": 16,
            "phrase": "spread something with something",
            "definition": "to cover something with a coat of something.  Using the roller, Judy spread the wall with a thick coat of pink paint.  Spread the lasagna with a layer of cheese mixture and cover that with another layer of lasagna."
        },
        {
            "id": 17,
            "phrase": "spread the word",
            "definition": "to tell many people some kind of information. I need to spread the word that the meeting is canceled for this afternoon."
        },
        {
            "id": 18,
            "phrase": "spread to someone or something",
            "definition": "to expand or extend to reach someone or something.  The epidemic finally spread to me and my family.  The business slowdown spread to the West Coast."
        },
        {
            "id": 19,
            "phrase": "spring at someone or something",
            "definition": "to jump at someone or something.  The cat sprang at me but could not sink in its claws.  The spider sprang at the moth and captured it."
        },
        {
            "id": 20,
            "phrase": "spring back (to some place)",
            "definition": "to jump, bounce, or recoil back to a place.  The cat sprang back to its original place on the top of the table.  The lid sprang back to a closed position."
        },
        {
            "id": 21,
            "phrase": "spring (forth) from someone or something",
            "definition": "to come forth from someone or something; to gush out of someone or something, as with a spring of water; to jump from or out of someone or something.  The best ideas spring forth from the mind of Mary! _ What new example of pure genius can we expect to spring from Mary today?"
        },
        {
            "id": 22,
            "phrase": "spring into action",
            "definition": "to suddenly begin moving or doing something.  As soon as the boss came in the door, everyone sprang into action.  Every morning, I jump out of bed and spring into action."
        },
        {
            "id": 23,
            "phrase": "spring out at someone",
            "definition": "to jump out at someone. A grasshopper sprang out at me when I peered into the hollow log.  I was afraid that something would spring out at me, so I opened the cellar door carefully."
        },
        {
            "id": 24,
            "phrase": "spring out of something",
            "definition": "to jump out of something. The cat sprang out of the closet when I opened the door.  The boys sprang out of the cold water as fast as they could."
        },
        {
            "id": 25,
            "phrase": "spring something on someone",
            "definition": "1. to surprise someone with something.  I hate to spring this on you at the last moment, but I will need some money to travel on.  Please don’t spring any other demands on me. 2. to pull a trick on someone.  Let me tell you about the trick I sprang on Sally.  What are you going to spring on her this time?"
        },
        {
            "id": 26,
            "phrase": "spring to attention",
            "definition": "to move quickly to assume the military posture of attention.  The recruit sprang to attention."
        },
        {
            "id": 27,
            "phrase": "spring to life",
            "definition": "to become suddenly alive or more alive. The party sprang to life after midnight. The city sprang to life at dawn."
        },
        {
            "id": 28,
            "phrase": "spring to one’s feet",
            "definition": "to stand up quickly. He sprang to his feet and demanded that the chair recognize him.  The audience sprang to its feet and cheered madly when the soprano finished."
        },
        {
            "id": 29,
            "phrase": "spring to someone’s defense",
            "definition": "to go quickly to defend someone. (Can be against physical or verbal attack.) _ Fred was attacked and Ralph sprang to his defense.  We sprang to Mary’s defense when she was accused of doing wrong."
        },
        {
            "id": 30,
            "phrase": "spring up",
            "definition": "to appear or develop suddenly; to sprout, as with a seedling.  We knew it was really spring when all the f lowers sprang up. It seems as if the tulips sprang up overnight.  The dog’s ears sprang up when the refrigerator opened."
        },
        {
            "id": 31,
            "phrase": "spring (up)on someone, something, or an animal",
            "definition": "to jump on someone, something, or an animal; to pounce on someone, something, or an animal. (Upon is formal and less commonly used than on.) _The lion sprang upon him and knocked him down. The cat sprang on the mouse and captured it."
        },
        {
            "id": 32,
            "phrase": "sprinkle someone or something with something",
            "definition": "to lightly cover someone or something with something by scattering or sprinkling.  The storm sprinkled us with a few droplets of water and then blew over. Larry sprinkled his grapefruit with powdered sugar."
        },
        {
            "id": 33,
            "phrase": "sprout up",
            "definition": "to grow upward quickly, as do newly sprouted seedlings.  The seeds sprouted up in the warm rains.  Many of the newly planted seeds failed to sprout up on time."
        },
        {
            "id": 34,
            "phrase": "sprout wings",
            "definition": "to behave so well as to resemble an angel.  The kid is not about to sprout wings, but he probably won’t get into jail again.  He was so good and helpful, I thought he would sprout wings."
        },
        {
            "id": 35,
            "phrase": "spruce someone or something up†",
            "definition": "to tidy up and groom someone or something.  Laura’s mother took a few minutes to spruce her daughter up for the party.  She spruced up her room each day."
        },
        {
            "id": 36,
            "phrase": "spur someone on†",
            "definition": "to urge someone onward; to egg someone on. (Fig. on applying spurs to a horse.) _ The crowd spurred the runners on throughout the race.  The cheering spurred on the runners."
        },
        {
            "id": 37,
            "phrase": "spurt something out†",
            "definition": "to eject something in a stream. The octopus spurted its ink out as the scuba diver approached it.  It spurted out all its ink."
        },
        {
            "id": 38,
            "phrase": "sputter out",
            "definition": "[for a flame] to go out in little puffs.  The candle f lame f lickered and sputtered out.  The fire sputtered out after midnight and we all got very cold before down."
        },
        {
            "id": 39,
            "phrase": "sputter something out†",
            "definition": "to utter something while stuttering or faltering. (As when one is physically or mentally disoriented.) _She was so excited she could hardly sputter her name out.  He could only sputter out a few words."
        },
        {
            "id": 40,
            "phrase": "spy (up)on someone or something",
            "definition": "to watch someone or something to learn secret or concealed information. (Upon is formal and less commonly used than on.) _ Are you spying upon me? _ I wasn’t spying on you! I was just trying to see who you were."
        },
        {
            "id": 41,
            "phrase": "squabble about someone or something",
            "definition": "to quarrel and disagree about someone or something.  Please stop squabbling about Jeff, or I’ll put him on my team so neither of you can have him.  There is no need to squabble about the last piece of pie. There’s more in the kitchen."
        },
        {
            "id": 42,
            "phrase": "squabble over someone or something",
            "definition": "to fight over someone or something. Please don’t squabble over me. I don’t want to be chosen by any of you! _ Stop squabbling over money and go out and get a job."
        },
        {
            "id": 43,
            "phrase": "squabble with someone",
            "definition": "to argue with someone. Please don’t squabble with your sister! _ I wish that everyone would stop squabbling with me!"
        },
        {
            "id": 44,
            "phrase": "squabble with something",
            "definition": "to argue about something.  I won’t squabble with what you said, but you are wrong.  One political party will squabble with any issue the other party brings up."
        },
        {
            "id": 45,
            "phrase": "squander something away†",
            "definition": "to waste something; to use up something valuable wastefully.  Where is all the money I gave you last month? Did you squander it all away? _ Frank squandered away all his assets."
        },
        {
            "id": 46,
            "phrase": "squander something on someone or something",
            "definition": "to waste all of something on someone or something.  I am tired of squandering money on this rickety old house.  I squandered a fortune on Roger and what did it get me?"
        },
        {
            "id": 47,
            "phrase": "square accounts (with someone)",
            "definition": "to settle one’s financial accounts with someone.  I have to square accounts with the bank this week, or it’ll take back my car. I called the bank and said I needed to come in and square accounts."
        },
        {
            "id": 48,
            "phrase": "a square deal",
            "definition": "a fair and honest transaction; fair treatment. All the workers want is a square deal, but their boss underpays them.  You always get a square deal with that travel company."
        },
        {
            "id": 49,
            "phrase": "square (meal)",
            "definition": "a good and nutritious meal. (Always with quantifier when square is used without meal.) _ I need three squares a day—at least.  The old beggar looks like he could use a square meal."
        },
        {
            "id": 50,
            "phrase": "square off (for something)",
            "definition": "to get ready for an argument or a fight.  John was angry and appeared to be squaring off for a fight.  When those two square off, everyone gets out of the way."
        },
        {
            "id": 51,
            "phrase": "a square peg in a round hole",
            "definition": "someone who is uncomfortable or who does not belong in a particular situation. (Also the cliché: trying to fit a square peg into a round hole, trying to combine two things that do not belong or fit together.) _ I feel like a square peg in a round hole at my office. Everyone else there seems so ambitious, competitive, and dedicated to the work, but I just want to make a living.  Trying to teach me math is like trying to fit a square peg into a round hole. I’m convinced my brain is not built right to understand algebra."
        },
        {
            "id": 52,
            "phrase": "square someone away†",
            "definition": "to get someone or something arranged or properly taken care of. See if you can square Bob away in his new office. When you are squared away, come back and we’ll talk."
        },
        {
            "id": 53,
            "phrase": "square something off†",
            "definition": "to make something square; to trim something until it is square. You will have to square this corner off a bit so it will match the part it will be attached to.  Please square off this corner."
        },
        {
            "id": 54,
            "phrase": "square something up†",
            "definition": "to cause something to have right angles. Please square the door frames up better before you nail them in.  Can you square up this box a little better?"
        },
        {
            "id": 55,
            "phrase": "square something with someone",
            "definition": "to make certain that something is approved by a particular person. I am sure I can square this matter with Sally.  Sam intended to square everything with Henry when he had time."
        },
        {
            "id": 56,
            "phrase": "square up (for fighting)",
            "definition": "to get ready for an argument or a fight.  John was angry and appeared to be squaring up for a fight.  When those two square up, everyone gets out of the way."
        },
        {
            "id": 57,
            "phrase": "square up to someone or something",
            "definition": "to face someone or something bravely; to tackle someone or something.  You’ll have to square up to the bully or he’ll make your life miserable.  It’s time to square up to your financial problems. You can’t just ignore them."
        },
        {
            "id": 58,
            "phrase": "square up with someone",
            "definition": "to pay someone what one owes; to pay one’s share of something to someone.  I’ll square up with you later if you pay the whole bill now.  Bob said he would square up with Tom for his share of the gas."
        },
        {
            "id": 59,
            "phrase": "square with someone",
            "definition": "to settle a disagreement with someone.  I will try to square with Fred before the end of the school year. Max refused to square with Lefty and they are still feuding."
        },
        {
            "id": 60,
            "phrase": "square with something",
            "definition": "[for a statement] to agree, match, or correspond to something. Your answer doesn’t square with mine.  The figures I have don’t square with those the government has."
        },
        {
            "id": 61,
            "phrase": "squared away",
            "definition": "arranged or properly taken care of.  Is Ann squared away in her dorm room yet? _ I will talk to you when I am squared away."
        },
        {
            "id": 62,
            "phrase": "squash someone or something up†",
            "definition": "to grind someone or something up; to mash someone or something up.  You had better stay out of the traffic, or some big truck will squash you up! _ The truck squashed up the tiny car."
        },
        {
            "id": 63,
            "phrase": "squash something down†",
            "definition": "to crush something down; to pack something down. Squash the ice cream down so the air will be pushed out.  Who squashed down my hat?"
        },
        {
            "id": 64,
            "phrase": "squash something in†",
            "definition": "to crush or make something concave by squashing or mashing.  The children squashed the Halloween jack-o’-lantern in and ruined it.  Someone squashed in the lampshade."
        },
        {
            "id": 65,
            "phrase": "squash up against someone or something",
            "definition": "to press hard up against someone or something. (Usually said of something soft.) _The egg squashed up against the window and splattered all over. The pumpkin squashed up against the side of the truck."
        },
        {
            "id": 66,
            "phrase": "squawk about something",
            "definition": "to complain about something.  Stop squawking about how much money you lost. I lost twice as much.  What are you squawking about now?"
        },
        {
            "id": 67,
            "phrase": "squeak by (someone or something)",
            "definition": "1. Fig. to manage just to squeeze past someone or something.  I squeaked by the fat man in the hallway only to find myself blocked by another. I just barely squeaked by. 2. Fig. to manage just to get past a barrier represented by a person or thing, such as a difficult teacher or an examination.  Judy just squeaked by Professor Smith, who has a reputation for f lunking students.  I took the test and just squeaked by."
        },
        {
            "id": 68,
            "phrase": "squeak something through",
            "definition": "to manage just to get something accepted or approved.  I just managed to squeak the proposal through.  Tom squeaked the application through at the last minute."
        },
        {
            "id": 69,
            "phrase": "squeak through (something)",
            "definition": "1. Fig. to manage just to squeeze through an opening.  The child squeaked through the opening and escaped. Sally squeaked through and got away. 2. Fig. to manage just to get past a barrier, such as an examination or interview. (Fig. on Q.) _Sally just barely squeaked through the interview, but she got the job.  I wasn’t too alert and I just squeaked through."
        },
        {
            "id": 70,
            "phrase": "squeal (on someone) (to someone)",
            "definition": "to report someone to someone. Max was afraid that the witness would squeal on him to the cops.  Sally threatened to squeal to the boss.  Please promise you won’t squeal on me!"
        },
        {
            "id": 71,
            "phrase": "squeal with something",
            "definition": "to shriek or squeak, exhibiting some characteristic emotion or experience, such as delight, pain, glee, etc.  The baby saw the bright picture and squealed with delight.  Timmy squealed with excitement when he saw the presents and the birthday cake."
        },
        {
            "id": 72,
            "phrase": "squeeze by (someone or something)",
            "definition": "to manage just to press oneself past someone or something.  The hall was crowded and I had to squeeze by a number of rotund gentlemen.  I squeezed by the crowd and ran on to my appointment."
        },
        {
            "id": 73,
            "phrase": "squeeze someone or something through (something)",
            "definition": "to push and compress until someone or something passes through something. John’s cellmate managed to squeeze John through the window just before the guards walked by.  I squeezed some food through the crack and the trapped miner was glad to get it."
        },
        {
            "id": 74,
            "phrase": "squeeze someone or something together",
            "definition": "to press people or things together. The driver squeezed us together so he could get more people in the taxi.  See if you can squeeze the vegetables together a little so we can get more in the basket."
        },
        {
            "id": 75,
            "phrase": "squeeze someone or something up†",
            "definition": "to press people or things close together.  The usher tried to squeeze us up so she could seat more people.  Don’t squeeze up the cars too tight in the parking area."
        },
        {
            "id": 76,
            "phrase": "squeeze something from something",
            "definition": "to press something out of something; to press on something until something comes out.  Betty squeezed some toothpaste from the tube.  Don’t squeeze so much mustard from the bottle."
        },
        {
            "id": 77,
            "phrase": "squeeze (themselves) together",
            "definition": "[for creatures] to press close together.  The little pigs squeezed themselves together to get a better chance at some food.  They squeezed together and gobbled their dinner.  They squeezed themselves together to keep warm."
        },
        {
            "id": 78,
            "phrase": "squeeze (themselves) up",
            "definition": "[for people] to press themselves closely together. Everyone squeezed themselves up in the tiny car so there would be room for one more.  Let’s squeeze up so Jamie can sit down.  They squeezed themselves up so they would take less space."
        },
        {
            "id": 79,
            "phrase": "squeeze through something",
            "definition": "to manage to press oneself through an opening.  I think I can squeeze through the window and get out of this place.  The cat squeezed through a hole in the fence and got away."
        },
        {
            "id": 80,
            "phrase": "squeeze up against someone or something",
            "definition": "to press close up against someone or something.  He squeezed up against me, trying to keep warm.  The puppies squeezed up against their mother."
        },
        {
            "id": 81,
            "phrase": "squiff out",
            "definition": "Sl. to collapse from drink. Hank squiffed out at midnight, right on the dot. She kept from squiffing out and barely made it home."
        },
        {
            "id": 82,
            "phrase": "squint at someone or something",
            "definition": "to look at someone or something with the eyes partly closed. (When squinting, the eyes are partly closed by pressing the upper and lower eyelids toward one another.) _ Why are you squinting at me? _ I had to squint at the small print in order to read it."
        },
        {
            "id": 83,
            "phrase": "squint out of something",
            "definition": "1. to cast one’s gaze from something, such as a place of concealment, with one’s eyes partly closed. The prisoner squinted out of the little hatch in the door to his cell. You could see that many people were squinting out of the windows, trying to get a good view of the movie star who was visiting. 2. to cast one’s gaze through something, such as glasses, one eye, etc., with one’s eyes partly closed.  She squinted out of one eye in the bright sun.  Tony squinted out of his glasses and his mother decided that he needed to have his eyes checked again."
        },
        {
            "id": 84,
            "phrase": "squirm in(to something)",
            "definition": "to press into something that is tight; to crawl or wiggle into something tight. (For people, this is often clothing that is too tight. For other creatures, it is more variable.) _ Dave squirmed into his jeans and pledged to himself that he would lose some weight.  He squirmed in and knew he could never close the zipper."
        },
        {
            "id": 85,
            "phrase": "squirm out (of something)",
            "definition": "to crawl or wiggle out of something.  The worm squirmed out of its hole and was gobbled up by a bird. The worm squirmed out."
        },
        {
            "id": 86,
            "phrase": "squirm with something",
            "definition": "to fidget or move around restlessly, showing irritation of some type. The children squirmed with impatience, but they kept quiet. I squirmed with discomfort, hoping that the time on the aircraft would pass rapidly."
        },
        {
            "id": 87,
            "phrase": "squirrel something away†",
            "definition": "to hide something or store something in the way that a squirrel stores nuts for use in the winter.  I squirreled a little money away for an occasion such as this. Liz squirreled away a lot of money while she was working."
        },
        {
            "id": 88,
            "phrase": "squirt from something",
            "definition": "[for a liquid] to be ejected in a spurt from something.  The water squirted from the hose.  Juice squirted from the orange when I squeezed it."
        },
        {
            "id": 89,
            "phrase": "squirt out (of someone or something)",
            "definition": "[for something, especially a liquid] to gush or spurt forth from someone or something.  In the horror movie, black stuff squirted out of this guy whenever he got angry. A lot of blood squirted out of the gash and I closed my eyes."
        },
        {
            "id": 90,
            "phrase": "squirt something at someone or something",
            "definition": "1. to direct a narrow stream of liquid onto someone or something. They squirted the water at the cat and it ran away.  Who is squirting catsup at people? 2. to direct a device for squirting liquid at someone or something.  Tom squirted the hose at the cat.  Who is squirting the firehose at the front of the house?"
        },
        {
            "id": 91,
            "phrase": "stab at someone or something",
            "definition": "to thrust at someone or something with something sharp, such as a knife.  The horrid man stabbed at me and missed.  The stork stabbed at the frog with its beak."
        },
        {
            "id": 92,
            "phrase": "stab someone in something",
            "definition": "to stab someone in a particular place.  Max stabbed a prison guard in the belly and left him to die. Tom stabbed himself in the thigh by accident."
        },
        {
            "id": 93,
            "phrase": "stab someone in the back",
            "definition": "to thrust a knife into someone’s back.  Max planned to stab his hostage in the back if he screamed.  The murderer stabbed his victim in the back and f led."
        },
        {
            "id": 94,
            "phrase": "stab something at someone or something",
            "definition": "to thrust something at someone or something.  The hunter stabbed a stick at the bear to see if there was any life at all left in it.  The stork tried to stab its beak at me as I held it, but I held tight while the vet examined it."
        },
        {
            "id": 95,
            "phrase": "stack something against someone or something",
            "definition": "to make a pile of something that leans against someone or something. Watch what you are doing! Why are you stacking the books against me? They will fall when I move.  Stack the books against the wall."
        },
        {
            "id": 96,
            "phrase": "stack something up†",
            "definition": "to make a stack of things. (Also without the up.) _Where should I stack them up? _Please stack up these boxes."
        },
        {
            "id": 97,
            "phrase": "stack up",
            "definition": "[for something] to accumulate, as in stacks.  Your work is stacking up. You will have to work late to finish it. I hate to let my work stack up. I have to do it sooner or later."
        },
        {
            "id": 98,
            "phrase": "stack up to someone or something",
            "definition": "[for someone or something] to measure up favorably when compared to someone or something.  How do you think I stack up to Liz? _ My car stacks up pretty well to yours."
        },
        {
            "id": 99,
            "phrase": "stagger around",
            "definition": "to go about tottering or wobbling, especially as if drunk.  The wounded man staggered around and then fell.  A lot of people came out of the party and staggered around."
        },
        {
            "id": 100,
            "phrase": "stagger from something",
            "definition": "to move out of a place, tottering. The drunk staggered from the tavern and fell into the gutter. The wounded man staggered from the door and called for help."
        },
        {
            "id": 101,
            "phrase": "stagger in(to some place)",
            "definition": "to walk into some place, tottering.  The old man staggered into the room and collapsed.  He staggered in and fell down."
        },
        {
            "id": 102,
            "phrase": "stagger out (of some place)",
            "definition": "to walk out of some place, tottering.  The drunk staggered out of the tavern and fell down.  She staggered out and sat on the curb."
        },
        {
            "id": 103,
            "phrase": "stagger under something",
            "definition": "to struggle or totter under a serious burden, either a heavy object or a serious problem or responsibility. The welfare budget is staggering under the burden of having to care for many people. Sam staggered under the heavy load and finally fell."
        },
        {
            "id": 104,
            "phrase": "stain something with something",
            "definition": "1. to cause a blemish or blotch on something with something. (Usually an accident.) _ Judy stained the carpet with some grape juice.  You will stain your clothing with that food if you drop any of it. 2. to affect the coloring of something through the use of a chemical stain. (A purposeful act, much the same as painting.) _ Walter stained the house with a long-lasting reddish stain.  We decided to stain the doors with a special varnish rather than paint them. 3. Fig. to injure or blemish someone’s reputation. They stained his reputation with their charges.  I don’t want to do anything that would stain my reputation."
        },
        {
            "id": 105,
            "phrase": "stake a claim to someone or something",
            "definition": "to state or record one’s claim on someone or something. (Alludes to marking off an area by pounding in wooden stakes.) _ She staked a claim to Jeff and told all her rivals to stay away.  The prospector staked a claim to the gold-rich area."
        },
        {
            "id": 106,
            "phrase": "stake one’s reputation on someone or something",
            "definition": "to risk harming one’s reputation on someone or something. Of course Denise is great. I will stake my reputation on her! _ It may be so, but I wouldn’t stake my reputation on it."
        },
        {
            "id": 107,
            "phrase": "stake someone or something out†",
            "definition": "1. to position a person so that someone or something can be observed or followed.  The cops staked the car out and made the arrest. Barlowe staked out the apartment building and watched patiently for an hour. 2. to position a person to observe someone or something.  He staked his best operative out in front of the building.  We staked out two men to keep watch."
        },
        {
            "id": 108,
            "phrase": "stake someone to something",
            "definition": "to make a loan of something to someone.  I will stake you to a hundred bucks if that will help.  Jed refused to stake Tex to a loan."
        },
        {
            "id": 109,
            "phrase": "stake something off†",
            "definition": "to mark out the boundaries of an area of land with stakes.  The prospectors staked an area off for themselves.  The prospectors staked off an area in which they would look for gold."
        },
        {
            "id": 110,
            "phrase": "stalk in(to some place)",
            "definition": "to stride into a place, perhaps indignantly.  Carl stalked into the manager’s office and began his tirade.  He stalked in and began to complain."
        },
        {
            "id": 111,
            "phrase": "stalk out of some place",
            "definition": "to stride out of a place indignantly. Jeff stalked out of the store and went straight to the police.  Mary got angry and stalked out of the meeting."
        },
        {
            "id": 112,
            "phrase": "stall for time",
            "definition": "to cause a delay intentionally. You are just stalling for time. Please hurry.  She is stalling for time, hoping someone will rescue her."
        },
        {
            "id": 113,
            "phrase": "stall someone or something for something",
            "definition": "to delay someone or something for a period of time.  I stalled him for as long as I could.  I could not stall the proceedings for another second."
        },
        {
            "id": 114,
            "phrase": "stall someone or something off†",
            "definition": "to put off or delay someone or something. The sheriff is at the door. I’ll stall him off while you get out the back door.  You can stall off the sheriff, but you can’t stall off justice."
        },
        {
            "id": 115,
            "phrase": "stammer something out†",
            "definition": "to manage to say something, but only haltingly.  Fred stammered the words out haltingly.  He stammered out the name of the winner."
        },
        {
            "id": 116,
            "phrase": "stamp a fire out†",
            "definition": "to extinguish a fire by stamping on it.  Quick, stamp that fire out before it spreads.  Tom stamped out the sparks before they started a fire."
        },
        {
            "id": 117,
            "phrase": "stamp on someone or something",
            "definition": "to strike down hard on someone or something with the bottom of the foot. The attacker stamped on his victim after he had knocked him down.  Walter stamped on a spider."
        },
        {
            "id": 118,
            "phrase": "stamp someone or something as something",
            "definition": "to label someone or something as something; to mark someone or something as something.  His manner stamped him as a fool.  The committee stamped the proposal as wasteful."
        },
        {
            "id": 119,
            "phrase": "stamp someone or something with something",
            "definition": "to affix a label onto someone or something with something; to apply a particular message or symbol onto someone or something, as with a rubber stamp. Judy stamped everyone who went into the dance with a symbol that showed that each had paid admission. Mary stamped the bill with the PAID symbol."
        },
        {
            "id": 120,
            "phrase": "stamp someone out†",
            "definition": "Sl. to get rid of or kill someone. (Fig. on stamp something out.) _You just can’t stamp somebody out on your own! _ The victim wanted to stamp out the robbers without a trial."
        },
        {
            "id": 121,
            "phrase": "stamp something onto something",
            "definition": "to affix an informative label onto something, as with a rubber stamp.  She stamped her name and address onto all her books.  Tom stamped his identification onto all his papers and books."
        },
        {
            "id": 122,
            "phrase": "stamp something out†",
            "definition": "to eliminate something.  The doctors hope they can stamp cancer out.  Many people think that they can stamp out evil."
        },
        {
            "id": 123,
            "phrase": "stamp something (up)on someone or something",
            "definition": "to affix an informative label onto someone or something, as with a rubber stamp. (Upon is formal and less commonly used than on.) _ The attendant stamped a date upon each person who entered the dance hall.  The person at the door stamped something on my hand when I came in."
        },
        {
            "id": 124,
            "phrase": "stampede in(to some place)",
            "definition": "[for a crowd of people or other creatures] to move rapidly into a place, as if in panic.  The shoppers stampeded into the store the minute the doors opened.  The doors opened and the shoppers stampeded in."
        },
        {
            "id": 125,
            "phrase": "stampede out of some place",
            "definition": "[for a crowd of people or other creatures] to move rapidly out of a place, as if in panic.  The patrons stampeded out of the smoky theater.  The cattle stampeded out of the corral."
        },
        {
            "id": 126,
            "phrase": "stampede someone or something into something",
            "definition": "to cause people or other creatures to move rapidly into a place, in panic or as if in panic.  The loud noises stampeded the crowd into the parking lot across from the stadium.  The cowboys stampeded the cattle into the corral."
        },
        {
            "id": 127,
            "phrase": "stand a chance (of doing something)",
            "definition": "to have a chance of doing something. Do you think I stand a chance of winning first place? _Everyone stands a chance of catching the disease."
        },
        {
            "id": 128,
            "phrase": "stand and deliver",
            "definition": "to give up something to someone who demands it. (Originally used by highway robbers asking for passengers’ valuables.) _ And when the tax agent says “Stand and deliver” you have to be prepared to pay what is demanded. The robber stopped the coach and demanded of Lady Ellen, “Stand and deliver!”"
        },
        {
            "id": 129,
            "phrase": "stand apart (from someone or something)",
            "definition": "to stand, separated from someone or something.  Please stand apart from the person next to you. We want to see the table between you. Stand apart. Leave some space between you."
        },
        {
            "id": 130,
            "phrase": "stand around",
            "definition": "to wait around, standing; to loiter. Please don’t stand around. Get busy! _ Why are all these people standing around doing nothing?"
        },
        {
            "id": 131,
            "phrase": "stand aside",
            "definition": "to step aside; to get out of the way.  Please stand aside while the bridal party passes by.  The guests stood aside while the bride and groom left."
        },
        {
            "id": 132,
            "phrase": "stand at something",
            "definition": "1. to stand in front of something; to stand in the vicinity of something.  I stood at the window, watching the traffic.  Tom stood at the door, counting people as they came in. 2. to stand or remain in a particular state, such as attention or readiness.  The troops stood at attention for a very long time.  The entire platoon is standing at readiness, awaiting further orders."
        },
        {
            "id": 133,
            "phrase": "stand back (from someone or something)",
            "definition": "to stand or move well away and to the rear of someone or something.  Stand back from Sam. He is really angry.  Would you please stand back from the edge?"
        },
        {
            "id": 134,
            "phrase": "stand between someone or something and someone or something else",
            "definition": "to position oneself between things and people, so as to act as a barrier. I don’t want to stand between you and your family.  We won’t stand between you and your goals."
        },
        {
            "id": 135,
            "phrase": "stand by",
            "definition": "to wait and remain ready. (Generally heard in communication, such as broadcasting, telephones, etc.) _ Your transatlantic telephone call is almost ready. Please stand by.  Is everyone ready for the telecast? Only ten seconds— stand by."
        },
        {
            "id": 136,
            "phrase": "stand by someone",
            "definition": "to support someone; to continue supporting someone even when things are bad.  Don’t worry. I’ll stand by you no matter what.  I feel as though I have to stand by my brother even if he goes to jail."
        },
        {
            "id": 137,
            "phrase": "stand by someone or something",
            "definition": "to stand next to someone or something.  Jeff, please stand by Judy. I want to take your picture.  Can I stand by the window and watch the birds?"
        },
        {
            "id": 138,
            "phrase": "stand corrected",
            "definition": "to admit that one has been wrong.  I realize that I accused him wrongly. I stand corrected.  We appreciate now that our conclusions were wrong. We stand corrected."
        },
        {
            "id": 139,
            "phrase": "stand down",
            "definition": "1. to step down, particularly from the witness stand in a courtroom.  The bailiff told the witness to stand down.  Please stand down and take your seat. 2. [for military forces] to move away from readiness for war.  After the peace treaty was signed, troops on both sides stood down."
        },
        {
            "id": 140,
            "phrase": "stand for something",
            "definition": "1. to permit something; to endure something.  The teacher won’t stand for any whispering in class. We just can’t stand for that kind of behavior. 2. to signify something. In a traffic signal, the red light stands for “stop.” _The abbreviation Dr. stands for “doctor.” 3. to endorse or support an ideal.  The mayor claims to stand for honesty in government and jobs for everyone.  Every candidate for public office stands for all the good things in life."
        },
        {
            "id": 141,
            "phrase": "stand head and shoulders above someone or something",
            "definition": "[for someone or something] to be considerably superior to someone or something.  Alice stands head and shoulders above all the rest of the people we interviewed.  Your proposal stands head and shoulders above the rest."
        },
        {
            "id": 142,
            "phrase": "stand in awe (of someone or something)",
            "definition": "to be overwhelmed with respect for someone or something. Many people stand in awe of the president.  Bob says he stands in awe of a big juicy steak. I think he’s exaggerating."
        },
        {
            "id": 143,
            "phrase": "stand in (for someone)",
            "definition": "to substitute for someone; to serve in someone’s place. The famous opera singer was ill, and an inexperienced singer had to stand in for her.  The new singer was grateful for the opportunity to stand in."
        },
        {
            "id": 144,
            "phrase": "stand off from someone or something",
            "definition": "to be or remain at some distance from someone or something.  Charles stood off from the group.  Mary stood off from the fireside, where all the excitement was taking place."
        },
        {
            "id": 145,
            "phrase": "stand off some place",
            "definition": "[for a ship] to wait some distance from a point on shore.  The ship stood off at some distance, waiting for its berth. We stood off about a mile from shore and went to land in small boats called tenders."
        },
        {
            "id": 146,
            "phrase": "stand on ceremony",
            "definition": "to hold rigidly to protocol or formal manners. (Often in the negative.) _Please help yourself to more. Don’t stand on ceremony. We are very informal around here. Hardly anyone stands on ceremony."
        },
        {
            "id": 147,
            "phrase": "stand on one’s dignity",
            "definition": "to remain dignified in spite of difficulties.  I will stand on my dignity to the very end.  She stood on her dignity and ignored all the nonsense going on around her."
        },
        {
            "id": 148,
            "phrase": "stand on one’s head",
            "definition": "to stand or balance vertically with one’s head and hands—rather than one’s feet— touching the floor. Can you stand on your head? _Todd stood on his head as a form of exercise."
        },
        {
            "id": 149,
            "phrase": "stand on one’s (own) two feet",
            "definition": "to act in an independent and forthright manner.  I can stand on my own two feet without any help from you! _ Dave will be better off when he gets a job and can stand on his own feet."
        },
        {
            "id": 150,
            "phrase": "stand on something",
            "definition": "1. to step or tread on something, perhaps by accident. I didn’t mean to stand on the cat’s tail.  Please don’t stand on the nice carpet with muddy shoes. 2. to elevate oneself by standing on something, such as a chair or stool.  Tony stood on a stool so he could reach the cookie jar.  Don’t stand on that box. It won’t hold you and it’s not tall enough."
        },
        {
            "id": 151,
            "phrase": "stand out (against someone or something)",
            "definition": "to be prominent or conspicuous against a background of someone or something.  Your red coat really stands out against all those dull brown ones.  With that deep tan, you really stand out against the others."
        },
        {
            "id": 152,
            "phrase": "stand out (from someone or something)",
            "definition": "to be prominent when compared to someone or something.  As a programmer, she stands out from all the others.  This entry stands out from all the rest in this show."
        },
        {
            "id": 153,
            "phrase": "stand out (from something)",
            "definition": "to protrude from something. One very straight branch in particular stood out from the tree and looked suitable for a post.  The branch stood out and made a perfect place to hang my shirt while I worked."
        },
        {
            "id": 154,
            "phrase": "stand outside ((of ) something)",
            "definition": "to remain outside of a place, standing. (Of is usually retained before pronouns.) _Judy stood outside the shop, waiting for it to open. How long have you been standing outside the door in this cold wind?"
        },
        {
            "id": 155,
            "phrase": "stand over someone or something",
            "definition": "to hover over someone or something; to monitor or keep close watch on someone or something.  Please don’t stand over me while I work! _ Dave stood over the machine, making sure it did what it was supposed to do."
        },
        {
            "id": 156,
            "phrase": "stand pat (on something)",
            "definition": "to stick firmly to one’s position or opinions.  I am going to stand pat on this issue.  I thought you would stand pat in the absence of new information."
        },
        {
            "id": 157,
            "phrase": "stand someone in good stead",
            "definition": "[for something] to be of great use and benefit to someone.  I know that my large vocabulary will always stand me in good stead at college.  Any experience you can get in dealing with the public will stand you in good stead no matter what line of work you go into."
        },
        {
            "id": 158,
            "phrase": "stand someone or something off",
            "definition": "to repel the attack of someone or something; to defend against someone or something; to stave someone or something off.  It was all we could do to stand them off.  The soldiers stood off the attackers as long as they could."
        },
        {
            "id": 159,
            "phrase": "stand someone to a treat",
            "definition": "to pay for a treat for someone. Come on. Let’s go out and eat. I’ll stand you to a treat.  It seems as if I am always standing someone to a treat."
        },
        {
            "id": 160,
            "phrase": "stand someone up†",
            "definition": "1. to place someone into a standing position. I tried to stand him up, but he was just too tired. Let’s try to stand up Timmy and get him awake. 2. to fail to show up for a meeting or a date. He stood her up once too often, so she broke up with him.  Tom stood up Mary once, and she never forgave him."
        },
        {
            "id": 161,
            "phrase": "stand something on its head",
            "definition": "to stir up, baffle, or surprise a group or organization. The new owners came into the company and stood it on its head. Nothing will ever be the same. The mayor set out to stand the town on its head, but after one month, it was business as usual."
        },
        {
            "id": 162,
            "phrase": "stand tall",
            "definition": "to be brave and proud.  I can still stand tall. I’m innocent.  Our athletes stand tall in the knowledge that they did their best."
        },
        {
            "id": 163,
            "phrase": "stand the test of time",
            "definition": "Prov. to be well regarded; to last for a long time. Bill and Nancy just celebrated their fiftieth wedding anniversary. Their marriage has stood the test of time. The singer’s work was not popular while she was alive, but it has stood the test of time."
        },
        {
            "id": 164,
            "phrase": "stand there with one’s bare face hanging out",
            "definition": "Rur. to stand some place looking helpless and stupid.  Say something. Don’t just stand there with your bare face hanging out.  She just stood there with her bare face hanging out while they took away everything she owned."
        },
        {
            "id": 165,
            "phrase": "stand to lose something",
            "definition": "to be likely to lose something or have it taken away.  I stand to lose hundreds of dollars if I am not there on time."
        },
        {
            "id": 166,
            "phrase": "stand to reason",
            "definition": "to seem reasonable.  It stands to reason that it’ll be colder in January than it is in November.  It stands to reason that Bill left in a hurry, although no one saw him go."
        },
        {
            "id": 167,
            "phrase": "stand together",
            "definition": "1. to stand in a group.  All the members of the family stood together for a photograph. Please stand together so I can count you. 2. to remain united.  We must stand together if we want to defeat this enemy.  If we don’t stand together, we will be defeated one by one."
        },
        {
            "id": 168,
            "phrase": "stand trial",
            "definition": "to be the accused person in a trial before a judge; to be on trial.  He had to stand trial for perjury and obstruction of justice."
        },
        {
            "id": 169,
            "phrase": "stand up",
            "definition": "1. to arise from a sitting or reclining position. He stood up and looked across the valley. She had been sitting for so long that it was a pleasure to stand up. 2. to be in a standing position.  I’ve been standing up all day and I’m exhausted.  I stood up throughout the whole trip because there were no more seats on the train. 3. to wear well; to remain sound and intact.  This material just doesn’t stand up well when it’s washed.  Her work doesn’t stand up under close scrutiny. 4. [for an assertion] to remain believable.  His testimony will not stand up in court. When the police checked the story, it did not stand up."
        },
        {
            "id": 170,
            "phrase": "stand up against someone or something",
            "definition": "to withstand or hold one’s own against someone or something.  He’s good, but he can’t stand up against Jill.  Can this tent stand up against the wind?"
        },
        {
            "id": 171,
            "phrase": "stand up and be counted",
            "definition": "to state one’s support (for someone or something).  If you believe in more government help for farmers, write your representative—stand up and be counted.  I’m generally in favor of what you propose, but not enough to stand up and be counted."
        },
        {
            "id": 172,
            "phrase": "stand up for someone or something",
            "definition": "to take the side of someone or something; to defend someone or something.  I hope you will stand up for me if the going gets rough.  We will have to stand up for our rights someday."
        },
        {
            "id": 173,
            "phrase": "stand up in court",
            "definition": "[for a case] to survive a test in a court of law. Do you think that this case will stand up in court? _ These charges will never stand up in court. They are too vague."
        },
        {
            "id": 174,
            "phrase": "stand up to someone or something",
            "definition": "to take a stand against someone or something; to hold one’s ground or principles in the face of a challenge by someone or something.  He is a tough customer, and you have to learn to stand up to him.  Can the witness stand up to questioning by the prosecution?"
        },
        {
            "id": 175,
            "phrase": "stand up with someone",
            "definition": "to attend someone who is being married. (Usually refers to males.) _ I agreed to stand up with my buddy at his wedding. Tom stood up with Harry when the latter got married."
        },
        {
            "id": 176,
            "phrase": "stand (up)on someone or something",
            "definition": "to be on someone or something, standing. (Upon is formal and less commonly used than on.) _ To help his back pain, he lay down on his tummy and Jill stood upon him, digging her toes into his back.  Please don’t stand on the bed."
        },
        {
            "id": 177,
            "phrase": "stand well with someone",
            "definition": "to be acceptable or agreeable to someone.  That idea doesn’t stand well with the management.  I hope my suggestions stand well with you."
        },
        {
            "id": 178,
            "phrase": "stand with someone",
            "definition": "to unite with someone, as in defense.  Don’t worry. I’ll stand with you to the end.  He stood with her and they faced the threat together."
        },
        {
            "id": 179,
            "phrase": "a standing joke",
            "definition": "a subject that regularly and over a period of time causes amusement whenever it is mentioned.  Uncle Jim’s driving was a standing joke. He used to drive incredibly slowly. Their mother’s inability to make a decision was a standing joke in the Smith family all their lives."
        },
        {
            "id": 180,
            "phrase": "star as someone or something",
            "definition": "[for someone] to be a featured performer, representing a particular person, or play in a particular role.  Judy starred as Evita in the broadway production of the same name.  Mary starred as an aging countess."
        },
        {
            "id": 181,
            "phrase": "star in something",
            "definition": "to be a featured actor in a play, movie, opera, etc.  Roger starred in an off-Broadway play last season.  Mary always wanted to star in her own movie, but it was not to be."
        },
        {
            "id": 182,
            "phrase": "star-crossed lovers",
            "definition": "ill-fated lovers.  I suppose that Romeo and Juilet are star-crossed lovers."
        },
        {
            "id": 183,
            "phrase": "stare at someone or something",
            "definition": "to look fixedly at someone or something.  Why are you staring at me? _ I was staring at the scenery behind you."
        },
        {
            "id": 184,
            "phrase": "stare into something",
            "definition": "to gaze fixedly into something. She just sat there, staring into space.  Tom stared into the water, hoping to see a fish or maybe a turtle."
        },
        {
            "id": 185,
            "phrase": "stare out at someone or something",
            "definition": "1. to be in a place staring outward at someone or something.  I stayed in my little room and stared out at the others having fun in the crisp fall air.  We stared out at the deep snow. 2. [for a face or eyes visible in a place] to be seen staring outward from that place.  Two bright little cat eyes stared out at me from the basket. Her faced stared out of the tiny window."
        },
        {
            "id": 186,
            "phrase": "stare someone down†",
            "definition": "to pressure someone to capitulate, back down, or yield by staring.  Don’t try to stare me down. I have nerves of steel.  I tried to stare down my opponent, but it didn’t work."
        },
        {
            "id": 187,
            "phrase": "stare someone in the face",
            "definition": " [for evidence] to confront someone directly. (Fig. on stare someone in the face; look someone in the face.) _Finally, the truth stared me in the face, and I had to admit to myself what had really happened.  When the facts in the case stared the jury in the face, there was nothing they could do but acquit."
        },
        {
            "id": 188,
            "phrase": "stark raving mad",
            "definition": "Cliché totally insane; completely crazy; out of control. (Often an exaggeration.) _When she heard about what happened at the office, she went stark raving mad.  You must be start raving mad if you think I would trust you with my car!"
        },
        {
            "id": 189,
            "phrase": "*stars in one’s eyes",
            "definition": "an obsession with celebrities, movies, and the theater. (Alludes to movie stars. *Typically: get ~; have ~; give one ~.) _Many young people have stars in their eyes at this age.  Anne has stars in her eyes. She wants to go to Hollywood."
        },
        {
            "id": 190,
            "phrase": "start as something",
            "definition": "to begin in some original condition or status.  Every forest fire starts as a small spark.  The argument started as a small disagreement."
        },
        {
            "id": 191,
            "phrase": "start back (to some place)",
            "definition": "to begin the journey back to a place.  When do we start back to Chicago? _ It’s time to start back."
        },
        {
            "id": 192,
            "phrase": "start for some place",
            "definition": "to begin a journey to some place.  When shall we start for Springfield? _ We will start for Detroit before dawn."
        },
        {
            "id": 193,
            "phrase": "start from scratch",
            "definition": "to start from the very beginning; to start from nothing. Whenever I bake a cake, I start from scratch. I never use a cake mix in a box.  I built every bit of my own house. I started from scratch and did everything with my own hands."
        },
        {
            "id": 194,
            "phrase": "start from some place",
            "definition": "1. [for someone] to begin a journey at some place. (The emphasis is on the location of the start of the journey.) _ We started from California.  Where will you start from? 2. [for a journey] to begin from a particular point. The journey started from Chicago.  Our trip started from the airport in New York."
        },
        {
            "id": 195,
            "phrase": "start in on someone or something",
            "definition": "to begin dealing with, discussing, or chastising someone or something.  Please don’t start in on me again! You said enough the previous three times.  When will you be ready to start in on painting the house?"
        },
        {
            "id": 196,
            "phrase": "start off",
            "definition": "to begin; to set out on a journey.  When do you want to start off ? _ We will start off as soon as we can get everything packed."
        },
        {
            "id": 197,
            "phrase": "start off as someone or something",
            "definition": "to begin in a particular status, character, rank, etc.  I started off as a waiter and ended up as the owner of the restaurant. This tree started off as a tiny seedling only a few years ago."
        },
        {
            "id": 198,
            "phrase": "start off (by doing something)",
            "definition": "to begin a process by doing a particular thing first.  Can I start off by singing the school song? _ That’s a good way to start off."
        },
        {
            "id": 199,
            "phrase": "start off from some place",
            "definition": "to begin a journey from some place. (The emphasis is on the inception of the journey.) _ We will start off from Detroit and drive to Chicago.  He started off from work rather than home."
        },
        {
            "id": 200,
            "phrase": "start off (on something)",
            "definition": "1. to begin a series or sequence. Today I start off on the first volume of my trilogy. I am ready to start off now. 2. to begin a journey.  When do we start off on our trip? _I’m ready to start off. What about you?"
        },
        {
            "id": 201,
            "phrase": "start (off) with a bang",
            "definition": "to begin with considerable excitement. The program started off with a bang and the whole show was great.  The day started off with a bang and kept going that way."
        },
        {
            "id": 202,
            "phrase": "start (off) with someone or something",
            "definition": "to begin a task or a process with someone or something. I will start off with one volunteer and then add others as we go along.  I will start off with one hot dog and get another later if I want it."
        },
        {
            "id": 203,
            "phrase": "start on someone or something",
            "definition": "1. to begin dealing with someone or something.  We have finished talking about Gary, and now we will start on Bob.  We will start on dessert after you have finished your broccoli. 2. to begin to castigate someone or something _ Don’t start on me! I didn’t do anything wrong! _ The politician started on the opposing party, and everyone in the audience cheered."
        },
        {
            "id": 204,
            "phrase": "start out",
            "definition": "to begin. Whenever you are ready, we will start out.  We can’t start out until Tom is here."
        },
        {
            "id": 205,
            "phrase": "start out as something",
            "definition": "to begin one’s career as something. I started out as a clerk and two years later I’m still a clerk! _ I wanted to start out as an assistant manager."
        },
        {
            "id": 206,
            "phrase": "start out (on something)",
            "definition": "to begin something, such as a trip, a career, an investigation, etc. When we started out on this investigation, I never dreamed we would uncover so much.  What time did you start out this morning?"
        },
        {
            "id": 207,
            "phrase": "start out with someone or something",
            "definition": "to begin something in association with someone or something. I started out the project with Jeff, but he had to be replaced. We started out with the Acme Corp., but they could not handle all our work."
        },
        {
            "id": 208,
            "phrase": "start over",
            "definition": "to begin again. I have messed this up so much that there is nothing to do now but start over.  When you start over, try to do it right this time."
        },
        {
            "id": 209,
            "phrase": "start someone off† (on something)",
            "definition": "to cause someone to begin on a task or job. I have to start Jeff off on this task, then I will talk to you.  I will start off my workers on the job tomorrow."
        },
        {
            "id": 210,
            "phrase": "start someone out at an amount of money",
            "definition": "to start someone working at a particular salary.  We will start you out at $30,000.  I wanted to be started out at $35,000."
        },
        {
            "id": 211,
            "phrase": "start someone over",
            "definition": "to cause someone to begin again; to lead someone to begin again.  The orchestra messed up the first few bars, so the conductor started them over again.  I hope the conductor doesn’t start us over again. This is getting boring to play."
        },
        {
            "id": 212,
            "phrase": "start someone up† (in something)",
            "definition": "to help someone get a start in some enterprise. My uncle started me up in business.  I started up my niece in the candy business."
        },
        {
            "id": 213,
            "phrase": "start something up†",
            "definition": "to start something, such as a car or some procedure. (Also without up.) _ It was cold, but I managed to start up the car without any difficulty.  We can’t start the project up until we have more money."
        },
        {
            "id": 214,
            "phrase": "start something up† with something",
            "definition": "to use something in the process of starting something else.  Do you have to start this old car up with a crank? _ Do you start up this car with a crank?"
        },
        {
            "id": 215,
            "phrase": "start up",
            "definition": "to begin; to begin running, as with an engine.  The car started up without a problem. The engines of the plane started up one by one."
        },
        {
            "id": 216,
            "phrase": "start up with someone or something",
            "definition": "to begin by using someone or something. We will start up with two clerks and add more as we grow.  We started up with one old cash register, and now we have six."
        },
        {
            "id": 217,
            "phrase": "startle someone out of something",
            "definition": "to frighten someone very badly. (The something that may be lost may be expressed as wits, senses, ten years’ growth, etc.) _The explosion star- tled Polly out of her senses.  I frightened myself out of ten years’ growth."
        },
        {
            "id": 218,
            "phrase": "starve for some food",
            "definition": "to be very hungry for something.  I am just starved for some fresh peaches. We were starved for dinner by the time we finally got to eat."
        },
        {
            "id": 219,
            "phrase": "starve for someone or something",
            "definition": "to have a strong desire or need for someone or something. (Based on starved for some food.) _ I am starved for Jane. I miss her so! _ Claire was starved for affection."
        },
        {
            "id": 220,
            "phrase": "starve someone or an animal into something",
            "definition": "to force someone or an animal to do something by starvation.  The torturers finally starved the prisoner into telling the battle plans. They starved the water buffalo into a state of weakness."
        },
        {
            "id": 221,
            "phrase": "stash something away†",
            "definition": "to hide something; to set something aside for use at a later time. Please stash this away somewhere. You may need it someday.  You should stash away some money for later."
        },
        {
            "id": 222,
            "phrase": "stash something in something",
            "definition": "to put or shove something into something; to store or hide something in something.  You should stash your food in a place that is safe from bears when you go camping.  I stashed my clothes in my suitcase and called a taxi."
        },
        {
            "id": 223,
            "phrase": "state of mind",
            "definition": "basic attitude or outlook at a point in time.  She was in a terrible state of mind when she was interviewed for a job."
        },
        {
            "id": 224,
            "phrase": "state of the art",
            "definition": "using the most recent technology. (Hyphenated before nouns.) _ Our company’s computer setup is strictly state of the art. This state-of-the-art radio is capable of filling the whole room with sound."
        },
        {
            "id": 225,
            "phrase": "station someone at something",
            "definition": "to position or place someone near something.  The manager stationed a receptionist at the door. Would you station a guard at the back door to keep people out?"
        },
        {
            "id": 226,
            "phrase": "stave someone or something off†",
            "definition": "to hold someone or something off; to defend against the attack of someone or something.  The citizen was not able to stave the mugger off. The army staved off the attackers for three hours without letup."
        },
        {
            "id": 227,
            "phrase": "stave something in†",
            "definition": "to crush something in. (The past tense is usually stove with ships, and otherwise, staved.) _ The rocks on the reef staved the hull of the ship in.  The angry sailor staved in the cask of rum."
        },
        {
            "id": 228,
            "phrase": "stave something off†",
            "definition": "to delay or postpone something unwanted, such as hunger, foreclosure, death, etc.  He could stave his thirst off no longer. Despite the enemy sentries, he made a dash for the stream. The lost hiker could not stave off her hunger any longer."
        },
        {
            "id": 229,
            "phrase": "stay after (someone or something)",
            "definition": "to remain behind later than someone or something.  I will stay after the others and clean up.  I would be happy to stay after school."
        },
        {
            "id": 230,
            "phrase": "stay at some place",
            "definition": "1. to remain at a place. Have you ever tried to make a cat stay at one place? _ Please stay at home until I call you. 2. to live at a place temporarily.  I am staying at the Statler Hotel.  At what hotel are you staying while you are in town?"
        },
        {
            "id": 231,
            "phrase": "stay at something",
            "definition": "to keep working at something.  You should stay at something until you finish it.  She couldn’t seem to stay at her place of work for a whole day."
        },
        {
            "id": 232,
            "phrase": "stay back (from something)",
            "definition": "to keep one’s distance from someone or something. Stay back from the lawn mower! _ This is dangerous. Stay back!"
        },
        {
            "id": 233,
            "phrase": "stay behind",
            "definition": "[for someone] to remain in a place when others have left.  I will stay behind and tell the late arrivers where you have gone. Fred always stayed behind to clean up."
        },
        {
            "id": 234,
            "phrase": "stay by someone or something",
            "definition": "to remain close to someone or something. Please stay by me until we get through this crowd of rough-looking people. Stay by the wall and move along slowly."
        },
        {
            "id": 235,
            "phrase": "stay clear of someone or something",
            "definition": "to keep one’s distance from something, usually something dangerous.  Please stay clear of me. I have the f lu. Stay clear of that machine. It is dangerous."
        },
        {
            "id": 236,
            "phrase": "stay down",
            "definition": "to remain in a prone, squatting, or sitting position. Stay down until the danger is over. Stay down so they won’t see you."
        },
        {
            "id": 237,
            "phrase": "stay for something",
            "definition": "to remain in a place to participate in something.  Would you please stay for dinner? _ I am sorry, but we cannot stay for dinner."
        },
        {
            "id": 238,
            "phrase": "stay in (something)",
            "definition": "to remain inside a place or thing; to stay indoors.  Please stay in the house. It’s too cold to go outside.  You should stay in when it’s this cold."
        },
        {
            "id": 239,
            "phrase": "stay off (something)",
            "definition": "to keep off of something.  Please stay off my lawn! _ Stay off!"
        },
        {
            "id": 240,
            "phrase": "stay on (some place)",
            "definition": "to remain at a place longer than had been planned.  I stayed on in Paris for nearly two years.  Mary liked it there and decided to stay on."
        },
        {
            "id": 241,
            "phrase": "stay on something",
            "definition": "1. to remain on something, such as a horse, road, stool, etc.  The first time I rode, I could hardly stay on the horse. It was so slippery that I had trouble staying on the road. 2. to continue to pursue something. I will stay on this problem until it is settled. She stayed on the matter for weeks until it had been dealt with."
        },
        {
            "id": 242,
            "phrase": "stay on top of someone or something",
            "definition": "to remain positioned on the top of someone or something. Please stay on top of the hill until we call you.  The wind is blowing and this sheet of plastic will not stay on top of me, so I am getting soaked!"
        },
        {
            "id": 243,
            "phrase": "stay out (of something)",
            "definition": "to keep out of something or some place.  Stay out of here! _ Please stay out until we are ready."
        },
        {
            "id": 244,
            "phrase": "stay over (somewhere)",
            "definition": "to stay overnight in a dwelling other than one’s own.  Can I stay over at Jimmy’s tonight? _ No, you can’t stay over."
        },
        {
            "id": 245,
            "phrase": "stay put",
            "definition": "not to move; to stay where one is. We’ve decided to stay put and not to move to Florida. If the children just stay put, their parents will come for them soon."
        },
        {
            "id": 246,
            "phrase": "stay to something",
            "definition": "to remain in a place for something, such as dinner.  I hope you will stay to dinner.  I stayed to lunch because they were having fried shrimp."
        },
        {
            "id": 247,
            "phrase": "stay under (something)",
            "definition": "to remain concealed or protected beneath something. You had better stay under the blankets until I get the fire started in the fireplace. Stay under and keep warm."
        },
        {
            "id": 248,
            "phrase": "stay up (for something)",
            "definition": "to remain awake and out of bed for some nighttime event.  I will stay up for her arrival.  I can’t stay up that late."
        },
        {
            "id": 249,
            "phrase": "stay up late",
            "definition": "to remain awake and out of bed later than usual.  I am in the practice of staying up late.  I can’t stay up late three nights in a row."
        }
    ]
}