{
    "dictionary": [
        {
            "id": 0,
            "phrase": "fat and sassy",
            "definition": "in good health and spirits. She came back from her vacation all fat and sassy. Under Joe’s care, the runt of the litter grew up fat and sassy."
        },
        {
            "id": 1,
            "phrase": "*fat as a pig",
            "definition": "exceptionally fat; grotesquely fat. (*Also: as ~.) _ If I don’t stop eating this cake, I’ll be fat as a pig! _ You really ought to go on a diet; you’re as fat as a pig."
        },
        {
            "id": 2,
            "phrase": "fat cat",
            "definition": "someone who is ostentatiously and smugly wealthy.  I like to watch the fat cats go by in their BMWs.  I’m no fat cat. I can’t even pay my normal bills!"
        },
        {
            "id": 3,
            "phrase": "fat chance",
            "definition": "very little likelihood.  Fat chance he has of getting a promotion.  You think she’ll lend you the money? Fat chance!"
        },
        {
            "id": 4,
            "phrase": "*the fat hit the fire",
            "definition": "a situation that suddenly becomes frantic and unpleasant. (*Typically: suddenly ~; then ~; when ~.) _ Things were looking bad in the stock market, then the fat hit the fire and I lost everything."
        },
        {
            "id": 5,
            "phrase": "The fat is in the fire.",
            "definition": "Prov. Matters have come to a crisis; trouble is about to start.  Brother: Mom found out that we broke the clock. Sister: Uh-oh. The fat’s in the fire now.  The fat is in the fire at work; we’re nowhere near finishing the project, but the deadline is in two days."
        },
        {
            "id": 6,
            "phrase": "a fate worse than death",
            "definition": "a terrible fate. (Usually an exaggeration.) _ Having to sit through one of his lectures is a fate worse than death."
        },
        {
            "id": 7,
            "phrase": "father something on someone",
            "definition": "to regard someone as the author or originator of something.  Do not attempt to father that stupid idea on me! _We fathered the whole plan on the president. And we learned later she had nothing to do with it."
        },
        {
            "id": 8,
            "phrase": "fatten someone or an animal up† (with something)",
            "definition": "to use something to make someone or an animal fat.  We will fatten the calf up with corn.  I don’t know why they keep fattening up their children with so much food."
        },
        {
            "id": 9,
            "phrase": "fatten up (on something)",
            "definition": "to get fat by eating something.  The cattle fattened up on the succulent grass.  The bears have to fatten up on food before they hibernate for the winter."
        },
        {
            "id": 10,
            "phrase": "fault someone (for something)",
            "definition": "to blame or criticize someone for something. I can’t fault you for that. I would have done the same thing.  He tended to fault himself for the failure of the project."
        },
        {
            "id": 11,
            "phrase": "faunch around",
            "definition": "Rur. to fuss and complain. Stop faunching around about your problems and go to sleep.  Aunt Bess is always faunching around about something."
        },
        {
            "id": 12,
            "phrase": "favor someone or something with something",
            "definition": "to provide someone or something with something beneficial or special. Mary favored us with a song.  Nature favored Bill with curly hair."
        },
        {
            "id": 13,
            "phrase": "fawn (all) over someone",
            "definition": "to flatter someone or attend to someone excessively; to curry favor with someone.  Please stop fawning all over the guests. You are embarrassing me.  She always fawns over us when we visit."
        },
        {
            "id": 14,
            "phrase": "fawn (up)on someone",
            "definition": "to praise and flatter someone.  Aunt Mabel fawned on the new baby till the poor child was rescued by her mother. I hate the way our aunts fawn on us at family gatherings."
        },
        {
            "id": 15,
            "phrase": "fear for someone or something",
            "definition": "to be afraid for the safety of someone or something; to worry about someone or something.  I fear for Tom. He has gone to a very dangerous place.  I don’t want to go down that rocky trail. I fear for my car."
        },
        {
            "id": 16,
            "phrase": "feast one’s eyes ((up)on someone or something)",
            "definition": "to enjoy the sight of someone or something. (Upon is formal and less commonly used than on.) _ Just feast your eyes on that beautiful beach.  Jane feasted her eyes on Roger for a while and then went on with her studying."
        },
        {
            "id": 17,
            "phrase": "feast (up)on something",
            "definition": "to eat a great deal of something; to eat a feast built around something in particular.  We will feast upon turkey for weeks.  We feasted on the fish Harry had caught."
        },
        {
            "id": 18,
            "phrase": "a feather in one’s cap",
            "definition": "an honor; a reward for something. Getting a new client was really a feather in my cap. John earned a feather in his cap by getting an A in physics."
        },
        {
            "id": 19,
            "phrase": "feather one’s (own) nest",
            "definition": "1. Fig. to decorate and furnish one’s home in style and comfort. (Alludes to birds lining their nests with feathers to make them warm and comfortable.) _ With the new family room and expanded kitchen, they seem to have feathered their nest quite comfortably. 2. Fig. to use power and prestige to provide for oneself selfishly. (Said especially of politicians who use their offices to make money for themselves.) _The mayor seemed to be helping people, but she was really feathering her own nest.  The building contractor used a lot of public money to feather his nest."
        },
        {
            "id": 20,
            "phrase": "feature someone as something",
            "definition": "1. to imagine someone to be something or a particular type of person.  I really can’t feature you as a ship’s captain. Alice had always featured Fred as a fairly even-tempered person. 2. to give special prominence to someone in a particular part in a play, film, opera, etc.  They featured Laura as the lead singer in the group.  The director refused to feature Roger as a lead."
        },
        {
            "id": 21,
            "phrase": "feature someone in something",
            "definition": "1. to imagine someone wearing something. I can’t feature you in that ridiculous dress.  Can you feature Fran in that hat? 2. to imagine someone being in something or some place. I can’t feature you in Paris. You are too rural to enjoy a place like Paris.  Can you feature David in New York City?"
        },
        {
            "id": 22,
            "phrase": "*fed up (to some degree) (with someone or something)",
            "definition": "bored or disgusted with someone or something. (*Typically: be ~; become ~.) _ I am fed up to my eyeballs with your complaining.  I am just fed up to here!"
        },
        {
            "id": 23,
            "phrase": "Feed a cold and starve a fever.",
            "definition": "Prov. You should feed someone who has a cold, and withhold food from someone who has a fever.; (or, interpreted differently) If you feed someone who has a cold, that will ward off a fever.  Jill: I don’t feel like going out to lunch with you. I have a cold. Jane: All the more reason you should get something to eat. Feed a cold and starve a fever, you know."
        },
        {
            "id": 24,
            "phrase": "feed off (of ) something",
            "definition": "to eat something in particular customarily. (Of is usually retained before pronouns.) _This creature feeds off fallen fruit.  Mosquitoes seem to want to feed off of me!"
        },
        {
            "id": 25,
            "phrase": "feed one’s face",
            "definition": "Inf. to put food in one’s mouth; to eat (something).  You’re always feeding your face. You’re going to get fat.  Stop feeding your face and listen to me."
        },
        {
            "id": 26,
            "phrase": "feed someone, something, or an animal with something",
            "definition": "1. to feed something to someone, a group, or an animal. The camp cook fed them with hot dogs and beans. We fed the dogs with the leftovers. 2. to use a tool or utensil to feed someone, a group, or an animal.  He fed the baby with a spoon.  We fed the entire group with paper plates."
        },
        {
            "id": 27,
            "phrase": "feed something back into something",
            "definition": "to return something back to where it came.  I tried to feed the stamps back into the machine, but, of course, they wouldn’t go.  The machine made too many boxes, but you can’t feed them back into it!"
        },
        {
            "id": 28,
            "phrase": "feed something back† to someone",
            "definition": "to give or hand something back to someone. We fed the rope back to those in line behind us.  Feed back the papers to the clerk."
        },
        {
            "id": 29,
            "phrase": "feed something into something",
            "definition": "to put something into something; to push a supply of something into something.  I fed all the coins into the telephone and waited to be connected.  I will feed every coin I have into the phone and see what it does for me.  Did you feed the data into the computer?"
        },
        {
            "id": 30,
            "phrase": "feed something to someone",
            "definition": "to tell someone lies. Don’t try to feed that nonsense to me! I know it isn’t so.  Please don’t feed any of those lies to Mark."
        },
        {
            "id": 31,
            "phrase": "feed something to someone or an animal",
            "definition": "to give someone or an animal food. Don’t feed pizza to the baby. I fed the leftover turkey to the dog."
        },
        {
            "id": 32,
            "phrase": "feed the kitty",
            "definition": "to contribute money. (A kitty here is a small collection of money.) _Please feed the kitty. Make a contribution to help sick children.  Come on, Bill. Feed the kitty. You can afford a dollar for a good cause."
        },
        {
            "id": 33,
            "phrase": "feed (up)on someone or something",
            "definition": "to eat someone or something. (Upon is formal and less commonly used than on.) _ They say that some Bengal tigers feed upon people.  They feed on anything that moves."
        },
        {
            "id": 34,
            "phrase": "a feeding frenzy",
            "definition": "[of sharks] a vicious, competitive feeding attack on prey animals.  One of the sharks was fatally bitten during a feeding frenzy amongst his own kind."
        },
        {
            "id": 35,
            "phrase": "feel a draft",
            "definition": "to sense that one is being rejected; to sense that someone is cool toward one, possibly for racial reasons. Oh, man, I feel a draft in here. Let’s leave. What a reception! I sure felt a draft."
        },
        {
            "id": 36,
            "phrase": "feel at home",
            "definition": "to feel as if one belongs; to feel as if one were in one’s home; to feel accepted.  I liked my dormitory room. I really felt at home there. We will do whatever we can to make you feel at home."
        },
        {
            "id": 37,
            "phrase": "feel blue",
            "definition": "to feel sad.  You look like you feel blue. What’s wrong?"
        },
        {
            "id": 38,
            "phrase": "feel fit",
            "definition": "to feel well and healthy. If you want to feel fit, you must eat the proper food and get enough rest. I hope I still feel fit when I get old."
        },
        {
            "id": 39,
            "phrase": "feel for someone",
            "definition": "to feel the emotional pain that someone else is feeling; to empathize or sympathize with someone.  I really feel for you. I’m so sorry it turned out this way.  Fred felt for Dave, but there was nothing he could do for him."
        },
        {
            "id": 40,
            "phrase": "*a feel for something",
            "definition": "a natural or learned ability to do something. (*Typically: get ~; have ~.) _ I will do better with this work as soon as I get a feel for it.  He doesn’t have a feel for this kind of careful work."
        },
        {
            "id": 41,
            "phrase": "feel free (to do something)",
            "definition": "to feel like one is permitted to do something or take something.  Please feel free to stay for dinner.  If you see something you want in the refrigerator, please feel free."
        },
        {
            "id": 42,
            "phrase": "feel guilty (about something)",
            "definition": "to feel that one is to blame for something; to feel intense regret for something that one has done. I feel guilty for forgetting about your birthday.  You shouldn’t feel guilty about the accident. It’s not your fault."
        },
        {
            "id": 43,
            "phrase": "feel it beneath one (to do something)",
            "definition": "to feel that one would be lowering oneself to do something.  Tom feels it beneath him to scrub the f loor. Ann feels it beneath her to carry her own luggage.  I would do it, but I feel it beneath me."
        },
        {
            "id": 44,
            "phrase": "feel like a million (dollars)",
            "definition": "to feel well and healthy, both physically and mentally. A quick swim in the morning makes me feel like a million dollars.  What a beautiful day! It makes you feel like a million."
        },
        {
            "id": 45,
            "phrase": "feel like a new person",
            "definition": "to feel refreshed and renewed, especially after getting well or getting dressed up. I bought a new suit, and now I feel like a new person.  Bob felt like a new person when he got out of the hospital."
        },
        {
            "id": 46,
            "phrase": "feel like doing something",
            "definition": "to want to do something; to be in the mood to do something; to feel well enough to do something.  Do you feel like stopping work to eat something? _ I feel like going on a vacation."
        },
        {
            "id": 47,
            "phrase": "feel like someone or something",
            "definition": "to have the feel of someone or something; to seem to be someone or something according to feel or touch. Whoever this is feels like Tom. Sort of soft and pudgy. This thing feels like a rubber hose, not a hot dog."
        },
        {
            "id": 48,
            "phrase": "*the feel of something",
            "definition": "a sense for how something feels when it is being used correctly. (*Typically: get ~; have ~; give someone ~.) _ I haven’t yet got the feel of this bat. I hope I don’t strike out.  I can drive better now that I have the feel of this car’s steering."
        },
        {
            "id": 49,
            "phrase": "feel on top of the world",
            "definition": "to feel very good, as if one were ruling the world.  I feel on top of the world this morning.  I do not actually feel on top of the world, but I have felt worse."
        },
        {
            "id": 50,
            "phrase": "feel one’s gorge rise",
            "definition": "to sense that one is getting very angry.  I felt my gorge rise and I knew I was going to lose my temper.  Bob could feel his gorge rise as he read his tax bill."
        },
        {
            "id": 51,
            "phrase": "feel one’s oats",
            "definition": "to be very lively.  Careful with that horse. He’s feeling his oats today.  Mary was feeling her oats and decided to go out dancing."
        },
        {
            "id": 52,
            "phrase": "feel out of things",
            "definition": "to feel alienated from something.  I feel out of things lately. Are people ignoring me? _ I feel a little out of things at this party, but I will try to join in the fun."
        },
        {
            "id": 53,
            "phrase": "feel somehow about someone or something",
            "definition": "to have ideas, opinions, or reactions regarding someone or something. I feel good about him. Do you feel good about how you did on the test? _ How do you feel about Sally?"
        },
        {
            "id": 54,
            "phrase": "feel someone out† (about someone or something)",
            "definition": "to find out what someone thinks about someone or some- thing. (This does not involve touching anyone.) _ I will feel him out about what he thinks about going to Florida.  Let me feel out the boss about this matter."
        },
        {
            "id": 55,
            "phrase": "feel someone up†",
            "definition": "to feel someone sexually. (Use discretion with topic.) _I heard him say he really wanted to feel her up.  He wanted to feel up the girl."
        },
        {
            "id": 56,
            "phrase": "feel something with something",
            "definition": "to touch and explore something with something.  I felt the soft little creature with my hand.  Don’t feel that thing with your bare hands."
        },
        {
            "id": 57,
            "phrase": "feel up to something",
            "definition": "to feel well enough or prepared enough to do something. (Often in the negative.) _I don’t feel up to jogging today. Aunt Mary didn’t feel up to making the visit."
        },
        {
            "id": 58,
            "phrase": "feeling (kinda) puny",
            "definition": "feeling ill. I’m feeling puny. Think I might be coming down with a cold. Bill had to skip football practice on account of he was feeling puny."
        },
        {
            "id": 59,
            "phrase": "feeling no pain",
            "definition": "numbed by alcohol and feeling nothing; intoxicated. She fell off the wagon and is feeling no pain.  He drank the whole thing, and he’s feeling no pain."
        },
        {
            "id": 60,
            "phrase": "The female of the species is more deadly than the male.",
            "definition": "Prov. In many animal species, the female is poisonous and the male is not, and, by analogy, women are more dangerous than men. Bill: My old girlfriend’s been threatening me ever since I broke up with her, but she’s too small and weak to do me any harm. Fred: I’d be careful if I were you. The female of the species is more deadly than the male."
        },
        {
            "id": 61,
            "phrase": "fence an animal in†",
            "definition": "to enclose an animal and its area within a fence or barrier. We fenced the dog in to keep it at home.  We had to fence in the dog."
        },
        {
            "id": 62,
            "phrase": "fence someone in†",
            "definition": "to restrict someone in some way.  I don’t want to fence you in, but you have to get home earlier at night. Don’t try to fence me in. I need a lot of freedom.  Your last stupid move fenced in the department, making us less effective."
        },
        {
            "id": 63,
            "phrase": "fence someone or an animal out†",
            "definition": "to keep someone or an animal out with a fence or barrier.  We decided that living in the woods was satisfactory only if we fenced the wildlife out.  We had to fence out the deer.  We hoped we had fenced prowlers out with the tall electric fence."
        },
        {
            "id": 64,
            "phrase": "fence someone or something off† (from something)",
            "definition": "to separate someone or something from something else with a fence or barrier.  We fenced the children’s play area off from the rest of the yard.  Dave fenced off the play area.  We fenced off the children from the rest of the yard."
        },
        {
            "id": 65,
            "phrase": "fence something in†",
            "definition": "to enclose an area within a fence.  When they fenced the garden in, they thought the deer wouldn’t be able to destroy the f lowers.  We fenced in the yard to make a safe place for the children."
        },
        {
            "id": 66,
            "phrase": "fend someone or something off†",
            "definition": "to hold someone or something off; to fight someone or something off.  We knew we could fend them off only a little while longer.  They could not fend off the attackers."
        },
        {
            "id": 67,
            "phrase": "fender bender",
            "definition": "a minor car accident. A small fender bender tied up traffic on the expressway for hours!"
        },
        {
            "id": 68,
            "phrase": "ferret something out† (from something)",
            "definition": "to fetch something out from something.  We will have to ferret the mouse out from behind the stove.  We can ferret out the mouse with the aid of the cat."
        },
        {
            "id": 69,
            "phrase": "ferry someone around†",
            "definition": "to transport people here and there in small groups.  I really don’t want to spend all my days ferrying children around.  Why am I ferrying around a bunch of kids all day?"
        },
        {
            "id": 70,
            "phrase": "fess up (to something)",
            "definition": "to confess to having done something. (Short form of confess.) _ I tried to get the boy to fess up to doing it, but he wouldn’t do it.  Come on, fess up."
        },
        {
            "id": 71,
            "phrase": "festoon someone or something with something",
            "definition": "to drape or garland someone or something with something.  Karen festooned her daughter with f lowers for the party.  The kids festooned the gymnasium with crepe paper and garlands of plastic f lowers."
        },
        {
            "id": 72,
            "phrase": "fetch something in†",
            "definition": "to bring or pull something in. Would you please fetch some more firewood in? _ Can you fetch in the paper?"
        },
        {
            "id": 73,
            "phrase": "fetch up",
            "definition": "Sl. to empty one’s stomach; to vomit.  I really felt like I was going to fetch up.  Somebody fetched up in here and didn’t clean it up."
        },
        {
            "id": 74,
            "phrase": "fetch up at some place",
            "definition": "to reach a place; to end up at a place.  We fetched up at Sam’s house at about midnight.  The car fetched up at the cabin and everyone got out."
        },
        {
            "id": 75,
            "phrase": "few and far between",
            "definition": "very few; few and widely scattered.  Get some gasoline now. Service stations on this highway are few and far between.  Some people think that good movies are few and far between."
        },
        {
            "id": 76,
            "phrase": "fiddle something away†",
            "definition": "to waste something. She fiddled the afternoon away. Don’t fiddle away the afternoon. Get to work."
        },
        {
            "id": 77,
            "phrase": "fiddle while Rome burns",
            "definition": "to do nothing or something trivial while knowing that something disastrous is happening. (From a legend that the Roman emperor Nero played the lyre while Rome was burning.) _The lobbyists don’t seem to be doing anything to stop this tax bill. They’re fiddling while Rome burns."
        },
        {
            "id": 78,
            "phrase": "fiddle with someone or something",
            "definition": "to tinker or play with someone or something.  Please don’t fiddle with the stereo controls.  Leave your brother alone. Don’t fiddle with him. He’s cranky."
        },
        {
            "id": 79,
            "phrase": "fidget around",
            "definition": "to wiggle and twitch nervously. The child sat there, fidgeting around for over ten minutes.  Please don’t fidget around so."
        },
        {
            "id": 80,
            "phrase": "fidget with something",
            "definition": "to play with something nervously.  Please don’t fidget with your zipper.  Carl is always fidgeting with his left ear."
        },
        {
            "id": 81,
            "phrase": "Fields have eyes, and woods have ears.",
            "definition": "Prov. Even though you are outside in an apparently empty landscape, someone may be eavesdropping on you.  Jill: You said you had a secret. Tell me. Jane: Not here. Jill: But there’s nobody else in the park. Jane: Fields have eyes, and woods have ears."
        },
        {
            "id": 82,
            "phrase": "a fifth wheel",
            "definition": "an unwelcome or extra person. I don’t like living with my son and daughter-in-law. I feel like a fifth wheel.  Bill always begs to come on camping trips with us, but really, he’s a fifth wheel."
        },
        {
            "id": 83,
            "phrase": "fifty-fifty",
            "definition": "even or equal. The chances of success are about fifty-fifty. Even at fifty-fifty, it’s probably worth it, you know."
        },
        {
            "id": 84,
            "phrase": "fight about someone or something",
            "definition": "to have a battle or argue about someone or something.  Why do we always have to fight about money? _ Let’s not fight about Ed."
        },
        {
            "id": 85,
            "phrase": "fight against someone or something",
            "definition": "to battle against someone or something.  The general refused to fight against the enemy, which was much stronger.  He fought against the disease to the very end."
        },
        {
            "id": 86,
            "phrase": "fight against time",
            "definition": "to hurry to meet a deadline or to do something quickly.  The ambulance sped through the city to reach the accident, fighting against time.  All the students fought against time to complete the test."
        },
        {
            "id": 87,
            "phrase": "fight back (at someone or something)",
            "definition": "to defend oneself against someone or something; to retaliate against someone or something.  You are going to have to fight back at them. You can’t expect us to defend you.  It’s hard for me to fight back against three of them by myself."
        },
        {
            "id": 88,
            "phrase": "Fight fire with fire.",
            "definition": "Prov. Use against your opponent the same methods he or she is using against you.  After her opponent had spent several weeks slandering her, the candidate decided to fight fire with fire.  When evangelists would come to our house and try to convert us, Mother would fight fire with fire and try to convert them to her religion."
        },
        {
            "id": 89,
            "phrase": "fight for someone or something",
            "definition": "to go to battle for the benefit of someone or something; to go to battle in the name of someone or something.  They all went off to fight for their country.  The soldiers fought for the queen and the survival of the empire. I guess I will have to learn to fight for my rights."
        },
        {
            "id": 90,
            "phrase": "fight on",
            "definition": "to continue to fight.  The boys fought on until one of them was down.  They fought on until they were exhausted."
        },
        {
            "id": 91,
            "phrase": "fight (one’s way) back (to something)",
            "definition": "to struggle to return to something or some place.  She fought her way back to the head of the line.  Jan fought back to good health."
        },
        {
            "id": 92,
            "phrase": "fight (one’s way) through (something)",
            "definition": "1. to struggle to get through something; to struggle to penetrate something.  I’ll have to fight my way through all this crepe paper in order to reach the punch bowl.  The room was filled with trash, and I had to fight through it to get to the other door. 2. to struggle to work through all of some- thing. I have to fight my way through this stack of papers by noon.  I am tired of fighting through red tape."
        },
        {
            "id": 93,
            "phrase": "fight over someone or something",
            "definition": "to fight a battle that decides who gets someone or something. Well, let’s not fight over Tom. You can have him. I can make a better team without him. The children were fighting over who would get the largest piece of cake."
        },
        {
            "id": 94,
            "phrase": "fight someone or something down†",
            "definition": "to fight against and defeat someone or something. We fought the opposition down and got our bill through the committee. We had to fight down Fred, who wanted something entirely different."
        },
        {
            "id": 95,
            "phrase": "fight someone or something off†",
            "definition": "to repel an attack from someone or something. We fought the enemy attack off, but they returned almost immediately. She fought off the mosquitoes all evening.  Jed fought the attacker off."
        },
        {
            "id": 96,
            "phrase": "fight someone or something with something",
            "definition": "to attack or battle someone or something with something.  We can’t fight the enemy with clubs and pitchforks! _ I fought him with my bare fists."
        },
        {
            "id": 97,
            "phrase": "fight something down†",
            "definition": "1. to struggle to hold something back; to struggle to keep from being overwhelmed by something.  She fought her anger down and managed to stay calm.  She fought down the urge. 2. to struggle to swallow something; to fight to get something down one’s throat. It tasted terrible, but I managed to fight it down.  She fought down the nasty-tasting medicine."
        },
        {
            "id": 98,
            "phrase": "fight something out†",
            "definition": "to settle something by fighting. Do we have to fight this out? Can’t we use reason? _ I prefer to fight out this matter once and for all."
        },
        {
            "id": 99,
            "phrase": "fight something through† (something)",
            "definition": "to force something through some sort of procedure or process; to railroad something through (something).  The governor fought the bill through the legislature successfully.  She fought through the bill successfully."
        },
        {
            "id": 100,
            "phrase": "fight the good fight",
            "definition": "to fight a noble and wellintentioned battle.  He fought the good fight and left the meeting with a clear conscience."
        },
        {
            "id": 101,
            "phrase": "fight to the death",
            "definition": "to engage in a battle that isn’t finished until one opponent is dead.  The two men looked as though they were going to fight to the death.  These eviltempered dogs will fight to the death."
        },
        {
            "id": 102,
            "phrase": "a fighting chance",
            "definition": "a good possibility of success, especially if every effort is made.  They have at least a fighting chance of winning the race. The patient could die, but he has a fighting chance since the operation."
        },
        {
            "id": 103,
            "phrase": "figure in something",
            "definition": "[for someone or something] to play a role in something.  Tom figures in our plans for future office management.  I don’t wish to figure in your future."
        },
        {
            "id": 104,
            "phrase": "figure on doing something",
            "definition": "to plan on something.  I figured on arriving at the party around eight o’clock.  Jane figured on spending $25 on dinner."
        },
        {
            "id": 105,
            "phrase": "figure on someone or something",
            "definition": "to count on someone or something; to assume something about someone or something. I am figuring on twelve people for dinner next Friday. We are figuring on you and your wife for dinner next weekend."
        },
        {
            "id": 106,
            "phrase": "figure someone as something",
            "definition": "to think of a person as a particular type of person. I figured her as a reliable worker.  We figured them all as good credit risks."
        },
        {
            "id": 107,
            "phrase": "figure someone or something in† (on something)",
            "definition": "to plan on having someone or something included in something.  Please figure another ten people in on the picnic.  I will figure in those people."
        },
        {
            "id": 108,
            "phrase": "figure someone or something out†",
            "definition": "to begin to comprehend someone or something; to come to understand someone or something better. I just can’t figure you out. I can’t figure out quiet people readily."
        },
        {
            "id": 109,
            "phrase": "figure something up†",
            "definition": "to add up the amount of something.  Please figure the bill up. We have to go now.  I will figure up the bill right away."
        },
        {
            "id": 110,
            "phrase": "filch something (from someone)",
            "definition": "Sl. to grab or steal something from someone. The young boy filched a candy bar from the store.  Who filched my wallet from me?"
        },
        {
            "id": 111,
            "phrase": "file for something",
            "definition": "to submit an application or document for something. The company filed for bankruptcy. Let’s file for reorganization."
        },
        {
            "id": 112,
            "phrase": "file in((to) something)",
            "definition": "[for a line of people] to move into something or some place.  The people filed into the hall quietly.  Everyone filed in quietly."
        },
        {
            "id": 113,
            "phrase": "file out (of something)",
            "definition": "[for a line of people] to move out of something or some place. The people filed quietly out of the theater.  They filed out at the end."
        },
        {
            "id": 114,
            "phrase": "file past (someone or something)",
            "definition": "[for a line or procession] to move past someone or something.  The people filed past the coffin, looking sadly at the still figure inside.  As they filed past, some wept openly."
        },
        {
            "id": 115,
            "phrase": "file something against someone",
            "definition": "to lodge a criminal charge against someone.  Sally filed a charge of assault against Max.  The old man filed charges against the attacker."
        },
        {
            "id": 116,
            "phrase": "file something (away†)",
            "definition": "to put something away, usually in a file folder or file cabinet.  She filed the letter away for future reference. Please file away this report. You will need it some day."
        },
        {
            "id": 117,
            "phrase": "file something down†",
            "definition": "to level off a protrusion by filing.  File this edge down so no one gets cut on it.  Please file down this edge."
        },
        {
            "id": 118,
            "phrase": "file something with someone or something",
            "definition": "to submit an application or a document to someone or a group.  You must file this copy with the state office. I will file this with my boss."
        },
        {
            "id": 119,
            "phrase": "fill in",
            "definition": "[for an indentation, hole, etc.] to become full. The scar filled in after a few months.  Will this hole in the ground fill in by itself, or should I put some dirt in?"
        },
        {
            "id": 120,
            "phrase": "fill in (for someone or something)",
            "definition": "to substitute for someone or something; to take the place of someone or something.  I will have to fill in for Wally until he gets back.  I don’t mind filling in."
        },
        {
            "id": 121,
            "phrase": "Fill in the blanks.",
            "definition": "You can figure out the rest.; You can draw a conclusion from that. (Fixed order. See also fill something in.) _Mary: What happened at Fred’s house last night? Bill: There was a big fight, then the neighbors called the police. Mary: Then what happened? Bill: Fill in the blanks. What do you think? _ John: They had been lost for two days, then the wolves came, and the rest is history. Jane: Yes, I think I can fill in the blanks."
        },
        {
            "id": 122,
            "phrase": "fill out",
            "definition": "to become full; to gain weight.  About a month after her debilitating illness, Maggie began to fill out again.  The fruit on the trees began to fill out, and we knew it was going to ripen soon."
        },
        {
            "id": 123,
            "phrase": "fill someone full of lead",
            "definition": "Sl. to shoot someone. The shopkeeper bought a gun and swore the next time someone broke into the shop, he’d fill him full of lead. Don’t move, or I’ll fill you full of lead."
        },
        {
            "id": 124,
            "phrase": "fill someone in† (on someone or something)",
            "definition": "to tell someone the details about someone or something.  Please fill me in on what happened last night.  Please fill in the committee on the details."
        },
        {
            "id": 125,
            "phrase": "fill someone or something up† (with something)",
            "definition": "to put as much as possible into someone or something. We filled him up with chili and crackers. We will fill up the basket with leaves.  I will fill the basket up with f lowers."
        },
        {
            "id": 126,
            "phrase": "fill someone’s head with something",
            "definition": "to put some kind of ideas into someone’s head.  Who’s been filling your head with ideas like that? _Mary has been filling my head with ideas about how to get rich."
        },
        {
            "id": 127,
            "phrase": "fill someone’s shoes",
            "definition": "to take the place of some other person and do that person’s work satisfactorily. (As if you were wearing the other person’s shoes.) _ I don’t know how we’ll be able to do without you. No one can fill your shoes.  It’ll be difficult to fill Jane’s shoes. She did her job very well."
        },
        {
            "id": 128,
            "phrase": "fill something in†",
            "definition": "1. to add material to an indentation, hole, etc., to make it full.  You had better fill the crack in with something before you paint the wall. You should fill in the cracks first. 2. Fig. to write in the blank spaces on a paper; to write on a form.  Please fill this form in.  I will fill in the form for you."
        },
        {
            "id": 129,
            "phrase": "fill something out†",
            "definition": "to complete a form by writing in the blank spaces. Please fill this form out and send it back to us in the mail.  I will fill out the form as you asked."
        },
        {
            "id": 130,
            "phrase": "fill something to something",
            "definition": "to add material to something up to a certain point.  Fill the barrel up to here and no higher.  Please fill the glass to the top."
        },
        {
            "id": 131,
            "phrase": "fill the gap",
            "definition": "to serve temporarily.  I think that the temp will fill the gap until a new person can be hired."
        },
        {
            "id": 132,
            "phrase": "fill up",
            "definition": "1. to become full.  The creek filled up after the heavy rain yesterday. The rain barrel began to fill up during the storm. 2. to fill one’s gas tank.  I’ve got to stop and fill up. The gas tank is running low.  We will fill up at the next little town."
        },
        {
            "id": 133,
            "phrase": "filled to the brim",
            "definition": "filled all the way full; filled up to the top edge.  I like my coffee cup filled to the brim.  If the glass is filled to the brim, I can’t drink without spilling the contents."
        },
        {
            "id": 134,
            "phrase": "film over",
            "definition": "[for something] to develop a film on its surface.  The windows had filmed over because of all the humidity.  Her eyes filmed over with the cold."
        },
        {
            "id": 135,
            "phrase": "filter in(to some place)",
            "definition": "to leak or seep into some place.  The smell of bacon cooking filtered into his room and made him wake up. The smoke filtered in and burned our eyes."
        },
        {
            "id": 136,
            "phrase": "filter through (something)",
            "definition": "to pass or seep through something.  The water filtered through the coffee grounds and dripped into the pot. The clear water filtered through and left the sand behind."
        },
        {
            "id": 137,
            "phrase": "filthy lucre",
            "definition": "money.  I sure could use a little of that filthy lucre.  I don’t want to touch any of your filthy lucre."
        },
        {
            "id": 138,
            "phrase": "filthy rich",
            "definition": "1. Fig. very wealthy.  I wouldn’t mind being filthy rich.  There are too many filthy rich people now. 2. Fig. people who are very wealthy.  The filthy rich can afford that kind of thing, but I can’t.  I sort of feel sorry for the filthy rich."
        },
        {
            "id": 139,
            "phrase": "a final fling",
            "definition": "the last act or period of enjoyment before a change in one’s circumstances or lifestyle.  You might as well have a final f ling before the baby’s born.  Mary’s find (something) out (about going out with her girlfriends for a final f ling. She’s getting married next week."
        },
        {
            "id": 140,
            "phrase": "financially embarrassed",
            "definition": "Euph. broke.  I’m a bit financially embarrassed at the moment. Gary found himself financially embarrassed when the time came to pay the bill."
        },
        {
            "id": 141,
            "phrase": "find a way around someone or something",
            "definition": "to find a way to pass around someone or something to get to the other side.  I could hardly find a way around the tables in the crowded restaurant to get to the restroom."
        },
        {
            "id": 142,
            "phrase": "find against someone or something",
            "definition": "[for a jury or a judge] to announce a decision against one side of a lawsuit.  The jury found against the defendant, who was a horrible witness.  The court found against the corporation and levied a fine."
        },
        {
            "id": 143,
            "phrase": "find fault (with someone or something)",
            "definition": "to find things wrong with someone or something.  We were unable to find fault with his arguments.  Sally’s father was always finding fault with her."
        },
        {
            "id": 144,
            "phrase": "find favor with someone",
            "definition": "to win the praise of someone.  The maid found favor with the family and was given a large salary increase. Mary found favor with her employer because of her good ideas."
        },
        {
            "id": 145,
            "phrase": "find for someone or something",
            "definition": "[for a jury or a judge] to announce a decision in favor of one side of a lawsuit.  The judge found for Mrs. Franklin, and that made her family quite happy.  The court found for the plaintiff and admonished the defense lawyer."
        },
        {
            "id": 146,
            "phrase": "find its way somewhere",
            "definition": "[for something] to end up in a place. (This expression avoids accusing someone of moving the thing to the place.) _The money found its way into the mayor’s pocket. The secret plans found their way into the enemy’s hands."
        },
        {
            "id": 147,
            "phrase": "find one’s feet",
            "definition": "to become used to a new situation or experience.  She was lonely when she first left home, but she is finding her feet now. It takes time to learn the office routine, but you will gradually find your feet."
        },
        {
            "id": 148,
            "phrase": "find one’s own level",
            "definition": "to find the position or rank to which one is best suited.  You cannot force new clerks to be ambitious. They will all find their own level. The new student is happier in the beginning class. It was just a question of letting her find her own level."
        },
        {
            "id": 149,
            "phrase": "find one’s tongue",
            "definition": "to be able to talk; to figure out what to say.  Tom was speechless for a moment. Then he found his tongue.  Ann was unable to find her tongue. She sat there in silence."
        },
        {
            "id": 150,
            "phrase": "find one’s way (around)",
            "definition": "to be able to move about an area satifactorily without getting lost. I can go downtown by myself. I can find my way around.  I know the area well enough to find my way."
        },
        {
            "id": 151,
            "phrase": "find one’s way around (something)",
            "definition": "to discover a way to move around something or some place without getting lost. Can you find your way around or shall I have someone take you? _ Don’t worry. I can find my way around."
        },
        {
            "id": 152,
            "phrase": "find one’s way (somewhere)",
            "definition": "[for someone] to discover the route to a place. Mr. Smith found his way to the museum.  Can you find your way home?"
        },
        {
            "id": 153,
            "phrase": "find oneself with someone or something",
            "definition": "to discover that one has a disease or a problem.  I found myself with a terrible case of sunburn after the first day of my vacation."
        },
        {
            "id": 154,
            "phrase": "find oneself without someone or something",
            "definition": "to discover that one no longer has someone or something.  When I got to the head of the line, I found myself without a cent!"
        },
        {
            "id": 155,
            "phrase": "find someone in",
            "definition": "to learn or discover that one is at home; to learn or discover that one is in one’s office.  I never expected to find you in at this time of night.  Did you really expect to find me in on a Friday night?"
        },
        {
            "id": 156,
            "phrase": "find someone out",
            "definition": "1. to discover that someone is not at home. We knocked on their door and found them out.  Sam found Frank out when he arrived to collect the debt. 2. to discover something surprising or shocking about someone. I don’t want them to find me out. We found her out despite her deviousness."
        },
        {
            "id": 157,
            "phrase": "find something out†",
            "definition": "to discover facts about someone or something; to learn a fact.  I found something out that you might be interested in. We found out that the Smiths are going to sell their house."
        },
        {
            "id": 158,
            "phrase": "find (something) out† (about someone or something) (from someone or something)",
            "definition": "to learn something about someone or something from someone or something.  What did you find out about Terry from Mr. Franklin? _ I didn’t find anything out about Roger from the newspaper stories.  I found out what I wanted to know about solar f lares from the encyclopedia. What did you find out about Bill?"
        },
        {
            "id": 159,
            "phrase": "Finders keepers(, losers weepers).",
            "definition": "Prov. If you find something, you are entitled to keep it. (This is a children’s rhyme and sounds childish when used by adults.) _ Bill: Hey! How come you’re using my fountain pen? Fred: It’s mine now. I found it on the f loor—finders keepers, losers weepers.  Child: That’s my hat. You can’t have it. Playmate: I found it. Finders keepers."
        },
        {
            "id": 160,
            "phrase": "fine and dandy",
            "definition": "nice; good; well.  Well, that’s just fine and dandy. Couldn’t be better. I feel fine and dandy, and I’m going to have a good time here."
        },
        {
            "id": 161,
            "phrase": "Fine feathers make fine birds.",
            "definition": "Prov. If you dress elegantly, people will think you are elegant. (Can be used ironically, to suggest that even though someone dresses well, he or she is not a high-class person.) _ Bill: I don’t see why I should have to wear a necktie for a job interview. Jane: Fine feathers make fine birds."
        },
        {
            "id": 162,
            "phrase": "a fine how do you do",
            "definition": "an unpleasant situation. (Said with surprise.) _ This is a fine how do you do! Someone left a big puddle of motor oil in my driveway.  John saw his girlfriend out with another young man. He walked up to her and said, “Well, isn’t this a fine how do you do!”"
        },
        {
            "id": 163,
            "phrase": "a fine kettle of fish",
            "definition": "a troublesome situation; a vexing problem. (Usually appears in the expression, This is a fine kettle of fish!) _ This is a fine kettle of fish. My husband is not here to meet me at the train station, and there’s no phone here for me to call him.  Alan: Oh, no! I’ve burned the roast. We don’t have anything to serve our guests as a main dish. Jane: But they’ll be here any minute! This is a fine kettle of fish."
        },
        {
            "id": 164,
            "phrase": "fine someone for something",
            "definition": "to demand a monetary penalty from someone for having done something.  The judge fined her for speeding.  The agency fined our company for having the wrong kind of tank to store waste oil."
        },
        {
            "id": 165,
            "phrase": "Fine words butter no parsnips.",
            "definition": "Prov. Just because someone promises something does not guarantee that he or she will do it. (Can be used as a rebuke, implying that the person you are addressing is promising something he or she will not do, as in the second example.) _ Sue: Tom promised he would buy me any house I want if I marry him! Jane: Fine words butter no parsnips.  Fred: Sweetheart, I’m very sorry I’ve been so short-tempered. I’ll never, never be like that anymore. Ellen: Fine words butter no parsnips."
        },
        {
            "id": 166,
            "phrase": "fine-tune something",
            "definition": "to make delicate adjustments in some mechanical or electronic device. It took a while to fine-tune the f lute, but it was worth it."
        },
        {
            "id": 167,
            "phrase": "finger someone as someone",
            "definition": "Sl. to identify someone as a certain person. (As if one were pointing a finger at someone.) _Max fingered his partner as the gunman. The accountant fingered the bookkeeper as the one who fixed the books."
        },
        {
            "id": 168,
            "phrase": "Fingers were made before forks.",
            "definition": "Prov. It is all right to eat with one’s fingers because people had to eat somehow before there were forks. (Used to justify eating something with your fingers.) _Mother: Put that chicken wing back on your plate and eat it properly, with a knife and fork. Child: But Mom, fingers were made before forks.  I don’t see why it’s considered bad manners to eat with your fingers. Fingers were made before forks."
        },
        {
            "id": 169,
            "phrase": "finish someone or an animal off†",
            "definition": "to kill someone or an animal that is already injured or wounded. They had to finish the wounded bear off with a revolver. The hunter finished off the bear."
        },
        {
            "id": 170,
            "phrase": "finish someone or something off†",
            "definition": "to complete some activity being performed on someone or something.  Let’s finish this one off and go home.  Yes, let’s finish off this one. Nancy is cutting Elaine’s hair. When she finishes her off, she will be ready to leave."
        },
        {
            "id": 171,
            "phrase": "finish someone or something up†",
            "definition": "to finish doing something to someone or something. I will finish this typing up in a few minutes. She finished up Fred in a short time."
        },
        {
            "id": 172,
            "phrase": "finish (something) by doing something",
            "definition": "to bring something to a conclusion by doing something.  She finished the lecture by naming her sources.  Sharon finished by reading a poem."
        },
        {
            "id": 173,
            "phrase": "finish something off†",
            "definition": "to eat or drink up all of something; to eat or drink up the last portion of something.  Let’s finish the turkey off.  You finish off the turkey. I’ve had enough."
        },
        {
            "id": 174,
            "phrase": "finish (something) off† with something",
            "definition": "to bring something to a conclusion with something.  She finished the dinner off with fancy cheeses and fruit.  She finished off the dinner with pie."
        },
        {
            "id": 175,
            "phrase": "finish with something",
            "definition": "to complete something; to become done with something. I will finish with fixing this soon, and then you can have it. When will this be finished with?"
        },
        {
            "id": 176,
            "phrase": "finishing touch(s)",
            "definition": "a final adjustment of something; some effort or action that completes something.  Norm is in his workshop putting the finishing touches on his latest project."
        },
        {
            "id": 177,
            "phrase": "fink on someone",
            "definition": "Sl to inform parents, the authorities, etc. on someone.  You’re not going to fink on me, are you? _ Chuck finked on all of us."
        },
        {
            "id": 178,
            "phrase": "fink out (on someone or something)",
            "definition": "Sl. to decide not to cooperate with someone or something (after all). Come on, don’t fink out on us now.  Bob finked out on the plan."
        },
        {
            "id": 179,
            "phrase": "fire away (at someone)",
            "definition": "to ask many questions of someone; to criticize someone severely.  When it came time for questions, the reporters began firing away at the mayor.  Members of the opposite party are always firing away at the president."
        },
        {
            "id": 180,
            "phrase": "Fire is a good servant but a bad master.",
            "definition": "Prov. You must be careful to use fire wisely and under control so that it will not hurt you.  Don’t play with the candle f lames, children. Fire is a good servant but a bad master. At camp, we learned how to build and extinguish fires safely, since fire is a good servant but a bad master."
        },
        {
            "id": 181,
            "phrase": "fire over something",
            "definition": "to shoot over something with a weapon, usually people’s heads. We fired over their heads to warn them to stay away.  Wally fired over the target."
        },
        {
            "id": 182,
            "phrase": "fire someone up†",
            "definition": "to motivate someone; to make someone enthusiastic. See if you can fire John up and get him to rake the leaves. I have to fire up the electorate if I want them to vote for me."
        },
        {
            "id": 183,
            "phrase": "fire (something) back (at someone or something)",
            "definition": "to shoot back at someone or something.  We fired about ten rounds back at them.  The soldiers in the fort did not fire back at the attackers."
        },
        {
            "id": 184,
            "phrase": "fire something back† (to someone or something)",
            "definition": "to send something back to someone or a group immediately.  Look this over and fire it back to me immediately.  Fire back all this stuff to the printer as soon as you have proofed it."
        },
        {
            "id": 185,
            "phrase": "fire something into someone or something",
            "definition": "to shoot something, as a weapon, into someone or something.  She fired the gun into a special box that stopped the bullet. She would then examine it under a special microscope.  Max fired two shots into Lefty, but even that did not stop him."
        },
        {
            "id": 186,
            "phrase": "fire something off† (to someone)",
            "definition": "to send something to someone immediately, by a very rapid means. Fire a letter off to Fred, ordering him to return home at once.  I fired off a letter to Fred as you asked.  I finished the email and fired it off."
        },
        {
            "id": 187,
            "phrase": "fire something up†",
            "definition": "to light something, such as a pipe, cigarette, etc.  If you fire that pipe up, I will leave the room.  Please don’t fire up that cigar in here!"
        },
        {
            "id": 188,
            "phrase": "*a fire under someone",
            "definition": "something that makes someone start doing something. (*Typically: build ~; light ~; start ~.) _The teacher built a fire under the students, and they really started working.  You had better light a fire under your staff. Either that or we will lay off some of them."
        },
        {
            "id": 189,
            "phrase": "fire up",
            "definition": "to light a cigarette, cigar, or pipe.  One by one, the guests went outside and fired up.  I have to get out of here and fire up."
        },
        {
            "id": 190,
            "phrase": "fire (up)on someone or something",
            "definition": "to shoot at someone or something with a weapon; to shoot in the direction of someone or something. (Upon is formal and less commonly used than on.) _The troops fired upon the advancing army.  The cops fired on Max."
        },
        {
            "id": 191,
            "phrase": "fired up",
            "definition": "excited; enthusiastic.  How can you be so fired up at this time of the morning? _It’s impossible to get Martin fired up at all."
        },
        {
            "id": 192,
            "phrase": "*a firm hand",
            "definition": "[someone’s] strong sense of management; a high degree of discipline and direction. (*Typically: exercise ~; have ~; need ~; take ~; use ~.) _ I had to use a firm hand with Perry when he was a child. He had a problem with discipline."
        },
        {
            "id": 193,
            "phrase": "firm something up†",
            "definition": "to make something more stable or firm.  We need to firm this table up. It is very wobbly. You need to use a whisk to firm up the egg whites."
        },
        {
            "id": 194,
            "phrase": "firm up",
            "definition": "to develop better muscle tone; to become less flabby.  I need to do some exercises so I can firm up. You really ought to firm up."
        },
        {
            "id": 195,
            "phrase": "first and foremost",
            "definition": "Cliché first to be dealt with and most important.  First and foremost, I think you should work harder on your biology.  Have this in mind first and foremost: Keep smiling!"
        },
        {
            "id": 196,
            "phrase": "First catch your hare.",
            "definition": "Prov. Do not make plans about what you will do when you have something until you actually have it. Fred: When I buy my house on the beach, you can spend summers with me there. Ellen: First catch your hare."
        },
        {
            "id": 197,
            "phrase": "First come, first served.",
            "definition": "Prov. The first people to arrive will be able to get the best choices.  You can’t reserve a seat at the movie theater; it’s strictly first come, first served.  We should get to the book sale as soon as they open; it’s first come, first served."
        },
        {
            "id": 198,
            "phrase": "*first crack at something",
            "definition": "the first opportunity at doing, fixing, or having something. (*Typically: get ~; have ~; give someone ~; take ~; want ~.) _ I’ll take the first crack at it, and if I can’t do it, you can try."
        },
        {
            "id": 199,
            "phrase": "The first hundred years are the hardest.",
            "definition": "Prov. The first hundred years of your life are the hardest, and after that, you can expect things to get easier; in other words, your whole life will probably be difficult. (A jocular, ironic way to console someone who is having difficulties.) _ Don’t worry; things are bound to improve for you. The first hundred years are the hardest."
        },
        {
            "id": 200,
            "phrase": "First impressions are the most lasting.",
            "definition": "Prov. People will remember the way you appear when you first meet them, so it is important to look and act your best when you meet someone for the first time.  George spent two hours picking just the right clothes to wear when he met the head of the law firm, since he knew that first impressions are the most lasting."
        },
        {
            "id": 201,
            "phrase": "first of all",
            "definition": "as the very first thing; before anything else.  First of all, put your name on this piece of paper.  First of all, we’ll try to find a place to live."
        },
        {
            "id": 202,
            "phrase": "first off",
            "definition": "first; the first thing. (Almost the same as first of all.) _ He ordered soup first off.  First off, we’ll find a place to live."
        },
        {
            "id": 203,
            "phrase": "first see the light of day",
            "definition": "1. Fig. to be born.  My grandfather has taken care of me since I first saw the light of day. 2. Fig. to come into being.  Bob’s collection of short stories first saw the light of day in a privately printed edition three years ago."
        },
        {
            "id": 204,
            "phrase": "The first step is always the hardest.",
            "definition": "Prov. Starting a new endeavor is the hardest part of it.  Fred: I want to quit smoking, but I can’t convince myself to sign up for the “stop smoking” program. Jill: The first step is always the hardest.  If I can just start this project, I know the rest will be easy. The first step is always the hardest."
        },
        {
            "id": 205,
            "phrase": "first thing (in the morning)",
            "definition": "before anything else is done in the morning.  Please call me first thing in the morning. I can’t help you now.  I’ll do that first thing."
        },
        {
            "id": 206,
            "phrase": "First things first.",
            "definition": "Prov. Do things in the proper order; do not skip things that you should do first.  Jill: Should we go to the museum first, or should we go shopping? Jane: I’m hungry. Let’s eat lunch before we discuss it. First things first.  First things first: read the directions carefully before you try to assemble the bookcase."
        },
        {
            "id": 207,
            "phrase": "the firstest with the mostest",
            "definition": "the earliest and in the largest numbers; the earliest with more of what’s needed.  Pete got the prize for being the firstest with the mostest.  I always like to be there early—the firstest with the mostest."
        },
        {
            "id": 208,
            "phrase": "fish for a compliment",
            "definition": "to try to get someone to pay oneself a compliment.  When she showed me her new dress, I could tell that she was fishing for a compliment.  Tom was certainly fishing for a compliment when he modeled his fancy haircut for his friends."
        },
        {
            "id": 209,
            "phrase": "fish for something",
            "definition": "to try to catch a particular kind of fish. We are fishing for cod today, but we’ll take whatever we get. We will fish for perch from the riverbank."
        },
        {
            "id": 210,
            "phrase": "fish in troubled waters",
            "definition": "to involve oneself in a difficult, confused, or dangerous situation, especially with a view to gaining an advantage.  Frank is fishing in troubled waters by buying more shares of that company. They are supposed to be in financial difficulties. The company could make more money by selling armaments abroad, but they would be fishing in troubled waters."
        },
        {
            "id": 211,
            "phrase": "Fish or cut bait.",
            "definition": "Do something or get out of the way.  Fish or cut bait, Chuck. There’s work to be done here.  Decide whether you’re going to watch or help. Fish or cut bait."
        },
        {
            "id": 212,
            "phrase": "a fishing expedition",
            "definition": "a search for information without knowledge of whether such information exists. (This involves asking questions with no preconceived notion of what the answers might reveal.) _ The lawyer was on a fishing expedition. There was no real wrong committed to justify a lawsuit.  Your honor, the prosecutor is just on a clumsy fishing expedition. I move for dismissal.  We are going to have to go on a fishing expedition to try to find the facts."
        },
        {
            "id": 213,
            "phrase": "fit and trim",
            "definition": "slim and in good physical shape. Jean tried to keep herself fit and trim at all times.  For some people, keeping fit and trim requires time, effort, and self-discipline."
        },
        {
            "id": 214,
            "phrase": "fit around something",
            "definition": "to wrap around something.  This part fits around the top and keeps the water out. Will this wrench fit around the bolt?"
        },
        {
            "id": 215,
            "phrase": "*fit as a fiddle",
            "definition": "Cliché in very good health. (*Also: as ~.) _ You may feel sick now, but after a few days of rest and plenty of liquids, you’ll be fit as a fiddle.  Grandson: Are you sure you’ll be able to climb all these stairs? Grandmother: Of course! I feel as fit as a fiddle today."
        },
        {
            "id": 216,
            "phrase": "fit in (somehow) (with something)",
            "definition": "to match up or harmonize with something in some fashion. Your itinerary fits in well with my plans.  This fits in very poorly with what I had planned."
        },
        {
            "id": 217,
            "phrase": "fit in (with someone or something)",
            "definition": "to be comfortable with someone or something; to be in accord or harmony with someone or something. I really feel as if I fit in with that group of people.  It’s good that you fit in.  This chair doesn’t fit in with the style of furniture in my house."
        },
        {
            "id": 218,
            "phrase": "fit in((to) something)",
            "definition": "[for something] to be a suitable size to go into something. This peg does not fit into this hole.  That huge sofa simply doesn’t fit in through the door."
        },
        {
            "id": 219,
            "phrase": "fit like a glove",
            "definition": "to fit very well; to fit snugly.  My new shoes fit like a glove.  My new coat is a little tight. It fits like a glove."
        },
        {
            "id": 220,
            "phrase": "fit someone for something",
            "definition": "1. to measure someone for something.  I have to fit him for his tuxedo. I’ll take his measurements and get to work on it.  She was fitted for her gown in only one afternoon. 2. to prepare someone for something; to make someone suitable for some purpose or activity. His education did not fit him for working with children.  Her temperament does not fit her for this kind of work."
        },
        {
            "id": 221,
            "phrase": "fit someone or something out† (for something)",
            "definition": "to equip someone or something for something; to outfit someone or something for something. We are going to fit our boat out so we can live on it during a long cruise.  We fit out the children in funny costumes for Halloween."
        },
        {
            "id": 222,
            "phrase": "fit someone or something out† (with something)",
            "definition": "to provide or furnish someone or something with something. They fit out the campers with everything they needed. They fit them out for only $140."
        },
        {
            "id": 223,
            "phrase": "fit something to something",
            "definition": "to make something suit something else. Please try to fit your remarks to the audience.  Can you fit the main course to the needs of all the people who are coming to dinner?"
        },
        {
            "id": 224,
            "phrase": "fit something together†",
            "definition": "to put the parts of something together.  First you have to fit the pieces together to see if they are all there.  I think I can fit the parts of the model airplane together.  Do you think you can fit together all the parts of the puzzle?"
        },
        {
            "id": 225,
            "phrase": "fit to be tied",
            "definition": "angry and agitated. (As if needing to be restrained.) _ Joe was fit to be tied when his wife told him she was leaving.  I was fit to be tied when Mary tried to be friendly, after three years of not speaking to me."
        },
        {
            "id": 226,
            "phrase": "fit to kill",
            "definition": "Rur. a great deal; to the highest possible degree. We laughed fit to kill when we saw the expression on Jim’s face.  I had my car gussied up fit to kill."
        },
        {
            "id": 227,
            "phrase": "fit together",
            "definition": "[for things] to conform in shape to one another.  All the pieces of the puzzle fit together. They really do.  This nut and bolt just don’t fit together."
        },
        {
            "id": 228,
            "phrase": "fit with something",
            "definition": "to harmonize with something; to go well with something.  Do you think that your behavior fits with the occasion? _ This coat doesn’t fit with these slacks."
        },
        {
            "id": 229,
            "phrase": "*fits and starts",
            "definition": "with irregular movement; with much stopping and starting. (*Typically: by ~; in ~; with ~.) _ Somehow, they got the job done in fits and starts.  By fits and starts, the old car finally got us to town."
        },
        {
            "id": 230,
            "phrase": "five-finger discount",
            "definition": "Sl. shoplifting. Sam used his fivefinger discount to get the kind of ring Jane wanted.  I got this necklace by five-finger discount."
        },
        {
            "id": 231,
            "phrase": "*a fix",
            "definition": "1. Sl. a dose of a drug or narcotic. (*Typically: get ~; have ~; give someone ~; need ~.) _The addict badly needed a fix and was very fidgety. 2. an appropriate repair.  Do you have a good fix for a leaky faucet?"
        },
        {
            "id": 232,
            "phrase": "*a fix on something",
            "definition": "1. the exact location of something distant. (*Typically: get ~; have ~; give someone ~.) _ I can’t get a fix on your location. Where are you? _ We are trying to get a fix on your radio transmission. 2. Fig. an understanding of the direction of a discussion. (*Typically: get ~; have ~; give someone ~.) _I can’t quite get a fix on what you’re trying to say.  I can’t get a fix on where you’re going with this argument."
        },
        {
            "id": 233,
            "phrase": "fix someone or something up†",
            "definition": "to rehabilitate someone or something. The doctor said he could fix me up with a few pills. The doctor fixed up the injured hunter and sent him home."
        },
        {
            "id": 234,
            "phrase": "fix someone’s wagon",
            "definition": "to punish someone; to get even with someone; to plot against someone.  If you ever do that again, I’ll fix your wagon! _Tommy! You clean up your room this instant, or I’ll fix your wagon! _ He reported me to the boss, but I fixed his wagon. I knocked his lunch on the f loor."
        },
        {
            "id": 235,
            "phrase": "fix someone up† (with something)",
            "definition": "to supply someone with something. I will fix you up with some alcohol and bandages.  The clerk fixed up the lady with what she needed.  Larry wanted some film and the clerk fixed him up with the best."
        },
        {
            "id": 236,
            "phrase": "fix something for (a meal)",
            "definition": "to prepare something for a specific meal.  I will fix some chili for lunch.  Will you fix something good for dinner tonight?"
        },
        {
            "id": 237,
            "phrase": "fix something on(to) something",
            "definition": "to attach something onto something.  We fixed a notice onto the broken door so people wouldn’t use it.  Please fix a label on this package."
        },
        {
            "id": 238,
            "phrase": "fix something over†",
            "definition": "to redo something; to do something over; to redecorate something.  I want to fix this room over next spring.  I really want to fix over this room."
        },
        {
            "id": 239,
            "phrase": "fix something with someone",
            "definition": "1. to get someone’s agreement or permission for something. Don’t worry, I’ll fix it with your boss. Can you fix things with my brother? He doesn’t want me to do this. 2. to apologize or make amends to someone for something. She is upset at you, but you can fix it with her, I’m sure. I will fix it with her. Don’t worry."
        },
        {
            "id": 240,
            "phrase": "fix (up)on someone or something",
            "definition": "to become preoccupied with someone or something. (Upon is formal and less commonly used than on.) _ She seems to have fixed upon becoming a pilot.  James is quite fixed on Janet."
        },
        {
            "id": 241,
            "phrase": "fixed up",
            "definition": "provided with a date.  Sam got fixed up with Martha.  Okay, Sam is fixed up with a date for Saturday."
        },
        {
            "id": 242,
            "phrase": "fixin(g) to do something",
            "definition": "Rur. getting ready to do something; getting ready to start something.  I’m fixin’ to go to the store. Need anything?"
        },
        {
            "id": 243,
            "phrase": "fizz up",
            "definition": "[for a liquid] to sparkle and bubble with many tiny bubbles; [for a liquid] to effervesce.  The cola drink fizzed up and spilled over.  As she poured the root beer, it fizzed up over the glass."
        },
        {
            "id": 244,
            "phrase": "fizzle out",
            "definition": "[for a liquid] to lose its effervescence.  This seltzer has fizzled out. I need a fresh glass of it."
        },
        {
            "id": 245,
            "phrase": "flag someone or something down†",
            "definition": "to signal or wave, indicating that someone should stop.  Please go out and f lag a taxi down. I’ll be right out.  She went to flag down a taxi."
        },
        {
            "id": 246,
            "phrase": "flake away (from something)",
            "definition": "[for bits of something] to break away from the whole gradually or from natural causes.  Bits of stone f laked away from the surface of the statue year after year.  Bits of the steps f laked away from years of constant use."
        },
        {
            "id": 247,
            "phrase": "flake down",
            "definition": "Sl. to go to bed and go to sleep.  I’ve got to go home and flake down for a while. Tom is flaked down for the night."
        },
        {
            "id": 248,
            "phrase": "flake off ((of ) something)",
            "definition": "[for bits of something] to break away from the whole, perhaps under pressure or because of damage. (Of is usually retained before pronouns.) _ Little bits of marble began to f lake off the marble steps.  Bits f laked off from the whole."
        },
        {
            "id": 249,
            "phrase": "flame up",
            "definition": "1. [for something] to catch fire and burst into flames.  The trees flamed up one by one in the forest fire. Suddenly the car flamed up and exploded. 2. [for a fire] to expand and send out larger flames.  The raging fire flamed up and jumped to even more trees.  As firemen opened the door and came in, the fire flamed up and filled the room."
        }
    ]
}