{
    "dictionary": [
        {
            "id": 0,
            "phrase": "Let bygones be bygones.",
            "definition": "Cliché Forgive someone for something he or she did in the past.  Jill: Why don’t you want to invite Ellen to your party? Jane: She was rude to me at the office picnic. Jill: But that was six months ago. Let bygones be bygones.  Nancy held a grudge against her teacher for a long time, but she finally decided to let bygones be bygones."
        },
        {
            "id": 1,
            "phrase": "let down",
            "definition": "to relax one’s efforts or vigilance.  Now is no time to let down. Keep on your guard.  After the contest was over, Jane let down a bit so she could relax."
        },
        {
            "id": 2,
            "phrase": "Let every man skin his own skunk.",
            "definition": "Prov. Everyone should do his own job and not interfere with others.; Each person should do his own dirty work.  We weren’t supposed to help each other with the homework. “Let every man skin his own skunk,” the teacher said."
        },
        {
            "id": 3,
            "phrase": "let fly with something",
            "definition": "to throw or thrust something, such as a rock, ball, punch, etc.  The pitcher wound up and let f ly with a strike—right over the plate.  Max let f ly with a blow to Lefty’s chin."
        },
        {
            "id": 4,
            "phrase": "Let George do it.",
            "definition": "Let someone else do it: it doesn’t matter who.  Billie always says, “Let George do it.” She is unwilling to help with things that don’t interest her."
        },
        {
            "id": 5,
            "phrase": "let go of someone or something",
            "definition": "to release someone or something.  Please let go of me! _ Don’t let go of the steering wheel."
        },
        {
            "id": 6,
            "phrase": "let grass grow under one’s feet",
            "definition": "to do nothing; to stand still. Mary doesn’t let the grass grow under her feet. She’s always busy.  Bob is too lazy. He’s letting the grass grow under his feet."
        },
        {
            "id": 7,
            "phrase": "let it all hang out",
            "definition": "Inf. to be yourself, assuming that you generally are not; to become totally relaxed and unpretentious.  Come on. Relax! Let it all hang out.  I tried to let it all hang out, but I still felt out of place."
        },
        {
            "id": 8,
            "phrase": "Let it be.",
            "definition": "Leave the situation alone as it is.  Alice: I can’t get over the way he just left me there on the street and drove off. What an arrogant pig! Mary: Oh, Alice, let it be. You’ll figure out some way to get even. John: You can’t! Bill: Can too! John: Can’t! Bill: Can too! Jane: Stop arguing! Let it be! That’s enough!"
        },
        {
            "id": 9,
            "phrase": "Let it go.",
            "definition": "Forget it.; Stop worrying about it.  Don’t get so angry about it. Let it go.  Let it go. Stop fretting."
        },
        {
            "id": 10,
            "phrase": "let loose of someone or something",
            "definition": "1. to loosen the grasp on someone or something. Please let loose of me! _Will you let loose of the doorknob? 2. to become independent from someone or something.  She is nearly forty years old and has not yet let loose of her mother.  Dave can’t let loose of his childhood."
        },
        {
            "id": 11,
            "phrase": "let on (about someone or something) (to someone)",
            "definition": "to confirm or reveal something about someone or something.  I won’t let on about Kate.  You promised you wouldn’t let on about Sally and her new job! _ He was having money troubles, but he never let on about it to us."
        },
        {
            "id": 12,
            "phrase": "let on something",
            "definition": "to pretend something.  She let on that she was a college graduate. He looked quite tired, but that wasn’t how he let on."
        },
        {
            "id": 13,
            "phrase": "let on (to someone) (about someone or something)",
            "definition": "to reveal knowledge about someone or something to someone.  Please don’t let on to anyone about what happened last night.  I won’t let on to anyone."
        },
        {
            "id": 14,
            "phrase": "let one’s emotions show",
            "definition": "to be emotional, especially where it is not appropriate.  I’m sorry for the outburst. I didn’t mean to let my emotions show.  Please stop crying. You mustn’t let your emotions show."
        },
        {
            "id": 15,
            "phrase": "let one’s guard down†",
            "definition": "to stop guarding oneself against trouble; to relax one’s vigilance. He never lets his guard down because he trusts no one."
        },
        {
            "id": 16,
            "phrase": "let one’s hair down",
            "definition": "to undo one’s hair and let it fall freely.  When she took off her glasses and let her hair down, she was incredibly beautiful."
        },
        {
            "id": 17,
            "phrase": "let oneself go",
            "definition": "1. Fig. to become less constrained; to get excited and have a good time.  I love to dance and just let myself go.  Let yourself go, John. Learn to enjoy life. 2. Fig. to let one’s appearance and health suffer.  When I was depressed, I let myself go and was really a mess. He let himself go and gained 30 pounds."
        },
        {
            "id": 18,
            "phrase": "let oneself in for something",
            "definition": "to make oneself vulnerable to some difficulty.  I don’t want to let myself in for a lot of extra work.  You really let yourself in for some problems!"
        },
        {
            "id": 19,
            "phrase": "let out",
            "definition": "[for an event that includes many people] to end. (The people are then permitted to come out.) _ What time does the movie let out? I have to meet someone in the lobby.  The meeting let out at about seven o’clock.  School lets out in June."
        },
        {
            "id": 20,
            "phrase": "let out some kind of sound",
            "definition": "[for a living creature] to make some kind of a noise or sound.  Be quiet. Don’t let out a sound! _ Suddenly, Jane let out a shriek."
        },
        {
            "id": 21,
            "phrase": "let out (with) something",
            "definition": "1. to state or utter something loudly.  The man let out with a screaming accusation about the person whom he thought had wounded him.  She let out a torrent of curses. 2. to give forth a scream or yell.  She let out with a bloodcurdling scream when she saw the snake in her chair.  They let out with shouts of delight when they saw the cake."
        },
        {
            "id": 22,
            "phrase": "Let’s bump this place!",
            "definition": "Sl. Let’s get out of this place!; Let’s leave! _ Time to go. Let’s bump this place! _ Let’s bump this place! It’s dead here."
        },
        {
            "id": 23,
            "phrase": "Let’s call it a day.",
            "definition": "Let us end what we are doing for the day.  Mary: Well, that’s the end of the reports. Nothing else to do. Sue: Let’s call it a day.  Bob: Let’s call it a day. I’m tired. Tom: Me too. Let’s get out of here."
        },
        {
            "id": 24,
            "phrase": "Let’s dump.",
            "definition": "Sl. Let’s go.  It’s late. Let’s dump.  Let’s dump. I’ve still got a lot to do at home tonight."
        },
        {
            "id": 25,
            "phrase": "Let’s get down to business.",
            "definition": "a phrase marking a transition to a business discussion or serious talk. John: Okay, enough small talk. Let’s get down to business. Mary: Good idea. “All right, ladies and gentlemen, let’s get down to business,” said the president of the board."
        },
        {
            "id": 26,
            "phrase": "Let’s get out of here.",
            "definition": "Let us leave (and go somewhere else).  Alice: It’s really hot in this room. Let’s get out of here. John: I’m with you. Let’s go.  Bill: This crowd is getting sort of angry. Bob: I noticed that too. Let’s get out of here."
        },
        {
            "id": 27,
            "phrase": "Let’s get together (sometime).",
            "definition": "a vague invitation to meet again, usually said upon departing. (The sometime can be a particular time or the word sometime.) _Bill: Goodbye, Bob. Bob: See you, Bill. Let’s get together sometime.  Jane: We need to discuss this matter. John: Yes, let’s get together next week."
        },
        {
            "id": 28,
            "phrase": "Let’s go somewhere where it’s (more) quiet.",
            "definition": "Let us continue our conversation where there is less noise or where we will not be disturbed. Tom: Hi, Mary. It’s sure crowded here. Mary: Yes, let’s go somewhere where it’s quiet. Bill: We need to talk. Sally: Yes, we do. Let’s go somewhere where it’s more quiet."
        },
        {
            "id": 29,
            "phrase": "Let’s not go through all that again.",
            "definition": "We are not going to discuss that matter again. (Compare this with Do we have to go through all that again?) _ Bill: Now, I still want to explain again about last night. Sally: Let’s not go through all that again! _ Sally: I can’t get over the way you spoke to me at our own dinner table. Fred: I was only kidding! I said I was sorry. Let’s not go through all that again!"
        },
        {
            "id": 30,
            "phrase": "Let’s rock and roll!",
            "definition": "Inf. Let’s get started!; Let’s get moving! _A: Everybody ready? B: Yeah. A: Good. Let’s rock and roll!"
        },
        {
            "id": 31,
            "phrase": "let’s say",
            "definition": "introduces an estimate or a speculation. I need about—let’s say—twenty pounds.  Let’s say I go over and talk to him. What do you think?"
        },
        {
            "id": 32,
            "phrase": "Let’s shake on it.",
            "definition": "Let us mark this agreement by shaking hands on it.  Bob: Do you agree? Mary: I agree. Let’s shake on it. Bob: Okay. Bill: Good idea. Sounds fine. Bob (extending his hand): Okay, let’s shake on it. Bill (shaking hands with Bob): Great!"
        },
        {
            "id": 33,
            "phrase": "Let’s talk (about it).",
            "definition": "Let us talk about the problem and try to settle things.  Tom: Bill! Bill! I’m sorry about our argument. Let’s talk. Bill: Get lost! _ Sally: I’ve got a real problem. Bob: Let’s talk about it."
        },
        {
            "id": 34,
            "phrase": "Let sleeping dogs lie.",
            "definition": "Prov. Do not instigate trouble.; Leave something alone if it might cause trouble.  Jill: Should I ask the boss if he’s upset at my coming in late in the mornings? Jane: If he hasn’t said anything about it, just let sleeping dogs lie.  I thought I would ask Jill if she wanted me to pay her back right away, but then I decided to let sleeping dogs lie."
        },
        {
            "id": 35,
            "phrase": "let someone down",
            "definition": "to disappoint someone; to fail someone.  I’m sorry I let you down. Something came up, and I couldn’t meet you.  I don’t want to let you down, but I can’t support you in the election."
        },
        {
            "id": 36,
            "phrase": "let someone get by with something",
            "definition": "to allow someone to do something wrong and not be punished or reprimanded. (An elaboration of get by (with something).) _ She lets those kids get by with anything. They won’t let you get by with that!"
        },
        {
            "id": 37,
            "phrase": "let someone (get) off (something)",
            "definition": "to permit someone to disembark, dismount, or leave something.  Please move and let me get off the bus.  Let her off!"
        },
        {
            "id": 38,
            "phrase": "let someone get on with something",
            "definition": "to permit someone to continue something.  I will leave now and let you get on with your work.  She had to settle the matter first. She would not let herself get on with life until the matter was settled."
        },
        {
            "id": 39,
            "phrase": "let someone (get) past",
            "definition": "to allow someone to pass; to get out of the way so someone can pass.  Please let me get past. I’m in a hurry.  Do let me past."
        },
        {
            "id": 40,
            "phrase": "let someone go",
            "definition": "Euph. to fire someone.  They let Jane go from her job.  I’m afraid we’re going to have to let you go."
        },
        {
            "id": 41,
            "phrase": "let someone have it (with both barrels)",
            "definition": "to strike someone or attack someone verbally. (With both barrels intensifies the phrase; it alludes to firing a double-barreled shotgun.) _ I really let Tom have it with both barrels. I told him he had better not do that again if he knows what’s good for him. Bob was really angry and let John have it— with both barrels."
        },
        {
            "id": 42,
            "phrase": "let someone in for something",
            "definition": "to cause someone to be involved in something, usually something unpleasant.  Fred had no idea what his brother had let him in for when he agreed to take his place in the race.  Jack didn’t know what he was letting himself in for when he married that dreadful woman."
        },
        {
            "id": 43,
            "phrase": "let someone know (about something)",
            "definition": "to tell someone something; to inform someone of something. Please let me know about it soon. Will you be coming to the picnic? Please let me know."
        },
        {
            "id": 44,
            "phrase": "let someone off†",
            "definition": "to permit someone to disembark or leave a means of transportation.  The driver let Mary off the bus. “I can’t let you off at this corner,” said the driver.  He let off passengers at every stop. "
        },
        {
            "id": 45,
            "phrase": "let someone or an animal (get) out (of something)",
            "definition": "1. to permit someone or an animal to exit or escape from something or some place.  Please let the president get out of the car.  Don’t let the snake get out! 2. to permit someone or an animal to evade something.  I will not let you get out of your responsibilities.  They wouldn’t let me out of the contract."
        },
        {
            "id": 46,
            "phrase": "let someone or something at someone or something",
            "definition": "to permit someone or something to attack or get at someone or something.  He did that? Just let me at him! _ Let the committee at her, then she’ll change her tune."
        },
        {
            "id": 47,
            "phrase": "let someone or something down†",
            "definition": "to fail someone or something; to disappoint someone or a group.  Please don’t let me down. I am depending on you.  I let down the entire cast of the play."
        },
        {
            "id": 48,
            "phrase": "let someone or something through (something)",
            "definition": "to permit someone or something to move through an opening or through a congested area.  The usher wouldn’t let me through the door.  Please let the ambulance through the crowd."
        },
        {
            "id": 49,
            "phrase": "let someone slide by",
            "definition": "to permit someone to get past a barrier or a challenge too easily.  You let too many students slide by. You need to be more rigorous. Don’t let even one unqualified person slide by!"
        },
        {
            "id": 50,
            "phrase": "let something off†",
            "definition": "to release something; to give something off.  The engine let some evil smelling smoke off.  The f lower let off a wonderful smell."
        },
        {
            "id": 51,
            "phrase": "let something out†",
            "definition": "1. Fig. to reveal something; to tell about a secret or a plan.  It was supposed to be a secret. Who let it out? _ Who let out the secret? 2. Fig. to enlarge an article of clothing.  She had to let her overcoat out because she had gained some weight.  I see you have had to let out your trousers."
        },
        {
            "id": 52,
            "phrase": "let something out† (to someone)",
            "definition": "to rent something to someone.  I let the back room out to a college boy.  I let out the back room to someone."
        },
        {
            "id": 53,
            "phrase": "let something pass",
            "definition": "to let something go unnoticed or unchallenged.  Bob let Bill’s insult pass because he didn’t want to argue. Don’t worry, I’ll let this little incident pass."
        },
        {
            "id": 54,
            "phrase": "let something ride",
            "definition": "to allow something to continue or remain as it is.  It isn’t the best plan, but we’ll let it ride.  I disagree with you, but I’ll let it ride."
        },
        {
            "id": 55,
            "phrase": "let something slip (out)",
            "definition": "to reveal a secret carelessly or by accident.  I didn’t let it slip out on purpose. It was an accident.  John let the plans slip when he was talking to Bill."
        },
        {
            "id": 56,
            "phrase": "Let the buyer beware.",
            "definition": "Prov. ClichéWhen you buy something, you must take precautions against being cheated, because you cannot trust merchants to be honest about what they sell.  Let the buyer beware when shopping for a used car. Several of the lamps among those Max offered for sale were broken. “If a customer isn’t smart enough to try a lamp before he buys it, that’s his problem,” Max argued. “Let the buyer beware.”"
        },
        {
            "id": 57,
            "phrase": "let the cat out of the bag",
            "definition": "to reveal a secret or a surprise by accident.  When Bill glanced at the door, he let the cat out of the bag. We knew then that he was expecting someone to arrive.  It’s a secret. Try not to let the cat out of the bag."
        },
        {
            "id": 58,
            "phrase": "let the chance slip by",
            "definition": "to lose the opportunity (to do something). When I was younger, I wanted to become a doctor, but I let the chance slip by.  Don’t let the chance slip by. Do it now!"
        },
        {
            "id": 59,
            "phrase": "Let the chips fall where they may.",
            "definition": "Prov. Let something happen regardless of the consequences and no matter what happens.  I’m going to tell Ellen the truth about her husband, let the chips fall where they may.  Kathy decided to risk her money on the investment, and let the chips fall where they may."
        },
        {
            "id": 60,
            "phrase": "Let the cobbler stick to his last.",
            "definition": "Prov. Do not advise someone in matters outside your area of expertise.  Whenever Ted, who is a lawyer, tried to give Bob suggestions about how to write his novel, Bob would say, “Let the cobbler stick to his last.” _ Bill: I don’t think you should put so much oregano in the spaghetti sauce. Nancy: You’re a construction worker, not a chef. Let the cobbler stick to his last."
        },
        {
            "id": 61,
            "phrase": "Let the dead bury the dead.",
            "definition": "Prov. Do not try to revive old grievances.; Forget about past conflicts. (Biblical.) _ The Nelson family and the Hopkins family had been feuding for decades, but when Andrew Nelson and Louise Hopkins declared that they wanted to get married, their families decided to let the dead bury the dead."
        },
        {
            "id": 62,
            "phrase": "Let them eat cake.",
            "definition": "Prov. A joking disclaimer of responsibility for some group of people. (Supposed to have been said by Marie Antoinette when she heard that the common people had no bread.) _ Fred: The budget will allow each one of our managers to get a substantial holiday bonus. Jane: And what about the rest of the employees? Fred: Let them eat cake!"
        },
        {
            "id": 63,
            "phrase": "let up",
            "definition": "1. to diminish. I hope this rain lets up a little soon. When the snow lets up so I can see, I will drive to the store. 2. to stop [doing something] altogether. The rain let up about noon, and the sun came out."
        },
        {
            "id": 64,
            "phrase": "let up (on someone or something)",
            "definition": "to reduce the pressure or demands on someone or something.  You had better let up on Tom. He can’t handle any more work.  Please let up on the committee. It can only do so much.  Do let up. You are getting too upset."
        },
        {
            "id": 65,
            "phrase": "Let us do something.",
            "definition": "We will do something [together].  Let us go in peace.  Let us bow our heads in prayer."
        },
        {
            "id": 66,
            "phrase": "level a charge against someone",
            "definition": "to place a charge against someone; to accuse someone of something. The neighbors leveled a disturbance of the peace charge against us.  The cops leveled an assault charge against Max."
        },
        {
            "id": 67,
            "phrase": "level off",
            "definition": "[for variation or fluctuation in the motion of something] to diminish; [for a rate] to stop increasing or decreasing.  The plane leveled off at 10,000 feet.  After a while the workload will level off.  Things will level off after we get through the end of the month."
        },
        {
            "id": 68,
            "phrase": "level out",
            "definition": "[for something that was going up and down] to assume a more level course or path. The road leveled out after a while and driving was easier. As we got down into the valley, the land leveled out and traveling was easier."
        },
        {
            "id": 69,
            "phrase": "a level playing field",
            "definition": "a situation that is fair to all; a situation where everyone has the same opportunity. field.) _ If we started off with a level playing field, everyone would have an equal chance."
        },
        {
            "id": 70,
            "phrase": "level something at someone or something",
            "definition": "to direct something at someone or something; to aim a remark at someone.  The sheriff leveled his rif le at the f leeing bandit. Why did you think you had to level that barrage of words at me? I didn’t make the problem.  Sam leveled an acid comment or two at the committee."
        },
        {
            "id": 71,
            "phrase": "level something down",
            "definition": "to make something level or smooth.  The soil is very uneven in this part of the garden. Would you please level it down? _ The huge earth-moving machines leveled the hill down in preparation for the building of the highway."
        },
        {
            "id": 72,
            "phrase": "level something off†",
            "definition": "to make something level or smooth.  You are going to have to level the f loor off before you put the carpet down.  Please level off the f loor."
        },
        {
            "id": 73,
            "phrase": "level something out†",
            "definition": "to cause something to assume a more level course or path.  Level this path out before you open it to the public.  They have to level out this roadway."
        },
        {
            "id": 74,
            "phrase": "level something to the ground",
            "definition": "to crush or demolish something down to the ground. They were forced to level the building to the ground, because they could not afford to maintain it.  The house was leveled to the ground by the tornado."
        },
        {
            "id": 75,
            "phrase": "level something up†",
            "definition": "to move something into a level or plumb position.  Use a piece of wood under the table’s leg to level it up.  I will level up the table."
        },
        {
            "id": 76,
            "phrase": "level the (playing) field",
            "definition": "to create a state where everyone has the same opportunity.  Let’s level the playing field and give everyone a chance."
        },
        {
            "id": 77,
            "phrase": "level with someone (about someone or something)",
            "definition": "to be straightforward with someone about something; to be sincere or truthful about someone or something.  The police encouraged the criminal to level with them about the crime.  Level with me, and tell me what you thought of my cake."
        },
        {
            "id": 78,
            "phrase": "levy something (up)on someone or something",
            "definition": "to place a tax on someone or something. (Upon is formal and less commonly used than on.) _ The Congress was very straight- forward. It levied room taxes upon rich people.  The city council levied a heavy tax on hotel guests."
        },
        {
            "id": 79,
            "phrase": "A liar is not believed (even) when he tells the truth.",
            "definition": "Prov. If people think that you are a liar, they will not believe anything you say.  As it turned out, Fred was right when he warned his friends that the police were planning to raid their party; but they paid no attention to him, since they knew him to be a liar, and a liar is not believed even when he tells the truth."
        },
        {
            "id": 80,
            "phrase": "liberate someone or something from someone or something",
            "definition": "to free someone or something from someone or something; to set someone or something free from the control of someone or something.  The police hoped to liberate the child from his kidnappers. We liberated the town from the enemy.  I liberated the cat from the trap."
        },
        {
            "id": 81,
            "phrase": "license to do something",
            "definition": "permission, right, or justification to do something.  You have no license to behave in that manner! _Who granted you license to enter my house without knocking?"
        },
        {
            "id": 82,
            "phrase": "*a lick and a promise",
            "definition": "a hasty bit of work; a quick once-over. (*Typically: finish something with ~; give something ~.) _ I was pressed for time, so I just gave the housework a lick and a promise. Mary spent so much time on her history paper that she had to finish her math homework with a lick and a promise."
        },
        {
            "id": 83,
            "phrase": "lick at something",
            "definition": "to draw the tongue over something repeatedly.  Jimmy was just licking at the ice-cream cone, and soon it began to melt and drip off his elbow.  I don’t just lick at the ice cream. I take big bites of it."
        },
        {
            "id": 84,
            "phrase": "a lick of work",
            "definition": "a bit of work. (Used with a negative.) _ I couldn’t get her to do a lick of work all day long! _The boys didn’t do a lick of work while you were away."
        },
        {
            "id": 85,
            "phrase": "lick one’s chops",
            "definition": "to show one’s eagerness to do something, especially to eat something.  We could tell from the way the boys were licking their chops that they really wanted a turn at riding the motorcycle. Fred started licking his chops when he smelled the turkey roasting in the oven."
        },
        {
            "id": 86,
            "phrase": "lick one’s lips",
            "definition": "to show eagerness or pleasure about a future event. (From the habit of people licking their lips when they are about to enjoy eating something.) _ The children licked their lips at the sight of the cake.  The author’s readers were licking their lips in anticipation of her new novel."
        },
        {
            "id": 87,
            "phrase": "lick one’s wounds",
            "definition": "to recover from a defeat or a rebuke. (Also literal for an animal.) _ After the terrible meeting and all the criticism, I went back to my office to lick my wounds."
        },
        {
            "id": 88,
            "phrase": "lick someone or something into shape",
            "definition": "to press or force someone or something into good shape or condition.  The drama coach will try to lick her into shape by performance time.  Please try to lick this report into shape by tomorrow morning."
        },
        {
            "id": 89,
            "phrase": "lick something up†",
            "definition": "to clean up all of some substance by licking with the tongue. (Usually said of an animal.) _ Don’t worry about the spilled milk. The dog will lick it up.  The dog licked up the milk."
        },
        {
            "id": 90,
            "phrase": "*a licking",
            "definition": "a spanking; a beating in a fight. (*Typically: get ~; take ~; give someone ~.) _ Billy, you had better get in here if you don’t want to get a licking.  Bob took a real licking in the stock market.  Tom gave Harry a licking in the fight he was in."
        },
        {
            "id": 91,
            "phrase": "*a lid on something",
            "definition": "a cover on something, such as a pot, pan, etc. (*Typically: get ~; keep ~; put ~.) _ Keep the lid on the pot until the stew is almost done.  Put the lid on the skillet for just a little while."
        },
        {
            "id": 92,
            "phrase": "lie about",
            "definition": "1. [for someone] to recline lazily somewhere.  She just lay about through her entire vacation.  Don’t lie about all the time. Get busy. 2. [for something] to be located somewhere casually and carelessly, perhaps for a long time. This hammer has been lying about for a week. Put it away! _ Why are all these dirty dishes lying about?"
        },
        {
            "id": 93,
            "phrase": "lie about someone or something (to someone)",
            "definition": "to say something untrue about someone or something to someone.  I wouldn’t lie about my boss to anyone! _ I wouldn’t lie about anything like that!"
        },
        {
            "id": 94,
            "phrase": "lie alongside ((of ) someone or an animal)",
            "definition": "to lie next to someone or an animal. (Of is usually retained before pronouns.) _ Jimmy came in to lie alongside of his father in bed.  The puppy lay alongside its mother."
        },
        {
            "id": 95,
            "phrase": "lie around (some place)",
            "definition": "to recline some place; to spend some time lazily in some place.  I think I will just lie around the house all day.  I need to lie around every now and then."
        },
        {
            "id": 96,
            "phrase": "lie at anchor",
            "definition": "[for a ship] to wait or rest at anchor.  The ship lay at anchor throughout the day while a shore party searched for the runaway.  We lay at anchor overnight, waiting for the tide."
        },
        {
            "id": 97,
            "phrase": "lie at death’s door",
            "definition": "to be close to dying. She lay at death’s door for over a month.  I do not want to lie at death’s door suffering. I hope to pass on quickly."
        },
        {
            "id": 98,
            "phrase": "lie back",
            "definition": "to relax; to lean back in a chair and relax.  Just lie back and try to get comfortable.  I really need to get home and lie back and relax."
        },
        {
            "id": 99,
            "phrase": "lie behind someone or something",
            "definition": "1. [for something] to be positioned to the rear of someone or something. A wide expanse of water lay behind the sentry, and a narrow road- way lay in front. A vast field lies behind the house. 2. [for something] to be in someone’s or a group’s past.  Now that all of our difficulties lie behind us, we can get on with our business.  The busy season lay behind the company and people could take their vacations."
        },
        {
            "id": 100,
            "phrase": "lie beyond someone or something",
            "definition": "1. to be located on the other side of someone or something.  The stream lies beyond those men you see working in the field.  The village lies just beyond that hill there. 2. to be outside the grasp or the ability of someone or a group.  I am afraid that this matter lies beyond Dave.  The solution lies beyond the power of the committee."
        },
        {
            "id": 101,
            "phrase": "lie doggo",
            "definition": "to remain unrecognized (for a long time).  This problem has lain doggo since 1967.  If you don’t find the typos now, they will lie doggo until the next edition."
        },
        {
            "id": 102,
            "phrase": "lie down",
            "definition": "to recline.  Why don’t you lie down for a while? _ I need to lie down and have a little snooze."
        },
        {
            "id": 103,
            "phrase": "lie down on something",
            "definition": "to recline on something.  Don’t lie down on that couch! _I will just lie down on my bed for a few minutes."
        },
        {
            "id": 104,
            "phrase": "lie down under something",
            "definition": "to lie down beneath something. She was tired, so she lay down under a willow tree by the brook.  The dog lay down under a lawn chair and slept."
        },
        {
            "id": 105,
            "phrase": "lie fallow",
            "definition": "[for farmland] to exist unplanted for a period of time.  The fields lay fallow under the burning sun. It had been too wet to plant last spring."
        },
        {
            "id": 106,
            "phrase": "lie in",
            "definition": "[for a woman] to lie in bed awaiting the birth of her child.  The child is due soon, and the mother is lying in at the present time.  She did not lie in at all. She worked right up to the onset of labor pains."
        },
        {
            "id": 107,
            "phrase": "lie in ruins",
            "definition": "to exist in a state of ruin, such as a destroyed city, building, scheme, plan, etc.  The entire city lay in ruins.  My garden lay in ruins after the cows got in and trampled everything."
        },
        {
            "id": 108,
            "phrase": "lie in something",
            "definition": "to recline in something, such as a bed, a puddle, etc.  I found my wallet lying in a puddle. My money was soaked! _ We found Jimmy lying in a pile of leaves, napping."
        },
        {
            "id": 109,
            "phrase": "lie in state",
            "definition": "[for a dead body] to be on display for public mourning.  The president will lie in state in the Capitol Rotunda.  Mourners filed past the leader where he lay in state."
        },
        {
            "id": 110,
            "phrase": "lie in wait (for someone or something)",
            "definition": "to stay still and hidden, waiting for someone or something.  Bob was lying in wait for Anne so he could scold her about something.  The assassin lay in wait for his target to approach."
        },
        {
            "id": 111,
            "phrase": "lie like a rug",
            "definition": "Sl. to tell lies shamelessly. He says he didn’t take the money, but he’s lying like a rug.  I don’t believe her. She lies like a rug."
        },
        {
            "id": 112,
            "phrase": "lie out (in something)",
            "definition": "to remain out (unenclosed or unprotected) in some area.  Who left my screwdriver lying out in the rain? _ It’s not lying out. It’s in the drawer."
        },
        {
            "id": 113,
            "phrase": "lie through one’s teeth",
            "definition": "to lie boldly.  I knew she was lying through her teeth, but I didn’t want to say so just then. If John denies it he’s lying through his teeth, because I saw him do it."
        },
        {
            "id": 114,
            "phrase": "lie to someone (about someone or something)",
            "definition": "to tell an untruth about someone or something to someone.  You wouldn’t lie to me about Sarah, would you? _I’m not lying to you!"
        },
        {
            "id": 115,
            "phrase": "lie with someone",
            "definition": "1. to recline with someone. Come and lie with me and we will keep warm.  Jimmy and Franny were lying with each other to keep warm. 2. Euph. to recline with someone and have sex. She claimed he asked her to lie with him. Do you mean to imply that she lay with him?"
        },
        {
            "id": 116,
            "phrase": "lie within something",
            "definition": "to remain within a defined area or domain.  The boundaries of the village lie completely within the river valley.  The cost you cited lies within the range I was considering."
        },
        {
            "id": 117,
            "phrase": "Life begins at forty.",
            "definition": "Prov. By the time you are forty years old, you have enough experience and skill to do what you want to do with your life. (Often said as an encouragement to those reaching middle age.) _Alan: Why are you so depressed? Jane: Tomorrow’s my fortieth birthday. Alan: Cheer up! Life begins at forty. For Pete, life began at forty, because by that time he had enough financial security to enjoy himself now and then, rather than having to work all the time."
        },
        {
            "id": 118,
            "phrase": "life in the fast lane",
            "definition": "a very active or possible risky way to live.  Life in the fast lane is too much for me."
        },
        {
            "id": 119,
            "phrase": "Life is just a bowl of cherries.",
            "definition": "Prov. Everything is going well.; Life is carefree. (Often used ironically, as in the second example.) _ The real estate salesman tried to convince us that life in the suburbs is just a bowl of cherries.  Jill: Hi, Jane. How are you? Jane: Oh, my alarm clock didn’t go off this morning, and then my car wouldn’t start, and I missed the bus and got to work late, and I just found out my rent’s going up fifty dollars a month. Life is just a bowl of cherries."
        },
        {
            "id": 120,
            "phrase": "Life is short and time is swift.",
            "definition": "Prov. You should enjoy life as much as possible, because it does not last very long.  Jill: Want to go to the movies with me? Jane: Oh, I don’t know; I should probably stay at work and finish a few things. Jill: Come on, Jane, life is short and time is swift."
        },
        {
            "id": 121,
            "phrase": "Life is too short.",
            "definition": "Life is short and there is no point in wasting it on things like worry, hatred, vengeance, etc.  I am not going to spend any more time trying to get even with Wally. Life’s too short.  It’s a waste of time worrying about money. Life is too short for that."
        },
        {
            "id": 122,
            "phrase": "Life isn’t all beer and skittles.",
            "definition": "Prov. Life is not pleasurable all the time; you cannot always be having fun. (Skittles is a game like bowling.) _ I don’t really mind going back to work when my vacation is over. Life isn’t all beer and skittles, and I enjoy my fun that much more because I have work to compare it to. When George’s parents stopped supporting him, George suddenly discovered that life isn’t all beer and skittles."
        },
        {
            "id": 123,
            "phrase": "the life of the party",
            "definition": "a person who is lively and helps make a party fun and exciting.  Bill is always the life of the party. Be sure to invite him.  Bob isn’t exactly the life of the party, but he’s polite."
        },
        {
            "id": 124,
            "phrase": "Life’s been good (to me).",
            "definition": "I am grateful that I am doing well in life.  I can’t complain. Life’s been good to me.  I am doing fine. Life’s been good."
        },
        {
            "id": 125,
            "phrase": "lift off",
            "definition": "[for a plane or rocket] to move upward, leaving the ground.  The rocket lifted off exactly on time."
        },
        {
            "id": 126,
            "phrase": "lift someone or something down† (from something)",
            "definition": "to move someone or something down (from something or some place) by lifting and carrying.  Would you please lift Jimmy down from the top bunk? _ Frank lifted down the heavy box."
        },
        {
            "id": 127,
            "phrase": "lift someone or something up†",
            "definition": "to raise someone or something.  I helped lift him up and put him on the stretcher.  Please lift up Tommy."
        },
        {
            "id": 128,
            "phrase": "lift something from someone or something",
            "definition": "to raise something off someone or something.  Please lift this burden from me.  I lifted the glass from the tray carefully."
        },
        {
            "id": 129,
            "phrase": "lift up",
            "definition": "to raise up.  Suddenly, the top of the box lifted up and a hand reached out. Bill’s hand lifted up and fell back again."
        },
        {
            "id": 130,
            "phrase": "light out (of some place) (for some place)",
            "definition": "to leave a place in a great hurry for some place.  I lit out of there for home as fast as I could.  I lit out of there as fast as I could go."
        },
        {
            "id": 131,
            "phrase": "A light purse makes a heavy heart.",
            "definition": "Prov. If you do not have enough money, you will worry and be unhappy.  Nathan is a cheerful person by nature, but since he lost his job, worry has made him glum. A light purse makes a heavy heart."
        },
        {
            "id": 132,
            "phrase": "light someone or something up†",
            "definition": "to shine lights on someone or something. We lit Fred up with the headlights of the car.  Light up the stage and let’s rehearse."
        },
        {
            "id": 133,
            "phrase": "light something up†",
            "definition": "1. to light a fire, a gas burner, etc.  I lit the kindling up and soon the fire was going.  You light up the stove and get dinner going. 2. to light something to smoke, such as a cigarette, pipe, etc.  She lit the cigarette up and took in a great breath of the smoke.  She lit up a cigarette."
        },
        {
            "id": 134,
            "phrase": "light something with something",
            "definition": "1. to set something afire with something else. Kelly lit the fire with her last match.  I will light the fire with a cigarette lighter. 2. to illuminate something using something.  She lit the room with a few candles.  We lit the Christmas tree with colored lights."
        },
        {
            "id": 135,
            "phrase": "light up",
            "definition": "1. to become brighter.  Suddenly, the sky lit up like day.  The room lit up as the fire suddenly came back to life. 2. [for someone] to become interested and responsive in something. We could tell from the way Sally lit up that she recognized the man in the picture. She lit up when we told her about our team’s success."
        },
        {
            "id": 136,
            "phrase": "light (up)on someone or something",
            "definition": "to land on someone or something; to settle on someone or something. (Upon is formal and less commonly used than on.) _ Three butterf lies lit on the baby, causing her to shriek with delight.  The bees lit on the clover blossom and pulled it to the ground. Her glance lit upon a dress in the store window."
        },
        {
            "id": 137,
            "phrase": "lighten something up†",
            "definition": "to make something lighter or brighter.  Some white paint will lighten this room up a lot.  The sunlight came in and lightened up the kitchen."
        },
        {
            "id": 138,
            "phrase": "lighten up",
            "definition": "to become lighter or brighter. We applied a new coat of white paint to the walls, and the room lightened up considerably.  The sky is beginning to lighten up a little."
        },
        {
            "id": 139,
            "phrase": "lighten up (on someone or something)",
            "definition": "to be less rough and demanding or rude with someone or something. Please lighten up on her. You are being very cruel.  You are too harsh. Lighten up."
        },
        {
            "id": 140,
            "phrase": "Lightning never strikes (the same place) twice.",
            "definition": "Prov. The same highly unlikely thing never happens to the same person twice. Jill: I’m scared to drive ever since that truck hit my car. Alan: Don’t worry. Lightning never strikes the same place twice. It’s strange, but I feel safer since my apartment was robbed; I figure lightning never strikes the same place twice."
        },
        {
            "id": 141,
            "phrase": "like a bat out of hell",
            "definition": "Inf. very fast or sudden. (Use caution with hell.) _ The cat took off like a bat out of hell.  The car pulled away from the curb like a bat out of hell."
        },
        {
            "id": 142,
            "phrase": "like a blind dog in a meat market",
            "definition": "Rur. out of control.  The drunk staggered out of the saloon like a blind dog in a meat market, stumbling all over the sidewalk.  The kids tore through the museum like a blind dog in a meat market, touching everything they weren’t supposed to touch."
        },
        {
            "id": 143,
            "phrase": "like a bump on a log",
            "definition": "completely inert. (Derogatory.) _ Don’t just sit there like a bump on a log; give me a hand! _ You can never tell what Julia thinks of something; she just stands there like a bump on a log."
        },
        {
            "id": 144,
            "phrase": "like a can of corn",
            "definition": "Rur. very easy.  Whipping up dinner for twelve is like a can of corn, as far as Jane is concerned.  The championship game was like a can of corn for our team. We won easily."
        },
        {
            "id": 145,
            "phrase": "like a fish out of water",
            "definition": "appearing to be completely out of place; in a very awkward manner. Bob stood there in his rented tuxedo, looking like a fish out of water.  Whenever I am with your friends, I feel like a fish out of water. What on earth do you see in them—or me?"
        },
        {
            "id": 146,
            "phrase": "like a kid with a new toy",
            "definition": "very pleased; happily playing with something. Every time Bill gets a new gadget for his kitchen, he’s like a kid with a new toy.  Jane is absorbed in that computer. Just like a kid with a new toy."
        },
        {
            "id": 147,
            "phrase": "like a million (dollars)",
            "definition": "very good or well. (Usually with verbs such as feel, look, run, etc.) _ This old buggy runs like a million dollars.  Man, I feel like a million.  Your new hairdo looks like a million dollars."
        },
        {
            "id": 148,
            "phrase": "like a three-ring circus",
            "definition": "chaotic; exciting and busy.  Our household is like a three-ring circus on Monday mornings.  This meeting is like a three-ring circus. Quiet down and listen!"
        },
        {
            "id": 149,
            "phrase": "*like a ton of bricks",
            "definition": "Inf. like a great weight or burden. (*Typically: fall ~; hit ~; hit someone ~.) _Suddenly, the truth hit me like a ton of bricks.  The sudden tax increase hit like a ton of bricks. Everyone became angry."
        },
        {
            "id": 150,
            "phrase": "(like) an open book",
            "definition": "[of someone or something] easy to understand.  Jane’s an open book. I always know what she is going to do next.  The committee’s intentions are an open book. They want to save money."
        },
        {
            "id": 151,
            "phrase": "Like breeds like.",
            "definition": "Prov. People tend to raise children who are like them; something tends to give rise to things that resemble it. Jill: I think Fred’s little boy is going to be just as disagreeable as Fred. Jane: That’s no surprise. Like breeds like."
        },
        {
            "id": 152,
            "phrase": "*like death warmed over",
            "definition": "very ill; appearing very sickly. (*Typically: feel ~; look ~.) _ Oh dear, I feel like death warmed over.  Poor Carol said you look like death warmed over."
        },
        {
            "id": 153,
            "phrase": "like father, like son",
            "definition": "Prov. Fathers and sons resemble each other, and sons tend to do what their fathers did before them.  Jill: George’s father smoked all the time, and now George is smoking excessively, too. Jane: Like father, like son, eh? _ I think my son will grow up tall, just like his father. Like father, like son."
        },
        {
            "id": 154,
            "phrase": "like fighting snakes",
            "definition": "Rur. chaotic; challenging. (As if every time one snake is subdued, another one attacks.) _ It’s like fighting snakes to get anything done at this time of year.  Arguing with you is like fighting snakes."
        },
        {
            "id": 155,
            "phrase": "like flies to manure",
            "definition": "Rur. eagerly gathering in large numbers. (Has unpleasant connotations because of the reference to manure.) _Look at all them folks going to the freak show like f lies to manure.  The reporters hovered around the movie star like f lies to manure."
        },
        {
            "id": 156,
            "phrase": "like gangbusters",
            "definition": "with great excitement and speed. (From the phrase “Come on like gangbusters,” a radio show that “came on” with lots of noise and excitement.) _She works like gangbusters and gets the job done. They are selling tickets like gangbusters."
        },
        {
            "id": 157,
            "phrase": "like greased lightning",
            "definition": "Rur. very fast.  Once I get her tuned up, this old car will go like greased lightning.  He’s a fat kid, but he can run like greased lightning."
        },
        {
            "id": 158,
            "phrase": "like hell and high lightning",
            "definition": "Rur. very fast. The snowmobiles came zooming down the trail like hell and high lightning.  The powerboat sped up the river like hell and high lightning."
        },
        {
            "id": 159,
            "phrase": "like herding frogs",
            "definition": "Rur. chaotic; disorderly. (On the image of trying to direct frogs, which will jump any which way.) _ Trying to get those kids to march into the auditorium is like herding frogs. Trying to get everybody to cooperate is like herding frogs."
        },
        {
            "id": 160,
            "phrase": "Like it or lump it!",
            "definition": "Inf. There is no other choice. Take that or none.  John: I don’t like this room. It’s too small. Bill: Like it or lump it. That’s all we’ve got.  Jane: I don’t want to be talked to like that. Sue: Well, like it or lump it! That’s the way we talk around here."
        },
        {
            "id": 161,
            "phrase": "Like it’s such a big deal!",
            "definition": "Inf. It really isn’t all that important! (Sarcastic.) _ So I dropped the glass. Like it’s such a big deal.  Like it’s such a big deal. Who cares?"
        },
        {
            "id": 162,
            "phrase": "like it was going out of style",
            "definition": "rapidly or frequently. I’m worried about Sally. She’s taking aspirin like it’s going out of style.  The kids have been eating sweet corn like it was going out of style."
        },
        {
            "id": 163,
            "phrase": "like looking for a needle in a haystack",
            "definition": "engaged in a hopeless search.  Trying to find a white glove in the snow is like looking for a needle in a haystack.  I tried to find my lost contact lens on the beach, but it was like looking for a needle in a haystack."
        },
        {
            "id": 164,
            "phrase": "Like mother, like daughter.",
            "definition": "Prov. Daughters resemble their mothers.; Daughters tend to do what their mothers did before them. My mother loved sweets, and every time my father saw me with a cookie in my hand, he would sigh, “Like mother, like daughter.” _ Jill: Gina’s beautiful. Jane: Like mother, like daughter; her mother’s gorgeous, too."
        },
        {
            "id": 165,
            "phrase": "like nobody’s business",
            "definition": "Inf. very well; very much. She can sing like nobody’s business. What a set of pipes! _ My mom can cook chocolate chip cookies like nobody’s business."
        },
        {
            "id": 166,
            "phrase": "like nothing on earth",
            "definition": "1. Fig. very untidy or very unattractive. Joan arrived at the office looking like nothing on earth. She had fallen in the mud.  Alice was like nothing on earth in that electric yellow dress. 2. Fig. very unusual; very distinctive. The new car models look like nothing on earth this year.  This cake is so good! It’s like nothing on earth!"
        },
        {
            "id": 167,
            "phrase": "like one of the family",
            "definition": "as if someone (or a pet) were a member of one’s family. We treat our dog like one of the family.  We are very happy to have you stay with us, Bill. I hope you don’t mind if we treat you like one of the family."
        },
        {
            "id": 168,
            "phrase": "like pigs to the slaughter",
            "definition": "Rur. obediently and in large numbers. Look at all the people lining up to mail their tax forms on time, like pigs to the slaughter."
        },
        {
            "id": 169,
            "phrase": "like stealing acorns from a blind pig",
            "definition": "Rur. very easy. Getting Mary to sign the house over to me was like stealing acorns from a blind pig.  Tom: Was it hard to fool so many people? Charlie: Nope. It was like stealing acorns from a blind pig."
        },
        {
            "id": 170,
            "phrase": "*like stink",
            "definition": "Inf. rapidly. (As fast as a smell spreads. *Typically: go ~; move ~; run ~; swim ~.) _ Those kids moved through the whole test like stink. Real eagerbeavers.  The wood chipper went through the brush like stink and turned it into a small pile in minutes."
        },
        {
            "id": 171,
            "phrase": "*like the wind",
            "definition": "very fast; as fast and easy as the wind. (*Typically: go ~; move ~; run ~.) _ Emily’s sleek new bicycle can really go like the wind.  The racehorse ran like the wind, beating its nearest opponent by several lengths."
        },
        {
            "id": 172,
            "phrase": "like to hear oneself talk",
            "definition": "[for someone] to enjoy one’s own talking more than people enjoy listening to it.  I guess I don’t really have anything to say. I just like to hear myself talk, I guess.  There he goes again. He just likes to hear himself talk."
        },
        {
            "id": 173,
            "phrase": "like tryin’ to scratch your ear with your elbow",
            "definition": "Rur. impossible. Getting those kids to settle down is like tryin’ to scratch your ear with your elbow.  Fixing all the leaks in that old roof is like tryin’ to scratch your ear with your elbow."
        },
        {
            "id": 174,
            "phrase": "like (two) peas in a pod",
            "definition": "Cliché very close or intimate. (Compare this with as alike as (two) peas in a pod.) _ Yes, they’re close. Like two peas in a pod.  They’re always together. Like peas in a pod."
        },
        {
            "id": 175,
            "phrase": "like water off a duck’s back",
            "definition": "easily; without any apparent effect.  Insults rolled off John like water off a duck’s back.  The bullets had no effect on the steel door. They fell away like water off a duck’s back."
        },
        {
            "id": 176,
            "phrase": "like, you know",
            "definition": "Inf. a combining of the (essentially meaningless) expressions like and you know. (Never used in formal writing.) _She is, well, like, you know, uncool. This is, well, like, you know, too much!"
        },
        {
            "id": 177,
            "phrase": "*likely as not",
            "definition": "probably; with an even chance either way. (*Also: as ~.) _ He will as likely as not arrive without warning.  Likely as not, the game will be canceled."
        },
        {
            "id": 178,
            "phrase": "liken someone or something to someone or something",
            "definition": "to compare someone or something to someone or something, concentrating on the similarities.  He is strange. I can only liken him to an eccentric millionaire.  The poet likened James to a living statue of Mercury."
        },
        {
            "id": 179,
            "phrase": "the likes of someone or something",
            "definition": "someone or something similar to that person or thing; the equal or equals of someone or something.  I never want to see the likes of you again! _ We admired the splendid old ships, the likes of which will never be built again."
        },
        {
            "id": 180,
            "phrase": "Likewise(, I’m sure).",
            "definition": "The same from my point of view. (A hackneyed phrase said in greeting someone. See examples.) _ Alice: I’m delighted to make your acquaintance. Bob: Likewise, I’m sure. John: How nice to see you! Sue: Likewise. John: Where are you from, Sue?"
        },
        {
            "id": 181,
            "phrase": "limber someone or something up†",
            "definition": "to make someone or something more flexible or loose. Let me give you a massage; that will limber you up. I need to limber up my arms."
        },
        {
            "id": 182,
            "phrase": "limit someone to something",
            "definition": "1. to restrict someone to a certain amount or number of something.  I will have to limit you to two helpings of mashed potatoes.  I limit myself to cola drinks only. 2. to restrict someone to a certain area.  Please try to limit your children to your own yard.  They limited themselves to the north side of town."
        },
        {
            "id": 183,
            "phrase": "limit something to something",
            "definition": "to restrict something to a limited set, a certain amount, or a specific number of something. Please limit your comments to five minutes. Can you limit your remarks to the subject at hand?"
        },
        {
            "id": 184,
            "phrase": "the line of least resistance",
            "definition": "the course of action that will cause least trouble or effort.  Jane won’t stand up for her rights. She always takes the line of least resistance.  Joan never states her point of view. She takes the line of least resistance and agrees with everyone else."
        },
        {
            "id": 185,
            "phrase": "*a line on someone or something",
            "definition": "an idea on how to locate someone or something; an idea for finding someone who can help with someone or something. (*Typically: get ~; have ~; give someone ~.) _ I got a line on a book that might help explain what you want to know.  Sally has a line on someone who could help you fix up your apartment."
        },
        {
            "id": 186,
            "phrase": "line one’s own pocket(s)",
            "definition": "to make money for oneself in a greedy or dishonest fashion. They are interested in lining their pockets first and serving the people second.  You can’t blame them for wanting to line their own pockets."
        },
        {
            "id": 187,
            "phrase": "line someone or something up†",
            "definition": "to put people or things in line.  Line everyone up and march them onstage.  Line up the kids, please. Please line these books up. Hey, you guys! Line yourselves up!"
        },
        {
            "id": 188,
            "phrase": "line someone or something up† against something",
            "definition": "to put people or things into a row in front of or against something. We lined everyone up against the wall for the photograph.  Please line up everyone against the wall."
        },
        {
            "id": 189,
            "phrase": "line someone or something up† behind someone or something",
            "definition": "to put people or things into a line behind someone or something.  Please line all the children up behind the tallest child.  Line up everyone behind the curtain."
        },
        {
            "id": 190,
            "phrase": "line someone or something up† (in something)",
            "definition": "to put people or things into some kind of formation, such as a row, column, ranks, etc. The teacher lined the children up in two rows.  Please line up the children in a row."
        },
        {
            "id": 191,
            "phrase": "line someone or something up† on something",
            "definition": "to place people or things into a line oriented on one or more things.  Line them all up on the edge of the grass.  Line up the children on the white line."
        },
        {
            "id": 192,
            "phrase": "line someone or something up† with someone or something",
            "definition": "to place people or things into a line with other people or things.  Line Fred up with the others.  Line up these books with the others. Please line yourselves up with the others."
        },
        {
            "id": 193,
            "phrase": "line someone or something up† with something",
            "definition": "to position someone or something (or a group) in reference to other things.  Please line the chairs up with the f loor tiles.  Line up this brick with the bricks below and at both sides. That’s the way you lay bricks."
        },
        {
            "id": 194,
            "phrase": "line someone up† behind someone or something",
            "definition": "to organize people in support of someone or something.  I will see if I can line a few supporters up behind our candidate.  I can line up everyone behind you."
        },
        {
            "id": 195,
            "phrase": "line someone up† (for something)",
            "definition": "to schedule someone for something; to arrange for someone to do or be something.  I lined gardeners up for the summer work on the gardens. I lined up four of my best friends to serve as ushers at my wedding."
        },
        {
            "id": 196,
            "phrase": "line something with something",
            "definition": "to place a layer of something over the inside surface of something. You should line the drawers with clean paper before you use them.  I want to line this jacket with new material."
        },
        {
            "id": 197,
            "phrase": "line up",
            "definition": "to form a line; to get into a line. All right, everyone, line up!"
        },
        {
            "id": 198,
            "phrase": "line up against someone or something",
            "definition": "to organize against someone or something.  Our people lined up against the candidate and defeated her soundly.  We will line up against the opposing party as we did during the last election."
        },
        {
            "id": 199,
            "phrase": "line up alongside someone or something",
            "definition": "to form or get into a line beside someone or something.  Can you line up alongside the other people? _Line up alongside the wall and get ready to be photographed."
        },
        {
            "id": 200,
            "phrase": "line up for something",
            "definition": "to form or get into a line and wait for something.  Everyone lined up for a helping of birthday cake.  Let’s line up for dinner. The doors to the dining room will open at any minute."
        },
        {
            "id": 201,
            "phrase": "line up in(to) something",
            "definition": "to form or get into a line, row, rank, column, etc.  Please line up in three columns.  I wish you would all line up into a nice straight line."
        },
        {
            "id": 202,
            "phrase": "line up on something",
            "definition": "to form a line oriented on something.  Line up on the white line painted on the pavement.  Please line up on the marks on the f loor."
        },
        {
            "id": 203,
            "phrase": "line up with someone",
            "definition": "to get into a line with someone.  Go over and line up with the others.  Would you please line up with the other students?"
        },
        {
            "id": 204,
            "phrase": "linger around",
            "definition": "to wait around; to be idle some place.  Don’t linger around. Get going! _All the students were lingering around, waiting until the last minute to go into the building."
        },
        {
            "id": 205,
            "phrase": "linger on",
            "definition": "to remain for a long time; to exist longer than would have been thought.  This cold of mine just keeps lingering on. Some of the guests lingered on for a long time after the party was over."
        },
        {
            "id": 206,
            "phrase": "linger on something",
            "definition": "to delay moving on to the next thing; to remain at something and not move on.  Don’t linger on that one problem so long.  I don’t want to waste a lot of time lingering on this question."
        },
        {
            "id": 207,
            "phrase": "linger over something",
            "definition": "1. to take too much time or idle over something, such as a meal, a cup of coffee, etc.  I could linger over coffee all morning, given the chance.  Don’t linger over your soup. It will get cold. 2. to dawdle over the doing of something. You shouldn’t linger over eating your dinner. It would be best not to linger over making up your mind."
        },
        {
            "id": 208,
            "phrase": "link someone or something up† (to something)",
            "definition": "to connect someone or something to something, usually with something that has a type of fastener or connector that constitutes a link.  They promised that they would link me up to the network today.  They will link up my computer to the network today."
        },
        {
            "id": 209,
            "phrase": "the lion’s share of something)",
            "definition": "the largest portion of something. I earn a lot, but the lion’s share goes for taxes.  The lion’s share of the surplus cheese goes to school cafeterias."
        },
        {
            "id": 210,
            "phrase": "liquor someone up†",
            "definition": "to get someone tipsy or drunk.  He liquored her up and tried to take her home with him.  They liquored up the out-of-town visitors."
        },
        {
            "id": 211,
            "phrase": "liquor up",
            "definition": "to drink an alcoholic beverage, especially to excess. Sam sat around all evening liquoring up. They seem to liquor up almost every night of the week."
        },
        {
            "id": 212,
            "phrase": "list someone as something",
            "definition": "to categorize someone as something, usually in a written list.  I will list you as a contributor to the Preservation Fund, if you don’t mind.  Although she was not registered as such, she listed herself as a stockbroker."
        },
        {
            "id": 213,
            "phrase": "list someone or something among something",
            "definition": "to include someone or something in a particular category.  I list George among the all-time greats.  I have to list the budget committee as the most efficient ever."
        },
        {
            "id": 214,
            "phrase": "list someone or something off†",
            "definition": "to recite a list of people or things, one by one. She listed everyone off in order without having to look at her notes.  She listed off the names of the people who are always late.  Dale listed each one off."
        },
        {
            "id": 215,
            "phrase": "list to a direction",
            "definition": "to lean to one side or another; to lean toward a specific direction. (Usually of ships or boats.) _ The ship had listed to one side since being struck by the speedboat.  The huge ship listed a tiny bit to starboard."
        },
        {
            "id": 216,
            "phrase": "listen for someone or something",
            "definition": "to try to hear someone or something.  I will have to let you in the front door if you come home late. I will listen for you.  I am listening for the telephone."
        },
        {
            "id": 217,
            "phrase": "listen in (on someone or something)",
            "definition": "1. to join someone or a group as a listener. The band is rehearsing. Let’s go listen in on them.  It won’t hurt to listen in, will it? 2. to eavesdrop on someone.  Please don’t try to listen in on us. This is a private conversation.  I am not listening in. I was here first. You are talking too loud."
        },
        {
            "id": 218,
            "phrase": "listen to reason",
            "definition": "to yield to a reasonable argument; to take the reasonable course.  Please listen to reason, and don’t do something you’ll regret.  She got into trouble because she wouldn’t listen to reason."
        },
        {
            "id": 219,
            "phrase": "listen to someone or something",
            "definition": "1. to pay attention to and hear someone or something.  Listen to me! Hear what I have to say! _ I want to listen to his speech. 2. to heed someone, orders, or advice.  Listen to me! Do what I tell you! _ You really should listen to his advice."
        },
        {
            "id": 220,
            "phrase": "listen up",
            "definition": "to listen carefully. (Usually a command.) _Now, listen up! This is important.  Listen up, you guys!"
        },
        {
            "id": 221,
            "phrase": "litmus test",
            "definition": "a test used to determine the acidity or alkalinity of chemical substances. (Acid turns litmus paper red and alkaline compounds turn it blue.) _ I used a litmus test to show that the compound was slightly acid."
        },
        {
            "id": 222,
            "phrase": "litter something up†",
            "definition": "to mess something up with litter, trash, possessions, etc.  Who littered this room up? _ Who littered up this room?"
        },
        {
            "id": 223,
            "phrase": "Little and often fills the purse.",
            "definition": "Prov. If you get a little bit of money frequently, you will always have enough. Jill: I don’t think I’ll ever be able to save very much; I can only afford to save such a little bit of money from every paycheck. Jane: Ah, but little and often fills the purse."
        },
        {
            "id": 224,
            "phrase": "A little bird told me.",
            "definition": "a way of indicating that you do not want to reveal who told you something. (Sometimes used playfully, when you think that the person you are addressing knows or can guess who was the source of your information.) _Jill: Thank you for the beautiful pre- sent! How did you know I wanted a green silk scarf ? Jane: A little bird told me.  Bill: How did you find out it was my birthday? Jane: A little bird told me."
        },
        {
            "id": 225,
            "phrase": "a little bit (of something)",
            "definition": "a small amount; some.  Can I have a little bit of candy? _I need a little bit of time to finish this essay."
        },
        {
            "id": 226,
            "phrase": "little bitty",
            "definition": "very little.  Can I have just a little bitty piece of that lemon meringue pie? _He was just a little bitty boy."
        },
        {
            "id": 227,
            "phrase": "little by little",
            "definition": "gradually, a little bit at a time.  I earned enough money, little by little, to buy a car. Jimmy crawled, little by little, until he reached the door."
        },
        {
            "id": 228,
            "phrase": "(a little) new to (all) this",
            "definition": "an apologetic way of saying that one is experiencing something new or participating in something new. I’m sorry I’m slow. I’m a little new to all this.  She’s new to this. She needs practice."
        },
        {
            "id": 229,
            "phrase": "a (little) nip in the air",
            "definition": "a cold feeling; cold weather.  I felt a little nip in the air when I opened the window.  There’s more of a nip in the air as winter approaches."
        },
        {
            "id": 230,
            "phrase": "little old someone or something",
            "definition": "ordinary; harmless. (Said to downplay or minimize the importance of something.) _ Aw, honey, I wasn’t gambling. I just went to one little old poker game.  Charlie: Did you eat that whole chocolate cake that I was saving for the party? Jane: Little old me?"
        },
        {
            "id": 231,
            "phrase": "Little pitchers have big ears.",
            "definition": "Prov. Children like to listen to adult conversations and can understand a lot of what they hear. (Used to warn another adult not to talk about something because there is a child present.) _ I started to tell Mary about the date I had on Saturday, but she interrupted me, saying, “Little pitchers have big ears,” and looked pointedly at her six-year-old daughter, who was in the room with us."
        },
        {
            "id": 232,
            "phrase": "little shaver",
            "definition": "Rur. a child; a baby. I think the little shaver needs her diaper changed. Tom thinks his grandson is the cutest little shaver there ever was."
        },
        {
            "id": 233,
            "phrase": "a (little) short on one end",
            "definition": "Rur. short.  You’ll recognize Bill right away. He’s got red hair, and he’s a little short on one end.  He’s not small; he’s just short on one end.  The barber cut my hair a little short on one end."
        },
        {
            "id": 234,
            "phrase": "Little strokes fell great oaks.",
            "definition": "Prov. You can complete a large, intimidating task by steadily doing small parts of it.  Jill: How can I possibly write a fifty-page report in two months? Jane: Just write a little bit every day. Little strokes fell great oaks."
        },
        {
            "id": 235,
            "phrase": "Little thieves are hanged, but great ones escape.",
            "definition": "Prov. Truly expert criminals are never caught.  Everyone’s making such a fuss because they convicted that bank robber, but he must not have been a very dangerous criminal. Little thieves are hanged, but great ones escape."
        },
        {
            "id": 236,
            "phrase": "a little white lie",
            "definition": "a small, usually harmless lie; a fib.  Every little white lie you tell is still a lie and it is still meant to mislead people."
        },
        {
            "id": 237,
            "phrase": "live a life of something",
            "definition": "to have a life of a certain quality or style.  The movie star lived a life of luxury.  After Anne won the lottery, she lived the life of a queen."
        },
        {
            "id": 238,
            "phrase": "live among someone",
            "definition": "to live in a community with someone or a community made up of certain people.  The anthropologist lived among the small tribe for two years.  They lived among the Jivaro Indians for a brief period."
        },
        {
            "id": 239,
            "phrase": "live and learn",
            "definition": "Cliché to increase one’s knowledge by experience. (Usually said when one is surprised to learn something.) _ I didn’t know that snakes could swim. Well, live and learn! _ John didn’t know he should water his houseplants a little extra in the dry winter months. When they all died, he said, “Live and learn.”"
        },
        {
            "id": 240,
            "phrase": "live and let live",
            "definition": "Cliché not to interfere with other people’s business or preferences.  I don’t care what they do! Live and let live, I always say.  Your parents are strict. Mine just live and let live."
        },
        {
            "id": 241,
            "phrase": "live apart (from someone)",
            "definition": "to live separated from a person whom one might be expected to live with. John lives apart from his wife, who has a job in another city. He lives apart, but they are still married."
        },
        {
            "id": 242,
            "phrase": "live beyond one’s means",
            "definition": "to spend more money than one can afford.  The Browns are deeply in debt because they are living beyond their means.  I keep a budget so that I don’t live beyond my means."
        },
        {
            "id": 243,
            "phrase": "live by one’s wits",
            "definition": "to survive by being clever.  When you’re in the kind of business I’m in, you have to live by your wits.  John was orphaned at the age of ten and grew up living by his wits."
        },
        {
            "id": 244,
            "phrase": "live by something",
            "definition": "1. to live near something.  We live by a lovely park that is filled with children in the summer.  I would love to live by the sea. 2. to survive by doing or using something in particular.  She lives by her own skill and hard work.  We live by the skills that we have—and hard work, of course."
        },
        {
            "id": 245,
            "phrase": "Live by the sword, die by the sword.",
            "definition": "Prov. If you use violence against other people, you can expect to have violence used against you.; You can expect to become a victim of whatever means you use to get what you want. (Biblical.) _ The gang leader who organized so many murders was eventually murdered himself. Live by the sword, die by the sword.  Bill liked to spread damaging gossip about other people, until he lost all his friends because of some gossip that was spread about him. Live by the sword, die by the sword."
        },
        {
            "id": 246,
            "phrase": "live for someone or something",
            "definition": "1. to exist for the benefit of someone or something.  She just lives for her children.  Roger lives for his work. 2. to exist to enjoy someone or something.  She lives for her vacations in Acapulco."
        },
        {
            "id": 247,
            "phrase": "live for the moment",
            "definition": "to live only for the pleasures of the present time without planning for the future.  You need to make plans for your future. You cannot live just for the moment! _ He lives only for the moment."
        },
        {
            "id": 248,
            "phrase": "live from day to day",
            "definition": "to survive on limited means one day at a time with no plans or possibilities for the future.  The Simpsons just live from day to day. They never plan for the future.  I can’t live from day to day. I have to provide for the future."
        },
        {
            "id": 249,
            "phrase": "live from hand to mouth",
            "definition": "to live in poor circumstances. When both my parents were out of work, we lived from hand to mouth. We lived from hand to mouth during the war. Things were very difficult."
        }
    ]
}