{
    "dictionary": [
        {
            "id": 0,
            "phrase": "shank it",
            "definition": "Sl. to use one’s legs to get somewhere; to walk.  My car needs fixing so I had to shank it to work today.  I like to shank it every now and then."
        },
        {
            "id": 1,
            "phrase": "shank’s mare",
            "definition": "travel on foot. You’ll find that shank’s mare is the quickest way to get across town. Is there a bus, or do I have to use shank’s mare?"
        },
        {
            "id": 2,
            "phrase": "shape someone up†",
            "definition": "to get someone into good physical shape; to make someone behave or perform better. I’ve got to shape myself up to improve my health. The trainer was told that he’d have to shape up the boxer before the fight."
        },
        {
            "id": 3,
            "phrase": "shape up",
            "definition": "1. to improve; to reform.  I want to get things shaped up around here.  I guess I’d better shape up if I want to stay in school. 2. to assume a final form or structure.  The game plan for the election was beginning to shape up.  Her objectives began to shape up in her senior year."
        },
        {
            "id": 4,
            "phrase": "Shape up or ship out.",
            "definition": "Either improve one’s performance (or behavior) or leave. (Used as a command.) _ Okay, Tom. That’s the end. Shape up or ship out! _ John was late again, so I told him to shape up or ship out."
        },
        {
            "id": 5,
            "phrase": "share and share alike",
            "definition": "Cliché having or taking equal shares. I kept five and gave the other five to Mary—share and share alike.  The two roommates agreed that they would divide expenses—share and share alike."
        },
        {
            "id": 6,
            "phrase": "share someone’s pain",
            "definition": "to understand and sympathize with someone’s pain or emotional discomfort. (Said in order to sound sympathetic.) _I am sorry about the loss of your home. I share your pain. We sympathize about the loss of your mother. We share your pain."
        },
        {
            "id": 7,
            "phrase": "share someone’s sorrow",
            "definition": "to grieve as someone else grieves.  We all share your sorrow on this sad, sad day.  I am sorry to hear about the death in your family. I share your sorrow."
        },
        {
            "id": 8,
            "phrase": "a sharp tongue",
            "definition": "an outspoken or harsh manner; a critical manner of speaking.  He has quite a sharp tongue. Don’t be totally unnerved by what he says or the way he says it."
        },
        {
            "id": 9,
            "phrase": "a sharp wit",
            "definition": "a good and fast ability to make jokes and funny comments. Terry has a sharp wit and often makes cracks that force people to laugh aloud at inappropriate times."
        },
        {
            "id": 10,
            "phrase": "shell out (an amount of money)",
            "definition": "to spend a certain amount of money.  I’m not going to shell out $400 for that! _ Come on. You owe me. Shell out!"
        },
        {
            "id": 11,
            "phrase": "*a shellacking",
            "definition": "1. Fig. a physical beating. (*Typically: get ~; take ~; give someone ~.) _ The boxer took a shellacking and lost the fight. I got a shellacking when I broke the window. 2. Fig. a beating—as in sports. (*Typically: get ~; take ~; give someone ~.) _ Our team played well, but got a shellacking anyway.  I practiced my tennis game so I wouldn’t take a shellacking in the tournament."
        },
        {
            "id": 12,
            "phrase": "shift one’s ground",
            "definition": "to change one’s opinions or arguments, often without being challenged or opposed.  At first Jack and I were on opposite sides, but he suddenly shifted ground and started agreeing with me. Jim has very fixed views. You won’t find him shifting his ground."
        },
        {
            "id": 13,
            "phrase": "shine up to someone",
            "definition": "to try to gain someone’s favor by being extra nice.  John is a nice guy, except that he’s always trying to shine up to the professor.  Mary never tries to shine up to the manager."
        },
        {
            "id": 14,
            "phrase": "shipping and handling",
            "definition": "the costs of handling a product and transporting it to a customer.  Shipping and handling charges were included in the price.  The cost of the goods is low and shipping and handling added only a few dollars."
        },
        {
            "id": 15,
            "phrase": "ships that pass in the night",
            "definition": "Cliché people who meet each other briefly by chance, sometimes having a sexual liaison, and who are unlikely to meet again or have an ongoing relationship. Mary wanted to see Jim again, but to him, they were ships that passed in the night.  We will never be friends. We are just ships that passed in the night."
        },
        {
            "id": 16,
            "phrase": "shirk one’s duty",
            "definition": "to neglect one’s job or task.  The guard was fired for shirking his duty. You cannot expect to continue shirking your duty without someone noticing."
        },
        {
            "id": 17,
            "phrase": "Shit happens.",
            "definition": "Sl. Bad things just happen and are unavoidable. (Potentially offensive. Use only with discretion.) _ Too bad that your new car got dented, but shit happens.  Shit happens. There’s nothing that can be done about it."
        },
        {
            "id": 18,
            "phrase": "*the shock of one’s life",
            "definition": "a serious (emotional) shock. (*Typically: get ~; have ~; give one ~.) _ I opened the telegram and got the shock of my life.  I had the shock of my life when I won $5,000."
        },
        {
            "id": 19,
            "phrase": "The shoe is on the other foot.",
            "definition": "Prov. One is experiencing the same (often bad) things that one caused another person to experience. (Note the variations in the examples.) _ The teacher is taking a course in summer school and is finding out what it’s like when the shoe is on the other foot.  When the policeman was arrested, he learned what it was like to have the shoe on the other foot."
        },
        {
            "id": 20,
            "phrase": "shook up",
            "definition": "upset; shocked.  Relax, man! Don’t get shook up! _ I always get shook up when I see a bad accident."
        },
        {
            "id": 21,
            "phrase": "Shoot first, ask questions later.",
            "definition": "Prov. Assume that everyone you encounter is hostile to you.; Take action, even though you do not know enough to be sure if it is the right action.  If the foreman saw that one of the workers was working slowly, he didn’t stop to find out if the worker was sick or unhappy; he just fired him. He believed in shooting first and asking questions later."
        },
        {
            "id": 22,
            "phrase": "shoot for something",
            "definition": "to aim for or at something. (Usually in reference to basketball.) _ The center shot for the basket just before the end of the game. Wally shot for the basket but missed."
        },
        {
            "id": 23,
            "phrase": "shoot from the hip",
            "definition": "to fire a gun that is held at one’s side, beside one’s hip. (This increases one’s speed in firing a gun but is much less accurate.) _ When I lived at home on the farm, my father taught me to shoot from the hip.  I quickly shot the snake before it bit my horse. I’m glad I learned to shoot from the hip."
        },
        {
            "id": 24,
            "phrase": "shoot one’s mouth off†",
            "definition": "Inf. to boast or talk too much; to tell secrets.  Don’t pay any attention to Bob. He’s always shooting his mouth off.  Oh, Sally! Stop shooting off your mouth! You don’t know what you’re talking about."
        },
        {
            "id": 25,
            "phrase": "shoot one’s wad",
            "definition": "Sl. to spend all or nearly all one’s cash on hand. I shot my wad on junk food. I can’t afford a cab. I shot my wad at the restaurant."
        },
        {
            "id": 26,
            "phrase": "shoot oneself in the foot",
            "definition": "to cause oneself difficulty; to be the author of one’s own misfortune.  I am a master at shooting myself in the foot.  Again, he shot himself in the foot by saying too much to the press."
        },
        {
            "id": 27,
            "phrase": "shoot someone down in flames",
            "definition": "to ruin someone; to bring about someone’s downfall.  It was a bad idea, okay, but you didn’t have to shoot me down in flames at the meeting.  I didn’t mean to shoot you down in f lames."
        },
        {
            "id": 28,
            "phrase": "shoot someone or something (all) to hell",
            "definition": "to destroy someone or something with gunfire. (Use discretion with hell.) _ Fred shot the crook to hell with his machine gun.  The farm boys had shot the stop sign all to hell."
        },
        {
            "id": 29,
            "phrase": "shoot someone, something, or an animal down†",
            "definition": "to bring down someone, something, or an animal by gunfire.  Fred shot Mike down in the street.  They shot down the plane."
        },
        {
            "id": 30,
            "phrase": "shoot something down†",
            "definition": "to foil a plan through criticism; to counter an idea with criticism. (Based on shoot someone, something, or an animal down.) _He raised a good point, but the others shot him down almost immediately.  Liz shot down Jeff ’s best idea."
        },
        {
            "id": 31,
            "phrase": "shoot something out†",
            "definition": "1. to stick, throw, or thrust something outward.  The diamond shot bright shafts of light out when the sun fell on it.  The little girl shot out her tongue at the teacher. 2. to settle a matter by the use of guns.  Bill and the cowboy—with whom he had been arguing—went out in the street and shot it out."
        },
        {
            "id": 32,
            "phrase": "shoot the breeze",
            "definition": "to chat casually and without purpose.  We spent the entire afternoon just shooting the breeze.  It was good to shoot the breeze with you, Mary."
        },
        {
            "id": 33,
            "phrase": "shoot the cat",
            "definition": "Sl. to empty one’s stomach; to vomit.  I must have shot the cat a dozen times during the night.  Shooting the cat is no fun when you’re weak and dizzy."
        },
        {
            "id": 34,
            "phrase": "shoot the works",
            "definition": "1. to do everything; to use everything; to bet all one’s money.  Okay, let’s go out to dinner and shoot the works.  Don’t shoot the works! Save some for a cab. 2. Sl. to empty one’s stomach; to vomit.  Suddenly she turned sort of green, and I knew she was going to shoot the works.  After she shot the works, she looked fine—but I was sort of pale."
        },
        {
            "id": 35,
            "phrase": "shoot up",
            "definition": "Sl. to take drugs by injection.  Wallace was caught by the cops shooting up in the high school rest room."
        },
        {
            "id": 36,
            "phrase": "shop around (for something)",
            "definition": "to shop at different stores to find what you want at the best price.  I’ve been shopping around for a new car, but they are all priced too high.  You can find a bargain, but you’ll have to shop around."
        },
        {
            "id": 37,
            "phrase": "shopping list",
            "definition": "a list of things one needs to buy.  I made up a shopping list for groceries that we are out of.  Don’t forget to take the shopping list with you to the store."
        },
        {
            "id": 38,
            "phrase": "shore someone up†",
            "definition": "to (figuratively) prop up or support someone.  Mary’s solid character and personality helped shore her up during her recent problems with the law.  Everyone co-operated to shore up John when his mother died."
        },
        {
            "id": 39,
            "phrase": "shore something up†",
            "definition": "to prop up or support something.  The fence fell over, so we shored it up with more posts.  The storm weakened the foundation of our house, and we had to have workers shore up the house."
        },
        {
            "id": 40,
            "phrase": "short and sweet",
            "definition": "Cliché brief (and pleasant because of briefness).  That was a good sermon—short and sweet. I don’t care what you say, as long as you make it short and sweet."
        },
        {
            "id": 41,
            "phrase": "*the short end of the stick",
            "definition": "the smaller or less desirable part, rank, task, or amount. (*Typically: get ~; have ~; give someone ~; end up with ~.) _ Why do I always get the short end of the stick? I want my fair share! _She’s unhappy because she has the short end of the stick again."
        },
        {
            "id": 42,
            "phrase": "short for something",
            "definition": "[of a form] being a shortened form of a word or phrase. Photo is short for photograph. Dave is short for David."
        },
        {
            "id": 43,
            "phrase": "short of something",
            "definition": "not having enough of something.  I wanted to bake a cake, but I was short of eggs. Usually at the end of the month, I’m short of money."
        },
        {
            "id": 44,
            "phrase": "Short reckonings make long friends.",
            "definition": "Prov. If you borrow something from a friend, pay it back as soon as possible so that the two of you remain friendly.  Now that you’ve finished using Bert’s saw, take it right back to him. Short reckonings make long friends. (a) short shrift a brief period of consideration of a person’s ideas or explanations. They gave the reporter short shrift and got him out of the office.  My plan got short shrift from the board—a ten-minute presentation; they then voted it down."
        },
        {
            "id": 45,
            "phrase": "*short with someone",
            "definition": "abrupt and a little bit rude in speaking to a person. (*Typically: be ~; become ~; get ~.) _ Please don’t be short with me. I am doing the best that I can."
        },
        {
            "id": 46,
            "phrase": "a shot in the arm",
            "definition": "an injection of medicine. The doctor administered the antidote to the poison by a shot in the arm."
        },
        {
            "id": 47,
            "phrase": "a shot in the dark",
            "definition": "a very general attempt; a wild guess.  It was just a shot in the dark. I had no idea I was exactly correct.  Come on, try it. Even a shot in the dark may win."
        },
        {
            "id": 48,
            "phrase": "shot through with something",
            "definition": "containing something; interwoven, intermixed, or filled with something.  The rose was a lovely pink shot through with streaks of white.  John’s comments are often shot through with sarcasm."
        },
        {
            "id": 49,
            "phrase": "a shotgun wedding",
            "definition": "a forced wedding. (From imagery of the bride’s father having threatened the bridegroom with a shotgun to force him to marry the bride because he made her pregnant.) _ Mary was six months pregnant when she married Bill. It was a real shotgun wedding.  Bob would never have married Jane if she hadn’t been pregnant. Jane’s father saw to it that it was a shotgun wedding."
        },
        {
            "id": 50,
            "phrase": "should have stood in bed",
            "definition": "an expression used on a bad day, when one should have stayed in one’s bed.  What a horrible day! I should have stood in bed.  The minute I got up and heard the news this morning, I knew I should have stood in bed."
        },
        {
            "id": 51,
            "phrase": "shoulder to shoulder",
            "definition": "side by side; with a shared purpose.  The two armies fought shoulder to shoulder against the joint enemy.  The strikers said they would stand shoulder to shoulder against the management."
        },
        {
            "id": 52,
            "phrase": "shouldn’t happen to a dog",
            "definition": "an expression of something that is so bad that no creature deserves it.  Poor guy. That shouldn’t happen to a dog.  This cold I got shouldn’t happen to a dog."
        },
        {
            "id": 53,
            "phrase": "shout about someone or something",
            "definition": "1. to yell about someone or something.  Alice is shouting about Tom, the guy who stood her up.  What are you shouting about? 2. to show one’s pride or enthusiasm about someone or something. (Usually with the object shifted to the front of the sentence.) _That’s really something to shout about. She’s something to shout about."
        },
        {
            "id": 54,
            "phrase": "shout someone or something down†",
            "definition": "to overwhelm someone or something by shouting. Mary was trying to speak, but Sally shouted her down.  Ann brought up a very important suggestion, but Bob shouted it down.  The lecturer had to shout down the entire audience to be heard."
        },
        {
            "id": 55,
            "phrase": "shove one’s way somewhere",
            "definition": "to make a path through a crowd by pushing.  The impatient man shoved his way through the crowd.  The reporter shoved her way to the front of the crowd."
        },
        {
            "id": 56,
            "phrase": "shove someone around†",
            "definition": "to push someone around.  The bigger boys shoved him around easily because he is so small.  Karen shoved around the little kids until they got mad at her."
        },
        {
            "id": 57,
            "phrase": "show and tell",
            "definition": "a session where objects are presented and described. (Essentially a kindergarten or grade school activity, but often used figuratively.) _ It was a short lecture with lots of show and tell.  I can’t take another show and tell session."
        },
        {
            "id": 58,
            "phrase": "show good faith",
            "definition": "to demonstrate good intentions or good will.  I’m certain that you showed good faith when you signed the contract. Do you doubt that she is showing good faith?"
        },
        {
            "id": 59,
            "phrase": "a show of hands",
            "definition": "a display of raised hands [in a group of people] that can be counted for the purpose of votes or surveys. We were asked to vote for the candidates for captain by a show of hands. Jack wanted us to vote on paper, not by a show of hands, so that we could have a secret ballot."
        },
        {
            "id": 60,
            "phrase": "show off",
            "definition": "to do things in a way that is meant to attract attention. Please stop showing off! You embarrass me.  John is always showing off to his girlfriend."
        },
        {
            "id": 61,
            "phrase": "show one’s hand",
            "definition": "to reveal one’s intentions to someone. (From card games.) _ I don’t know whether Jim is intending to marry Jane or not. He’s not one to show his hand. If you want to get a raise, don’t show the boss your hand too soon."
        },
        {
            "id": 62,
            "phrase": "show one’s (true) colors",
            "definition": "to show what one is really like or what one is really thinking.  Whose side are you on, John? Come on. Show your colors. It’s hard to tell what Mary is thinking. She never shows her true colors."
        },
        {
            "id": 63,
            "phrase": "show signs of something",
            "definition": "to show hints or indications of something. I let the horse run at full speed until it began to show signs of tiring.  Sally is showing signs of going to sleep."
        },
        {
            "id": 64,
            "phrase": "show someone around (some place)",
            "definition": "to give someone a tour of a place.  I’m very glad you’ve come to work here. Let me show you around so you’ll know where things are.  Welcome to our town. As soon as you unpack, I’ll get someone to show you around."
        },
        {
            "id": 65,
            "phrase": "show someone one’s stuff",
            "definition": "to show someone how well one can do something.  We’ll audition Kate now. Okay, Kate, show us your stuff."
        },
        {
            "id": 66,
            "phrase": "show someone or something off†",
            "definition": "to display someone or something so that the best features are apparent.  Bill drove around all afternoon showing his new car off. Mrs. Williams was showing off her baby to the neighbors."
        },
        {
            "id": 67,
            "phrase": "show someone up†",
            "definition": "to make someone’s faults or shortcomings apparent.  John is always trying to show someone up to make himself look better. John’s excellent effort really showed up Bill, who didn’t try very hard at all."
        },
        {
            "id": 68,
            "phrase": "show someone up† as something",
            "definition": "to reveal that someone is really something (else). The investigation showed her up as a fraud.  The test showed up the candidate as unqualified."
        },
        {
            "id": 69,
            "phrase": "show something to good advantage",
            "definition": "to display the best features of something; to display something so that its best features are apparent.  Put the vase in the center of the table and show it to good advantage.  Having and using a large vocabulary shows your intelligence to good advantage."
        },
        {
            "id": 70,
            "phrase": "show up",
            "definition": "to appear; to arrive.  Where is John? I hope he shows up soon.  When will the bus show up? _ Weeds began to show up in the garden."
        },
        {
            "id": 71,
            "phrase": "shower someone or something with something",
            "definition": "to cover someone or something with cascades of something.  Mary’s friends showered her with gifts on her twenty-first birthday.  The guests showered the bride and groom with confetti and rice."
        },
        {
            "id": 72,
            "phrase": "a shrinking violet",
            "definition": "someone who is very shy and not assertive.  I am not exactly a shrinking violet, but I don’t have the guts to say what you said to her."
        },
        {
            "id": 73,
            "phrase": "shroud someone or something in something",
            "definition": "to wrap or conceal someone or something in something.  They shrouded Mr. Carlson in sailcloth and prepared him for burial at sea.  They shrouded the decision in a series of formalities."
        },
        {
            "id": 74,
            "phrase": "Shrouds have no pockets.",
            "definition": "Prov. You cannot take any material goods with you when you die.  You should use your money to enjoy yourself while you’re alive. Shrouds have no pockets."
        },
        {
            "id": 75,
            "phrase": "shuck something off†",
            "definition": "1. to take something off.  Tom shucked his jacket off and sat on the arm of the easy chair.  He shucked off his jacket. 2. to get rid of someone or something.  She shucked all her bad habits off.  Tom shucked off one girlfriend after another."
        },
        {
            "id": 76,
            "phrase": "shuffle off this mortal coil",
            "definition": "Euph. to die. (Often jocular or formal euphemism. Not often used in consoling someone.) _Cousin Fred shuff led off this mortal coil after suffering a heart attack.  When I shuff le off this mortal coil, I want to go out in style—bells, f lowers, and a long, boring funeral."
        },
        {
            "id": 77,
            "phrase": "shush (up)",
            "definition": "to be quiet.  Shush! I want to hear the weather.  Shush up and listen to the lecture."
        },
        {
            "id": 78,
            "phrase": "shut someone or something out†",
            "definition": "to exclude someone or something; to refuse entrance to someone or something.  We tried to get into the stadium, but they shut us out because there was no more room.  My parents shut out their children when they made important decisions."
        },
        {
            "id": 79,
            "phrase": "shut someone up†",
            "definition": "to silence someone.  Oh, shut yourself up! _ Will you please shut up that crying baby!"
        },
        {
            "id": 80,
            "phrase": "Shut up!",
            "definition": "Inf. Be quiet! (Impolite.) _ Bob: And another thing. Bill: Oh, shut up, Bob! _ Andy: Shut up! I’ve heard enough! Bob: But I have more to say! _ “Shut up! I can’t hear anything because of all your noise!” shouted the director."
        },
        {
            "id": 81,
            "phrase": "Shut up about it.",
            "definition": "Inf. Do not tell anyone about it. Bill: I heard that you had a little trouble with the police. Tom: Just shut up about it! Do you hear? _Andy: Didn’t you once appear in a movie? Alice: Shut up about it. No one has to know."
        },
        {
            "id": 82,
            "phrase": "shy away (from someone or something)",
            "definition": "to avoid someone or something.  The dog shies away from John since he kicked it.  I can understand why the dog would shy away."
        },
        {
            "id": 83,
            "phrase": "*sick (and tired) of someone or something",
            "definition": "tired of someone or something, especially something that one must do again and again or someone or something that one must deal with repeatedly. (*Typically: be ~; become ~; get ~; grow ~.) _I am sick and tired of cleaning up after you.  Mary was sick of being stuck in traffic."
        },
        {
            "id": 84,
            "phrase": "*sick as a dog",
            "definition": "Cliché very sick; sick and vomiting. (*Also: as ~.) _We’ve never been so ill. The whole family was sick as dogs.  Sally was as sick as a dog and couldn’t go to the party."
        },
        {
            "id": 85,
            "phrase": "*sick at heart",
            "definition": "distressed and depressed. (*Typically: be ~; become ~; make someone ~.) _I became sick at heart just looking at all the homeless children."
        },
        {
            "id": 86,
            "phrase": "sick in bed",
            "definition": "remaining in bed while (one is) ill.  Tom is sick in bed with the f lu.  He’s been sick in bed for nearly a week."
        },
        {
            "id": 87,
            "phrase": "sick to death (of someone or something)",
            "definition": "totally disgusted with someone or something.  I am sick to death of your constant bickering.  This reporting about the scandals in the government just has me sick to death."
        },
        {
            "id": 88,
            "phrase": "sick (up)",
            "definition": "Sl. to empty one’s stomach; to vomit.  I think I’m going to sick up. Isn’t there supposed to be a barf bag in one of these seat pockets? _ He’s got to sick, and there’s no air sickness bag. Help!"
        },
        {
            "id": 89,
            "phrase": "side against someone",
            "definition": "to be against someone; to take sides against someone.  I thought you were my friend! I never thought you would side against me! _The two brothers were always siding against their sister."
        },
        {
            "id": 90,
            "phrase": "side by side",
            "definition": "(of two or more people or things) lined up so their sides are adjacent. We walked side by side across the lawn."
        },
        {
            "id": 91,
            "phrase": "side with someone",
            "definition": "to join with someone; to take someone else’s part; to be on someone’s side.  Why is it that you always side with him when he and I argue? _ I never side with anybody. I form my own opinions."
        },
        {
            "id": 92,
            "phrase": "sidle away (from someone or something)",
            "definition": "to avoid someone or something by moving to the side; to ease away from someone or something.  The cowboy sidled away from the bar and drew his gun.  He sidled away and snuck out the door."
        },
        {
            "id": 93,
            "phrase": "sidle up (to someone or something)",
            "definition": "to move close to someone or something cautiously or furtively; to move closer to someone or something gradually.  Tex sidled up to Dolly and said howdy in a soft, shy voice.  Dolly sidled up and picked the cowboy’s pocket."
        },
        {
            "id": 94,
            "phrase": "sift something from something",
            "definition": "to remove something from something by sifting. Fran sifted all the impurities from the f lour before using it. Timmy sifted all the leaves from the sand in his sandbox."
        },
        {
            "id": 95,
            "phrase": "sift something through something",
            "definition": "to make something pass through something such as a sieve.  She sifted the powdered sugar through a strainer. Please sift the soil through this screen and watch for bits of pottery."
        },
        {
            "id": 96,
            "phrase": "sift through something",
            "definition": "to examine all parts of something.  The fire inspector sifted through the rubble, looking for clues to the start of the fire.  We sifted through all the papers in the old trunk, but we did not find what we were looking for."
        },
        {
            "id": 97,
            "phrase": "sigh about something",
            "definition": "to release a deep breath, indicating anxiety, distress, or relief about something.  What are you sighing about? _ She sighed about her illness and then shifted her thoughts to something else."
        },
        {
            "id": 98,
            "phrase": "sigh for someone",
            "definition": "to release a deep breath, indicating anxiety about one’s emotional attachment for someone.  Dave spent a lot of his time sighing for Laura, on whom he had a crush.  Laura has been sighing for some as-yetunnamed young man."
        },
        {
            "id": 99,
            "phrase": "a sight for sore eyes",
            "definition": "a welcome sight.  Oh, am I glad to see you here! You’re a sight for sore eyes.  I’m sure hungry. This meal is a sight for sore eyes."
        },
        {
            "id": 100,
            "phrase": "sign for someone",
            "definition": "to sign something, using one’s own signature in place of someone else’s signature; to sign something, using another person’s name, adding the phrase “by [one’s own name].” _ He’s not here. I will sign for him. Where do I sign? _ Who will sign for Mr. Wilson?"
        },
        {
            "id": 101,
            "phrase": "sign for something",
            "definition": "to sign a piece of paper indicating that one has received something.  Would you sign for this, please? _ Ted signed for the package and opened it up."
        },
        {
            "id": 102,
            "phrase": "sign in",
            "definition": "to indicate that one has arrived somewhere and at what time by signing a piece of paper or a list.  Please sign in so we will know you are here.  Did you remember to sign in this time?"
        },
        {
            "id": 103,
            "phrase": "a sign of the times",
            "definition": "something that signifies the situation evident in the current times.  Your neighbor’s unmowed grass is just a sign of the times. Nobody really cares any longer."
        },
        {
            "id": 104,
            "phrase": "sign off",
            "definition": "[for a broadcaster] to announce the end of programming for the day; [for an amateur radio operator] to announce the end of a transmission. Wally signed off and turned the transmitter off.  Channel 43 failed to sign off at the scheduled time last night."
        },
        {
            "id": 105,
            "phrase": "sign off on something",
            "definition": "to sign a paper, indicating that one has finished with something or agrees with the state of something. The publisher signed off on the book and sent it to be printed.  I refuse to sign off on this project until it is done correctly."
        },
        {
            "id": 106,
            "phrase": "sign on",
            "definition": "to announce the beginning of a broadcast transmission. The announcer signed on and then played “The Star-Spangled Banner.” _ We usually sign on at six in the morning."
        },
        {
            "id": 107,
            "phrase": "sign on the dotted line",
            "definition": "to indicate one’s agreement or assent by placing one’s signature on a special line provided for that purpose. (The line may be solid or dotted.) _ I agreed to the contract, but I haven’t signed on the dotted line yet. When you have signed on the dotted line, please give me a call."
        },
        {
            "id": 108,
            "phrase": "sign on (with someone or something) (as something)",
            "definition": "to join up with someone or something in a particular capacity by signing a contract or agreement.  I signed on with the captain of the Felicity Anne as first mate.  Roger signed on as manager for the new store."
        },
        {
            "id": 109,
            "phrase": "sign one’s own death warrant",
            "definition": "to do something (knowingly) that will most likely result in severe trouble. (As if one were ordering one’s own execution.) _ I wouldn’t ever gamble a large sum of money. That would be signing my own death warrant. The killer signed his own death warrant when he walked into the police station and gave himself up."
        },
        {
            "id": 110,
            "phrase": "sign out",
            "definition": "to indicate that one is leaving a place or going out temporarily by signing a piece of paper or a list.  I forgot to sign out when I left.  Please sign out every time you leave."
        },
        {
            "id": 111,
            "phrase": "sign someone in†",
            "definition": "to record that someone has arrived somewhere and at what time by recording the information on a paper or a list.  I will sign you in. What is your name? _ Do I have to sign in everyone?"
        },
        {
            "id": 112,
            "phrase": "sign someone on†",
            "definition": "to employ someone; to recruit someone as an employee. How many workers did the manager sign on? _ The construction company signed on ten new workers."
        },
        {
            "id": 113,
            "phrase": "sign someone up† (for something)",
            "definition": "to record the agreement of someone, including oneself, to participate in something.  Has anyone signed you up for the office picnic? _ Can you sign up Liz for the party?"
        },
        {
            "id": 114,
            "phrase": "sign someone up† (with someone or something)",
            "definition": "to record the agreement of someone to join someone, a group of people, or an organization. I want to sign George up with our softball team.  Tom signed up his friends with the agency."
        },
        {
            "id": 115,
            "phrase": "sign something away†",
            "definition": "to sign a paper in which one gives away one’s rights to something. Valerie signed her rights away.  She signed away her claim to the money."
        },
        {
            "id": 116,
            "phrase": "sign something for someone",
            "definition": "1. to sign one’s signature on a paper in place of someone else’s signature.  Would you please sign this for me? _ I can’t sign it right now. Would you sign it for me? 2. to sign a paper for another person, using that person’s name, adding the phrase “by [one’s own name].” _ When the delivery comes, will you please sign my name for me? _ I signed Ted’s name for him."
        },
        {
            "id": 117,
            "phrase": "sign something in†",
            "definition": "to record that something has been received at a particular time by recording the information on a paper or a list.  I have to sign this package in, then I will be right with you.  Should I sign in this shipment now?"
        },
        {
            "id": 118,
            "phrase": "sign something over† (to someone)",
            "definition": "to sign a paper granting the rights to or ownership of something to a specific person. Larry signed all the rights to his book over to the publisher.  He signed over all the rights to the publisher."
        },
        {
            "id": 119,
            "phrase": "sign up (for something)",
            "definition": "to record one’s agreement to participate in something. I want to sign up for guitar lessons.  We will sign up as soon as possible."
        },
        {
            "id": 120,
            "phrase": "sign (up) with someone or something",
            "definition": "to enter into an agreement with someone or a group.  I signed up with Tom and John to crew their ship in the regatta.  Did you sign with the office equipment supplier yet?"
        },
        {
            "id": 121,
            "phrase": "signal for someone",
            "definition": "to make a sign for someone to come. I signaled for the waiter and got the check. Ted signaled for the parking lot attendant."
        },
        {
            "id": 122,
            "phrase": "signal for something",
            "definition": "to make a sign that something should be done.  I caught the waiter’s eye and signaled for the check.  The director signaled for applause."
        },
        {
            "id": 123,
            "phrase": "signal (to) someone (to do something)",
            "definition": "[for someone] to give someone a command or instruction using a signal.  The traffic cop signaled me to stop. The state trooper signaled the driver to pull over to the side of the road."
        },
        {
            "id": 124,
            "phrase": "signed, sealed, and delivered",
            "definition": "formally and officially signed; [for a formal document to be] executed.  Here is the deed to the property—signed, sealed, and delivered.  I can’t begin work on this project until I have the contract signed, sealed, and delivered."
        },
        {
            "id": 125,
            "phrase": "Silence gives consent.",
            "definition": "Prov. If you do not object to what someone says or does, you can be assumed to agree with or condone it. Jill: What did Fred say when you told him we were thinking about leaving the office early? Jane: He didn’t say anything. Jill: Then he must not mind if we go. Silence gives consent."
        },
        {
            "id": 126,
            "phrase": "Silence is golden.",
            "definition": "Prov. Silence is often good or desirable.  Jerry has two teenage children who listen to music using their headphones all day. He knows that silence is golden.  Hush! Silence is golden."
        },
        {
            "id": 127,
            "phrase": "*silly as a goose",
            "definition": "very foolish. (*Also: as ~.) _ Edith is as silly as a goose. She thinks that reading aloud to her houseplants will help them grow. The ad in the newspaper said this lotion would make my hair grow back, but I’ve been using it for a whole month and my hair is still the same. Jane: You’re as silly as a goose! Do you believe everything you read in newspaper ads?"
        },
        {
            "id": 128,
            "phrase": "silt up",
            "definition": "[for a body of water] to become filled with silt.  The river moved too fast to silt up.  The lake silted up in a very few years."
        },
        {
            "id": 129,
            "phrase": "simmer down",
            "definition": "to decrease in intensity. (As boiling dies down when the heat is lowered or removed.) _ The hectic activity of the day finally simmered down.  When things simmer down in the fall, this is a much nicer place."
        },
        {
            "id": 130,
            "phrase": "sin against someone or something",
            "definition": "to offend or desecrate someone or something sacred or revered. The critic said that Walter sinned against the poet when he read the poem in a sarcastic manner.  I would say that Walter sinned against poetry, not just one poet."
        },
        {
            "id": 131,
            "phrase": "since time immemorial",
            "definition": "since a very long time ago. (Literally, since time before recorded history.) _ My hometown has had a big parade on the Fourth of July since time immemorial. Since time immemorial, the trees have blossomed each spring."
        },
        {
            "id": 132,
            "phrase": "Since when?",
            "definition": "Inf. When was that decided?; That’s news to me.; When was that done? _Tom: You’ve been assigned to the night shift. John: Since when? _ Jane: Fred is now the assistant manager. Pete: Since when? Jane: Since I appointed him, that’s when."
        },
        {
            "id": 133,
            "phrase": "sing along (with someone or something)",
            "definition": "to sing with someone or with the accompaniment of some instrument( s).  Harry played all the old songs and everybody sang along.  Let’s sing along with Mary. She knows some good songs."
        },
        {
            "id": 134,
            "phrase": "sing of someone or something",
            "definition": "to tell about or sing a song about someone or something.  The folksinger sang of Paul Bunyan.  They all sang of happier times in the past."
        },
        {
            "id": 135,
            "phrase": "sing out",
            "definition": "to sing louder.  Sing out, please. This is a very large hall.  The sopranos will have to sing out more."
        },
        {
            "id": 136,
            "phrase": "sing someone to sleep",
            "definition": "to sing softly and sweetly to someone until sleep comes. The mother sang her baby to sleep.  Please sing Timmy to sleep. He is very restless."
        },
        {
            "id": 137,
            "phrase": "sing something out†",
            "definition": "to sing or announce something loudly.  The teacher sang the names out loud and clear.  She sang out “The Star-Spangled Banner” in a loud voice."
        },
        {
            "id": 138,
            "phrase": "sing to someone or something",
            "definition": "to sing a song and direct it at someone or something.  The singer sang to a man in the front row, and he was very embarrassed by it. Claire sang to an older audience and put many of them to sleep."
        },
        {
            "id": 139,
            "phrase": "sing together",
            "definition": "[for people] to coordinate their singing.  Let’s sing together now. Everyone should watch the conductor and follow the beat.  You have to sing together if you want your words to be understood."
        },
        {
            "id": 140,
            "phrase": "single file",
            "definition": "a line of things or people, one person or one thing wide.  Please get into single file.  You have to march single file."
        },
        {
            "id": 141,
            "phrase": "single someone or something out† (for something)",
            "definition": "to choose or pick someone or something for something; to select an eligible person or thing for something.  The committee singled her out for a special award. We singled out Liz for special honors."
        },
        {
            "id": 142,
            "phrase": "sink back (into something)",
            "definition": "to lean back and relax in something, such as a soft chair.  I can’t wait to get home and sink back into my easy chair.  He sank back and went to sleep almost immediately."
        },
        {
            "id": 143,
            "phrase": "sink below something",
            "definition": "to descend below a certain level.  The boat sank below the surface of the water and was gone.  The temperature sank below the freezing mark again today."
        },
        {
            "id": 144,
            "phrase": "sink down",
            "definition": "to sink or submerge. The sun sank down and darkness spread across the land.  She sat in the chair and sank down, enjoying her moment of relaxation."
        },
        {
            "id": 145,
            "phrase": "sink in",
            "definition": "to sink, submerge, or descend into something.  How long will it take the water to sink in? _ It might take days for the oil to sink in, so you have time to clean it up."
        },
        {
            "id": 146,
            "phrase": "sink into despair",
            "definition": "to become depressed; to become completely discouraged.  After facing the hopelessness of the future, Jean Paul sank into despair.  Mary sank into despair upon learning of the death of her grandmother."
        },
        {
            "id": 147,
            "phrase": "sink into oblivion",
            "definition": "to fade into obscurity. She may be famous now, but in no time she will sink into oblivion.  In his final years, Wally Wilson sank into oblivion and just faded away."
        },
        {
            "id": 148,
            "phrase": "sink or swim",
            "definition": "to fail or succeed. (Alludes to the choices available to someone who has fallen into the water.) _ After I’ve studied and learned all I can, I have to take the test and sink or swim.  It’s too late to help John now. It’s sink or swim for him."
        },
        {
            "id": 149,
            "phrase": "sink to (doing) something",
            "definition": "to lower oneself to doing something bad or mean.  I never thought he would sink to doing that.  There is nothing that Max wouldn’t sink to."
        },
        {
            "id": 150,
            "phrase": "sink under (something)",
            "definition": "to submerge.  The small boat turned over and sank under the surface.  It sank under and went straight to the bottom."
        },
        {
            "id": 151,
            "phrase": "*a sinking feeling",
            "definition": "the feeling that everything is going wrong; a bad feeling in the base of one’s stomach. (*Typically: get ~; have ~; give someone ~.) _I get a sinking feeling whenever I think of the night of the accident."
        },
        {
            "id": 152,
            "phrase": "siphon something off† (from something)",
            "definition": "to suck or draw a liquid off from something.  Harry siphoned the cream off the milk.  He siphoned off the cream."
        },
        {
            "id": 153,
            "phrase": "sit around",
            "definition": "to relax sitting; to waste time sitting.  Don’t just sit around! Get moving! _ I need to sit around every now and then and reorganize my thoughts."
        },
        {
            "id": 154,
            "phrase": "sit around something",
            "definition": "to be seated at the edge or perimeter of something. They sat around the campfire for hours.  We used to sit around the big kitchen table and talk."
        },
        {
            "id": 155,
            "phrase": "sit around (somewhere)",
            "definition": "to sit somewhere and relax or do nothing; to sit idly somewhere.  Tom likes to sit around the house in shorts and a T-shirt on hot days.  Too many people are just sitting around doing nothing at my office."
        },
        {
            "id": 156,
            "phrase": "sit at something",
            "definition": "to be seated in front of something, such as a table.  He sat at the table, taking his tea.  Please sit at your desk and finish your work before taking a break."
        },
        {
            "id": 157,
            "phrase": "sit at the feet of someone",
            "definition": "to pay homage to someone; to pay worshipful attention to someone. The graduate student sat at the feet of the famous professor for years.  I do not intend to sit at the feet of an incompetent for years and years."
        },
        {
            "id": 158,
            "phrase": "sit back",
            "definition": "to push oneself back in one’s seat; to lean against the back of one’s seat.  Please sit back. I can’t see around you.  I sat back and made myself comfortable, assuming that the movie would bore me to sleep."
        },
        {
            "id": 159,
            "phrase": "sit back and let something happen",
            "definition": "to relax and not interfere with something; to let something happen without playing a part in it.  I can’t just sit back and let you waste all our money! _ Don’t worry. Just sit back and let things take care of themselves."
        },
        {
            "id": 160,
            "phrase": "sit bolt upright",
            "definition": "to sit up straight.  Tony sat bolt upright and listened to what the teacher was saying to him. After sitting bolt upright for almost an hour in that crowded airplane, I swore I would never f ly again."
        },
        {
            "id": 161,
            "phrase": "sit by someone",
            "definition": "to sit next to someone.  May I sit by you? _ Come over here and sit by me."
        },
        {
            "id": 162,
            "phrase": "sit down",
            "definition": "to be seated; to sit on something, such as a chair.  Please sit down and make yourself comfortable.  Can I sit down here?"
        },
        {
            "id": 163,
            "phrase": "sit down on something",
            "definition": "to be seated on something.  Please sit down on this chair and wait until you are called.  I don’t want to sit down on this hard bench."
        },
        {
            "id": 164,
            "phrase": "sit down to something",
            "definition": "to sit down at a table to do something, such as eat a meal or attend to some business.  I look forward to going home and sitting down to a quiet supper.  Ted looked forward to sitting down to a big Thanksgiving dinner."
        },
        {
            "id": 165,
            "phrase": "sit for an exam",
            "definition": "to take an exam to qualify for a license, such as a bar exam.  When do you sit for the bar exam? _ I will sit for the exam next week."
        },
        {
            "id": 166,
            "phrase": "sit for one’s portrait",
            "definition": "to serve as the subject of a portrait being done by a painter or photographer.  I sat for the picture for two hours. Do you mind sitting for the painter all day? It will be easier if you get it over with all at once."
        },
        {
            "id": 167,
            "phrase": "sit for someone",
            "definition": "1. to care for someone in the role of babysitter.  I sit for Timmy sometimes. I like him. He’s a good little kid.  Mary doesn’t sit for anyone anymore. It leaves no time for a social life. 2. to serve as a babysitter in someone’s employ. I sit for Mrs. Franklin every now and then.  Ted used to sit for the Wilsons. 3. to serve as a model or subject for someone, such as an artist. She sat for the portrait painter every day for a week.  She is looking for someone to sit for her so she can develop her skills."
        },
        {
            "id": 168,
            "phrase": "sit in (for someone)",
            "definition": "to act as a substitute for someone. (Usually involves actual sitting, such as at a meeting.) _ I am not a regular member of this committee. I am sitting in for Larry Smith.  Do you mind if I sit in? My representative can’t be here."
        },
        {
            "id": 169,
            "phrase": "sit in judgment (up)on someone or something",
            "definition": "to make a judgment about someone or something. (Upon is formal and less commonly used than on.) _ I don’t want to sit in judgment upon you or anyone else, but I do have some suggestions.  There is no need to sit in judgment on the proposal at this time."
        },
        {
            "id": 170,
            "phrase": "sit in (on something)",
            "definition": "to attend something as a visitor; to act as a temporary participant in something.  Do you mind if I sit in on your discussion? _ Please do sit in."
        },
        {
            "id": 171,
            "phrase": "sit on one’s ass",
            "definition": "Inf. to sit idle; to sit around doing nothing. (Use ass with discretion.) _Don’t just sit on your ass! Get busy! _He just sat on his ass, watching what was going on."
        },
        {
            "id": 172,
            "phrase": "sit on one’s hands",
            "definition": "to do nothing; to fail to help. When we needed help from Mary, she just sat on her hands.  We need the cooperation of everyone. You can’t sit on your hands!"
        },
        {
            "id": 173,
            "phrase": "sit on someone or something",
            "definition": "to place oneself in a sitting position on someone or something.  The enormous woman knocked the crook out and sat on him until the police came.  I need to sit on this chair for a minute and catch my breath."
        },
        {
            "id": 174,
            "phrase": "sit on the fence",
            "definition": "not to take sides in a dispute; not to make a clear choice between two possibilities. (Fig. on the image of someone straddling a fence, representing indecision.) _When Jane and Tom argue, it is best to sit on the fence and not make either of them angry.  No one knows which of the candidates Joan will vote for. She’s sitting on the fence."
        },
        {
            "id": 175,
            "phrase": "sit out",
            "definition": "to elect not to participate in something.  I think I will not join in this game. I’ll sit out.  I’ll sit out for this round."
        },
        {
            "id": 176,
            "phrase": "sit right with someone",
            "definition": "[for something] to be acceptable or understandable to someone. (Very close to sit well with someone.) _ What you just said doesn’t really sit right with me. Let’s talk about it.  It didn’t sit right with the boss."
        },
        {
            "id": 177,
            "phrase": "sit something out†",
            "definition": "not to participate in something; to wait until something is over before participating. Oh, please play with us. Don’t sit it out.  I’m tired of playing cards, so I think I’ll sit out this game."
        },
        {
            "id": 178,
            "phrase": "sit still for something",
            "definition": "to remain seated without fidgeting during something.  The child could hardly be expected to sit still for the opera.  Timmy would not sit still for his haircut."
        },
        {
            "id": 179,
            "phrase": "sit through something",
            "definition": "to remain seated and in attendance for all of something, even though it is boring or poorly done. I can’t stand to sit through that class one more time! _ Do I have to sit through the whole lecture?"
        },
        {
            "id": 180,
            "phrase": "sit tight",
            "definition": "to wait; to wait patiently. (This does not necessarily refer to sitting.) _Just relax and sit tight. I’ll be right with you.  We were waiting in line for the gates to open when someone came out and told us to sit tight because it wouldn’t be much longer before we could go in."
        },
        {
            "id": 181,
            "phrase": "sit up",
            "definition": "1. to rise from a lying to a sitting position.  When the alarm went off, he sat up and put his feet on the f loor.  She couldn’t sleep, so she sat up and read a book. 2. to sit more straight in one’s seat; to hold one’s posture more upright while seated.  Please sit up. Don’t slouch! _ You wouldn’t get backaches if you would sit up."
        },
        {
            "id": 182,
            "phrase": "sit up and take notice",
            "definition": "to become alert and pay attention.  A loud noise from the front of the room caused everyone to sit up and take notice. The company wouldn’t pay any attention to my complaints. When I had my lawyer write them a letter, they sat up and took notice."
        },
        {
            "id": 183,
            "phrase": "sit up with someone",
            "definition": "to stay with someone through the night, especially with a sick or troubled person or with someone who is waiting for something.  I had to sit up with my younger sister when she was ill.  I sat up with Bill while he waited for an overseas telephone call."
        },
        {
            "id": 184,
            "phrase": "sit well with someone",
            "definition": "to be acceptable to someone. Your explanation of your absence doesn’t sit well with the president.  The whole affair didn’t sit well with the manager."
        },
        {
            "id": 185,
            "phrase": "sit with someone",
            "definition": "1. to stay with someone; to sit up with someone. My uncle sat with me my first day in the hospital. 2. to stay with and care for one or more children; to babysit for someone.  I hired Mrs. Wilson to sit with the children.  We couldn’t go out for dinner because we couldn’t find anyone to sit with the kids."
        },
        {
            "id": 186,
            "phrase": "*a sitting duck",
            "definition": "someone or something vulnerable to attack, physical or verbal. (Alludes to a duck floating on the water, not suspecting that it is the object of a hunter or predator. *Typically: be ~; like ~; looking like ~.) _ You look like a sitting duck out there. Get in here where the enemy cannot fire at you.  The senator was a sitting duck because of his unpopular position on school reform."
        },
        {
            "id": 187,
            "phrase": "sitting on a gold mine",
            "definition": "in control of something very valuable; in control of something potentially very valuable.  When I found out how much the old book was worth, I realized that I was sitting on a gold mine. Mary’s land is valuable. She is sitting on a gold mine."
        },
        {
            "id": 188,
            "phrase": "sitting on a powder keg",
            "definition": "in a risky or explosive situation; in a situation where something serious or dangerous may happen at any time. (A powder keg is a keg of gunpowder.) _ Things are very tense at work. The whole office is sitting on a powder keg.  The fire at the oil field seems to be under control for now, but all the workers there are sitting on a powder keg."
        },
        {
            "id": 189,
            "phrase": "(sitting) on top of the world",
            "definition": "feeling wonderful; glorious; ecstatic. Wow, I feel on top of the world. Since he got a new job, he’s on top of the world."
        },
        {
            "id": 190,
            "phrase": "*sitting pretty",
            "definition": "living in comfort or luxury; living in a good situation. (*Typically: be ~; leave someone ~.) _ My uncle died and left enough money for me to be sitting pretty for the rest of my life. Now that I have a goodpaying job, I’m sitting pretty."
        },
        {
            "id": 191,
            "phrase": "six feet under",
            "definition": "dead and buried.  Fred died and is six feet under. They put him six feet under two days after he died."
        },
        {
            "id": 192,
            "phrase": "six of one and half a dozen of the other",
            "definition": "about the same one way or another.  It doesn’t matter to me which way you do it. It’s six of one and half a dozen of the other.  What difference does it make? They’re both the same—six of one and half a dozen of the other."
        },
        {
            "id": 193,
            "phrase": "a sixth sense",
            "definition": "a supposed power to know or feel things that are not perceptible by the five senses of sight, hearing, smell, taste, and touch.  My sixth sense told me to avoid going home by my usual route. Later I discovered there had been a fatal accident on it.  Jane’s sixth sense demanded that she not trust Tom, even though he seemed honest enough."
        },
        {
            "id": 194,
            "phrase": "the sixty-four-dollar question",
            "definition": "the most important question; the question that everyone wants to know the answer to.  Who will win? Now, that is the sixty-fourdollar question.  Now for the sixty-four-dollar question. What’s the stock market going to do this year?"
        },
        {
            "id": 195,
            "phrase": "size someone or something up†",
            "definition": "to observe someone or something to get information; to check someone or something out.  The comedian sized the audience up and decided not to use his new material.  I like to size up a situation before I act."
        },
        {
            "id": 196,
            "phrase": "skate around",
            "definition": "to skate here and there in no particular direction.  Let’s go over to the pond and skate around.  We will skate around for a while until we get too cold."
        },
        {
            "id": 197,
            "phrase": "skate around someone or something",
            "definition": "1. to skate to one side or the other of someone or something. Somehow I managed to skate around the child without knocking her down.  I skated around the tree limb and avoided an accident. 2. to circle someone or something while skating.  The children skated around their instructor until she was satisfied with their form. We skated around the post in a circle."
        },
        {
            "id": 198,
            "phrase": "skate on something",
            "definition": "to skate on a particular surface. You can’t skate on that ice! It’s too thin. Don’t skate on the ice until it has been scraped smooth."
        },
        {
            "id": 199,
            "phrase": "skate on thin ice",
            "definition": "to be in a risky situation. (Fig. on the image of someone taking the risk of ice skating on thin ice.) _ I try to stay well informed so I don’t end up skating on thin ice when the teacher asks me a question.  You are skating on thin ice when you ask me that!"
        },
        {
            "id": 200,
            "phrase": "skate over something",
            "definition": "to move over something, skating.  I love to be the first one to skate over newly frozen ice.  I skated over the pond too soon and the ice cracked while I was on it."
        },
        {
            "id": 201,
            "phrase": "skeleton(s) in the closet",
            "definition": "a hidden and shocking secret. You can ask anyone about how reliable I am. I don’t mind. I don’t have any skeletons in the closet.  My uncle was in jail for a day once. That’s our family’s skeleton in the closet."
        },
        {
            "id": 202,
            "phrase": "sketch something in†",
            "definition": "to draw in the image of someone or something.  I sketched a figure of a woman in so that she appears to be standing beneath the tree.  I’ll sketch in the house in the upper left corner."
        },
        {
            "id": 203,
            "phrase": "sketch something out†",
            "definition": "to create a rough idea or image of something by sketching or some other means. (Does not necessarily require an actual sketch.) _ Sally sketched the furniture arrangement out so we could get an idea of what it was to look like.  Would you sketch out your ideas, please?"
        },
        {
            "id": 204,
            "phrase": "skid across something",
            "definition": "to slip or glide across something, such as ice or wet pavement.  The car skidded across the pavement and crashed into a tree. Our bus skidded across the icy bridge and ran into a ditch on the other side."
        },
        {
            "id": 205,
            "phrase": "skid into someone or something",
            "definition": "to slip or glide into someone or something. The bicycle skidded into a pedestrian.  The car skidded into a guard rail."
        },
        {
            "id": 206,
            "phrase": "skim over something",
            "definition": "to glide across something.  The sailboat skimmed over the waves like a bird. The bird skimmed over the treetops, darting and dodging."
        },
        {
            "id": 207,
            "phrase": "skim through something",
            "definition": "to go through something hastily; to read through something hastily.  She skimmed through the catalogs, looking for a nice gift for Gary. I will skim through your manuscript and see whether it looks promising."
        },
        {
            "id": 208,
            "phrase": "skimp on something",
            "definition": "to use too little of something; to save something by using less of it than needed for something. Please don’t skimp on the gravy. I like my potatoes swimming in it.  They skimped on quality a little when they furnished the lobby."
        },
        {
            "id": 209,
            "phrase": "skin someone alive",
            "definition": "to be very angry with someone; to scold someone severely. (Fig. on being angry enough to do this kind of bodily harm to someone.) _I was so mad at Jane that I could have skinned her alive.  If I don’t get home on time, my parents will skin me alive."
        },
        {
            "id": 210,
            "phrase": "*skinny as a beanpole",
            "definition": "very thin; very skinny. (*Also: as ~.) _ I exercised and dieted until I was skinny as a beanpole."
        },
        {
            "id": 211,
            "phrase": "skinny-dip",
            "definition": "to swim naked.  The boys were skinnydipping in the creek when Bob’s mother drove up."
        },
        {
            "id": 212,
            "phrase": "Skip it!",
            "definition": "Inf. Never mind!; Forget it! (Shows impatience or disappointment.) _ John: I need some help on this project. Mary: What? John: Oh, skip it! _Jane: Will you be able to do this, or should I get someone with more experience? Bob: What did you say? Jane: Oh, skip it!"
        },
        {
            "id": 213,
            "phrase": "skip off (with something)",
            "definition": "to leave and take something with one. The little kid with the freckles skipped off with a candy bar.  He took the candy bar I offered him and skipped off."
        },
        {
            "id": 214,
            "phrase": "skip (out)",
            "definition": "Inf. to leave; to run away without doing something, such as paying a bill.  The guy skipped when the waitress wasn’t looking. Fred skipped out, leaving me with the bill."
        },
        {
            "id": 215,
            "phrase": "skip out (on someone or something)",
            "definition": "to sneak away from someone or some event; to leave someone or an event suddenly or in secret.  I heard that Bill skipped out on his wife.  I’m not surprised. I thought he should have skipped out long ago."
        },
        {
            "id": 216,
            "phrase": "skip out with something",
            "definition": "to leave and take something with one; to steal something. The hotel guest skipped out with the towels. Someone skipped out with the petty cash box."
        },
        {
            "id": 217,
            "phrase": "skip over someone or something",
            "definition": "not to choose someone or something next in line.  She skipped over me and chose the next one in line.  I skipped over the red ones and took a blue one."
        },
        {
            "id": 218,
            "phrase": "skip rope",
            "definition": "to jump over an arc of rope that is swung beneath one’s feet then over one’s head, repeatedly. The children skipped rope on the playground.  The boxer skipped rope while training."
        },
        {
            "id": 219,
            "phrase": "skip through something",
            "definition": "to go through a book or a stack of papers without dealing with every page.  I skipped through the book, just looking at the pictures. Ted skipped through the report, not bothering to read it."
        },
        {
            "id": 220,
            "phrase": "skirmish with someone or something",
            "definition": "to have a minor fight with someone, a group, or something.  Tim skirmished a bit with his brother and then ran into the house. I don’t want to skirmish with the committee."
        },
        {
            "id": 221,
            "phrase": "skirt around someone or something",
            "definition": "to move around and avoid someone or something. (Something can be a topic of conversation.) _We talked the whole evening and managed to skirt around Fred.  We had to skirt around the subject."
        },
        {
            "id": 222,
            "phrase": "The sky’s the limit.",
            "definition": "Inf. there is no upper limit.  I can afford it. The sky’s the limit.  You can do anything you set your mind to, Billy. The sky’s the limit."
        },
        {
            "id": 223,
            "phrase": "slack off",
            "definition": "1. to taper off; to reduce gradually.  Business tends to slack off during the winter months.  The storms begin to slack off in April. 2. [for someone] to become lazy or inefficient. Near the end of the school year, Sally began to slack off, and her grades showed it.  John got fired for slacking off during the busy season."
        },
        {
            "id": 224,
            "phrase": "slam dunk",
            "definition": "[in basketball] a goal scored by shooting the ball down from above the rim. He was wide open and scored on an easy slam dunk."
        },
        {
            "id": 225,
            "phrase": "slam into someone or something",
            "definition": "to crash into someone or something. The race car—out of control—slammed into the stands.  The bus slammed into a truck."
        },
        {
            "id": 226,
            "phrase": "slam someone or something down†",
            "definition": "to drive or strike someone or something downward. The wrestler slammed his opponent down hard.  He slammed down his opponent and injured him."
        },
        {
            "id": 227,
            "phrase": "slam something down† (on(to) something)",
            "definition": "to bang something down onto something. She slammed her fist down on the table in anger.  Karen slammed down her fist onto the table."
        },
        {
            "id": 228,
            "phrase": "slam the brakes on†",
            "definition": "to push on a vehicle’s brakes suddenly and hard. (The can be replaced by a possessive pronoun.) _ The driver in front of me slammed her brakes on and I nearly ran into her. Don’t slam on your brakes when the road is wet."
        },
        {
            "id": 229,
            "phrase": "slam the door in someone’s face",
            "definition": "to swing a door closed with force while someone is standing in the doorway.  I didn’t know Todd was behind me and I accidentally slammed the door in his face.  Please don’t slam the door in my face!"
        },
        {
            "id": 230,
            "phrase": "slant against something",
            "definition": "to rest obliquely against something. The bookcase slants against the wall, and it should be straight.  The lumber was left slanted against the garage."
        },
        {
            "id": 231,
            "phrase": "slant something against someone or something",
            "definition": "to bias something against someone or something; to twist information so it is against someone or something.  The writer slanted the story against the innocent people of the town.  The reporter slanted her story against one political party."
        },
        {
            "id": 232,
            "phrase": "slant toward someone or something",
            "definition": "to incline toward someone or something.  The scenery slanted toward the actors and looked as if it would fall.  Everything in your sketch slants toward the right."
        },
        {
            "id": 233,
            "phrase": "slap against someone or something",
            "definition": "[for something] to flap or strike against someone or something.  The f lag kept slapping against Ed, making it hard for him to remain at attention.  The awning slapped against the side of the house."
        },
        {
            "id": 234,
            "phrase": "a slap in the face",
            "definition": "an insult; an act that causes disappointment or discouragement.  Losing the election was a slap in the face for the club president. Failing to get into a good college was a slap in the face to Tim after his years of study."
        },
        {
            "id": 235,
            "phrase": "*a slap on the wrist",
            "definition": "a hit on the wrist as a mild punishment for putting one’s hands where they shouldn’t be or taking something. (*Typically: get ~; give someone ~.) _ When Billy tried to grab another cookie, he got a slap on the wrist."
        },
        {
            "id": 236,
            "phrase": "slap someone down†",
            "definition": "to cause someone to fall by striking with the open hand.  She became enraged and slapped him down when he approached her again.  Liz slapped down the insulting wretch."
        },
        {
            "id": 237,
            "phrase": "slap someone in something",
            "definition": "Inf. to put or throw someone in jail or prison.  The sheriff slapped the crooks in jail.  Do you want me to slap you in jail?"
        },
        {
            "id": 238,
            "phrase": "slap someone on something",
            "definition": "to slap a particular part of someone.  Gerald was always slapping his friends on the back.  He slapped himself on the knee and laughed very loudly."
        },
        {
            "id": 239,
            "phrase": "slap something against someone or something",
            "definition": "to flap or strike something onto someone or something. The wind slapped the branch against Walter.  The gusts from the storm slapped the shutters against the side of the house."
        },
        {
            "id": 240,
            "phrase": "slap something down†",
            "definition": "to strike downward with something flat in one’s hand.  She slapped the dollar bill down in great anger and took her paper cup full of water away with her.  Karen slapped down the money that the bailiff demanded."
        },
        {
            "id": 241,
            "phrase": "slap something on†",
            "definition": "Inf. to dress in something hastily.  Henry slapped a shirt on and went out to say something to the garbage hauler.  He slapped on a shirt and ran to the bus stop. "
        },
        {
            "id": 242,
            "phrase": "slap something on someone",
            "definition": "Inf. to serve someone with a legal paper or citation.  The strange man came into the office and slapped a subpoena on Mary. I will slap a citation on you for speeding if you don’t stop arguing."
        },
        {
            "id": 243,
            "phrase": "slash (out) at someone",
            "definition": "to thrust out at someone with a knife or something similar, with the intent of cutting.  The attacker slashed out at his victim and then ran away.  Max slashed at the cop with a pocketknife."
        },
        {
            "id": 244,
            "phrase": "slate someone or something for something",
            "definition": "to schedule someone or something for some thing or a particular time.  They slated me for a trip to Columbia, Missouri, in August.  Wally slated the meeting room for his presentation."
        },
        {
            "id": 245,
            "phrase": "*slated for something",
            "definition": "scheduled for something. (As if a schedule had been written on a slate. *Typically: be ~; have someone ~.) _ John was slated for Friday’s game, but he couldn’t play with the team.  Ann is slated for promotion next year."
        },
        {
            "id": 246,
            "phrase": "*slated to do something",
            "definition": "scheduled to do something. (*Typically: be ~; have someone ~.) _ Mary is slated to go to Washington in the fall.  We are slated to leave in November."
        },
        {
            "id": 247,
            "phrase": "slave away (at something)",
            "definition": "to work very hard (doing something).  I’m tired of slaving away at this and getting nowhere.  I’m slaving away for $7.00 an hour and have no prospects for the future."
        },
        {
            "id": 248,
            "phrase": "slave over something",
            "definition": "to stand over something, working at it very hard, typically cooking over a hot stove.  I’ve been slaving over this hot stove for hours to cook this meal! _ Ted slaved over his special dessert for hours."
        },
        {
            "id": 249,
            "phrase": "*a slave to something",
            "definition": "someone who is under the control of something; someone whose time or attention is controlled or “owned by” by something. (Fig. on being a slave to a person. *Typically: be ~; become ~.) _ Mary is a slave to her job. Bill is a slave to his drug addiction."
        }
    ]
}