{
    "dictionary": [
        {
            "id": 0,
            "phrase": "double someone over†",
            "definition": "to cause someone to bend at the waist.  The blow to the back of the head doubled Steve over.  The wind almost doubled over the children running for home."
        },
        {
            "id": 1,
            "phrase": "double something over†",
            "definition": "to fold something over.  Double the paper over twice, then press it f lat.  Double over the cloth a few times before you pack it away."
        },
        {
            "id": 2,
            "phrase": "double up (on someone or something)",
            "definition": "[for people] to deal with someone or something in pairs.  We are going to have to double up in this job.  We will double up and get it done."
        },
        {
            "id": 3,
            "phrase": "double up (with laughter)",
            "definition": "to laugh so hard that one bends over. We all just doubled up with laughter.  I doubled up when I heard the punch line."
        },
        {
            "id": 4,
            "phrase": "double up (with pain)",
            "definition": "to bend at the waist with severe pain.  The man doubled up with pain when he was stabbed.  He hurt so bad that he doubled up."
        },
        {
            "id": 5,
            "phrase": "double up (with someone)",
            "definition": "to share with someone. We don’t have enough books. Tom, will you double up with Jane? _When we get more books, we won’t have to double up anymore."
        },
        {
            "id": 6,
            "phrase": "a double whammy",
            "definition": "a double dose of something; a strong or powerful helping of something.  When the Federal Reserve Board raised the interest rates, I got a double whammy. My stocks went down and my bonds did too."
        },
        {
            "id": 7,
            "phrase": "double-cross someone",
            "definition": "to betray someone. (Originally a more complicated switching of sides in a conspiracy wherein the double-crosser sides with the victim of the conspiracy—against the original conspirator.) _ Don’t even think about double-crossing me! _ Richard doublecrossed Mr. Big a few years back."
        },
        {
            "id": 8,
            "phrase": "doubting Thomas",
            "definition": "someone who will not easily believe something without strong proof or evidence. (Can be said of a man or a woman. From the biblical account of the apostle Thomas, who would not believe that Jesus had risen from the dead until he actually touched the risen Christ.) _ Mary won’t believe that I have a dog until she sees it. She’s such a doubting Thomas."
        },
        {
            "id": 9,
            "phrase": "douse someone or something with something",
            "definition": "to splash or drench someone with something.  She doused her brother with a bucket of cold water.  They had to keep dousing the porpoise with cold water to keep it healthy."
        },
        {
            "id": 10,
            "phrase": "dovetail something into something",
            "definition": "to fit something neatly into something; to make something interlock nicely with something else.  She dovetailed her story into mine perfectly and the police let us go."
        },
        {
            "id": 11,
            "phrase": "dovetail with something",
            "definition": "to interlock tightly with something using a dovetail joint. The side of the drawer dovetails with the front of the drawer."
        },
        {
            "id": 12,
            "phrase": "down and dirty",
            "definition": "crude and carelessly done.  (Used as an attributive.) The last time he painted the kitchen, it was a down and dirty job because he thought we were moving. Fig. coarse; mean-spirited.  The campaign for governor really got down and dirty in the final week."
        },
        {
            "id": 13,
            "phrase": "down by some amount",
            "definition": "having a score that is lower, by the specified amount, than someone else’s score or the other team’s score.  At halftime, the home team was down by 14 points. Down by one run, the team scored two runs in the ninth inning and won the game."
        },
        {
            "id": 14,
            "phrase": "down for something",
            "definition": "having one’s name written down for something.  Am I down for an evening appointment? _ You are down for Friday."
        },
        {
            "id": 15,
            "phrase": "*down in the dumps",
            "definition": "sad or depressed. (*Typically: be ~; get ~.) _I’ve been down in the dumps for the past few days.  Try to cheer Jane up. She’s down in the dumps for some reason."
        },
        {
            "id": 16,
            "phrase": "down in the mouth",
            "definition": "sad-faced; depressed and unsmiling.  Since her dog died, Barbara has been down in the mouth.  Bob has been down in the mouth since he was laid off from his job."
        },
        {
            "id": 17,
            "phrase": "down on one’s luck",
            "definition": "without any money; unlucky. Can you lend me twenty dollars? I’ve been down on my luck lately.  The gambler had to get a job because he had been down on his luck and hadn’t won enough money to live on."
        },
        {
            "id": 18,
            "phrase": "*down pat",
            "definition": "learned or memorized perfectly. (*Typically: get something ~; have something ~.) _I have practiced my speech until I have it down pat.  Tom has his part in the play down pat. He won’t make any mistakes."
        },
        {
            "id": 19,
            "phrase": "down South",
            "definition": "to or at the southeastern United States.  I used to live down South. We are going down South for the winter."
        },
        {
            "id": 20,
            "phrase": "down the chute",
            "definition": "gone; wasted; ruined.  A lot of money went down the chute on that deal, and all for nothing.  I just hate to see all that effort go down the chute."
        },
        {
            "id": 21,
            "phrase": "down the drain",
            "definition": "gone; wasted.  Well, there’s 400 bucks down the drain.  A lot of money went down the drain in that Wilson deal."
        },
        {
            "id": 22,
            "phrase": "Down the hatch.",
            "definition": "I am about to drink this.; Let’s all drink up. (Said as one is about to take a drink, especially of something bad-tasting or potent. Also used as a jocular toast.) _Bob said, “Down the hatch,” and drank the whiskey in one gulp.  Let’s toast the bride and groom. Down the hatch!"
        },
        {
            "id": 23,
            "phrase": "down the little red lane",
            "definition": "down someone’s throat; down a child’s throat.  This really tasty medicine has to go down the little red lane. The last spoonful of that stuff that went down the little red lane came right back up."
        },
        {
            "id": 24,
            "phrase": "down the road",
            "definition": "farther along on this same road.  Just continue down the road until you come to a little church. Turn left there."
        },
        {
            "id": 25,
            "phrase": "down the street",
            "definition": "a short distance away on this same street. Sally lives just down the street. There is a drugstore down the street. It’s very convenient."
        },
        {
            "id": 26,
            "phrase": "down the tube(s)",
            "definition": "ruined; wasted.  His political career went down the tubes after the scandal. He’s lost his job.  The business went down the tube."
        },
        {
            "id": 27,
            "phrase": "down to a gnat’s eyebrow",
            "definition": "down to the smallest detail.  He described what the thief was wearing down to a gnat’s eyebrow.  No use trying to sneak anything out of the refrigerator. Mom knows what’s in there, down to a gnat’s eyebrow."
        },
        {
            "id": 28,
            "phrase": "down to chili and beans",
            "definition": "Rur. very poor; down to one’s last penny. Mary and Tom aren’t doing too well. They’re down to chili and beans.  Many’s the time I was down to chili and beans, but I always pulled through."
        },
        {
            "id": 29,
            "phrase": "*down to the last bit of money",
            "definition": "having only a small amount of money left. (*Typically: be ~; get ~.) _I’m down to my last nickel.  Lily is down to her last dollar."
        },
        {
            "id": 30,
            "phrase": "down to the last detail",
            "definition": "considering all of the details.  Jean planned the party very carefully, down to the last minute. Mary wanted to be in charge of everything right down to the last detail."
        },
        {
            "id": 31,
            "phrase": "down under",
            "definition": "Australia and New Zealand.  I’ve always wanted to visit down under.  We spent Christmas down under."
        },
        {
            "id": 32,
            "phrase": "*down with a disease",
            "definition": "ill; sick at home. (Can be said about many diseases. *Typically: be ~; come ~; get ~.) _ Tom isn’t here. He’s down with a cold.  Sally is down with the f lu."
        },
        {
            "id": 33,
            "phrase": "Down with someone or something!",
            "definition": "Do away with someone or something!; I am opposed to someone or something! _Down with higher taxes! Down with corporate tax breaks! _ Down with tyrants!"
        },
        {
            "id": 34,
            "phrase": "down-and-out",
            "definition": "1. having no money or means of support.  There are many young people down-and-out in the city. John gambled away all his fortune and is now completely down-and-out. 2. someone who is impoverished. There were a couple of down-and-outs sleeping under the railway bridge.  The down-and-out touched Martin for a fiver."
        },
        {
            "id": 35,
            "phrase": "*down-at-the-heels",
            "definition": "[of shoes] worn on the bottom of the heels. (*Typically: be ~; get ~.) _This pair is a little down-at-the-heels, but I only use them for gardening."
        },
        {
            "id": 36,
            "phrase": "downgrade someone or something to something",
            "definition": "to decrease the status of someone or something to something.  In effect, this downgrades your project to unimportant.  I didn’t mean to downgrade you to the assistant status."
        },
        {
            "id": 37,
            "phrase": "downhill all the way",
            "definition": "easy the entire way.  Don’t worry about your algebra course. It’s downhill all the way after this chapter.  The mayor said that the job of mayor is easy—in fact, downhill all the way."
        },
        {
            "id": 38,
            "phrase": "downhill from here on",
            "definition": "easy from this point on.  The worst part is over. It’s downhill from here on.  The painful part of this procedure is over. It’s downhill from here on."
        },
        {
            "id": 39,
            "phrase": "down-home",
            "definition": "as one would find in rural, especially southern, America.  She speaks with a kind of down-home accent that sounds more friendly than the typical, urban northener."
        },
        {
            "id": 40,
            "phrase": "downtime",
            "definition": "the time when a computer or some other system is not operating. (Computer jargon.) _ I can’t afford a lot of downtime in the system I buy.  We had too much downtime with the other machine."
        },
        {
            "id": 41,
            "phrase": "down-to-earth",
            "definition": "1. Fig. direct, frank, and honest.  You can depend on Ann. She’s very down-to-earth.  It’s good that she’s down-to-earth and will give us a frank response. 2. Fig. practical; not theoretical; not fanciful. Her ideas for the boutique are always very down-to-earth. The committee’s plans for the village are anything but down-toearth."
        },
        {
            "id": 42,
            "phrase": "*down-to-the-wire",
            "definition": "waiting until the very last moment; right up to the deadline. (*Typically: be ~; get ~.) _ It came down-to-the-wire before I turned the proposal in.  We went right down-to-the-wire on that one."
        },
        {
            "id": 43,
            "phrase": "doze off (to sleep)",
            "definition": "to slip away into sleep.  I dozed off to sleep during the second act of the opera.  I was so comfortable that I just dozed off."
        },
        {
            "id": 44,
            "phrase": "draft someone for something",
            "definition": "to select someone for something or to do something. We drafted a bunch of the boys for moving tables.  The committee drafted some of the members for kitchen work."
        },
        {
            "id": 45,
            "phrase": "draft someone into something",
            "definition": "to conscript someone into the armed services.  The draft board drafted Scott into the army.  Todd was drafted into the army."
        },
        {
            "id": 46,
            "phrase": "drag behind",
            "definition": "to follow along close behind someone. His little brother came along, dragging behind. Stop dragging along behind!"
        },
        {
            "id": 47,
            "phrase": "a drag (on someone)",
            "definition": "a burden (to someone).  I wish you wouldn’t be such a drag on your friends.  I don’t want to be a drag on the department."
        },
        {
            "id": 48,
            "phrase": "*a drag (on something)",
            "definition": "Sl. a puff or any kind of cigarette. (*Typically: have ~; take ~.) _ She had a drag on her cigarette and crushed it out on the sidewalk."
        },
        {
            "id": 49,
            "phrase": "drag someone in† (on something)",
            "definition": "to force someone to join something or participate in something.  Don’t drag me in on this.  Let’s try to drag in some of the others on this."
        },
        {
            "id": 50,
            "phrase": "drag someone or something down†",
            "definition": "to pull someone or something to the ground or to a lower level. The lions dragged the antelope down and made dinner out of it.  They dragged down the boxes from the closet shelf."
        },
        {
            "id": 51,
            "phrase": "drag someone or something off† (to someone or something)",
            "definition": "to haul someone or something away to someone, something, or some place.  The cops dragged her off to jail.  They dragged off the criminal to the judge."
        },
        {
            "id": 52,
            "phrase": "drag someone through the mud",
            "definition": "to insult, defame, and debase someone. The newspapers dragged the actress through the mud week after week.  The columnist felt it was her duty to drag people through the mud."
        },
        {
            "id": 53,
            "phrase": "drag someone up†",
            "definition": "to force someone to come up or to come and stand nearby.  He wouldn’t come on his own, so I dragged him up.  You will have to drag him up. He is too tired to walk by himself. The reporter dragged up a homeless man to interview."
        },
        {
            "id": 54,
            "phrase": "drag something behind one",
            "definition": "to pull something that is behind one.  The child dragged the wooden toy behind him.  What is that you are dragging behind you?"
        },
        {
            "id": 55,
            "phrase": "drag something out†",
            "definition": "to make something last for a long time.  Why does the chairman have to drag the meeting out so long? _Don’t drag out the meetings so long! 2 Go to next."
        },
        {
            "id": 56,
            "phrase": "drag something up†",
            "definition": "to pull something close, such as a chair, stool, etc., to sit in.  Please drag a chair up and sit down.  Drag up a chair and sit for a while."
        },
        {
            "id": 57,
            "phrase": "dragged out",
            "definition": "Sl. exhausted; worn out.  I feel so dragged out. I think I need some sleep.  After the game, the whole team was dragged out."
        },
        {
            "id": 58,
            "phrase": "dragoon someone into something",
            "definition": "to force someone into doing something.  We dragooned the boys into helping us.  She was trying to dragoon some of the men into setting up the banquet tables."
        },
        {
            "id": 59,
            "phrase": "drain away",
            "definition": "[for something] to flow away. All the water drained away and exposed the mud and rocks on the bottom of the pond. When the water drained away, we found three snapping turtles in the bottom of the pond."
        },
        {
            "id": 60,
            "phrase": "drain from something",
            "definition": "to flow out of something.  All the dirty oil drained from the engine. The milk drained from the leaky container and covered the bottom of the refrigerator."
        },
        {
            "id": 61,
            "phrase": "drain out",
            "definition": "to flow out or empty. All the milk drained out of the container onto the bottom of the refrigerator.  All the oil drained out of the crankcase."
        },
        {
            "id": 62,
            "phrase": "drain someone or something of something",
            "definition": "to exhaust someone or something of something, such as energy, motivation, etc. This day has drained me of all my motivation.  The first performance drained the cast of all its energy."
        },
        {
            "id": 63,
            "phrase": "drain something away† (from something)",
            "definition": "to channel some liquid away from something.  Drain all of the standing water away from the foundation of the house. Drain away the water from the foundation."
        },
        {
            "id": 64,
            "phrase": "drain something from someone or something",
            "definition": "to cause something to flow out of someone or something.  The farmers drained the water from the f looded fields.  The doctor drained the f luids from Roger after his operation."
        },
        {
            "id": 65,
            "phrase": "drain something of something",
            "definition": "to empty something out of something.  He drained the glass of the remaining beer."
        },
        {
            "id": 66,
            "phrase": "drape oneself over something",
            "definition": "to sprawl on a piece of furniture. He draped himself over the armchair and dropped off to sleep. He came in and casually draped himself over grandmother’s antique chair."
        },
        {
            "id": 67,
            "phrase": "drape over (something)",
            "definition": "[for cloth] to cover something and hang down. The robe draped over her knees, but she was still cold.  The tablecloth draped over and reached down to the f loor."
        },
        {
            "id": 68,
            "phrase": "drape someone or something in something",
            "definition": "to wrap or cover someone or something in something.  They draped her in golden silks, but she still looked like a country girl. They draped the tables in polka-dot cloth for the party."
        },
        {
            "id": 69,
            "phrase": "drape someone or something with something",
            "definition": "to hang something on or over someone or something.  They draped each guest with a makeshift toga. They draped the statue with a brightly colored loincloth."
        },
        {
            "id": 70,
            "phrase": "drape something around someone or something",
            "definition": "to wrap or hang something around someone or something.  She draped the shawl around her shoulders and felt a little warmer. Mother draped a towel around Timmy after his bath."
        },
        {
            "id": 71,
            "phrase": "draw a blank",
            "definition": "1. Fig. to get no response; to find nothing.  I asked him about Tom’s financial problems, and I just drew a blank.  We looked in the files for an hour, but we drew a blank. 2. Fig. to fail to remember something.  I tried to remember her telephone number, but I could only draw a blank.  It was a very hard test with just one question to answer, and I drew a blank."
        },
        {
            "id": 72,
            "phrase": "draw a line in the sand",
            "definition": "to create or declare an artificial boundary and imply that crossing it will cause trouble. Todd drew a line in the sand by giving his roommate an ultimatum about his sloppiness—he had to start cleaning up after himself or move out."
        },
        {
            "id": 73,
            "phrase": "draw against an amount of money",
            "definition": "to withdraw money from something in advance.  I can draw against my allowance—at least a small amount.  You cannot draw against your salary."
        },
        {
            "id": 74,
            "phrase": "draw ahead (of someone or something)",
            "definition": "to pull or move ahead of someone or something in motion.  I drew ahead of the car in front of me.  The horse I was racing against drew ahead."
        },
        {
            "id": 75,
            "phrase": "draw blood",
            "definition": "to hit or bite (a person or an animal) and make a wound that bleeds.  The dog chased me and bit me hard, but it didn’t draw blood.  The boxer landed just one punch and drew blood immediately."
        },
        {
            "id": 76,
            "phrase": "draw interest",
            "definition": "1. to appear interesting and get (someone’s) attention. (Note the variation in the examples.) _ This kind of event isn’t likely to draw a lot of interest.  What kind of show will draw public interest? 2. [for money] to earn interest while on deposit. Put your money in the bank so it will draw interest.  The cash value of some insurance policies also draws interest."
        },
        {
            "id": 77,
            "phrase": "draw (oneself) aside",
            "definition": "[for someone] to move aside.  I drew myself aside so the children could pass.  He drew himself aside so Maggie could pass."
        },
        {
            "id": 78,
            "phrase": "draw oneself up (to something)",
            "definition": "to stand up straight to one’s full height. (Fixed order.) _Walter drew himself up to his six-foot height and walked away. She drew herself up and walked away."
        },
        {
            "id": 79,
            "phrase": "draw people or things together†",
            "definition": "to pull people together; to pull things together.  She drew her toys together in preparation for leaving.  She drew together all the people she wanted to talk to."
        },
        {
            "id": 80,
            "phrase": "draw some kind of attention away† (from someone or something)",
            "definition": "to capture attention or praise due to someone or something.  Her sterling performance drew attention away from the big star in one of the other roles. She drew away too much notice by her late arrival at the party."
        },
        {
            "id": 81,
            "phrase": "draw someone aside†",
            "definition": "to pull or steer someone aside.  The teacher drew Bob aside to have a word with him.  Harry drew aside someone he could trust and expressed his fears."
        },
        {
            "id": 82,
            "phrase": "draw (someone or something) from something",
            "definition": "to sketch (someone or something) from a particular source, such as memory, real life, a photograph, etc. He is a very good artist. He can draw from a photograph or a painting.  I will try to draw him from memory."
        },
        {
            "id": 83,
            "phrase": "draw someone or something to(ward) someone or something",
            "definition": "to pull someone or something to someone or something.  She drew him toward her and kissed him.  Todd drew the child toward the light."
        },
        {
            "id": 84,
            "phrase": "draw someone’s attention to someone or something",
            "definition": "to attract someone to notice or focus on someone or something.  Now, I would like to draw your attention to Fred, the gentleman we have all heard so much about.  Could I draw your attention to the statue standing at the entrance?"
        },
        {
            "id": 85,
            "phrase": "draw someone together",
            "definition": "to make people seek one another for emotional support. The tragic accident drew the family all together. Do you think the crisis actually will draw us closer together?"
        },
        {
            "id": 86,
            "phrase": "draw something apart†",
            "definition": "to pull something, such as curtains or drapes, open or apart.  She drew the curtains apart and looked out the window.  She drew apart the curtains a little bit."
        },
        {
            "id": 87,
            "phrase": "draw something down†",
            "definition": "to pull something down.  She drew the shades down to cut off the bright sunlight.  She drew down the shades."
        },
        {
            "id": 88,
            "phrase": "draw something forth†",
            "definition": "to pull something forward or where it can be seen.  Carl drew a booklet forth and began to show it to the people sitting on either side of him.  She drew forth her pocketknife and threatened the bandit."
        },
        {
            "id": 89,
            "phrase": "draw something off† (from something)",
            "definition": "to remove a portion of a liquid from something; to cause something to flow from something.  The steward drew some wine off from the cask.  He drew off some wine."
        },
        {
            "id": 90,
            "phrase": "draw something out†",
            "definition": "1. to make something have greater length.  Bill drew the taffy candy out into a long string.  He drew out a long strand of melted cheese and tried to drop it into his mouth. 2. to extend something in time.  Do we have to draw this thing out? Let’s get it over with.  Stop drawing out the proceedings. 3. Lit. to draw a picture to make something more clear.  Here, I’ll draw it out so you can see what I mean.  Please draw out the concept on paper. I can’t follow your explanation. "
        },
        {
            "id": 91,
            "phrase": "draw something over someone or something",
            "definition": "to cover someone or something with something.  She drew the blanket over the sleeping baby.  Polly drew some plastic over her work and left for the day."
        },
        {
            "id": 92,
            "phrase": "draw something to",
            "definition": "to close or nearly close something, such as curtains, drapes, etc.  She drew the drapes to and turned on the lights. Please draw the door to as you leave, but don’t shut it all the way."
        },
        {
            "id": 93,
            "phrase": "draw something to a close",
            "definition": "to make something come to an end.  It is time we drew this evening to a close.  Ann drew the meeting to a close with a few words of encouragement."
        },
        {
            "id": 94,
            "phrase": "draw something to someone’s attention",
            "definition": "to make someone aware of something.  Please draw this error to the clerk’s attention."
        },
        {
            "id": 95,
            "phrase": "draw something up†",
            "definition": "to pull something close by, such as a chair, stool, etc.  Draw a chair up and sit down.  She drew up a pillow and sat on the f loor."
        },
        {
            "id": 96,
            "phrase": "draw straws for something",
            "definition": "to decide who gets something or must do something by choosing straws from an unseen set of straws of different lengths. (The person who gets the shortest straw is chosen. See also draw lots.) _ We drew straws for the privilege of going first. Let’s draw straws for it."
        },
        {
            "id": 97,
            "phrase": "draw the line (at something)",
            "definition": "to set a limit at something; to decide when a limit has been reached.  You can make as much noise as you want, but I draw the line at fighting. It’s hard to keep young people under control, but you have to draw the line somewhere."
        },
        {
            "id": 98,
            "phrase": "draw to a close",
            "definition": "to end; to come to an end.  This evening is drawing to a close.  It’s a shame that our vacation is drawing to a close."
        },
        {
            "id": 99,
            "phrase": "draw up",
            "definition": "to pull up more tightly; to shrink up.  When they got wet, his trunks drew up and became very tight.  This cheap underwear has a tendency to draw up."
        },
        {
            "id": 100,
            "phrase": "a drawing card",
            "definition": "an attraction that helps bring patrons to a place of entertainment.  The comedian was a real drawing card at the night club."
        },
        {
            "id": 101,
            "phrase": "*drawn and quartered",
            "definition": "to be dealt with very severely. (Now fig. except in historical accounts; refers to a former practice of torturing someone guilty of treason, usually a male, by disembowling and dividing the body into four parts. *Typically: be ~; have someone ~. Fixed order.) _Todd was practically drawn and quartered for losing the Wilson contract.  You were much too harsh with Jean. No matter what she did, she didn’t need to be drawn and quartered for it!"
        },
        {
            "id": 102,
            "phrase": "drawn like a moth to a flame",
            "definition": "attracted [to someone or some event] instinctively or very strongly, as a moth is drawn to the light of a flame.  Customers were drawn to the sale like a moth to a flame. They came from all over and bought up everything in the store."
        },
        {
            "id": 103,
            "phrase": "a dream come true",
            "definition": "a wish or a dream that has become a reality.  My vacation to Hawaii was like a dream come true. Having you for a friend is a dream come true."
        },
        {
            "id": 104,
            "phrase": "dream of doing something",
            "definition": "to have a fantasy of doing something.  I dream of owning a house like that.  Clara dreamed of sailing off into the sunset with Roger."
        },
        {
            "id": 105,
            "phrase": "Dream on.",
            "definition": "What you are expecting or wanting to happen is nothing but fantasy. You want to get promoted to general manager? Dream on.  You, an opera singer? Dream on."
        },
        {
            "id": 106,
            "phrase": "dream something away†",
            "definition": "to waste away a period of time having fantasies.  I just want to sit in the sun and dream the day away.  Don’t dream away your life!"
        },
        {
            "id": 107,
            "phrase": "dream something up†",
            "definition": "to invent something; to fabricate something. (The something can be the word something.) _ I don’t know what to do, but I’ll dream something up.  Please dream up a solution for this problem."
        },
        {
            "id": 108,
            "phrase": "dredge someone or something up†",
            "definition": "to scoop something up from underwater. The workers dredged the lifeless body up from the cold black water.  They dredged up the mud from the riverbed."
        },
        {
            "id": 109,
            "phrase": "dress for someone",
            "definition": "to clothe oneself to please someone.  I don’t dress for you! Don’t tell me how I should look! _Sally says she dresses for her friends, but she really dresses for herself."
        },
        {
            "id": 110,
            "phrase": "dress for something",
            "definition": "to clothe oneself suitably for some occasion or activity, or for success.  Finally, I learned to dress for success. I can wear my tuxedo if you want me to dress for the formal dinner."
        },
        {
            "id": 111,
            "phrase": "dress (oneself) up",
            "definition": "to dress in fancy dress.  They dressed themselves up in their finest. Please dress up for the dance."
        },
        {
            "id": 112,
            "phrase": "dress someone down†",
            "definition": "to bawl someone out; to give someone a good scolding. The drill sergeant dressed down the entire squadron for failing inspection.  I’m really late. I know my parents will dress me down when I get home."
        },
        {
            "id": 113,
            "phrase": "dress someone or something up†",
            "definition": "to make someone or something appear fancier than is actually so.  The publicity specialist dressed the actress up a lot.  They dressed up the hall so it looked like a ballroom."
        },
        {
            "id": 114,
            "phrase": "dress someone or something up† (in something)",
            "definition": "to clothe, decorate, or ornament someone or something in something.  She dressed her dolls up in special clothing.  She dressed up her dolls in tiny outfits."
        },
        {
            "id": 115,
            "phrase": "dress someone up† (as someone or something) to dress someone to look like or impersonate someone or something. ",
            "definition": "She dressed her little girl up as a witch for Halloween.  She dressed up her little girl as a fairy."
        },
        {
            "id": 116,
            "phrase": "dress (up) as someone or something",
            "definition": "to dress in the manner of someone or something.  I am going to dress up as a ghost for Halloween.  Larry will dress up as the pumpkin from Cinderella."
        },
        {
            "id": 117,
            "phrase": "a dressing-down",
            "definition": "a harsh scolding.  The boss gave the entire sales crew a powerful dressing-down for missing their forecast."
        },
        {
            "id": 118,
            "phrase": "drift along",
            "definition": "to float along; to be carried along on no particular course. The boat just drifted along lazily with the current.  The project drifted along until we received the leadership we needed."
        },
        {
            "id": 119,
            "phrase": "drift apart (from each other)",
            "definition": "[for floating things] to separate as they drift.  The boats drifted apart from one another. The boats drifted apart in the waves."
        },
        {
            "id": 120,
            "phrase": "drift away (from someone)",
            "definition": "[for someone] to begin to be less of a friend and more like a stranger. He began drifting away from me a few months ago, and I haven’t seen him at all in the last three weeks."
        },
        {
            "id": 121,
            "phrase": "drift away (from someone or something)",
            "definition": "[for floating people, animals, or things] to move away from a particular person or thing, on the surface of water. We watched the boat drift away from us.  He was drifting away on the ice block and there was nothing we could do."
        },
        {
            "id": 122,
            "phrase": "drift back (to someone)",
            "definition": "[for someone] to return to one’s friendship or romantic involvement slowly.  Finally he drifted back to her and they made up."
        },
        {
            "id": 123,
            "phrase": "drift back (to someone or something)",
            "definition": "to move back to someone or something slowly, on the surface of water.  The canoe drifted back to shore.  My little boat finally drifted back to me."
        },
        {
            "id": 124,
            "phrase": "drift in(to something)",
            "definition": "to move slowly and gradually into something. The people drifted slowly into the hall. The boats drifted into the shore on the tide."
        },
        {
            "id": 125,
            "phrase": "drift off",
            "definition": "to move slowly away.  The boat slowly drifted off and was gone. The clouds drifted off and the sun came out."
        },
        {
            "id": 126,
            "phrase": "drift off to sleep",
            "definition": "to fall asleep gradually.  At last, he drifted off to sleep. During that boring lecture, I drifted off to sleep a number of times."
        },
        {
            "id": 127,
            "phrase": "drift out",
            "definition": "to move out of a place slowly.  After there was no more food, the people drifted out, one by one. The boat drifted out and almost got away."
        },
        {
            "id": 128,
            "phrase": "drift toward someone or something",
            "definition": "to move slowly and gradually toward someone or something.  The clouds drifted toward us, and we could see that a storm was coming.  As the clouds drifted toward us, we could feel the humidity increase."
        },
        {
            "id": 129,
            "phrase": "drift with something",
            "definition": "to float along with something; to be carried along at the same rate as something.  He paddled the canoe into the center of the stream and let it drift with the current."
        },
        {
            "id": 130,
            "phrase": "drill down (to something)",
            "definition": "to bore downward to something or some distance.  We drilled down to a layer of waterbearing sand, hoping to make a well.  They had to drill down to bedrock to make a base for the piers that hold the building up."
        },
        {
            "id": 131,
            "phrase": "drill in(to something)",
            "definition": "to bore into or penetrate something. The worker drilled into the wall in three places. Please don’t drill into the wall here, where it will show."
        },
        {
            "id": 132,
            "phrase": "drill someone in something",
            "definition": "to give someone practice in something.  Now, I am going to drill you in irregular verbs.  The teacher drilled the students in the use of the passive."
        },
        {
            "id": 133,
            "phrase": "drink like a fish",
            "definition": "to drink alcohol excessively; to be in the habit of drinking alcohol excessively.  Jeff really drank like a fish at the party on Saturday.  I worry about Nancy; she drinks like a fish."
        },
        {
            "id": 134,
            "phrase": "drink someone under the table",
            "definition": "to be able to drink more alcohol than someone else.  I bet I can drink you under the table."
        },
        {
            "id": 135,
            "phrase": "drink something down†",
            "definition": "to drink something; to consume all of something by drinking it.  Here, drink this down, and see if it makes you feel better. Drink down this medicine."
        },
        {
            "id": 136,
            "phrase": "drink something in†",
            "definition": "to absorb something; to take in information, sights, a story, etc.  Terry and Amy drove up to the top of the hill to drink the sights in. They drank in the beautiful view."
        },
        {
            "id": 137,
            "phrase": "drink something up†",
            "definition": "to drink all of something that is served or that is on hand.  Who drank all the root beer up? _ I drank up the root beer."
        },
        {
            "id": 138,
            "phrase": "drink to excess",
            "definition": "Euph. to drink too much alcohol; to drink alcohol continually. Mr. Franklin drinks to excess.  Some people drink to excess only at parties."
        },
        {
            "id": 139,
            "phrase": "drink to someone or something",
            "definition": "to toast someone or something; to take an alcoholic drink in honor of someone or something. I’ll drink to that! _Let us drink to our guest of honor, Wallace J. Wilson!"
        },
        {
            "id": 140,
            "phrase": "Drink up!",
            "definition": "Finish your drink!; Finish that drink, and we’ll have another! _Okay, drink up! It’s closing time. Drink up, and let’s get going."
        },
        {
            "id": 141,
            "phrase": "drip in(to something)",
            "definition": "[for a liquid] to fall into something drop by drop.  The water dripped into the bowl we had put under the leak. Is the water still dripping in the bathtub?"
        },
        {
            "id": 142,
            "phrase": "drip with something",
            "definition": "to be heavy or overloaded with something to the point of overflowing.  The foliage dripped with the heavy morning dew.  Her clothing dripped with seawater as she climbed back onto the deck."
        },
        {
            "id": 143,
            "phrase": "drive a coach and horses through something",
            "definition": "to expose weak points or “holes” in an argument, alibi, or criminal case by [figuratively] driving a horse and carriage through them. (Formal. Emphasizes the large size of the holes or gaps in the argument.) _ The barrister drove a horse and carriage through the witness’s testimony. The opposition will drive a coach and horses through the wording of that government bill."
        },
        {
            "id": 144,
            "phrase": "drive a hard bargain",
            "definition": "to work hard to negotiate prices or agreements in one’s own favor. All right, sir, you drive a hard bargain. I’ll sell you this car for $12,450. You drive a hard bargain, Jane, but I’ll sign the contract."
        },
        {
            "id": 145,
            "phrase": "drive a price down†",
            "definition": "to force the price of something down.  The lack of buyers drove the price down.  The lack of buyers drove down the price."
        },
        {
            "id": 146,
            "phrase": "drive a wedge between someone and someone else",
            "definition": "to cause people to oppose one another or turn against one another. The argument drove a wedge between Mike and his father."
        },
        {
            "id": 147,
            "phrase": "drive at something",
            "definition": "to be making a point; to be hinting at something; to work up to making a point. What are you driving at? What’s the point? _ I could tell Mary was driving at something, but I didn’t know what it was."
        },
        {
            "id": 148,
            "phrase": "drive away",
            "definition": "to leave some place driving a vehicle.  They got in the car and drove away.  They drove away and left us here."
        },
        {
            "id": 149,
            "phrase": "drive back",
            "definition": "to go in a vehicle back to where it started.  Mary drove back and parked the car where it had been when she started.  You drive us there and I’ll drive back."
        },
        {
            "id": 150,
            "phrase": "drive between something and something else",
            "definition": "to go in a vehicle between things or places.  I can’t drive between work and home in less than thirty minutes.  The cab driver drove between the airport and downtown more than twelve times in one day."
        },
        {
            "id": 151,
            "phrase": "drive down (to some place)",
            "definition": "to go in a vehicle to a relatively lower place or to a place in the south. We are going to drive down to Houston for the weekend. We were going to f ly to Florida, but it will be nice to drive down."
        },
        {
            "id": 152,
            "phrase": "drive into someone or something",
            "definition": "to strike someone or something while driving.  She drove into the garage and damaged the wall.  Accidentally, Fred drove into Max."
        },
        {
            "id": 153,
            "phrase": "drive in(to something)",
            "definition": "to enter something or some place by driving.  She drove right into the garage and stopped the car before she realized that she was not at her own house.  She drove in and looked around."
        },
        {
            "id": 154,
            "phrase": "drive off",
            "definition": "to leave somewhere, driving a vehicle.  She got in her car and drove off.  Please don’t drive off and leave me!"
        },
        {
            "id": 155,
            "phrase": "drive on",
            "definition": "to continue driving; to continue with one’s journey.  We drove on for a little while.  The traffic jam is breaking up, so we can drive on."
        },
        {
            "id": 156,
            "phrase": "drive one out of one’s mind",
            "definition": "to make someone go crazy; to frustrate someone.  You are driving me out of my mind with your nagging.  Henry was driven out of his mind by all the negative comments."
        },
        {
            "id": 157,
            "phrase": "drive out (to some place)",
            "definition": "to go in a vehicle to a place that is away from one’s home, away from a city, etc. We drove out to a little place in the country for a picnic. Why don’t you drive out this weekend? We would love to have you here."
        },
        {
            "id": 158,
            "phrase": "drive over (to some place)",
            "definition": "to go in a vehicle to some place that is neither close by nor far away.  Let’s drive over to Larry’s place.  Yes, let’s drive over. It’s too far to walk."
        },
        {
            "id": 159,
            "phrase": "Drive safely.",
            "definition": "an expression used to advise a departing person to be careful while driving.  Mary: Good-bye, Sally. Drive safely. Sally: Good-bye. I will. “Drive safely!” everyone shouted as we left on our trip."
        },
        {
            "id": 160,
            "phrase": "drive someone around something",
            "definition": "to transport a person in a vehicle on a tour of something or some place.  Fred will drive you around the city to see the sights.  He spent an hour driving himself around town."
        },
        {
            "id": 161,
            "phrase": "drive someone around the bend",
            "definition": "to make someone angry or very frustrated.  This tax stuff is about to drive me around the bend.  Gert will drive us all around the bend with her constant complaining."
        },
        {
            "id": 162,
            "phrase": "drive someone back on something",
            "definition": "to force someone to tap reserves of something.  The hard times drove them back on their life savings.  The challenges of being a corporate executive drove her back on all her personal resources."
        },
        {
            "id": 163,
            "phrase": "drive someone back to someone",
            "definition": "to force someone to return to someone, such as a spouse, lover, parent, etc.  Her bad experience with her new friend drove her back to her husband. Being homeless was no fun, and soon Wally was driven back to his parents."
        },
        {
            "id": 164,
            "phrase": "drive someone down (to some place)",
            "definition": "to transport someone to some place (as in town or away from home), or to a relatively lower place or to a place in the south.  She drove herself down to the hospital.  We have to drive Andrew down to school in the fall."
        },
        {
            "id": 165,
            "phrase": "drive someone into a corner",
            "definition": "to force someone into the place where two walls intersect. They drove him into a corner and captured him there.  When he is driven into a corner, he will fight."
        },
        {
            "id": 166,
            "phrase": "drive someone on† (to something)",
            "definition": "to make someone move onward toward some kind of success.  She said her parents drove her on to finish law school. They drove on their daughter to great things.  The thought of earning a large salary drove him on."
        },
        {
            "id": 167,
            "phrase": "drive someone or an animal away† (from something or some place)",
            "definition": "to repel someone or an animal from something or some place.  We drove the monkeys away from the pineapples.  We drove away the monkeys from the fruit."
        },
        {
            "id": 168,
            "phrase": "drive someone or something back†",
            "definition": "to force someone or something away; to force someone or something to retreat.  The infantry drove the attackers back into the desert.  They drove back the invading army.  We drove them back to the border."
        },
        {
            "id": 169,
            "phrase": "drive someone or something off†",
            "definition": "to repel or chase away someone or something.  The campers drove the cows off before the animals trampled the tents. They drove off the cows."
        },
        {
            "id": 170,
            "phrase": "drive someone to despair",
            "definition": "to depress someone; to frustrate someone.  Sometimes raising an infant drives me to despair! _ The recent problems drove her to despair."
        },
        {
            "id": 171,
            "phrase": "drive someone to distraction",
            "definition": "to confuse or perplex someone. Can’t you see you’re driving her to distraction? _ The problems I am having with my boss are driving me to distraction."
        },
        {
            "id": 172,
            "phrase": "drive someone to do something",
            "definition": "to force someone to do something. Poverty drove him to steal. She drove herself to earn a living."
        },
        {
            "id": 173,
            "phrase": "drive someone to drink",
            "definition": "[for someone or something] to cause someone to turn to alcohol as an escape from frustration.  Being a Cubs fan is enough to drive you to drink.  She was driven to drink by the problems she had with her teenage son."
        },
        {
            "id": 174,
            "phrase": "drive someone up the wall",
            "definition": "to annoy or irritate someone.  Stop whistling that tune. You’re driving me up the wall. All his talk about moving to California nearly drove me up the wall."
        },
        {
            "id": 175,
            "phrase": "drive someone up (to some place)",
            "definition": "to transport someone to a place on a higher level or to a place in the north.  Ralph drove Sally up to the cabin.  He was going to drive her up last week, but could not."
        },
        {
            "id": 176,
            "phrase": "drive something around something",
            "definition": "1. to steer or propel something around something. Wally drove the small car around the post easily. Please drive your truck around the corner carefully. 2. to go in a vehicle through different parts of a place. He drove his new car around town, hoping everyone would see it.  We drove the car around the parade route twice so everyone could get a good look at it."
        },
        {
            "id": 177,
            "phrase": "drive something down† (to some place)",
            "definition": "to transport a vehicle to a place by driving it there. I will drive the car down to the college and leave it there for you.  I’ll drive down the car and meet you.  Do I have to drive the car down? Can’t you f ly up here and get it?"
        },
        {
            "id": 178,
            "phrase": "drive something into someone or something",
            "definition": "to strike someone or something while driving. He drove the truck right into the abutment.  She drove the car into the side of the garage."
        },
        {
            "id": 179,
            "phrase": "drive through (something)",
            "definition": "to go in a vehicle from one side of something to the other; to pass through something while driving.  We drove through some nice little towns on the way here.  We didn’t stop. We just drove through."
        },
        {
            "id": 180,
            "phrase": "drive up (to some place)",
            "definition": "to arrive some place in a vehicle.  She drove up to the door and stopped.  Sally drove up and honked."
        },
        {
            "id": 181,
            "phrase": "*the driving force (behind someone or something)",
            "definition": "the person or a thing that motivates or directs someone or something. (*Typically: be ~; become ~; serve as ~.) _Making money is the driving force behind most businesses. Ambition is the driving force behind Tom. Love can also be the driving force."
        },
        {
            "id": 182,
            "phrase": "drizzle down (on someone or something)",
            "definition": "to rain on someone or something.  The light rain drizzled down on the garden.  The rain drizzled down and soaked us because we had no umbrella."
        },
        {
            "id": 183,
            "phrase": "drone on (about someone or something)",
            "definition": "to lecture or narrate in a low-pitched, dull, and boring manner. The dull old professor droned on about Byron—or was it Keats? _It was Shelley and, yes, he did drone on."
        },
        {
            "id": 184,
            "phrase": "drone something out†",
            "definition": "to make a loud and low-pitched noise; to say something in a low-pitched and monotonous manner.  The announcer droned the winning numbers out.  She droned out the winning numbers."
        },
        {
            "id": 185,
            "phrase": "drool (all) over someone or something",
            "definition": "to drip saliva on someone or something.  You’re drooling all over my plate! _ The dog drooled all over my hand."
        },
        {
            "id": 186,
            "phrase": "drop a bundle (on something)",
            "definition": "Inf. to pay a lot of money for something.  Pete dropped a bundle on this car.  I always buy old used cars. I’ve never dropped a bundle on any car."
        },
        {
            "id": 187,
            "phrase": "drop a hint",
            "definition": "to give a tiny or careful hint about something.  Mary dropped a hint that she wanted a new ring for her birthday."
        },
        {
            "id": 188,
            "phrase": "drop across someone or something",
            "definition": "[for something long or wide] to fall on and lay on someone or something.  A snake dropped across the hood of the tourist bus as it passed under a tree.  As I lay sleeping, a ceiling panel dropped across me and woke me up."
        },
        {
            "id": 189,
            "phrase": "drop around (for something)",
            "definition": "to come for a casual visit that includes something such as tea, dinner, a drink, etc.  Drop around for a drink sometime.  Yes, please drop around."
        },
        {
            "id": 190,
            "phrase": "drop away",
            "definition": "to fall off; to fall away. The leaves were still dropping away from the trees in November. The dead branches dropped away from the tree."
        },
        {
            "id": 191,
            "phrase": "drop back",
            "definition": "1. to fall back to an original position.  His arm raised up and then dropped back.  The lid dropped back to its original position as soon as we let go of it. 2. to go slowly and lose one’s position in a march or procession.  He dropped back a bit and evened up the spacing in the line of marchers.  He got tired and dropped back a little."
        },
        {
            "id": 192,
            "phrase": "drop behind (in something)",
            "definition": "to fail to keep up with a schedule. I don’t want to drop behind in my work. She is dropping behind and needs someone to help her."
        },
        {
            "id": 193,
            "phrase": "drop behind (someone or something)",
            "definition": "to reduce speed and end up after someone or a group, at the back of a moving line.  I dropped behind the rest of the people, because I can’t walk that fast. I dropped behind the speeding pack of cars and drove a little slower."
        },
        {
            "id": 194,
            "phrase": "drop below someone or something",
            "definition": "to fall to a point lower than someone or something.  The gunman dropped below the cowboy’s hiding place and got ready to take a shot.  The temperature dropped below the freezing point."
        },
        {
            "id": 195,
            "phrase": "drop dead",
            "definition": "1. to die suddenly.  I understand that Tom Anderson dropped dead at his desk yesterday.  No one knows why Uncle Bob suddenly dropped dead. 2. Go away and stop bothering me. (Usually Drop dead!) _ If you think I’m going to put up with your rudeness all afternoon, you can just drop dead! _ Drop dead! I’m not your slave!"
        },
        {
            "id": 196,
            "phrase": "drop down",
            "definition": "1. [for someone] to fall down or stoop down.  Suddenly, Ted dropped down, trying not to be seen by someone in a passing car.  I dropped down as soon as I heard the loud sounds. 2. [for something] to fall from above. The tiles on the ceiling dropped down, one by one, over the years. The raindrops dropped down and gave the thirsty plants a drink."
        },
        {
            "id": 197,
            "phrase": "drop down (on someone or something)",
            "definition": "to fall on someone or something.  The leaves dropped down on the newly mowed lawn.  The wind blew a mighty gust and a thousand leaves dropped down."
        },
        {
            "id": 198,
            "phrase": "drop everything",
            "definition": "to stop doing whatever you are doing.  Drop everything and go outside. The house is on fire.  Do you expect me to drop everything and come and pick you up at school?"
        },
        {
            "id": 199,
            "phrase": "drop in one’s tracks",
            "definition": "1. to collapse from exhaustion.  I was so tired, I dropped in my tracks. Kelly almost dropped in her tracks from overwork. 2. to die instantly.  Finally, one day, he worked so hard that he dropped in his tracks.  I know that someday I will just drop in my tracks."
        },
        {
            "id": 200,
            "phrase": "Drop in sometime.",
            "definition": "Visit my home or office sometime when you are nearby. Bob: Bye, Bill, nice seeing you. Bill: Hey, drop in sometime. Bob: Okay.  “Drop in sometime,” said Bob to his uncle."
        },
        {
            "id": 201,
            "phrase": "drop like flies",
            "definition": "to faint, sicken, collapse, or die, in great numbers like houseflies dying in a large group.  It was a terrible year for the f lu. People were dropping like f lies."
        },
        {
            "id": 202,
            "phrase": "drop off",
            "definition": "[for a part of something] to break away and fall off.  The car’s bumper just dropped off—honest.  I lifted boxes until I thought my arms would drop off."
        },
        {
            "id": 203,
            "phrase": "drop off (to sleep)",
            "definition": "to go to sleep without difficulty; to fall asleep.  I sat in the warm room for five minutes, and then I dropped off to sleep.  After I’ve eaten dinner, I can drop off with no trouble at all."
        },
        {
            "id": 204,
            "phrase": "drop one’s drawers",
            "definition": "to lower one’s pant or underpants.  The boys dropped their drawers and jumped in the creek."
        },
        {
            "id": 205,
            "phrase": "drop one’s teeth",
            "definition": "to react with great surprise.  I almost dropped my teeth when she told me her news. They dropped their teeth when I told them I was married."
        },
        {
            "id": 206,
            "phrase": "drop out of sight",
            "definition": "to fall behind something and be seen no longer.  The pen dropped out of sight behind the sofa nevermore to be seen."
        },
        {
            "id": 207,
            "phrase": "drop out (of something)",
            "definition": "to fall out of something.  One by one, the skydivers dropped out of the plane.  The marshmallows dropped out of the bag."
        },
        {
            "id": 208,
            "phrase": "drop over",
            "definition": "to come for a casual visit.  We would love for you to drop over.  I would really like to drop over soon."
        },
        {
            "id": 209,
            "phrase": "drop someone or something down†",
            "definition": "to let someone or something fall.  He dropped his pants down, revealing the swimming trunks beneath. The rescuer dropped down the baby and the doctor caught it.  Sam went to the well and dropped a rock down."
        },
        {
            "id": 210,
            "phrase": "drop someone or something from something",
            "definition": "to release someone or something from some higher point. Galileo proved that two objects of different weights dropped from the same height will reach the ground at the same time."
        },
        {
            "id": 211,
            "phrase": "drop someone or something like a hot potato",
            "definition": "to disassociate oneself with someone or something instantly.  When we learned of the conviction, we dropped him like a hot potato.  I dropped the idea like a hot potato when the big boss said he didn’t like it."
        },
        {
            "id": 212,
            "phrase": "drop someone or something off† (some place)",
            "definition": "to let someone or a group out of a vehicle at a particular place; to deliver someone or something some place. Let’s drop these shirts off at the cleaners.  Let’s drop off Tom and Jerry at the hamburger joint."
        },
        {
            "id": 213,
            "phrase": "drop someone or something on someone or something",
            "definition": "to release something so it falls on someone or something.  Poor Alice dropped an iron on her toe.  I accidentally dropped the baby on the f loor."
        },
        {
            "id": 214,
            "phrase": "drop something across something",
            "definition": "to let something fall in such a way that a span is bridged; to let something fall in such a way that a pathway is blocked.  Let’s drop a little rug across the threshold.  They dropped a huge boulder across the road so no one could pass."
        },
        {
            "id": 215,
            "phrase": "drop something on someone",
            "definition": "to let something fall on someone.  The bricklayer dropped some mortar on me."
        },
        {
            "id": 216,
            "phrase": "drop the ball",
            "definition": "[in a ball game of some type] to let the ball get away or fall out of one’s grasp.  Good grief! Bill dropped the ball, just as he was about to score!"
        },
        {
            "id": 217,
            "phrase": "drop the other shoe",
            "definition": "to do the deed that completes something; to do the expected remaining part of something. Mr. Franklin has left his wife. Soon he’ll drop the other shoe and divorce her. Tommy has just failed three classes in school. We expect him to drop the other shoe and quit altogether any day now."
        },
        {
            "id": 218,
            "phrase": "drop up (some place)",
            "definition": "to come for a visit to a place that is relatively higher or in the north.  Drop up and see us sometime.  Please drop up when you can."
        },
        {
            "id": 219,
            "phrase": "drop-dead gorgeous",
            "definition": "Sl. very good-looking.  Perry’s girlfriend is drop-dead gorgeous. How can a twit like him hold onto a looker like that?"
        },
        {
            "id": 220,
            "phrase": "drown in something",
            "definition": "to be asphyxiated in some liquid.  Wouldn’t you hate to drown in that nasty, smelly water? _I am not choosy about what I don’t want to drown in."
        },
        {
            "id": 221,
            "phrase": "drown someone in something",
            "definition": "to inundate someone with something.  I will drown you in money and fine clothes. Mike drowned the nightclub singer in fancy jewels and furs."
        },
        {
            "id": 222,
            "phrase": "drown someone or an animal in something",
            "definition": "to cause someone or an animal to die of asphyxiation in a liquid.  He accidentally drowned the cat in the bathtub. She drowned herself in the lake."
        },
        {
            "id": 223,
            "phrase": "drown someone or an animal out†",
            "definition": "[for a flood] to drive someone or an animal away from home.  The high waters almost drowned the farmers out last year.  The water drowned out the fields."
        },
        {
            "id": 224,
            "phrase": "drown someone or something out†",
            "definition": "[for a sound] to be so loud that someone or something cannot be heard.  The noise of the passing train drowned out our conversation.  The train drowned us out."
        },
        {
            "id": 225,
            "phrase": "A drowning man will clutch at a straw.",
            "definition": "Prov. When you are desperate, you will look for anything that might help you, even if it cannot help you very much.  Scott thinks this faith healer will cure his baldness. A drowning man will clutch at a straw."
        },
        {
            "id": 226,
            "phrase": "drum on something",
            "definition": "to tap, thump, or beat on something in rhythm. Who is drumming on the table? _Please stop drumming on the wall."
        },
        {
            "id": 227,
            "phrase": "drum something out†",
            "definition": "to beat a rhythm, loudly and clearly, as if teaching it to someone. Drum the rhythm out before you try to sing this song.  Drum out the rhythm first."
        },
        {
            "id": 228,
            "phrase": "drum something up†",
            "definition": "to obtain something by attracting people’s attention to one’s need or cause. I shall try to drum up support for the party.  You shall have to drum up new business by advertising.  I need to do something to drum some business up."
        },
        {
            "id": 229,
            "phrase": "drunk and disorderly",
            "definition": "a criminal charge for public drunkenness accompanied by bad or offensive behavior.  The judge fined Richard for being drunk and disorderly.  In addition to being convicted for driving while intoxicated, Richard was found guilty of being drunk and disorderly."
        },
        {
            "id": 230,
            "phrase": "dry out",
            "definition": "to become dry.  The clothes finally dried out in the wet weather."
        },
        {
            "id": 231,
            "phrase": "dry run",
            "definition": "an attempt; a practice or rehearsal. We had better have a dry run for the official ceremony tomorrow.  The children will need another dry run before their procession in the pageant."
        },
        {
            "id": 232,
            "phrase": "dry someone or something off†",
            "definition": "to remove the moisture from someone or something.  Please dry your feet off before coming in.  Dry off your feet before you come in here!"
        },
        {
            "id": 233,
            "phrase": "dry someone out†",
            "definition": "to cause someone to become sober; to cause someone to stop drinking alcohol to excess.  If the doctor at the clinic can’t dry him out, no one can. The hospital will dry out Mary and start treatment."
        },
        {
            "id": 234,
            "phrase": "dry something out†",
            "definition": "to make something become dry. Dry this out and put it on immediately.  Dry out your jacket in the clothes dryer."
        },
        {
            "id": 235,
            "phrase": "dry something up†",
            "definition": "1. to cause moisture to dry away to nothing. Dry this spill up with the hair dryer. Will the hair dryer dry up this mess? 2. to cure a skin rash by the use of medicine that dries.  Let’s use some of this to try to dry that rash up. This medicine will dry up your rash in a few days."
        },
        {
            "id": 236,
            "phrase": "dry spell",
            "definition": "Rur. a period with no rain. The dry spell killed the crops.  We ain’t had such a long dry spell since 1988."
        },
        {
            "id": 237,
            "phrase": "dry up",
            "definition": "[for something] to dry away to nothing.  Finally, the water on the track dried up, and the race was able to continue.  When will the fields dry up so we can plant?"
        },
        {
            "id": 238,
            "phrase": "dry-gulch someone",
            "definition": "to ambush someone.  The outlaw dry-gulched the traveler and took everything he had. The posse planned to dry-gulch the outlaw by waiting outside his favorite saloon."
        },
        {
            "id": 239,
            "phrase": "dub something in†",
            "definition": "to mix a new sound recording into an old one.  The actor messed up his lines, but they dubbed the correct words in later.  They dubbed in his lines."
        },
        {
            "id": 240,
            "phrase": "dub something over†",
            "definition": "to record a replacement sound over another sound in a recording. They had dubbed over all the dialog in the movie. It doesn’t matter if you say a word wrong on the tape. We can dub it over."
        },
        {
            "id": 241,
            "phrase": "duck and cover",
            "definition": "to bend down and seek protection against an attack.  When the gunfire started, we had to duck and cover or get killed."
        },
        {
            "id": 242,
            "phrase": "duck down",
            "definition": "to stoop down quickly, as if to avoid being hit.  He ducked down when he heard the gunshot.  Duck down and get out of the way."
        },
        {
            "id": 243,
            "phrase": "duck out (of some place)",
            "definition": "to sneak out of some place. She ducked out of the theater during the intermission.  When no one was looking, she ducked out."
        },
        {
            "id": 244,
            "phrase": "duck out (of something)",
            "definition": "to evade something; to escape doing something.  Are you trying to duck out of your responsibility? _Fred tried to duck out of going to the dance."
        },
        {
            "id": 245,
            "phrase": "duck soup",
            "definition": "very easy; an easy thing to do. For Maria, knitting a sweater is duck soup.  Jill: This jar is stuck. Could you open it for me? Jane: Sure. Duck soup."
        },
        {
            "id": 246,
            "phrase": "dude (oneself) up",
            "definition": "Sl. to dress in fancy or stylish clothing. I have to go dude myself up for the party. I’m not going to dude up tonight.  Why don’t you dude yourself up so we can go out tonight?"
        },
        {
            "id": 247,
            "phrase": "duded up",
            "definition": "Sl. dressed up. She got all duded up in her fanciest dancing dress. He hates fancy clothes. He didn’t even get duded up for his own wedding."
        },
        {
            "id": 248,
            "phrase": "duke it out",
            "definition": "Sl. to have a fistfight.  John told George to meet him in the alley so they could duke it out."
        },
        {
            "id": 249,
            "phrase": "duke someone out†",
            "definition": "Sl. to knock someone out.  Wilbur tried to duke the guy out first.  Bob duked out the mugger with a jab to the cheek."
        }
    ]
}