{
    "dictionary": [
        {
            "id": 0,
            "phrase": "put balls on something",
            "definition": "Sl. to make something more masculine or powerful; to give something authority and strength. (Potentially offensive. Use only with discretion.) _ Come on, sing louder. Put some balls on it.  This story is too namby-pamby. Put some balls on it."
        },
        {
            "id": 1,
            "phrase": "Put ‘er there(, pal).",
            "definition": "Inf. Please shake hands with me.  Glad to meet you. Put ‘er there, pal."
        },
        {
            "id": 2,
            "phrase": "put hair on someone’s chest",
            "definition": "to do or take something to invigorate or energize someone, always a male, except in jest.  Here, have a drink of this stuff! It’ll put hair on your chest.  That stuff is powerful. It will really put hair on your chest."
        },
        {
            "id": 3,
            "phrase": "put ideas into someone’s head",
            "definition": "to suggest something— usually something bad—to someone (who would not have thought of it otherwise). Bill keeps getting into trouble. Please don’t put ideas into his head.  Bob would get along all right if other kids didn’t put ideas into his head."
        },
        {
            "id": 4,
            "phrase": "put in a good word (for someone)",
            "definition": "to say something (to someone) in support of someone else. I hope you get the job. I’ll put in a good word for you. Yes, I want the job. If you see the boss, please put in a good word."
        },
        {
            "id": 5,
            "phrase": "put in an appearance (at something)",
            "definition": "to appear briefly at some place or at some event.  I only wanted to put in an appearance at the reception, but I ended up staying for two hours.  Do we have to stay a long time, or can we just put in an appearance?"
        },
        {
            "id": 6,
            "phrase": "put in for something",
            "definition": "to apply for something; to make a request for something.  I put in for a transfer, but I bet I don’t get it. She put in for a new file cabinet, but she never got one."
        },
        {
            "id": 7,
            "phrase": "put money up† (for something)",
            "definition": "to provide the funding for something. The government put the money up for the cost of construction.  Who will put up the money for my education?"
        },
        {
            "id": 8,
            "phrase": "put off by someone or something",
            "definition": "distressed or repelled by someone or something.  I was really put off by your behavior.  We were all put off by the unfairness of the rules."
        },
        {
            "id": 9,
            "phrase": "put on an act",
            "definition": "to pretend that one is something other than what one is.  Be yourself, Ann. Stop putting on an act.  You don’t have to put on an act. We accept you the way you are."
        },
        {
            "id": 10,
            "phrase": "put on weight",
            "definition": "to gain weight; to get fat.  I think I am putting on a little weight. I had better go on a diet.  He has put on a lot of weight since last year."
        },
        {
            "id": 11,
            "phrase": "put one at (one’s) ease",
            "definition": "to cause someone to relax or feel welcome.  She usually tells a little joke to put you at your ease.  Please do something to put me at ease."
        },
        {
            "id": 12,
            "phrase": "put one foot in front of the other",
            "definition": "to walk deliberately.  I was so tired that I could hardly even put one foot in front of the other. She was putting one foot in front of the other so carefully that I thought she must be ill."
        },
        {
            "id": 13,
            "phrase": "put one in one’s place",
            "definition": "to rebuke someone; to remind one of one’s (lower) rank or station.  The boss put me in my place for criticizing her. Then her boss put her in her place for being rude."
        },
        {
            "id": 14,
            "phrase": "put one off one’s stride",
            "definition": "to cause one to deviate from a rhythmic stride while walking, running, or marching. A rabbit ran across the path and put me off my stride."
        },
        {
            "id": 15,
            "phrase": "put one on one’s guard",
            "definition": "to make one wary or cautious.  The menacing growl by the watchdog put me on my guard.  Every time the boss comes around, it puts me on my guard."
        },
        {
            "id": 16,
            "phrase": "put one on one’s honor",
            "definition": "to inform one that one is trusted to act honorably, legally, and fairly without supervision.  I’ll put you on your honor when I have to leave the room during the test. They put us on our honor to take no more than we had paid for."
        },
        {
            "id": 17,
            "phrase": "put one out of (one’s) misery",
            "definition": "1. Euph. Fig. to kill someone as an act of mercy.  Why doesn’t the doctor simply put her out of her misery? _He took pills to put himself out of his misery. 2. Fig. to end a suspenseful situation for someone.  Please, put me out of misery; what happened? _ I put her out of her misery and told her how the movie ended."
        },
        {
            "id": 18,
            "phrase": "put one’s back (in)to something",
            "definition": "1. Fig. to apply great physical effort to lift or move something. All right, you guys. Put your backs into moving this piano.  You can lift it if you put your back to it. 2. Fig. to apply a lot of mental or creative effort to doing something. (From Q.) _If we put our backs to it, we can bake twelve dozen cookies today.  The artist put his back into finishing the picture on time."
        },
        {
            "id": 19,
            "phrase": "put one’s best foot forward",
            "definition": "to act or appear at one’s best; to try to make a good impression. When you apply for a job, you should always put your best foot forward.  I try to put my best foot forward whenever I meet someone for the first time."
        },
        {
            "id": 20,
            "phrase": "put one’s dibs on something",
            "definition": "to lay a claim to something; to announce one’s claim to something.  She put her dibs on the last piece of cake.  I put my dibs on the seat by the window."
        },
        {
            "id": 21,
            "phrase": "put one’s face on",
            "definition": "[for a woman] to apply cosmetics.  Martha’s gone to put her face on.  We’ll be on our way once my wife has put her face on."
        },
        {
            "id": 22,
            "phrase": "put one’s feet up†",
            "definition": "to sit down, lean back, and rest; to lie down. He was really exhausted and had to go put his feet up.  Time to put up my feet and get some rest."
        },
        {
            "id": 23,
            "phrase": "put one’s finger on something",
            "definition": "to touch something with one’s finger.  I put my finger on the button and pressed.  Put your finger on this spot and push hard."
        },
        {
            "id": 24,
            "phrase": "put one’s foot down (about someone or something)",
            "definition": "to assert something strongly. The boss put her foot down and refused to accept any more changes to the plan."
        },
        {
            "id": 25,
            "phrase": "put one’s hair up†",
            "definition": "to arrange one’s hair into a ponytail, bun, etc. (with curlers, hairpins, etc.).  I can’t go out because I just put my hair up.  I put up my hair every night."
        },
        {
            "id": 26,
            "phrase": "put one’s hand to the plow",
            "definition": "to get busy; to help out; to start working. (Alludes to grasping a plow, ready to work the fields.) _ You should start work now. It’s time to put your hand to the plow. Put your hand to the plow and get the job done!"
        },
        {
            "id": 27,
            "phrase": "put one’s hand up†",
            "definition": "to raise one’s hand to get attention from whomever is in charge.  The student put his hand up to ask a question of the teacher.  She put up her hand to ask a question."
        },
        {
            "id": 28,
            "phrase": "put one’s head on the block (for someone or something)",
            "definition": "to take great risks for someone or something; to go to a lot of trouble or difficulty for someone or something; to attempt to gain favor for someone or something.  I don’t know why I should put my head on the block for Joan. What has she ever done for me? _ Sally tried to get me to put in a good word about her with the boss. But the last time I put my head on the block for anyone, it all backfired, and when the person goofed up, I looked like an idiot!"
        },
        {
            "id": 29,
            "phrase": "put one’s heart (and soul) into something",
            "definition": "to put all of one’s sincere efforts into something. She put her heart and soul into the singing of the national anthem.  Come on, choir. You can sing better than that. Put your heart into it!"
        },
        {
            "id": 30,
            "phrase": "put one’s house in order",
            "definition": "to put one’s business or personal affairs into good order. (As if one were cleaning one’s house. See also put one’s own house in order.) _ There was some trouble in the department office and the manager was told to put his house in order.  Every now and then, I have to put my house in order. Then life becomes more manageable."
        },
        {
            "id": 31,
            "phrase": "put one’s money on someone or something (to do something)",
            "definition": "1. Fig. to bet money that someone or something will accomplish something.  I put my money on the favorite to win the race.  Donna put her money on the winning horse. 2. Fig. to predict the outcome of an event involving someone or something. (This is not a wager.) _ I put my money on Bob to get elected this time.  Alice put her money on the most popular candidate."
        },
        {
            "id": 32,
            "phrase": "put one’s neck on the line",
            "definition": "to put oneself at great risk.  I put my neck on the line and recommended you for the job, and now look what you’ve done! I’m ruined!"
        },
        {
            "id": 33,
            "phrase": "put one’s nose to the grindstone",
            "definition": "to keep busy doing one’s work. (Also with have and get, as in the examples.) _ The boss told me to put my nose to the grindstone.  I’ve had my nose to the grindstone ever since I started working here.  If the other people in this office would get their noses to the grindstone, more work would get done."
        },
        {
            "id": 34,
            "phrase": "put one’s own house in order",
            "definition": "to make one’s own affairs right, before or instead of criticizing someone else. You should put your own house in order before criticizing someone else.  I have to put my own house in order before I criticize others."
        },
        {
            "id": 35,
            "phrase": "put one’s thinking cap on†",
            "definition": "to start thinking in a serious manner. (Usually used with children.) _ It’s time to put our thinking caps on, children.  All right now, let’s put on our thinking caps and do some arithmetic."
        },
        {
            "id": 36,
            "phrase": "put one’s trust in someone or something",
            "definition": "to trust someone or something. Will I never be able to put my trust in you? _ You can put your trust in the bank. Its deposits are insured."
        },
        {
            "id": 37,
            "phrase": "put oneself out",
            "definition": "to inconvenience oneself.  I just don’t know why I put myself out for you! _ No, I did not put myself out at all. It was no trouble, in fact."
        },
        {
            "id": 38,
            "phrase": "put out",
            "definition": "to generate [lots of something].  What a great machine. It really puts out! _ The new laser printer really puts out!"
        },
        {
            "id": 39,
            "phrase": "put out (about someone or something)",
            "definition": "irritated; bothered.  John behaved rudely at the party, and the hostess was quite put out.  Liz was quite put out about the question."
        },
        {
            "id": 40,
            "phrase": "put out (some) feelers (on someone or something)",
            "definition": "to arrange to find out about something in an indirect manner.  I put out some feelers on Betty to try and find out what is going on.  I will put out feelers on what’s going on with June."
        },
        {
            "id": 41,
            "phrase": "put paid to something",
            "definition": "to consider something closed or completed; to mark or indicate that something is no longer important or pending. (As if one were stamping a bill “paid”.) _ At last, we were able to put paid to the matter of who is to manage the accounts."
        },
        {
            "id": 42,
            "phrase": "put people or things together",
            "definition": "to join or combine people or things. We will put Sam and Trudy together at the dinner table.  Let’s put all the crystal goblets together."
        },
        {
            "id": 43,
            "phrase": "put people’s heads together",
            "definition": "to join together with someone to confer.  Let’s put our heads together and come up with a solution to this problem.  Mary and Ted put their heads together, but failed to provide anything new."
        },
        {
            "id": 44,
            "phrase": "put pressure on something",
            "definition": "to apply weight or pressure to something. Put pressure on the wound to stop the bleeding. Put some pressure on the papers to f latten them out."
        },
        {
            "id": 45,
            "phrase": "put roots down† (some place)",
            "definition": "to settle down somewhere; to make a place one’s permanent home.  I’m not ready to put roots down anywhere yet.  I’m ready to put down roots some place. I want to settle down. I want to put roots down and buy a house."
        },
        {
            "id": 46,
            "phrase": "put some creature out of its misery",
            "definition": "to kill an animal in a humane manner.  The vet put that dog with cancer out of its misery.  Please, put my sick goldfish out of its misery."
        },
        {
            "id": 47,
            "phrase": "put some distance between someone and oneself or something",
            "definition": "to move or travel away from someone or something.  Jill and I aren’t getting along. I need to put some distance between her and me. I drove fast to put some distance between Max and me."
        },
        {
            "id": 48,
            "phrase": "put some teeth into something",
            "definition": "to increase the power or efficacy of something.  The mayor tried to put some teeth into the new law. The delivery clause in the contract is too weak. Put some teeth into it."
        },
        {
            "id": 49,
            "phrase": "put (some) years on someone or something",
            "definition": "to cause someone or something to age prematurely; to cause deterioration in the state of someone or something. (The some may be replaced with a specific number or period of time.) _ The events of the last week have really put a lot of years on Gerald.  The severe weather put many years on the roof of the house."
        },
        {
            "id": 50,
            "phrase": "put someone down as something bad",
            "definition": "to judge that someone is bad or undesirable in some way.  He was so rude that I put him down as someone to be avoided. If you act silly all the time, people will put you down as a fool."
        },
        {
            "id": 51,
            "phrase": "put someone down (for something)",
            "definition": "to put someone’s name on a list of people who volunteer to do something or give an amount of money.  Can I put you down for ten dollars? _We’re having a picnic, and you’re invited. Everyone is bringing something. Can I put you down for potato salad?"
        },
        {
            "id": 52,
            "phrase": "put someone in an awkward position",
            "definition": "to make a situation difficult for someone; to make it difficult for someone to evade or avoid acting. Your demands have put me in an awkward position. I don’t know what to do.  I’m afraid I’ve put myself in sort of an awkward position."
        },
        {
            "id": 53,
            "phrase": "put someone in mind of someone or something",
            "definition": "to remind someone of someone or something.  Mary puts me in mind of her mother when she was that age.  This place puts me in mind of the village where I was brought up."
        },
        {
            "id": 54,
            "phrase": "put someone in touch with someone or something",
            "definition": "to cause or help someone to communicate with someone or something.  Can you put me in touch with Liz? _ Would you please put me in touch with the main office?"
        },
        {
            "id": 55,
            "phrase": "put someone off†",
            "definition": "1. to delay dealing with someone until a later time.  I hate to keep putting you off, but we are not ready to deal with you yet.  I had to put off the plumber again. He really wants his money. 2. to repel someone; to distress someone.  You really put people off with your scowling face.  You put off people with your arrogance. 3. to avoid or evade someone.  I don’t wish to see Mr. Brown now. Please put him off.  I won’t talk to reporters. Tell them something that will put them off.  Put off those annoying people!"
        },
        {
            "id": 56,
            "phrase": "put someone off the scent",
            "definition": "to distract someone or a group from following a scent or trail. (From put a dog off the scent; the scent or trail can be purely figurative. The clever maneuvers of the bandits put the sheriff ’s posse off the scent. The mob laundered the drug money to try to put investigators off the trail."
        },
        {
            "id": 57,
            "phrase": "put someone on hold",
            "definition": "to stop all activity or communication with someone. John put Ann on hold and started dating Mary.  “You can’t just put me on hold!” cried Ann."
        },
        {
            "id": 58,
            "phrase": "put someone on the spot",
            "definition": "to ask someone forthright questions; to demand that someone produce as expected.  Don’t put me on the spot. I can’t give you an instant answer. The boss put Bob on the spot and demanded that he do everything he had promised."
        },
        {
            "id": 59,
            "phrase": "put someone onto someone or something",
            "definition": "to alert someone to the existence of someone or something; to lead someone to someone or something.  Nancy put Elaine onto George, who knew of a job that Elaine might be interested in.  Nancy put Elaine onto a good job lead."
        },
        {
            "id": 60,
            "phrase": "put someone or an animal to sleep",
            "definition": "1. to cause someone or an animal to sleep, perhaps through drugs or anesthesia.  The doctor put the patient to sleep before the operation.  I put the cat to sleep by stroking its tummy. 2. Euph. to kill someone or an animal.  We had to put our dog to sleep.  The robber said he’d put us to sleep forever if we didn’t cooperate."
        },
        {
            "id": 61,
            "phrase": "put someone or some creature to death",
            "definition": "to kill someone or some creature.  The killer was put to death right at midnight."
        },
        {
            "id": 62,
            "phrase": "put someone or something above someone or something",
            "definition": "to place someone or something at a higher level than someone or something. The captain put one soldier above the wall so he could see trouble coming.  In the painting, the artist put an angel above the small shed."
        },
        {
            "id": 63,
            "phrase": "put someone or something ahead (of someone or something)",
            "definition": "1. to move or place someone or something in front of someone or something.  The teacher put Freddie ahead of Mike, because Mike had been disrespectful.  Don’t put him ahead! I didn’t do anything. 2. to think of someone or something as more important than someone or something. I put Gerry ahead of Betty as far as strength is concerned.  Yes, I would put Gary ahead.  She put herself ahead of everyone else and expected special treatment."
        },
        {
            "id": 64,
            "phrase": "put someone or something among someone or something",
            "definition": "to place someone or something in the midst of people or things.  The martial arts instructor put Fred among the strongest students to see what he would do.  The shopkeeper put the green pears among the ripe ones and tried to sell them."
        },
        {
            "id": 65,
            "phrase": "put someone or something at someone’s disposal",
            "definition": "to make someone or something available to someone; to offer someone or something to someone.  I’d be glad to help you if you need me. I put myself at your disposal.  I put my car at my neighbor’s disposal."
        },
        {
            "id": 66,
            "phrase": "put someone or something down†",
            "definition": " Fig. to belittle or degrade someone or something.  It’s an old car, but that’s no reason to put it down.  You put down everything you don’t understand!"
        },
        {
            "id": 67,
            "phrase": "put someone or something down† as something",
            "definition": "to write down the name of someone or a group as something.  I will put you down as cook for the benefit luncheon.  I put down John as a likely prospect."
        },
        {
            "id": 68,
            "phrase": "put someone or something forward",
            "definition": "to move someone or something forward. The director put all the players forward during the last scene, leaving more room for the chorus to come on for the finale.  Could you put your left foot forward a little?"
        },
        {
            "id": 69,
            "phrase": "put someone or something in(to) jeopardy",
            "definition": "to put someone or something into danger.  What you just said puts Bill into jeopardy.  It puts his plans in jeopardy."
        },
        {
            "id": 70,
            "phrase": "put someone or something into order",
            "definition": "to put people or things into a proper sequence.  Would you please put these people into order by height so we can march into the auditorium? _ Could you put these magazines into order?"
        },
        {
            "id": 71,
            "phrase": "put someone or something on hold",
            "definition": "to put someone or someone’s telephone call on an electronic hold.  Please don’t put me on hold! I’m in a hurry! _ I am going to have to put your call on hold."
        },
        {
            "id": 72,
            "phrase": "put someone or something on ice",
            "definition": "to put a body part or corpse on ice or under refrigeration to preserve it; to put a foodstuff on ice or under refrigeration to cool it.  The surgeon transplanted a heart that had been put on ice for two hours.  Please put the soda pop on ice."
        },
        {
            "id": 73,
            "phrase": "put someone or something out of one’s mind",
            "definition": "to forget someone or something; to make an effort to stop thinking about someone or something. (Almost the same as get someone or something out of one’s mind.) _Try to put it out of your mind.  I can’t seem to put him out of my mind."
        },
        {
            "id": 74,
            "phrase": "put someone or something out of the way",
            "definition": "to move someone or something out of a pathway.  Please put that chair out of the way before someone trips on it. Put the baby out of the way so the noise doesn’t bother her."
        },
        {
            "id": 75,
            "phrase": "put someone or something over",
            "definition": "to succeed in making someone or something be accepted.  The public relations expert helped put John over to the public.  Do you think we can put this new product over?"
        },
        {
            "id": 76,
            "phrase": "put someone or something through (to someone)",
            "definition": "to put someone’s telephone call through to someone. Will you please put me through to the international operator? _ Please put my call through."
        },
        {
            "id": 77,
            "phrase": "put someone or something to the test",
            "definition": "to see what someone or something can achieve.  I think I can jump that far, but no one has ever put me to the test.  I’m going to put my car to the test right now, and see how fast it will go."
        },
        {
            "id": 78,
            "phrase": "put someone or something under something",
            "definition": "to place someone or something beneath something.  Dave put Sam under the loft in the barn, hoping no one would find him there.  Alice put the birthday present under the couch, where she could get to it in a hurry."
        },
        {
            "id": 79,
            "phrase": "put someone or something with someone",
            "definition": "to place someone or something with someone; to assign someone or something to someone.  I will put David with you and let you two work together for a while.  I will put this project with you for the time being."
        },
        {
            "id": 80,
            "phrase": "put someone out†",
            "definition": "to distress or inconvenience someone.  I’d like to have a ride home, but not if it puts you out.  Don’t worry. It won’t put out anybody."
        },
        {
            "id": 81,
            "phrase": "put someone out of the way",
            "definition": "Euph. to kill someone.  The police suspected that she had put her uncle out of the way in order to inherit his property."
        },
        {
            "id": 82,
            "phrase": "put someone out to pasture",
            "definition": "to retire someone. (Based on put a horse out to pasture.) _ Please don’t put me out to pasture. I have lots of good years left.  This vice president has reached retirement age. It’s time to put him out to pasture."
        },
        {
            "id": 83,
            "phrase": "put someone’s eye out†",
            "definition": "to puncture or harm someone’s eye and destroy its ability to see.  Careful with that stick or you’ll put your eye out.  He fell on a stick and almost put out his eye!"
        },
        {
            "id": 84,
            "phrase": "put someone’s nose out of joint",
            "definition": "to make someone resentful. What’s wrong with Jill? What put her nose out of joint? _ Don’t put your nose out of joint. I didn’t mean anything by what I said."
        },
        {
            "id": 85,
            "phrase": "put someone through something",
            "definition": "to cause someone to have to endure something. The doctor said he hated to put me through all these tests, but that it was medically necessary."
        },
        {
            "id": 86,
            "phrase": "put someone through the wringer",
            "definition": "to give someone a difficult time; to interrogate someone thoroughly. (Alludes to putting something through an old-fashioned clothes wringer.) _ The lawyer really put the witness through the wringer! _ The teacher put the students through the wringer."
        },
        {
            "id": 87,
            "phrase": "put someone to bed with a shovel",
            "definition": "Sl. to bury someone; to kill and bury someone. Shut up! You want me to put you to bed with a shovel? _ The leader of the gang was getting sort of tired and old, so one of the younger thugs put him to bed with a shovel."
        },
        {
            "id": 88,
            "phrase": "put someone to shame",
            "definition": "1. to embarrass someone; to make someone ashamed.  I put him to shame by telling everyone about his bad behavior. 2. to show someone up. Your excellent efforts put us all to shame."
        },
        {
            "id": 89,
            "phrase": "put someone to sleep",
            "definition": "to bore someone.  That dull lecture put me to sleep. Her long story just put me to sleep. "
        },
        {
            "id": 90,
            "phrase": "put someone under",
            "definition": "to anesthetize someone.  They put him under with ether.  After you put her under, we will begin the operation."
        },
        {
            "id": 91,
            "phrase": "put someone up†",
            "definition": "to provide lodging for someone. I hope I can find someone to put me up.  They were able to put up John for the night."
        },
        {
            "id": 92,
            "phrase": "put someone up against someone",
            "definition": "to place someone into competition with someone else.  The coach put his best wrestler up against the champ from the other team.  The varsity put themselves up against the alumni team in a game to benefit charity."
        },
        {
            "id": 93,
            "phrase": "put someone up† (for something)",
            "definition": "to nominate or offer someone for some office or task. I put Henry up for club president.  We put up Shannon for treasurer."
        },
        {
            "id": 94,
            "phrase": "put someone up to something",
            "definition": "to cause someone to do something; to give someone the idea of doing something.  Who put you up to throwing the party? _ Nobody put me up to it. I thought it up myself."
        },
        {
            "id": 95,
            "phrase": "put someone up with someone",
            "definition": "to house someone with someone.  I will put her up with my cousin, who has an extra bedroom.  We will put up the lady with us."
        },
        {
            "id": 96,
            "phrase": "put something aside†",
            "definition": "to set or place something to the side.  I put the magazine aside and began reading a book.  Put aside your work for a minute and listen to what I have to tell you."
        },
        {
            "id": 97,
            "phrase": "put something aside† (for something)",
            "definition": "to hold something in reserve for some purpose.  You should put a little of the sugar aside for your coffee in the morning.  Please put aside some money for me.  I can put a little aside."
        },
        {
            "id": 98,
            "phrase": "put something at a premium",
            "definition": "to make something available only at an extra cost or through extra effort.  The scarcity of fresh vegetables at this time of year puts broccoli at a premium.  The high demand for apples puts them at a premium."
        },
        {
            "id": 99,
            "phrase": "put something at an amount",
            "definition": "to price something at a certain amount of money; to estimate something at a certain figure.  I would put the charges at about two hundred dollars.  She put the damages at nearly two hundred thousand dollars."
        },
        {
            "id": 100,
            "phrase": "put something away†",
            "definition": "to return something to its proper storage place.  When you are finished with the hammer, please put it away. Don’t leave it out.  Put away this mess!"
        },
        {
            "id": 101,
            "phrase": "put something back†",
            "definition": "to return something to where it was before.  Please put the book back when you finish it.  Put back the book when you finish. "
        },
        {
            "id": 102,
            "phrase": "put something behind one",
            "definition": "to try to forget about something.  I look forward to putting all my problems behind me.  She will be happier when all this can be put behind her."
        },
        {
            "id": 103,
            "phrase": "put something behind someone or something",
            "definition": "to place something in back of someone or something.  I put the box behind Mary, and she didn’t even know it was there.  Please put the present behind the couch where Janet will not see it."
        },
        {
            "id": 104,
            "phrase": "put something down†",
            "definition": "to repress or put a stop to something such as a riot or rebellion.  The army was called to put down the rebellion.  The police used tear gas to put the riot down. "
        },
        {
            "id": 105,
            "phrase": "put (something) forth",
            "definition": "to exert effort.  You are going to have to put more effort forth if you want to succeed.  You need to put forth. You are not carrying your load."
        },
        {
            "id": 106,
            "phrase": "put something forward†",
            "definition": "to state an idea; to advance an idea.  Toward the end of the meeting, Sally put an idea forward.  He put several suggestions forward."
        },
        {
            "id": 107,
            "phrase": "put something in a nutshell",
            "definition": "to state something very concisely. (Alludes to the small size of a nutshell and the amount that it would hold.) _The explanation is long and involved, but let me put it in a nutshell for you.  To put it in a nutshell: you are fired!"
        },
        {
            "id": 108,
            "phrase": "put something in mothballs",
            "definition": "to put something into storage in mothballs.  He put his winter coat in storage with mothballs each fall and had to air it out for a week each spring."
        },
        {
            "id": 109,
            "phrase": "put something in quotes",
            "definition": "to put quotation marks around writing or printing. Please put this word in quotes, since it means something special the way you have used it here.  They put it in quotes so people would know it means something different."
        },
        {
            "id": 110,
            "phrase": "put something in the way of someone or something",
            "definition": "to place a barrier in the way of someone or something. You know I don’t want to put anything in the way of your happiness. I would never put anything in the way of you and Donna."
        },
        {
            "id": 111,
            "phrase": "put something in(to) order",
            "definition": "to make something tidy.  Please put this room into order.  I will put it in order as soon as I have a minute."
        },
        {
            "id": 112,
            "phrase": "put something into practice",
            "definition": "to make a suggested procedure the actual procedure.  That is a good policy. I suggest you put it into practice immediately. I plan to put the new technique into practice as soon as I can."
        },
        {
            "id": 113,
            "phrase": "put something in(to) print",
            "definition": "to publish something; to record something spoken in printed letters.  The article looks good. We will put it into print as soon as possible.  We’ll put it in print as soon as we can."
        },
        {
            "id": 114,
            "phrase": "put something in(to) someone’s head",
            "definition": "to give ideas to someone who might not have thought of them without help.  Who put that idea into your head? _ No one put it in my head. I thought of it all by myself."
        },
        {
            "id": 115,
            "phrase": "put something into words",
            "definition": "to form an idea into sentences that can be spoken or written.  I find it hard to put my thoughts into words.  She put it into words quite nicely."
        },
        {
            "id": 116,
            "phrase": "put something off†",
            "definition": "to postpone something; to schedule something for a later time.  I have to put off our meeting until a later time. I put off a visit to the dentist as long as I could."
        },
        {
            "id": 117,
            "phrase": "put something on hold",
            "definition": "to postpone something; to stop the progress of something. They put the project on hold until they got enough money to finish it.  Sorry, but we must put your plan on hold."
        },
        {
            "id": 118,
            "phrase": "put something on paper",
            "definition": "to write something down.  You have a great idea for a novel. Now put it on paper.  I’m sorry, I can’t discuss your offer until I see something in writing. Put it on paper, and then we’ll talk."
        },
        {
            "id": 119,
            "phrase": "put something on the cuff",
            "definition": "to buy something on credit; to add to one’s credit balance. I’ll take two of those, and please put them on the cuff. I’m sorry, Tom. We can’t put anything more on the cuff."
        },
        {
            "id": 120,
            "phrase": "put something on the map",
            "definition": "to make some place famous or popular.  The good food you serve here will really put this place on the map. Nothing like a little scandal to put an otherwise sleepy town on the map."
        },
        {
            "id": 121,
            "phrase": "put something on the street",
            "definition": "Sl. to tell something openly; to spread news.  There is no need to put all this gossip on the street. Keep it to yourself.  Now, please don’t put this on the street, but I am going to get married."
        },
        {
            "id": 122,
            "phrase": "put something out†",
            "definition": "1. to emit something.  The factory put a lot of fumes out. It put out nasty fumes. 2. to extinguish something on fire.  He used f lour to put the grease fire out.  He put out the fire with f lour. 3. to manufacture or produce something.  That factory puts electrical supplies out.  We put out some very fine products. 4. to publish something.  When was this book put out? _ We put out both books last year."
        },
        {
            "id": 123,
            "phrase": "put something over†",
            "definition": "to accomplish something; to put something across.  This is a very hard thing to explain to a large audience. I hope I can put over the main points. This is a big request for money. I go before the board of directors this afternoon, and I hope I can put it over."
        },
        {
            "id": 124,
            "phrase": "put something plainly",
            "definition": "to state something firmly and explicitly.  To put it plainly, I want you out of this house immediately.  Thank you. I think you’ve put your feelings quite plainly."
        },
        {
            "id": 125,
            "phrase": "put something to bed",
            "definition": "to complete work on something and send it on to the next step in production, especially in publishing. (From put someone to bed.) _ This week’s edition is finished. Let’s put it to bed.  Finish the editing of this book and put it to bed."
        },
        {
            "id": 126,
            "phrase": "put something to (good) use",
            "definition": "to apply a skill or ability; to use a skill or ability. The lawyer put her training to good use for the charity.  The pianist put his talents to use at the party."
        },
        {
            "id": 127,
            "phrase": "put something together",
            "definition": "to assemble something.  How long will it take to put dinner together? _ This model was put together incorrectly."
        },
        {
            "id": 128,
            "phrase": "put something up†",
            "definition": "1. to build a building, a sign, a fence, a wall, etc.  We’ll put a garage up next month.  The city put up a fence next to our house. 2. to store and preserve food by canning or freezing.  This year we’ll put some strawberries up.  We put up a lot of tomatoes every year."
        },
        {
            "id": 129,
            "phrase": "Put that in your pipe and smoke it!",
            "definition": "Inf. See how you like that!; It is final, and you have to live with it.  Well, I’m not going to do what you want, so put that in your pipe and smoke it! _ I’m sick of you, and I’m leaving. Put that in your pipe and smoke it!"
        },
        {
            "id": 130,
            "phrase": "put the arm on someone",
            "definition": "to apply pressure to someone.  John’s been putting the arm on Mary to get her to go out with him.  John has been putting the arm on Bill to get him to cooperate."
        },
        {
            "id": 131,
            "phrase": "put the brakes on someone",
            "definition": "to block someone’s activities; to cause someone to stop doing something. (Based on put the brakes on something.) _ The boss put the brakes on Gerald, who was trying too aggressively to get promoted.  We are going to have to put the brakes on you if you make any more difficulties."
        },
        {
            "id": 132,
            "phrase": "put the brakes on something",
            "definition": "to halt or impede some process.  The manager had to put the brakes on the Wilson project due to lack of funds. We will put the brakes on this project because it is costing too much money."
        },
        {
            "id": 133,
            "phrase": "put the cart before the horse",
            "definition": "to have things in the wrong order; to have things confused and mixed up. (Also with have.) _You’re eating your dessert first! You’ve put the cart before the horse.  John has the cart before the horse in most of his projects."
        },
        {
            "id": 134,
            "phrase": "put the fear of God in(to) someone",
            "definition": "to frighten someone severely; [for something] to shock someone into contrite behavior.  A near miss like that really puts the fear of God into you.  Yes, it puts the fear of God in you."
        },
        {
            "id": 135,
            "phrase": "put the heat on†",
            "definition": "to turn on central heating; to increase the amount of heat in a room or house.  It’s going to get cold tonight. I’d better put the heat on.  Let’s put on the heat to take off the chill. "
        },
        {
            "id": 136,
            "phrase": "put the kibosh on someone or something",
            "definition": "to squelch someone or something; to veto someone or someone’s plans. I hate to put the kibosh on Randy, but he isn’t doing what he is supposed to. Your comments put the kibosh on the whole project."
        },
        {
            "id": 137,
            "phrase": "put (the) pressure on someone (to do something)",
            "definition": "to make demands on someone; to try to get someone to do something.  Please don’t put pressure on me to go there! _ We put the pressure on him to get him to come, but he refused."
        },
        {
            "id": 138,
            "phrase": "put the skids on (something)",
            "definition": "Sl. to cause something to fail.  They put the skids on the project when they refused to give us any more money.  That’s the end of our great idea! Somebody put the skids on."
        },
        {
            "id": 139,
            "phrase": "put the skids under someone or something",
            "definition": "Sl. to cause someone or something to fail. Her lateness put the skids under our presentation to the board of directors.  He thought he could get promoted if he put the skids under the vice president."
        },
        {
            "id": 140,
            "phrase": "put the squeeze on someone",
            "definition": "Inf. to attempt to get money out of someone.  The mob put the squeeze on all the merchants, threatening to break their windows if they didn’t pay.  Are you trying to put the squeeze on me for more money? "
        },
        {
            "id": 141,
            "phrase": "put to bed with a shovel",
            "definition": "1. Sl. dead and buried. (Alludes to burying someone.) _You wanna be put to bed with a shovel? Just keep talking that way.  Poor old Jake. He was put to bed with a shovel last March. 2. Sl. intoxicated.  He wasn’t just tipsy. He was put to bed with a shovel! _Dead drunk? Yes, he was put to bed with a shovel."
        },
        {
            "id": 142,
            "phrase": "put to it",
            "definition": "strained or exhausted.  Man, I’m really put to it! What a day! _ John was put to it to get there on time."
        },
        {
            "id": 143,
            "phrase": "put too fine a point on something",
            "definition": "to make too much out of something; to dwell overly long on a small detail of a complaint or argument. (Usually with not. Formal or stilted.) _Not to put too fine a point on it, but did you really mean to say that Paul was the former secretary of the organization? Wasn’t he the corresponding secretary? _ When he said that everyone was angry, he put too fine a point on it."
        },
        {
            "id": 144,
            "phrase": "put two and two together",
            "definition": "to figure something out from the information available. Well, I put two and two together and came up with an idea of who did it.  Don’t worry. John won’t figure it out. He can’t put two and two together."
        },
        {
            "id": 145,
            "phrase": "put up one’s dukes",
            "definition": "to be prepared to fight.  He’s telling you to put up your dukes.  Put up your dukes and be a man!"
        },
        {
            "id": 146,
            "phrase": "Put up or shut up!",
            "definition": "1. Inf. a command to prove something or stop talking about it; Do something or stop promising to do it! _I’m tired of your telling everyone how fast you can run. Now, do it! Put up or shut up! _ Now’s your chance to show us that you can run as fast as you can talk. Put up or shut up! 2. Inf. a command to bet money in support of what one advocates. If you think that your horse is faster than mine, then make a bet. Put up or shut up! _ You think you can beat me at cards? Twenty bucks says you’re wrong. Put up or shut up!"
        },
        {
            "id": 147,
            "phrase": "put up with someone or something",
            "definition": "to tolerate or endure someone or something; to be able to stand someone or something.  I cannot put up with your constant whining any longer! _ We can put up with John’s living here until he finds a place of his own."
        },
        {
            "id": 148,
            "phrase": "put upon by someone",
            "definition": "to be made use of to an unreasonable degree. (Typically passive.) _My mother was always put upon by her neighbors. She was too nice to refuse their requests for help.  Jane feels put upon by her live-in mother-in-law."
        },
        {
            "id": 149,
            "phrase": "put wear (and tear) on something",
            "definition": "to cause deterioration in the state of something. (There can be various amounts of wear and tear. See the examples.) _ This road salt puts a lot of wear on cars.  All this wave action puts too much wear and tear on the boat dock."
        },
        {
            "id": 150,
            "phrase": "put weight on†",
            "definition": "to gain weight; to grow fat.  The doctor says I need to put some weight on.  I have to go on a diet because I’ve been putting on a little weight lately."
        },
        {
            "id": 151,
            "phrase": "put weight on some part of the body",
            "definition": "to subject an injured body part, as a foot or knee, to the weight of standing, to test its strength.  My doctor told me I can put weight on my broken leg next week."
        },
        {
            "id": 152,
            "phrase": "put words in(to) someone’s mouth",
            "definition": "to interpret what someone said so that the words mean what you want and not what the speaker wanted.  I didn’t say that! You are putting words into my mouth.  Stop putting words in my mouth!"
        },
        {
            "id": 153,
            "phrase": "Put your money where your mouth is!",
            "definition": "Inf. Stop just talking and stake your own money! (From gambling. Can also be said to someone giving investment advice.) _You want me to bet on that horse? Did you? Why don’t you put your money where your mouth is? _ If this is such a good stock, you buy it. Put your money where your mouth is!"
        },
        {
            "id": 154,
            "phrase": "putt along",
            "definition": "to move along rapidly, usually in a motorized vehicle. (“Putt-putt” is the sound made to mimic engines, especially small engines.) _The little car was putting along down the highway, when one of the tires went f lat.  We were putting along very smoothly all the way into town."
        },
        {
            "id": 155,
            "phrase": "*putty in someone’s hands",
            "definition": "[of someone] easily influenced by someone else; excessively willing to do what someone else wishes. (Putty is soft and malleable. *Typically: be ~; seem like ~.) _ Bob’s wife is putty in his hands. She never thinks for herself.  Jane is putty in her mother’s hands. She always does exactly what her mother says."
        },
        {
            "id": 156,
            "phrase": "a put-up job",
            "definition": "Inf. a deception; a deceptive event.  That’s really phony; a put-up job if I ever saw one.  No put-up job is clever enough to fool me."
        },
        {
            "id": 157,
            "phrase": "putz around",
            "definition": "Inf. to fiddle around; to mess around. Stop putzing around and get to work.  Those guys spend most of their time just putzing around."
        },
        {
            "id": 158,
            "phrase": "puzzle over someone or something",
            "definition": "to consider or ponder someone or something.  Anne is a bit strange. I’ve spent some time puzzling over her.  While I was puzzling over why she had slapped me, she did it again."
        },
        {
            "id": 159,
            "phrase": "puzzle something out†",
            "definition": "to figure something out.  It took me a while to puzzle it out.  I can’t puzzle out the meaning of this argument."
        },
        {
            "id": 160,
            "phrase": "quail at someone or something",
            "definition": "to show fear at someone or something; to shrink from someone or something. Todd quailed at the thought of what he had to do. The students quailed at the teacher who had been so hard on them in the past."
        },
        {
            "id": 161,
            "phrase": "quail before someone or something",
            "definition": "to cower before or at the threat of someone or something.  The students quailed before the angry principal.  They quailed before the thought of punishment."
        },
        {
            "id": 162,
            "phrase": "quake with something",
            "definition": "to shake as with fear, terror, etc.  Alice was quaking with fear as the door slowly opened.  Todd quaked with terror when he saw the vicious dog at the door."
        },
        {
            "id": 163,
            "phrase": "qualify as something",
            "definition": "to fulfill the requirements to be something. Tom qualified as a mechanic. I have been qualified as a mechanic since I was twenty."
        },
        {
            "id": 164,
            "phrase": "qualify for something",
            "definition": "to meet the requirements for something. I’m sorry, you do not qualify for this job. I don’t qualify for it."
        },
        {
            "id": 165,
            "phrase": "qualify someone as something",
            "definition": "to cause someone to fulfill the requirements for something.  Does this course qualify me as a stockbroker? _She qualified herself as a realtor."
        },
        {
            "id": 166,
            "phrase": "qualify someone for something",
            "definition": "to enable someone to meet the requirements for something. His years with the company qualified him for pension.  Does this ticket qualify me for the drawing?"
        },
        {
            "id": 167,
            "phrase": "quality time",
            "definition": "time spent with someone allowing interaction and closeness.  He was able to spend a few minutes of quality time with his son, Buxton, at least once every two weeks."
        },
        {
            "id": 168,
            "phrase": "*qualms (about someone or something)",
            "definition": "an uneasy feeling of one’s conscience about someone or something. (*Typically: cause ~; have ~; have no ~; give someone ~.) _ Do you have any qualms about telling a little white lie to Mary about her not getting an invitation to the party?"
        },
        {
            "id": 169,
            "phrase": "quarrel (with someone) (about someone or something)",
            "definition": "to have an argument with someone about the subject of someone or something.  Please don’t quarrel with me about money.  You are always quarreling with Claire."
        },
        {
            "id": 170,
            "phrase": "quarrel (with someone) (over someone or something)",
            "definition": "to have an argument with someone about someone or something.  Todd quarreled with Carl over who was going to get the new secretary.  They are quarreling over Sally."
        },
        {
            "id": 171,
            "phrase": "quarrel with something",
            "definition": "to argue against something; to have a complaint about something.  I can’t quarrel with that. Does anyone want to quarrel with that last remark?"
        },
        {
            "id": 172,
            "phrase": "The Queen’s English",
            "definition": "“Official” British English.  He can’t even speak The Queen’s English! Despicable!"
        },
        {
            "id": 173,
            "phrase": "queer for something",
            "definition": "Inf. in the mood for something; desiring something. (Old.) _ I’m queer for a beer right now.  She’s queer for him because of his money."
        },
        {
            "id": 174,
            "phrase": "quest for someone or something",
            "definition": "to seek after someone or something. Martin is off questing for a book on baroque organ building.  She is questing for a better way to do it."
        },
        {
            "id": 175,
            "phrase": "a question of something",
            "definition": "a matter of something; a problem of something.  It’s not a matter of not wanting to go to the opera. It’s a question of money."
        },
        {
            "id": 176,
            "phrase": "question someone about someone or something",
            "definition": "to ask someone about someone or something. The police questioned Roger about the crime.  Then they questioned Claire about Roger."
        },
        {
            "id": 177,
            "phrase": "queue up (for something)",
            "definition": "to line up for something. (Typically British.) _We had to queue up for tickets to the play.  You must queue up here to get in."
        },
        {
            "id": 178,
            "phrase": "quick and dirty",
            "definition": "[done] fast and carelessly; [done] fast and cheaply. I am not interested in a quick and dirty job. I want it done right.  The contractor made a lot of money on quick and dirty projects that would never last very long."
        },
        {
            "id": 179,
            "phrase": "quick like a bunny",
            "definition": "really quick.  Now’s your chance. Do it! Quick like a bunny!"
        },
        {
            "id": 180,
            "phrase": "quick off the mark",
            "definition": "quick starting or reacting. (Compare this with slow off the mark.) _ Boy, you were quick off the mark there! _ If you can be really quick off the mark, you can soon find the answer."
        },
        {
            "id": 181,
            "phrase": "quick on the uptake",
            "definition": "quick to understand or learn something. Just because I’m not quick on the uptake, it doesn’t mean I’m stupid. Mary understands jokes before anyone else because she’s so quick on the uptake."
        },
        {
            "id": 182,
            "phrase": "a quick study",
            "definition": "a person who is quick to learn things. (Compare this to a slow study.) _ Jane, who is a quick study, caught the joke immediately and laughed before everyone else."
        },
        {
            "id": 183,
            "phrase": "quicker than hell",
            "definition": "Inf. very fast.  You got over here quicker than hell. Be careful in the stock market. You can lose all your money quicker than hell."
        },
        {
            "id": 184,
            "phrase": "quiet down",
            "definition": "to become quiet; to become less noisy.  Please quiet down.  Ask them to quiet down."
        },
        {
            "id": 185,
            "phrase": "quiet someone or an animal down†",
            "definition": "to make someone or an animal more quiet.  Please go and quiet the children down. Try to quiet down the children. Please quiet that dog down."
        },
        {
            "id": 186,
            "phrase": "quip about someone or something",
            "definition": "to joke about someone or something.  The kids were quipping about the principal’s hairpiece. It is rude to quip about an elderly person."
        },
        {
            "id": 187,
            "phrase": "quit a place",
            "definition": "to leave a place. In the autumn, Melinda quit Paris and traveled south to warmer climes."
        },
        {
            "id": 188,
            "phrase": "quit on someone",
            "definition": "1. [for something] to quit while someone is using it.  This stupid car quit on me.  I hope this thing doesn’t quit on me. 2. [for one] to leave one’s job, usually suddenly or unannounced.  Wally, the park supervisor, quit on us at the last minute. My assistant quit on me."
        },
        {
            "id": 189,
            "phrase": "quit over someone or something",
            "definition": "to stop working or doing something because of someone or something; to quit because of a dispute over someone or something. Please don’t quit over a silly thing like that.  She quit over one of her fellow workers."
        },
        {
            "id": 190,
            "phrase": "quit while one is ahead",
            "definition": "to stop doing something while one is still successful. When will I learn to quit while I’m ahead? _ Get into the market. Make some money and get out. Quit while you’re ahead."
        },
        {
            "id": 191,
            "phrase": "quite a something",
            "definition": "definitely something; a good example of something.  The captain of the swim team is quite a swimmer.  That’s quite a bruise you have there."
        },
        {
            "id": 192,
            "phrase": "quite something",
            "definition": "something very good or remarkable.  You should see their new house. It’s quite something. Meg’s mother has bought a new hat for the wedding and it’s quite something."
        },
        {
            "id": 193,
            "phrase": "quiver with something",
            "definition": "to shake or shiver from something, such as cold, fear, anticipation, etc. On seeing the bear, the dogs quivered with fear.  Todd quivered with the cold."
        },
        {
            "id": 194,
            "phrase": "quiz out (of something)",
            "definition": "to earn permission to waive a college course by successful completion of a quiz or exam.  Andrew was able to quiz out of calculus.  After studying very hard, he quizzed out."
        },
        {
            "id": 195,
            "phrase": "quiz someone about someone or something",
            "definition": "to ask someone many questions about someone or something. The general quizzed the soldier about the incident.  The officer quizzed her about Randy."
        },
        {
            "id": 196,
            "phrase": "quiz someone on someone or something",
            "definition": "to give someone a quiz or test over the subject of someone or something.  The teacher quizzed the students on the chapter she had assigned for homework.  I hope they quiz me on George Washington. I am prepared."
        },
        {
            "id": 197,
            "phrase": "quote a price",
            "definition": "to name or state in advance the charge for doing or supplying something.  The mechanic quoted a price of $100 to repair my car.  The carpenter quoted a price for fixing the stairs."
        },
        {
            "id": 198,
            "phrase": "quote (something) from someone or something",
            "definition": "to recite something verbatim that someone else has said; to recite something verbatim from a printed source. May I quote from your letter of the tenth? _ Do you mind if I quote a line from Keats?"
        },
        {
            "id": 199,
            "phrase": "quote, unquote",
            "definition": "a parenthetical expression said before a word or short phrase indicating that the word or phrase would be in quotation marks if used in writing.  So I said to her, quote, unquote, it’s time we had a little talk."
        },
        {
            "id": 200,
            "phrase": "race against someone or something",
            "definition": "to attempt to win a trial of speed against someone or something.  I don’t want to race against Kelly. She is too fast.  I had to race against time to get there before the baby got worse."
        },
        {
            "id": 201,
            "phrase": "race against time",
            "definition": "1. a rush; a rush to beat a deadline.  We were in a race against time to beat the deadline. It was a race against time, but we made it. 2. to hurry to beat a deadline.  We had to race against time to finish before the deadline.  You don’t need to race against time. Take all the time you want."
        },
        {
            "id": 202,
            "phrase": "race around",
            "definition": "to run or move around in a great hurry.  Stop racing around and calm down! _ I have been racing around all morning, trying to get some things done."
        },
        {
            "id": 203,
            "phrase": "race around (after someone or something)",
            "definition": "to rush here and there to find or fetch someone or something. I had to race around after Tom. I couldn’t seem to catch up to him. I wish I could find the dog without having to race around all over the neighborhood."
        },
        {
            "id": 204,
            "phrase": "race for something",
            "definition": "to run or drive fast to get to something in a hurry.  I raced for the door to see who was there.  The children raced for the best seats in front of the television set."
        },
        {
            "id": 205,
            "phrase": "race into someone or something",
            "definition": "to bump or crash into someone or something.  The boys raced into the side of the car, and one of them was hurt.  We raced into Mary and knocked her over."
        },
        {
            "id": 206,
            "phrase": "race into something",
            "definition": "to run into a place.  The children raced into the room and headed straight for their presents.  Please don’t race into the garden. You will trample the f lowers."
        },
        {
            "id": 207,
            "phrase": "race someone for something",
            "definition": "to compete against someone for a prize; to try to outrun someone to get to something first.  I will race you for the grand prize.  Ned raced his sister for the breakfast table every morning."
        },
        {
            "id": 208,
            "phrase": "race someone to some place",
            "definition": "to compete against someone to see who gets to a place first. I will race you to the door.  Tim wanted to race me to the corner."
        },
        {
            "id": 209,
            "phrase": "race through someone or something",
            "definition": "to run or chase through a group of people or a place. The children raced through the group of ladies standing by the door. The dogs raced through the room, upsetting a lamp."
        },
        {
            "id": 210,
            "phrase": "race through something",
            "definition": "to perform some task very rapidly.  They raced through their prayers and jumped into bed. The children raced through dinner, in a hurry to get outside to play."
        },
        {
            "id": 211,
            "phrase": "race to someone or something",
            "definition": "to run to someone or something.  The girls raced to the front room.  We all raced to Mary, who had the candy."
        },
        {
            "id": 212,
            "phrase": "race up to someone or something",
            "definition": "to run to someone or something. Molly raced up to Paul and kissed him on the cheek. We raced up to the door and opened it cautiously."
        },
        {
            "id": 213,
            "phrase": "race with someone or something",
            "definition": "to enter a speed contest with someone or something. I refuse to race with Carla. She is much too fast for me.  I can’t race with a horse!"
        },
        {
            "id": 214,
            "phrase": "rack one’s brain(s)",
            "definition": "to try very hard to think of something.  I racked my brains all afternoon, but couldn’t remember where I put the book.  Don’t waste any more time racking your brain. Go borrow the book from the library."
        },
        {
            "id": 215,
            "phrase": "rack out",
            "definition": "Sl. to go to bed and to sleep.  I’m really tired. I’ve got to go rack out for a while. I racked out until nearly noon."
        },
        {
            "id": 216,
            "phrase": "rack something up†",
            "definition": "to place something onto or into its rack.  You had better rack the billiard balls up when you finish this game.  Please rack up the balls."
        },
        {
            "id": 217,
            "phrase": "racked with pain",
            "definition": "suffering from severe pain. My body was racked with pain, and I nearly passed out.  My head was racked with pain."
        },
        {
            "id": 218,
            "phrase": "radiate from someone or something",
            "definition": "to spread out from someone or something, as with rays.  Happiness radiated from Mary. She was so proud! _ The heat radiated from the wall next to the furnace room."
        },
        {
            "id": 219,
            "phrase": "raffle something off†",
            "definition": "to give something away by a drawing or raffle.  They will raff le a television set off.  They are going to raff le off a television set this weekend at the school."
        },
        {
            "id": 220,
            "phrase": "rag out",
            "definition": "Sl. to dress up.  I like to rag out and go to parties.  I hate to rag out. I like comfortable clothes."
        },
        {
            "id": 221,
            "phrase": "rag someone about someone or something",
            "definition": "1. to complain to someone about someone or something. Why are you always ragging me about Mary? _ Stop ragging me about being late. 2. to tease someone about someone or something.  I wish you would stop ragging me about my hat.  Why do you always rag me about my funny walk? I can’t help it."
        },
        {
            "id": 222,
            "phrase": "rage against someone or something",
            "definition": "to vent one’s anger about someone or something; to criticize someone or something severely. She exhausted herself raging against Judy.  Mary is raging about the office politics again."
        },
        {
            "id": 223,
            "phrase": "rage at someone or something",
            "definition": "to direct one’s anger at someone or something.  Why are you raging at me? What on earth did I do? _ Nothing can be solved by raging at the police department."
        },
        {
            "id": 224,
            "phrase": "rage out of control",
            "definition": "to become uncontrollable.  The fire raged out of control and threatened the residential area.  If we didn’t do something quickly, the fire would be raging out of control."
        },
        {
            "id": 225,
            "phrase": "rage over someone or something",
            "definition": "to fight furiously over someone or something. The two managers both wanted to hire the same prospective employee. They raged over her for nearly an hour.  The bears raged over that one fish for a long time."
        },
        {
            "id": 226,
            "phrase": "rage through something",
            "definition": "[for a fire] to burn rapidly through an area or a building.  The fire raged through the unoccupied building.  When the fire began to rage through the forest, we knew we had better head for the river."
        },
        {
            "id": 227,
            "phrase": "rail against someone or something",
            "definition": "to complain vehemently about someone or something.  Why are you railing against me? What did I do? _ Leonard is railing against the tax increase again."
        },
        {
            "id": 228,
            "phrase": "rail at someone (about something)",
            "definition": "to complain loudly or violently to someone about something.  Jane railed at the payroll clerk about not having received her check.  I am not responsible for your problems. Don’t rail at me!"
        },
        {
            "id": 229,
            "phrase": "railroad someone into something",
            "definition": "to force someone into doing something in great haste.  The salesman tried to railroad me into signing the contract.  You can’t railroad me into doing anything!"
        },
        {
            "id": 230,
            "phrase": "railroad something through (something)",
            "definition": "to force something through some legislative body without due consideration.  The committee railroaded the new constitution through the ratification process. Mary felt she could railroad the legislation through."
        },
        {
            "id": 231,
            "phrase": "rain cats and dogs",
            "definition": "to rain very hard.  It’s raining cats and dogs. Look at it pour! _ I’m not going out in that storm. It’s raining cats and dogs."
        },
        {
            "id": 232,
            "phrase": "a rain check (on something)",
            "definition": "1. a piece of paper allowing one to see an event—which has been canceled—at a later time. (Originally said of sporting events that had to be canceled because of rain. *Typically: get ~; have ~; take ~; give someone ~.) _ The game was canceled because of the storm, but we all got rain checks on it.  I can’t use a rain check because I’m leaving town for a month. 2. a reissuance of an invitation at a later date. (Said to someone who has invited you to something that you cannot attend now, but would like to attend at a later time. *Typically: get ~; have ~; take ~; give someone ~.) _We would love to come to your house, but we are busy next Saturday. Could we take a rain check on your kind invitation? _ Oh, yes. You have a rain check that’s good anytime you can come by and visit. 3. a piece of paper that allows one to purchase an item on sale at a later date. (Stores issue these pieces of paper when they run out of specially priced sale merchandise. *Typically: get ~; have ~; take ~; give someone ~.) _ The store was all out of the shampoo they advertised, but I got a rain check.  Yes, you should always take a rain check so you can get it at the sale price later when they have more."
        },
        {
            "id": 233,
            "phrase": "rain down on someone or something",
            "definition": "to fall or drop down on someone or something like rain.  The ashes from the incinerator rained down on us, getting our clothes dirty.  The hail rained down on us—some of it quite large."
        },
        {
            "id": 234,
            "phrase": "rain in on someone or something",
            "definition": "[for rain] to enter a window or other opening and get someone or something wet.  Carol left the window open, and it rained in on her in the night.  The storm rained in on my carpet!"
        },
        {
            "id": 235,
            "phrase": "rain or shine",
            "definition": "no matter whether it rains or the sun shines.  Don’t worry. I’ll be there rain or shine.  We’ll hold the picnic—rain or shine."
        },
        {
            "id": 236,
            "phrase": "rain something down† (on someone or something)",
            "definition": "to pour something, such as criticism or praise, onto someone or something. (Based on rain down on someone or something.) _ The employees rained criticism down on the personnel manager for the new policy on sick leave.  The audience rained down compliments on the performers."
        },
        {
            "id": 237,
            "phrase": "rain something out†",
            "definition": "[for the weather] to spoil something by raining. Oh, the weather looks awful. I hope it doesn’t rain the picnic out.  It’s starting to sprinkle now. Do you think it will rain out the ball game?"
        },
        {
            "id": 238,
            "phrase": "rain (up)on someone or something",
            "definition": "[for rain, or something similar] to fall on someone or something. (Upon is formal and less commonly used than on.) _ The ashes from the erupting volcano rained on all the people f leeing the village.  It rained on the fields until they were f looded."
        },
        {
            "id": 239,
            "phrase": "raise a hue and cry (about something)",
            "definition": "to make an issue about something; to alert people to a problem or difficulty.  The city council raised a hue and cry about the mayor’s proposed budget."
        },
        {
            "id": 240,
            "phrase": "raise (an) objection (to someone or something)",
            "definition": "to mention an objection about someone or something.  I hope your family won’t raise an objection to my staying for dinner.  I’m certain no one will raise an objection. We are delighted to have you."
        },
        {
            "id": 241,
            "phrase": "raise Cain",
            "definition": "to make a lot of trouble; to raise hell. (A Biblical reference, from Genesis 4.) _ Fred was really raising Cain about the whole matter.  Let’s stop raising Cain."
        },
        {
            "id": 242,
            "phrase": "raise one’s glass to someone or something",
            "definition": "to propose a drinking toast in salute to someone or something.  Let us all raise our glasses to George Wilson! _They raised their glasses to the successful campaign."
        },
        {
            "id": 243,
            "phrase": "raise one’s sights",
            "definition": "to set higher goals for oneself. (Alludes to someone lifting the sights of a gun in order to fire farther.) _ When you’re young, you tend to raise your sights too high.  On the other hand, some people need to raise their sights."
        },
        {
            "id": 244,
            "phrase": "raise one’s voice against someone or something",
            "definition": "to speak out loudly or angrily against someone or something; to complain about someone or something.  Tony was very polite and did not raise his voice against Roger. I was too timid to raise my voice against the injustices of the day."
        },
        {
            "id": 245,
            "phrase": "raise one’s voice (to someone)",
            "definition": "to speak loudly or shout at someone in anger.  Don’t you dare raise your voice to me! _ I’m sorry. I didn’t mean to raise my voice."
        },
        {
            "id": 246,
            "phrase": "raise someone from something",
            "definition": "to help someone up from a lowly state.  They hoped for some windfall to raise them from their poverty.  They raised me from the depressed state I was in."
        },
        {
            "id": 247,
            "phrase": "raise someone from the dead",
            "definition": "to bring a dead person back to life. (When used figuratively, usually refers to something very bad or offensive.) _How great are your magic powers? Can you raise people from the dead? _They say her singing could raise people from the dead."
        },
        {
            "id": 248,
            "phrase": "raise someone or an animal from something",
            "definition": "to bring up someone or an animal from a young state.  My grandmother raised me from a baby.  We raised all these rabbits from babies."
        },
        {
            "id": 249,
            "phrase": "raise someone or something to something",
            "definition": "to elevate someone or something to something at a higher level.  Dan raised Alice up to the window.  I helped raise the ladder to the top of the roof."
        }
    ]
}