{
    "dictionary": [
        {
            "id": 0,
            "phrase": "buckle someone in†",
            "definition": "to attach someone securely with a vehicle’s seat belts. (This includes airplane seat belts.) _ Don’t forget to buckle the children in.  Did you buckle in the children?"
        },
        {
            "id": 1,
            "phrase": "buckle someone or something down†",
            "definition": "to attach someone or something down with straps that buckle together.  They stopped to buckle the load down again.  Did you buckle down the kids?"
        },
        {
            "id": 2,
            "phrase": "buckle someone or something up†",
            "definition": "to attach someone or something securely with straps that buckle together. (This emphasizes the completeness and secureness of the act.) _Buckle the children up before we leave. Buckle up your shoes."
        },
        {
            "id": 3,
            "phrase": "buckle under",
            "definition": "[for something] to collapse. With heavy trucks on it, the bridge buckled under.  The table buckled under."
        },
        {
            "id": 4,
            "phrase": "buckle under something",
            "definition": "to collapse under or from the weight of something.  The bridge buckled under the weight of the truck and collapsed. The table finally buckled under."
        },
        {
            "id": 5,
            "phrase": "bud out",
            "definition": "[for a flowering plant or tree] to develop buds.  How early in the spring do the trees bud out around here? _ The trees bud out in early spring."
        },
        {
            "id": 6,
            "phrase": "a budding genius",
            "definition": "a very bright and promising young person. Harry is a budding genius, but he seems like a fairly normal teenager."
        },
        {
            "id": 7,
            "phrase": "buddy up (to someone)",
            "definition": "to become overly familiar or friendly with someone. Don’t try to buddy up to me now. It won’t do any good.  He always tries to buddy up, no matter how coldly you treat him."
        },
        {
            "id": 8,
            "phrase": "buddy up (with someone)",
            "definition": "to join with another person to form a pair that will do something together or share something.  I buddied up with Carl, and we helped each other on the hike.  Carl and I buddied up, and we shared a canoe."
        },
        {
            "id": 9,
            "phrase": "budget something for someone or something",
            "definition": "to set aside a certain amount of money for someone or something.  Did you budget some money for the holiday party? _I budgeted a few hundred a month for Andrew’s college expenses."
        },
        {
            "id": 10,
            "phrase": "buff something down†",
            "definition": "to polish or smooth something by buffing.  I buffed the newly waxed table down with a cloth.  I’m going to go out and buff down the car."
        },
        {
            "id": 11,
            "phrase": "buff something up†",
            "definition": "to polish something to a shine.  He buffed his shoes up and went out for the evening.  He buffed up the antique silver platter."
        },
        {
            "id": 12,
            "phrase": "buffet someone or something from someone or something to someone or something",
            "definition": "to shift someone or something back and forth between people, things, or places, as if being tossed around by the waves of the sea.  The state agency buffeted the orphan child from one relative to another. The office staff buffeted the memo from one desk to another."
        },
        {
            "id": 13,
            "phrase": "bug off",
            "definition": "1. Sl. to cease bothering [someone].  Hey, bug off! Your comments are annoying.  I wish you would bug off! 2. Sl. Get out!; Go away! (Usually Bug off!) _ Bug off! Get out of my sight! _ Bug off and leave me alone!"
        },
        {
            "id": 14,
            "phrase": "bug out",
            "definition": "1. Sl. to pack up and leave or retreat. Orders are to bug out by oh-nine-hundred.  Okay, everybody, move it! We’re bugging out. 2. Sl. to get out of somewhere fast.  I gotta find a way to bug out of here without getting caught.  Okay, the downpour has stopped. Let’s bug out."
        },
        {
            "id": 15,
            "phrase": "bug someone",
            "definition": "to irritate someone; to bother someone. Go away! Stop bugging me! _ Leave me alone. Go bug someone else."
        },
        {
            "id": 16,
            "phrase": "build a better mousetrap",
            "definition": "to develop or invent something superior to a device that is widely used. (From the old saying, “If you build a better mousetrap, the world will beat a path to your door.”) _Harry thought he could build a better mousetrap, but everything he “invented” had already been thought of."
        },
        {
            "id": 17,
            "phrase": "build down",
            "definition": "[for traffic] to reduce in volume or diminish.  At about six, the going-home traffic begins to build down.  When traffic builds down, I leave for home."
        },
        {
            "id": 18,
            "phrase": "build one’s hopes on someone or something",
            "definition": "to make plans or have aspirations based on someone or something.  I have built my hopes on making a success of this business.  I built my hopes on John’s presidency."
        },
        {
            "id": 19,
            "phrase": "build out onto something",
            "definition": "to extend a building onto a particular space. We can build out onto the adjacent lot after we purchase it.  We built out onto the area over the old patio."
        },
        {
            "id": 20,
            "phrase": "build someone or something up†",
            "definition": "to make someone or something bigger or stronger.  Tom is lifting weights to build himself up for basketball.  Tom needs to build up his upper body."
        },
        {
            "id": 21,
            "phrase": "build someone or something up† (from something)",
            "definition": "to transform someone or something from a lowly start to a higher state.  I built up this business from nothing.  The publicity agent built this politician up from a cheap party hack."
        },
        {
            "id": 22,
            "phrase": "build someone or something up† (into someone or something)",
            "definition": "to develop or advance someone or something into a particular [desirable] kind of person or thing.  The publicity people built her up into a singer whom everyone looked forward to hearing.  The agent built up the local band into a top national act."
        },
        {
            "id": 23,
            "phrase": "build someone up† (for something)",
            "definition": "to prepare someone for something; to bring a person into a state of mind to accept some information.  We built them up for the challenge they were to face.  We had to build up the woman before breaking the bad news."
        },
        {
            "id": 24,
            "phrase": "build something out of something",
            "definition": "to construct something from parts or materials.  She built a tower out of the blocks.  They will build the bridge out of reinforced concrete."
        },
        {
            "id": 25,
            "phrase": "build something to order",
            "definition": "to build an individual object according to a special set of specifications. I am having them build a new house to order—just for us. The car will be built to order."
        },
        {
            "id": 26,
            "phrase": "build something up†",
            "definition": "to add buildings to an area of land or a neighborhood.  They are really building this area up. There is no more open space.  They built up the area over the years."
        },
        {
            "id": 27,
            "phrase": "build something (up)on something",
            "definition": "to construct something on the base of something else. (Upon is formal and less commonly used than on.) _ The ancients built their houses upon the houses of earlier people."
        },
        {
            "id": 28,
            "phrase": "build up",
            "definition": "to increase; to develop.  The storm clouds are building up. Better close the windows."
        },
        {
            "id": 29,
            "phrase": "build up to something",
            "definition": "1. [for a person] to lead up to something or advance to doing or saying something.  I can tell you are building up to something. What is it? 2. [for a situation] to develop into something.  The argument is building up to something unpleasant."
        },
        {
            "id": 30,
            "phrase": "build (up)on something",
            "definition": "1. to construct something on a particular space. (Upon is more formal and less commonly used than on.) _ Are you going to build upon this land? _ Yes, we will build on it. 2. to start with something and add to it. (Upon is more formal and less commonly used than on.) _ Our progress has been good so far. Let’s build on it.  We will build upon the success of our forebears."
        },
        {
            "id": 31,
            "phrase": "bulge out",
            "definition": "to swell outward; to extend out into a lump or mound.  The puppy’s tummy bulged out, full of food.  The bag of grass clippings bulged out heavily."
        },
        {
            "id": 32,
            "phrase": "bulge with something",
            "definition": "to be swollen with something. The bag was bulging with gifts and candy.  The chipmunk’s cheeks bulged with the nuts it had found."
        },
        {
            "id": 33,
            "phrase": "*a bull in a china shop",
            "definition": "Prov. a very clumsy creature in a delicate situation. (*Typically: as awkward as ~; like ~.) _ I never know what to say at a funeral. I feel like a bull in a china shop, trampling on feelings without even meaning to.  Lester felt like a bull in a china shop; reaching for an orange, he made several elaborate pyramids of fruit tumble down."
        },
        {
            "id": 34,
            "phrase": "bulldoze into something",
            "definition": "to move clumsily into something.  Don’t just bulldoze into me! Watch where you are going! _ Todd bulldozed into the wall, denting it badly."
        },
        {
            "id": 35,
            "phrase": "bulldoze through something",
            "definition": "to push clumsily and carelessly through something.  Don’t just bulldoze through your work! _I wish you wouldn’t bulldoze through the room."
        },
        {
            "id": 36,
            "phrase": "Bully for you!",
            "definition": "1. an expression that praises someone or someone’s courage. (Dated, but still heard.) _ The audi- ence shouted, “Bravo! Bully for you!” _ Bob: I quit my job today. Sally: Bully for you! Now what are you going to do? Bob: Well, I need a little loan to tide me over. 2. a sarcastic phrase belittling someone’s statement or accomplishment. Bob: I managed to save three dollars last week. Bill: Well, bully for you! _ Mary: I won a certificate good for a free meal! Sally: Bully for you!"
        },
        {
            "id": 37,
            "phrase": "A bully is always a coward.",
            "definition": "Prov. Bullies will only intimidate people who are much weaker than they are, because they are afraid of losing a fight.  Child: Dad, Joey keeps picking on me. How can I make him stop? Father: Try fighting back. A bully is always a coward.  Bill took advantage of the younger children, but he was quiet and docile around the older ones. A bully is always a coward."
        },
        {
            "id": 38,
            "phrase": "bully someone into something",
            "definition": "to harass or threaten someone into doing something. The coach tried to bully them into agreeing to stay late and practice.  Don’t try to bully me into your way of doing things."
        },
        {
            "id": 39,
            "phrase": "bum around (with someone)",
            "definition": "to spend or waste a lot of time with a particular person.  He used to bum around with Ted a lot.  They bummed around together all summer."
        },
        {
            "id": 40,
            "phrase": "bum out",
            "definition": "Sl. to have a bad experience. (Originally referred to a bad experience with drugs.) _ Are you going to bum out again tonight? _ Man, is he bummed out!"
        },
        {
            "id": 41,
            "phrase": "*the bum’s rush",
            "definition": "hurrying someone out of a place. (As someone might quickly escort a vagrant from a fancy restaurant. *Typically: get ~; give someone ~.) _ The young customer in the jewelry store was getting the bum’s rush until he pulled out an enormous roll of bills. Bill got the bum’s rush at the restaurant because he didn’t have a tie on."
        },
        {
            "id": 42,
            "phrase": "bum someone out†",
            "definition": "Sl. to disappoint someone.  This menial job really bums me out.  The bad movie bummed out the entire audience."
        },
        {
            "id": 43,
            "phrase": "bum something off someone",
            "definition": "Sl. to beg or borrow something from someone.  Can I bum a cigarette off you? _ You can’t bum anything off me that I don’t have."
        },
        {
            "id": 44,
            "phrase": "*a bum steer",
            "definition": "misleading instructions or guidance; a misleading suggestion. (Bum= false; phony. Steer = guidance, as in the steering of a car. *Typically: get ~; have ~; give someone ~.) _Wilbur gave Ted a bum steer and Ted ended up in the wrong town.  I got a bum steer from the salesman, and I paid far more than I needed to for a used car."
        },
        {
            "id": 45,
            "phrase": "bumble through something",
            "definition": "to get through something clumsily. I guess I will have to bumble through this speech again.  Lily bumbled through her song and f led from the stage."
        },
        {
            "id": 46,
            "phrase": "bummed (out)",
            "definition": "Sl. discouraged; depressed.  I feel so bummed. I think I need a nice hot bath. When you’re feeling bummed out, think how much you’ve accomplished."
        },
        {
            "id": 47,
            "phrase": "bump someone or something up†",
            "definition": "to damage or batter someone or something.  The crash into the wall bumped the race driver up a little.  The accident bumped up the passengers a little."
        },
        {
            "id": 48,
            "phrase": "Bump that!",
            "definition": "Sl. Forget that! _ Bump that! I was wrong.  I gave you the wrong number. Bump that!"
        },
        {
            "id": 49,
            "phrase": "bump (up) against someone or something",
            "definition": "to strike someone or something accidentally, usually relatively gently.  The car bumped up against the curb.  The door has bumped against the wall and scratched the paint."
        },
        {
            "id": 50,
            "phrase": "bumper to bumper",
            "definition": "[of traffic] close together and moving slowly. The traffic is bumper to bumper from the accident up ahead."
        },
        {
            "id": 51,
            "phrase": "a bunch of fives",
            "definition": "Sl. a punch from a closed fist.  How would you like a bunch of fives right in the kisser? _ He ended up with a bunch of fives in the gut."
        },
        {
            "id": 52,
            "phrase": "bunch someone or something up†",
            "definition": "to pack or cluster things or people together.  Bunch them up so you can squeeze them into the sack.  Kelly bunched up the roses and put them in a vase."
        },
        {
            "id": 53,
            "phrase": "bunch up",
            "definition": "to pack together or cluster.  Spread out. Don’t bunch up!"
        },
        {
            "id": 54,
            "phrase": "a bundle of nerves",
            "definition": "a very nervous person. I was a bundle of nerves before my dental appointment."
        },
        {
            "id": 55,
            "phrase": "bundle off",
            "definition": "to leave in a hurry; to take all one’s parcels or baggage and leave in a hurry.  She got ready and bundled off after her bus.  Her arms full, Lily bundled off in a rush."
        },
        {
            "id": 56,
            "phrase": "bundle (oneself) up (against something)",
            "definition": "to wrap oneself up in protective clothing or bedding as protection against the cold.  Please bundle yourself up against the frigid wind.  Bundle up before you go outside."
        },
        {
            "id": 57,
            "phrase": "bundle someone off† (to some place)",
            "definition": "to send someone, usually a child, somewhere.  Robert bundled the children off to school. They bundled off the kids and were able to relax."
        },
        {
            "id": 58,
            "phrase": "bundle someone up† (against something)",
            "definition": "to wrap someone up in protective clothing or bedding against the cold.  Wally bundled Billy up against the winter storm.  You had better bundle up the children against the bitter wind."
        },
        {
            "id": 59,
            "phrase": "bundle someone up† (in something)",
            "definition": "to wrap someone up in protective clothing or bedding.  Bill bundled Billy up in his parka.  Bill bundled up Mary in her parka."
        },
        {
            "id": 60,
            "phrase": "bundle something off† (to someone or some place)",
            "definition": "to send something off in a bundle to someone.  He bundled his laundry off to his mother, who would wash it for him.  Mary bundled off the package to her brother."
        },
        {
            "id": 61,
            "phrase": "bung something in†",
            "definition": "to cram or bang something into something. He bunged the cork into the barrel. With a heavy blow, he bunged in the cork."
        },
        {
            "id": 62,
            "phrase": "bung something up†",
            "definition": "to damage someone or something by blows. Don’t let the watermelon roll around in the trunk of your car. You don’t want to bung it up.  Last time I put up the storm windows, I really bunged up my hands."
        },
        {
            "id": 63,
            "phrase": "bunged up",
            "definition": "battered or bruised. It used to be a nice table, but it got all bunged up. What happened to Jane? Her face was bunged up."
        },
        {
            "id": 64,
            "phrase": "bungle something up†",
            "definition": "to botch something; to mess something up.  Please don’t bungle this job up.  Tom was careless and he bungled up the job."
        },
        {
            "id": 65,
            "phrase": "bunk down (for the night)",
            "definition": "to bed down for the night; to go to bed.  Where are you going to bunk down for the night? _ I’m tired and ready to bunk down."
        },
        {
            "id": 66,
            "phrase": "bunk (up) together",
            "definition": "[for two or more people] to share a bed, a bedroom, or a tent. Shall we bunk together? _My tent is big and you can bunk up with me."
        },
        {
            "id": 67,
            "phrase": "bunk (up) with someone",
            "definition": "to share a bed, a bedroom, or a tent with someone. Are you going to bunk up with Fred? _ I’ll bunk with Todd."
        },
        {
            "id": 68,
            "phrase": "buoy someone or something up†",
            "definition": "to keep someone or something afloat. Use this cushion to buoy yourself up. The log buoyed up the swimmer until help came.  The air trapped in the hull buoyed the boat up."
        },
        {
            "id": 69,
            "phrase": "buoy someone up†",
            "definition": "to support, encourage, or sustain someone.  The good news buoyed her up considerably.  Her good humor buoyed up the entire party."
        },
        {
            "id": 70,
            "phrase": "burden someone or something with someone or something",
            "definition": "to bother or weigh down someone or something with someone or something.  Please don’t burden us with the bad news at this time.  I don’t want to burden the school with a troublesome child."
        },
        {
            "id": 71,
            "phrase": "burden someone with something",
            "definition": "to give unpleasant information to someone; to give someone some bad news.  I hate to burden you with this, but your cat ran away.  I wish I had not been burdened with all the facts."
        },
        {
            "id": 72,
            "phrase": "burgeon out",
            "definition": "to develop and grow rapidly; to burst forth.  The flowers burgeoned out and made the garden beautiful again.  When the trees have burgeoned out, spring is really here."
        },
        {
            "id": 73,
            "phrase": "burn something to a crisp",
            "definition": "to burn something totally or very badly.  The cook burned the meat to a crisp."
        },
        {
            "id": 74,
            "phrase": "burn away",
            "definition": "1. [for something] to burn until there is no more of it.  All the oil burned away.  The logs burned away and the fireplace was cooling down. 2. for something to keep on burning. The little fire burned away brightly, warming the tiny room.  The candle burned away, giving a tiny bit of light to the huge room."
        },
        {
            "id": 75,
            "phrase": "burn down",
            "definition": "1. [for a building] to be destroyed by fire.  The barn burned down. There was a fire, and the old factory was burned down. 2. [for a fire] to burn and dwindle away. The flame burned down and then went out.  As the fire burned down, it began to get cold."
        },
        {
            "id": 76,
            "phrase": "burn for someone or something",
            "definition": "to desire someone or something very much.  Jim said he was burning for Sally.  I was just burning for another look at her."
        },
        {
            "id": 77,
            "phrase": "burn (itself ) out",
            "definition": "1. [for a flame or fire] to run out of fuel and go out.  Finally, the fires burned themselves out.  The fire finally burned out. 2. [for an electrical or mechanical part] to fail and cease working.  The motor finally burned itself out.  The light bulb burned out."
        },
        {
            "id": 78,
            "phrase": "Burn not your house to fright the mouse away.",
            "definition": "Prov. Do not do something drastic when it is not necessary.  Ellen: I don’t like the shape of my nose; I think I’ll have surgery to make it look better. Jane: But you can make your nose look better just by using different makeup. Don’t burn your house to fright the mouse away.  When someone pointed out a small f law in Bob’s latest painting, Bob wanted to tear the whole painting to shreds. “Now, now, Bob,” his friends said, “burn not your house to fright the mouse away.”"
        },
        {
            "id": 79,
            "phrase": "burn off",
            "definition": "[for some excess volatile or flammable substance] to burn away or burn up.  A film of oil on the surface of the water was burning off, making dense black smoke.  The alcohol burned off and left a delicious f lavor in the cherries jubilee."
        },
        {
            "id": 80,
            "phrase": "burn one’s bridges (behind one)",
            "definition": "to cut off the way back to where you came from, making it impossible to retreat. The army, which had burned its bridges behind it, couldn’t go back.  By blowing up the road, the spies had burned their bridges behind them."
        },
        {
            "id": 81,
            "phrase": "burn one’s bridges in front of one",
            "definition": "to create future problems for oneself. (A play on burn one’s bridges (behind one).) _ I made a mistake again. I always seem to burn my bridges in front of me. I accidentally insulted a math teacher whom I will have to take a course from next semester. I am burning my bridges in front of me."
        },
        {
            "id": 82,
            "phrase": "burn (oneself) out",
            "definition": "to do something so long and so intensely that one gets sick and tired of doing it.  I burned myself out as a competitive swimmer. I just cannot stand to practice anymore.  Tom burned himself out in that boring job."
        },
        {
            "id": 83,
            "phrase": "burn someone at the stake",
            "definition": "to set fire to a person tied to a post (as a form of execution). They used to burn witches at the stake."
        },
        {
            "id": 84,
            "phrase": "burn someone down†",
            "definition": "Sl. to humiliate someone.  Man, don’t you ever burn me down like that again! _ You just want to burn down everybody to make yourself seem better."
        },
        {
            "id": 85,
            "phrase": "burn someone in effigy",
            "definition": "to burn a dummy or other figure that represents a hated person.  For the third day in a row, they burned the king in effigy.  Until they have burned you in effigy, you can’t really be considered a famous leader."
        },
        {
            "id": 86,
            "phrase": "burn someone out†",
            "definition": "to wear someone out; to make someone ineffective through overuse. Facing all these problems at once will burn Tom out.  The continuous problems burned out the office staff in a few months."
        },
        {
            "id": 87,
            "phrase": "burn someone up†",
            "definition": "to destroy someone by fire.  The house fire burned the victims up.  The fire burned up both of them."
        },
        {
            "id": 88,
            "phrase": "burn something away†",
            "definition": "to remove or destroy something by burning.  The doctor burned the wart away.  The doctor burned away the wart."
        },
        {
            "id": 89,
            "phrase": "burn something down†",
            "definition": "[for a fire] to destroy a building completely. The fire burned the barn down. It burned down the barn."
        },
        {
            "id": 90,
            "phrase": "burn something in†",
            "definition": "to run a piece of new electronic equipment for a while to make certain that all the electrical parts will last a long time.  Please burn this computer in for a couple of hours before you deliver it.  The technician burned in the computer."
        },
        {
            "id": 91,
            "phrase": "burn something out†",
            "definition": "1. to burn away the inside of something, getting rid of excess deposits.  The mechanic burned the carbon out of the manifold.  He burned out all of the carbon deposits. 2. to wear out an electrical or electronic device through overuse.  Turn it off. You’re going to burn the motor out! _ He burned out the motor."
        },
        {
            "id": 92,
            "phrase": "burn something up†",
            "definition": "to destroy something by fire; [for fire] to consume something. Take this cardboard and burn it up.  The fire burned up the papers and left no trace."
        },
        {
            "id": 93,
            "phrase": "burn the candle at both ends",
            "definition": "to work very hard and stay up very late at night. (One end of the candle is work done in the daylight, and the other end is work done at night.) _ No wonder Mary is ill. She has been burning the candle at both ends for a long time.  You’ll wear out if you keep burning the candle at both ends."
        },
        {
            "id": 94,
            "phrase": "burn the midnight oil",
            "definition": "to stay up working, especially studying, late at night. (Alludes to working by the light of an oil lamp late in the night.) _ I have a big exam tomorrow so I’ll be burning the midnight oil tonight.  If you burn the midnight oil night after night, you’ll probably become ill."
        },
        {
            "id": 95,
            "phrase": "burn up",
            "definition": "to become destroyed or consumed by fire. The wood burned up and left only ashes. The deed burned up in the fire."
        },
        {
            "id": 96,
            "phrase": "burn with a low blue flame",
            "definition": "[of a properly adjusted gas burner] to burn and put off heat.  Each burner on the stove burns with a low blue flame giving the maximum amount of heat per BTU."
        },
        {
            "id": 97,
            "phrase": "burn with something",
            "definition": "1. [for a fire] to burn with a particular quality.  The building burned with great ferocity.  The fire burned with a lot of crackling and popping. 2. [for someone] to experience intense and consuming feelings of a particular quality.  Fred is just burning with anger.  Why is he burning with envy?"
        },
        {
            "id": 98,
            "phrase": "burned to a cinder",
            "definition": "burned very badly. [Very often used figuratively.] _ I stayed out in the sun too long, and I am burned to a cinder.  This toast is burnt to a cinder."
        },
        {
            "id": 99,
            "phrase": "burned up",
            "definition": "very angry. (From the heat of anger. See also burn someone up.) _ My new assistant’s mistakes are so maddening! I’ve never been so burned up in my life.  I’m really burned up at Bob’s behavior."
        },
        {
            "id": 100,
            "phrase": "A burnt child dreads the fire.",
            "definition": "Prov. If something has hurt you once, you avoid it after that. Jill: Let’s go ride the roller coaster! Jane: No, thanks. I got sick on one of those once, and a burnt child dreads the fire. Ever since Cynthia rebuffed me so rudely, I’ve avoided asking her for anything; a burnt child dreads the fire."
        },
        {
            "id": 101,
            "phrase": "burst at the seams",
            "definition": "1. Fig. to be very full and burst, perhaps at the seams. (Alludes to something that would burst at the seams if overfilled.) _ I am so full from dinner! I’m ready to burst at the seams.  The room was so full it was bursting at the seams. 2. Fig. [for someone] to strain from holding in pride or laughter as if one might burst.  Tom nearly burst at the seams with pride. We laughed so hard we just about burst at the seams."
        },
        {
            "id": 102,
            "phrase": "burst forth",
            "definition": "to come forth explosively.  The words burst forth and frightened everyone.  The blossoms burst forth in the first warm days of the year."
        },
        {
            "id": 103,
            "phrase": "burst in (on someone or something)",
            "definition": "to enter a room, interrupting someone or some activity. (Often without knocking or seeking permission to enter.) _Tom burst in on his sister and her boyfriend while they were kissing.  I must ask you not to burst into my office again. Whatever it is can wait."
        },
        {
            "id": 104,
            "phrase": "burst in ((up)on someone or something)",
            "definition": "to intrude or come in thoughtlessly and suddenly and interrupt someone or something. (Upon is formal and less commonly used than on.) _ I didn’t mean to burst in on you.  She feared that someone would burst in upon her."
        },
        {
            "id": 105,
            "phrase": "burst in (with something)",
            "definition": "to interrupt with some comment.  Ted burst in with the good news.  He burst in to tell us about his new car."
        },
        {
            "id": 106,
            "phrase": "burst into flame(s)",
            "definition": "[for something] to catch fire and become a large fire quickly. As soon as the flame reached the curtains, the entire wall seemed to burst into f lames.  The two cars burst into f lames soon after the collision."
        },
        {
            "id": 107,
            "phrase": "burst into sight",
            "definition": "to come into view suddenly. (As if the sight appeared as suddenly as an explosion.) _ The sun finally burst into sight at the horizon.  Suddenly, a tiger burst into sight and caught the hunter off guard."
        },
        {
            "id": 108,
            "phrase": "burst in(to some place)",
            "definition": "to intrude or come in thoughtlessly and suddenly.  Ted burst into the room and sat down right in the middle of the meeting.  Wasn’t it very annoying of him to just burst in?"
        },
        {
            "id": 109,
            "phrase": "burst onto the scene",
            "definition": "to appear suddenly in a location. When Charles burst onto the scene, no one was prepared for the news he brought. The police suddenly burst onto the scene and arrested everyone in the room."
        },
        {
            "id": 110,
            "phrase": "burst out",
            "definition": "to explode outward; to break open under force.  The door burst out and released the trapped people.  When the glass burst out, Gerald was cut by some splinters."
        },
        {
            "id": 111,
            "phrase": "burst out doing something",
            "definition": "to begin to do something suddenly, such as cry, laugh, shout, etc. Suddenly, she burst out singing. Ted burst out laughing when he read the joke."
        },
        {
            "id": 112,
            "phrase": "burst out laughing",
            "definition": "to begin to laugh suddenly.  The entire audience burst out laughing when the clown took a fall. Every time I think of you sitting there with a lap full of spaghetti, I burst out laughing."
        },
        {
            "id": 113,
            "phrase": "burst out (of some place)",
            "definition": "to come out of a place very rapidly, like an explosion.  Everyone burst out of the burning building.  Suddenly, the windows all burst out."
        },
        {
            "id": 114,
            "phrase": "burst out (of something)",
            "definition": "to seem to explode out of something; to become [suddenly] too big for something, such as clothes, a house, etc.  She is practically bursting out of her dress.  The butterf ly burst out of the chrysalis."
        },
        {
            "id": 115,
            "phrase": "burst out with something",
            "definition": "to utter something loudly and suddenly. (Compare this with burst in (with something).) _ The child burst out with a scream.  Lily burst out with song."
        },
        {
            "id": 116,
            "phrase": "burst someone’s bubble",
            "definition": "to destroy someone’s illusion or delusion; to destroy someone’s fantasy. I hate to burst your bubble, but Columbus did not discover Canada.  Even if you think I am being foolish, please don’t burst my bubble."
        },
        {
            "id": 117,
            "phrase": "burst through something",
            "definition": "to break through or penetrate something with force.  The tank burst through the barrier easily.  The workers burst through the wall after a lot of hard work."
        },
        {
            "id": 118,
            "phrase": "burst (up)on someone",
            "definition": "[for an idea] to strike someone suddenly. (As if an idea had burst forth. Upon is formal and less commonly used than on.) _ After thinking all morning long, this really tremendous idea burst upon me.  It burst on me like a bolt of lightning."
        },
        {
            "id": 119,
            "phrase": "burst (up)on the scene",
            "definition": "to appear suddenly somewhere; to enter or arrive suddenly some place. (Upon is formal and less commonly used than on.) _ The police suddenly burst upon the scene.  They burst on the scene and took control."
        },
        {
            "id": 120,
            "phrase": "burst with excitement",
            "definition": "to have a strong feeling of excitement. Joe was just bursting with excitement because of his triumph.  The new toys had the children all bursting with excitement."
        },
        {
            "id": 121,
            "phrase": "burst with joy",
            "definition": "[for someone] to be full to the bursting point with happiness. (To be so filled with joy as if to burst.) _When I got my grades, I could have burst with joy.  Bill was not exactly bursting with joy when he got the news."
        },
        {
            "id": 122,
            "phrase": "burst with pride",
            "definition": "to be full as if to the bursting point with pride. My parents were bursting with pride when I graduated from college.  I almost burst with pride when I was chosen for the first prize."
        },
        {
            "id": 123,
            "phrase": "bury oneself in something",
            "definition": "1. Fig. to become very busy with something.  She stopped taking phone calls and buried herself in her work. He tended to bury himself in his work. 2. Fig. to hide oneself some place. (Alludes to burying oneself in a cave or something similar.) _He buried himself in the back of the little shop and worked quietly.  The lizard buried itself in the sand."
        },
        {
            "id": 124,
            "phrase": "bury someone or something away (some place)",
            "definition": "to bury or hide someone or something some place. The dog buried the bone away under a bush.  The ex-dictator was buried away in an unmarked grave."
        },
        {
            "id": 125,
            "phrase": "bury someone or something in something",
            "definition": "to inter someone or something in a grave, the ground, a vault, a tomb, etc.  They buried the old man in the family vault.  Thousands of war veterans are buried in the national cemetery."
        },
        {
            "id": 126,
            "phrase": "bury someone or something under something",
            "definition": "to bury someone or something beneath something, sometimes to hide or conceal it.  Joe buried the money under a stone in the forest.  They buried Aunt Mary under a pine tree."
        },
        {
            "id": 127,
            "phrase": "bury the hatchet",
            "definition": "to make peace.  Let’s stop arguing and bury the hatchet.  Tom and I buried the hatchet and we are good friends now."
        },
        {
            "id": 128,
            "phrase": "bush out",
            "definition": "[for a plant, bush, beard, head of hair] to develop many small branches or hairs. His beard bushed out and really needed trimming. I hope the hedge bushes out nicely this year."
        },
        {
            "id": 129,
            "phrase": "a bushel and a peck (and some in a gourd)",
            "definition": "Rur. a great deal or amount. (Usually used to answer the question, “How much do you love me?”) _ Mary: How much do you love me? Tom: A bushel and a peck and some in a gourd.  We knew that Grandpa loved us a bushel and a peck."
        },
        {
            "id": 130,
            "phrase": "business as usual",
            "definition": "having things go along as usual.  Even right after the f lood, it was business as usual in all the stores.  Please, everyone, business as usual. Let’s get back to work."
        },
        {
            "id": 131,
            "phrase": "Business before pleasure.",
            "definition": "Prov. You should finish your work before starting to relax and enjoy yourself.  Alan: Hi, Ted. Shall we get something to drink? Ted: Business before pleasure, Alan. Do you have the reports I asked you to bring? _ I’d love to go water-skiing with you now, but I have a few things to do in the office first. Business before pleasure, I’m afraid."
        },
        {
            "id": 132,
            "phrase": "the business end of something",
            "definition": "the part or end of something that actually does the work or carries out the procedure.  Keep away from the business end of the electric drill so you won’t get hurt.  Don’t point the business end of that gun at anyone. It might go off."
        },
        {
            "id": 133,
            "phrase": "a busman’s holiday",
            "definition": "leisure time spent doing something similar to what one does at work. (Alludes to a bus driver going on a bus tour for his vacation or on a day off.) _ Tutoring students in the evening is a busman’s holiday for our English teacher.  It’s a bit of a busman’s holiday to ask her to be wardrobe mistress for our amateur production in the summer. She’s a professional dressmaker."
        },
        {
            "id": 134,
            "phrase": "bust a bronco",
            "definition": "to ride and thus tame a wild horse so that it can be ridden. (Bust is a nonstandard form of burst.) _ In them days, I made my living busting broncos. That was the meanest bronco I ever seen. Nobody could bust ’im."
        },
        {
            "id": 135,
            "phrase": "bust a gut (to do something)",
            "definition": "to work very hard; to strain oneself to accomplish something. (The word gut is considered impolite in some circumstances. Bust is a nonstandard form of burst.) _ I don’t intend to bust a gut to get there on time. I busted a gut to get there the last time, and I was the first one there."
        },
        {
            "id": 136,
            "phrase": "bust a move",
            "definition": "Sl. to leave (a place.) _Let’s go. Time to bust a move.  Let’s bust a move. Lots to do tomorrow."
        },
        {
            "id": 137,
            "phrase": "bust ass out of some place",
            "definition": "Sl. to get out of some place in a hurry. (Potentially offensive. Use only with discretion.) _ I had to bust ass out of the house and run all the way to school.  Bob busted ass out of the classroom and headed for home."
        },
        {
            "id": 138,
            "phrase": "bust out laughing",
            "definition": "to start laughing suddenly. I busted out laughing when I saw him in that getup.  The bridegroom was so nervous, it was all he could do not to bust out laughing."
        },
        {
            "id": 139,
            "phrase": "bust out (of some place)",
            "definition": "Sl. to break out of some place, especially a prison. (Bust is a nonstandard form of burst meaning ‘break’ here.) _ Somehow the gangsters busted out of prison and left the country.  They busted out together."
        },
        {
            "id": 140,
            "phrase": "bust (some) suds",
            "definition": "1. Sl. to drink some beer. (Bust is a nonstandard form of burst. See also crack some suds.) _ Let’s go out and bust some suds.  I’m tired of busting suds. Let’s play cards. 2. Sl. to wash dishes. (Bust is a nonstandard form of burst.) _ I don’t want to spend the rest of my life busting suds. You get into that kitchen and bust some suds to earn your allowance."
        },
        {
            "id": 141,
            "phrase": "bust someone one",
            "definition": "Sl. to punch someone; to give someone a punch, probably in the face. (Bust is a nonstandard form of burst meaning ‘hit’ here.) _ You better shut up, or I’ll bust you one! _ You want me to bust you one? I will if you do that again."
        },
        {
            "id": 142,
            "phrase": "bust someone up†",
            "definition": "1. Sl. to cause lovers to separate; to break up a pair of lovers, including married persons. ’ here.) _ Mary busted Terri and John up.  Mary busted up Terri and John. 2. Sl. to beat someone up; to batter someone. (Bust is a nonstandard form of burst meaning ‘hit’ here.) _ You want me to bust you up? _ Max busted up Lefty pretty badly."
        },
        {
            "id": 143,
            "phrase": "bust someone wide open",
            "definition": "Sl. to beat someone severely. (An exaggeration. Bust is a nonstandard form of burst.) _If you ever take a step onto my property, I’ll bust you wide open.  Jim threatened to bust Bill wide open."
        },
        {
            "id": 144,
            "phrase": "bust something up†",
            "definition": "1. Inf. to break or ruin something; to break something into smaller pieces. (Bust is a nonstandard form of burst meaning ‘break’ here.) _ Who busted this plate up? _ Don’t bust up the plates! Be careful! 2. Sl. to ruin a marriage by coming between the married people. He busted their marriage up by starting rumors about Maggie.  He busted up their marriage."
        },
        {
            "id": 145,
            "phrase": "bust up",
            "definition": "1. Sl. [for lovers] to separate or break up. (Bust is a nonstandard form of burst meaning ‘break’ here.) _ Tom and Alice busted up for good.  They busted up last week. 2. Sl. [for something] to break up due to natural causes. (Bust is a nonstandard form of burst meaning ‘break (apart)’ here.) _The rocket busted up in midair.  I saw it bust up."
        },
        {
            "id": 146,
            "phrase": "bustle about doing something",
            "definition": "to go about doing something busily and energetically. Greg bustled about all day, doing the chores.  Lily bustled about, getting dinner ready."
        },
        {
            "id": 147,
            "phrase": "bustle about some place",
            "definition": "to move about some place very busily, or as if busy.  They were all bustling about the kitchen, getting the feast ready.  Veronica was bustling about outside, cleaning up the yard."
        },
        {
            "id": 148,
            "phrase": "bustle around",
            "definition": "to move about very busily.  The people were bustling around, trying to get things ready for the picnic.  I wish you would stop bustling around."
        },
        {
            "id": 149,
            "phrase": "bustle off",
            "definition": "to leave in haste.  Well, I have to bustle off or I’ll miss my f light.  I hate to bustle off so soon."
        },
        {
            "id": 150,
            "phrase": "bustle someone off†",
            "definition": "to help someone leave; to send someone out or away.  The cops bustled the crook off.  They bustled off the three men who were fighting."
        },
        {
            "id": 151,
            "phrase": "*busy as a hibernating bear",
            "definition": "not busy at all. (*Also: as ~.) _ Tom: I can’t go with you. I’m busy. Jane: Yeah. You’re as busy as a hibernating bear.  He lounged on the sofa all day, busy as a hibernating bear."
        },
        {
            "id": 152,
            "phrase": "busy oneself with someone or something",
            "definition": "to occupy one’s time by dealing with someone or something. Tony busied himself with helping Sam.  Mrs. Wilson busied herself with little Jimmy."
        },
        {
            "id": 153,
            "phrase": "busy someone with someone or something",
            "definition": "to keep someone busy dealing with someone or something.  You should busy the children with some activity. We will busy Randy with cleaning up the garage."
        },
        {
            "id": 154,
            "phrase": "but for someone or something",
            "definition": "if it were not for someone or something.  But for the railing, I’d have fallen down the stairs.  But for the children, Mrs. Smith would have left her husband years ago."
        },
        {
            "id": 155,
            "phrase": "but good",
            "definition": "severely; thoroughly. She told him off but good.  Joe beat up Bill but good."
        },
        {
            "id": 156,
            "phrase": "butt in (on someone or something)",
            "definition": "to interrupt someone or something.  Pardon me for butting in on your conversation, but this is important.  John butted in on Tom and Jane to tell them that the mail had come."
        },
        {
            "id": 157,
            "phrase": "butt into something",
            "definition": "to intrude upon something; to break into a conversation.  Please don’t butt into my conversation; I’m on the phone. I don’t like my conversations being butted into by perfect strangers!"
        },
        {
            "id": 158,
            "phrase": "the butt of a joke",
            "definition": "the reason for or aim of a joke, especially when it is a person. Poor Fred was the butt of every joke told that evening."
        },
        {
            "id": 159,
            "phrase": "butt out",
            "definition": "to exit [as abruptly as one has intruded]. (Compare this with butt in (on someone or something). Usually a command.) _ Butt out! Leave me alone! _ Please butt out of my life!"
        },
        {
            "id": 160,
            "phrase": "butt (up) against someone or something",
            "definition": "to press against someone or something firmly.  This board is supposed to butt up against the one over there.  The goat butted against Fred, but didn’t hurt him."
        },
        {
            "id": 161,
            "phrase": "Butter wouldn’t melt (in someone’s mouth).",
            "definition": "Prov. Someone is acting as if innocent.  By the time her parents came home, Emily had cleaned up all evidence of having broken the valuable figurine, and she looked as though butter wouldn’t melt in her mouth.  Jane: How can you suspect George of playing that practical joke on you? He looks so innocent. Jill: Yes, butter wouldn’t melt, I’m sure."
        },
        {
            "id": 162,
            "phrase": "*butterflies in one’s stomach",
            "definition": "a nervous feeling in one’s stomach. (*Typically: get ~; have ~; give someone ~.) _ Whenever I have to speak in public, I get butterf lies in my stomach.  She always has butterf lies in her stomach before a test. It was not frightening enough to give me butterf lies in my stomach, but it made me a little apprehensive."
        },
        {
            "id": 163,
            "phrase": "button something down†",
            "definition": "to fasten something down with buttons.  Button your collar down. You look too casually dressed.  Please button down your collar."
        },
        {
            "id": 164,
            "phrase": "button something up†",
            "definition": "to fasten something with buttons. Button your shirt up, please. I will button up my shirt."
        },
        {
            "id": 165,
            "phrase": "button up",
            "definition": "to fasten one’s buttons.  Your jacket’s open. You’d better button up. It’s cold.  I’ll button up in the car."
        },
        {
            "id": 166,
            "phrase": "button (up) one’s lip",
            "definition": "to stop talking. (Fixed order.) _ Please button up your lip! _ Will you button your lip? I don’t want the news to get out."
        },
        {
            "id": 167,
            "phrase": "buttress something up†",
            "definition": "to brace something; to provide architectural support for something.  We have to buttress up this part of the wall while we work on it.  The workers buttressed the wall up with heavy timbers."
        },
        {
            "id": 168,
            "phrase": "buy a pig in a poke",
            "definition": "to buy something without looking inside first.  If you don’t get a good look at the engine of a used car before you buy it, you’ll wind up buying a pig in a poke.  I just took the salesman’s word that this camera worked. I guess I bought a pig in a poke."
        },
        {
            "id": 169,
            "phrase": "buy in(to something)",
            "definition": "to purchase shares of something; to buy a part of something the ownership of which is shared with other owners.  I bought into a company that makes dog food. Sounds like a good company. I would like to buy in."
        },
        {
            "id": 170,
            "phrase": "buy one’s way in(to something)",
            "definition": "to achieve entry or membership in something often by paying money.  Do you think you can buy your way into this fraternity? _ I’m sure I can buy my way in with my family connections."
        },
        {
            "id": 171,
            "phrase": "buy one’s way out (of something)",
            "definition": "to get out of trouble by bribing or influencing someone to ignore what one has done wrong.  You can’t buy your way out of this mess, buster! _ You made this mess and you can’t buy your way out!"
        },
        {
            "id": 172,
            "phrase": "buy someone off†",
            "definition": "to bribe someone to ignore what one is doing wrong.  Do you think you can buy her off ? _ The mobster tried to buy off the jury."
        },
        {
            "id": 173,
            "phrase": "buy someone or something out†",
            "definition": "to purchase full ownership of something from someone or a group.  We liked the company, so we borrowed a lot of money and bought it out.  Carl bought out the owners of the company."
        },
        {
            "id": 174,
            "phrase": "buy someone’s wolf ticket",
            "definition": "Sl. to challenge someone’s boast or taunt.  He wants me to buy his wolf ticket bad.  He’s such a fighter. He’ll buy anybody’s wolf ticket."
        },
        {
            "id": 175,
            "phrase": "buy something at something",
            "definition": "1. to purchase something at a particular place or at a particular type of sale, such as a store, an auction, a clearance sale, etc. I bought this table at an auction. This was bought at an auction. 2. to purchase something at a particular price or for a particular level of price.  I bought shares in General Motors at forty and a half.  The shares were bought at a good price."
        },
        {
            "id": 176,
            "phrase": "buy something back† (from someone)",
            "definition": "to repurchase something that one has previously sold from the person who bought it.  Can I buy it back from you? I have decided I need it.  He bought back his book from George."
        },
        {
            "id": 177,
            "phrase": "buy something on credit",
            "definition": "to purchase something now and pay for it later (normally plus interest).  Almost everyone who buys a house buys it on credit.  I didn’t have any cash with me, so I used my credit card and bought a new coat on credit."
        },
        {
            "id": 178,
            "phrase": "buy something on time",
            "definition": "to buy something on credit.  Tom: That’s an awful fancy TV. Are you sure you can afford it? Jane: I’m buying it on time. I bought the sofa on time, but I paid cash for the chairs."
        },
        {
            "id": 179,
            "phrase": "buy something out†",
            "definition": "to buy all that is available of a particular item.  The kids came in and bought all our bubble gum out.  They bought out the bubble gum in a single hour."
        },
        {
            "id": 180,
            "phrase": "buy something sight unseen",
            "definition": "to buy something without seeing it first.  I bought this land sight unseen. I didn’t know it was so rocky. It isn’t usually safe to buy something sight unseen."
        },
        {
            "id": 181,
            "phrase": "buy something up†",
            "definition": "to buy all of something; to buy the entire supply of something.  He bought the oranges up from all the groves.  He bought up all the oranges and drove up the price."
        },
        {
            "id": 182,
            "phrase": "buy the big one",
            "definition": "Euph. to die.  I don’t plan to buy the big one for at least another thirty years.  She conked out for good—you know, bought the big one."
        },
        {
            "id": 183,
            "phrase": "buy time",
            "definition": "to postpone an event hoping that the situation will improve. You are just stalling to buy time. Maybe I can buy some time by asking the judge for a continuance."
        },
        {
            "id": 184,
            "phrase": "buy trouble",
            "definition": "to encourage trouble; to bring on trouble. (As if certain acts would pay for or cause difficulties that would have to be suffered through.) _ I don’t want to buy trouble. I have enough already.  Saying something insulting to him is just buying trouble."
        },
        {
            "id": 185,
            "phrase": "buzz along",
            "definition": "to move or drive along fast.  The cars were buzzing along at a great rate. Traffic is sure buzzing along."
        },
        {
            "id": 186,
            "phrase": "buzz for someone",
            "definition": "to sound a signal for someone.  Please buzz for the bell captain.  I buzzed for my secretary and waited for a reply."
        },
        {
            "id": 187,
            "phrase": "buzz in(to some place)",
            "definition": "to come into a place rapidly or unexpectedly. The child buzzed into the shop and bought a nickel’s worth of candy.  I just buzzed in to say hello."
        },
        {
            "id": 188,
            "phrase": "buzz off",
            "definition": "to leave quickly. I’ve got to buzz off. Bye.  It’s time for me to buzz off."
        },
        {
            "id": 189,
            "phrase": "buzz with something",
            "definition": "[for a place] to be busy or filled with something.  The room buzzed with excitement.  The office had better be buzzing with moneymaking activity when I get there."
        },
        {
            "id": 190,
            "phrase": "by a mile",
            "definition": "by a great distance. (Usually an exaggeration.) _ You missed the target by a mile.  Your estimate of the budget deficit was off by a mile."
        },
        {
            "id": 191,
            "phrase": "by a show of hands",
            "definition": "[of a vote taken] expressed by people raising their hands. We were asked to vote for the candidates for captain by a show of hands. Bob wanted us to vote on paper, not by a show of hands, so that we could have a secret ballot."
        },
        {
            "id": 192,
            "phrase": "by all appearances",
            "definition": "apparently; according to what one sees or how things seem. She is, by all appearances, ready to resume work.  By all appearances, we ought to be approaching the airport."
        },
        {
            "id": 193,
            "phrase": "by all means",
            "definition": "certainly; yes; absolutely.  I will attempt to get there by all means.  Bob: Can you come to dinner tomorrow? Jane: By all means. I’d love to."
        },
        {
            "id": 194,
            "phrase": "by all means of something",
            "definition": "trying to do something by the use of every possible manner of something.  People will be arriving by all means of transportation.  The surgeon performed the operation by all means of instruments."
        },
        {
            "id": 195,
            "phrase": "by and by",
            "definition": "at some time in the future; as time passes.  The weather’s sure to clear up by and by.  You may think your heart is broken, but you’ll feel better by and by."
        },
        {
            "id": 196,
            "phrase": "by and large",
            "definition": "generally; usually. (Originally a nautical expression.) _ I find that, by and large, people tend to do what they are told to do.  By and large, rosebushes need lots of care."
        },
        {
            "id": 197,
            "phrase": "by ankle express",
            "definition": "on foot.  After my horse was stolen, I had to go by ankle express.  It’s a five-minute drive, forty minutes by ankle express."
        },
        {
            "id": 198,
            "phrase": "by any means",
            "definition": "by any way possible.  I need to get there soon by any means. I must win this contest by any means, fair or unfair."
        },
        {
            "id": 199,
            "phrase": "by any stretch of the imagination",
            "definition": "as much as anyone could imagine; as much as is imaginable. (Often negative.) _I don’t see how anyone by any stretch of the imagination could fail to understand what my last sentence meant."
        },
        {
            "id": 200,
            "phrase": "by brute strength",
            "definition": "by great muscular strength.  The men moved the heavy door by brute strength."
        },
        {
            "id": 201,
            "phrase": "by chance",
            "definition": "accidentally; randomly; without planning. I found this book by chance at a book sale.  We met by chance in a class in college."
        },
        {
            "id": 202,
            "phrase": "by check",
            "definition": "by using a check for payment.  He paid for the book by check.  You will be paid by check."
        },
        {
            "id": 203,
            "phrase": "by choice",
            "definition": "due to conscious choice; on purpose. I do this kind of thing by choice. No one makes me do it.  I didn’t go to this college by choice. It was the closest one to home."
        },
        {
            "id": 204,
            "phrase": "by coincidence",
            "definition": "by an accidental and strange similarity; by an unplanned pairing of events or occurrences.  We just happened to be in the same place at the same time by coincidence. By coincidence, the circus was in town when I was there. I’m glad because I love circuses."
        },
        {
            "id": 205,
            "phrase": "By cracky!",
            "definition": "Rur. By God! (A mild oath, often used to express surprise or approval.) _Jim said he’d get the whole house painted this weekend, and by cracky, that’s just what he did.  By cracky! That thunder sure was loud."
        },
        {
            "id": 206,
            "phrase": "by dint of something",
            "definition": "because of something; due to the efforts of something. (Dint is an old word meaning ‘force,’ and it is never used except in this phrase.) _ They got the building finished on time by dint of hard work and good organization. By dint of much studying, John got through college."
        },
        {
            "id": 207,
            "phrase": "by force of habit",
            "definition": "owing to a tendency to do something that has become a habit.  After I retired, I kept getting up and getting dressed each morning by force of habit."
        },
        {
            "id": 208,
            "phrase": "By godfrey!",
            "definition": "By God! (A mild oath.) _ By godfrey, Jim’s brother is a big man! _ Those cats sure do make a lot of noise, by godfrey."
        },
        {
            "id": 209,
            "phrase": "by hand",
            "definition": "made by human hands and handheld tools as opposed to a machine.  This fine wooden cabinet was made by hand.  I carved this figurine by hand."
        },
        {
            "id": 210,
            "phrase": "by hook or (by) crook",
            "definition": "by any means, legal or illegal.  I’ll get the job done by hook or by crook. I must have that house. I intend to get it by hook or crook."
        },
        {
            "id": 211,
            "phrase": "by itself",
            "definition": "with the help of nothing else; without the addition of anything else.  Will this food be enough by itself for all of us? _ Can the dog get out of the house by itself ?"
        },
        {
            "id": 212,
            "phrase": "by leaps and bounds",
            "definition": "rapidly; by large movements forward.  The brush we cut back last fall is growing by leaps and bounds. The profits of my company are increasing by leaps and bounds.  He is gaining by leaps and bounds."
        },
        {
            "id": 213,
            "phrase": "by main strength and awkwardness",
            "definition": "Rur. by force or brute strength.  Tom: How did you get that piano up the stairs? Mary: By main strength and awkwardness.  By main strength and awkwardness, we got all the luggage crammed into the car."
        },
        {
            "id": 214,
            "phrase": "by means of something",
            "definition": "using something; with the use of something.  I opened the bottle by means of a bottle opener.  I was able to afford a car by means of a loan."
        },
        {
            "id": 215,
            "phrase": "by mistake",
            "definition": "in error; accidentally. I’m sorry. I came into the wrong room by mistake.  I chose the wrong road by mistake. Now we are lost."
        },
        {
            "id": 216,
            "phrase": "by myself",
            "definition": "1. with no one else present; alone.  I sat at the table by myself.  I will not be at the party. I will be at home by myself tonight. 2. without the help of anyone else.  I did it all by myself.  Can you eat that whole pie by yourself ?"
        },
        {
            "id": 217,
            "phrase": "by no means",
            "definition": "absolutely not; certainly not.  I’m by no means angry with you.  Bob: Did you put this box here? Tom: By no means. I didn’t do it, I’m sure."
        },
        {
            "id": 218,
            "phrase": "by oneself",
            "definition": "1. with no one else present; alone (of two or more people).  Must one sit by oneself or may one join another group? _ One just hates eating by oneself, doesn’t one? 2. with the help of no one else.  One is expected to do it by oneself.  Can one do this by oneself ?"
        },
        {
            "id": 219,
            "phrase": "by ourselves",
            "definition": "1. with no one else present; alone. Do we have to sit here by ourselves? Can’t we sit with Mary and Max? _We like to eat by ourselves, so we can talk about private matters. 2. with the help of no one else. We can do it by ourselves. Can we lift this by ourselves, or do we need some help?"
        },
        {
            "id": 220,
            "phrase": "by rote",
            "definition": "[of learning or memorizing] done as habit and without thinking. I simply memorized the speech by rote. I don’t know what it means.  The student learns everything by rote and doesn’t really understand the concepts."
        },
        {
            "id": 221,
            "phrase": "by shank’s mare",
            "definition": "by foot; by walking. (Shank refers to the shank of the leg.) _My car isn’t working, so I’ll have to travel by shank’s mare.  I’m sore because I’ve been getting around by shank’s mare."
        },
        {
            "id": 222,
            "phrase": "by the day",
            "definition": "one day at a time. I don’t know when I’ll have to leave town, so I rent this room by the day."
        },
        {
            "id": 223,
            "phrase": "by the dozen",
            "definition": "in groups of 12. (Compare this with by the dozens.) _ Eggs are normally sold by the dozen."
        },
        {
            "id": 224,
            "phrase": "by the dozens",
            "definition": "many; by some fairly large, indefinite number. (Similar to but implying less than hundreds. Compare this with by the dozen.) _ Just then people began showing up by the dozens. I baked cookies and pies by the dozens for the charity bake sale."
        },
        {
            "id": 225,
            "phrase": "by the end of the day",
            "definition": "by the time when the workday is over; by the time that the sun goes down. Will this task be completed by the end of the day? _ We have to do all these things by the end of the day."
        },
        {
            "id": 226,
            "phrase": "by the handful",
            "definition": "in amounts equal to a handful; in quantity. Billy is eating candy by the handful. People began leaving by the handful at midnight."
        },
        {
            "id": 227,
            "phrase": "by the hour",
            "definition": "at each hour; once each hour. It kept growing darker by the hour. I have to take this medicine by the hour."
        },
        {
            "id": 228,
            "phrase": "by the month",
            "definition": "one month at a time.  Not many apartments are rented by the month. I needed a car for a short while, so I rented one by the month."
        },
        {
            "id": 229,
            "phrase": "by the nape of the neck",
            "definition": "by the back of the neck. (Mostly said in threats.) _ He grabbed me by the nape of the neck and told me not to turn around if I valued my life. I stood very still.  If you do that again, I’ll pick you up by the nape of the neck and throw you out the door."
        },
        {
            "id": 230,
            "phrase": "by the same token",
            "definition": "Cliché a phrase indicating that the speaker is introducing parallel or closely contrasting information. Tom: I really got cheated! Bob: You think they’ve cheated you, but, by the same token, they believe that you’ve cheated them.  Some say he is a real charmer, but by the same token others are put off by his manner."
        },
        {
            "id": 231,
            "phrase": "*by the seat of one’s pants",
            "definition": "by sheer luck and use of intuition. (*Typically: fly ~; make it ~.) _ I got through school by the seat of my pants.  Pilots who are in fog and using only instruments are f lying by the seat of their pants."
        },
        {
            "id": 232,
            "phrase": "by the skin of one’s teeth",
            "definition": "just barely. (By an amount equal to the thickness of the (imaginary) skin on one’s teeth.) _I got through calculus class by the skin of my teeth.  I got to the airport a few minutes late and missed the plane by the skin of my teeth.  Lloyd escaped from the burning building by the skin of his teeth."
        },
        {
            "id": 233,
            "phrase": "by the sweat of one’s brow",
            "definition": "by one’s efforts; by one’s hard work.  Tom raised these vegetables by the sweat of his brow.  Sally polished the car by the sweat of her brow."
        },
        {
            "id": 234,
            "phrase": "by the week",
            "definition": "one week at a time. I plan my schedules by the week.  Where can I rent a room by the week?"
        },
        {
            "id": 235,
            "phrase": "by the year",
            "definition": "one year at a time.  Most apartments are available by the year.  We budget by the year."
        },
        {
            "id": 236,
            "phrase": "by themselves",
            "definition": "1. with help from no one else.  Do you think they can do it by themselves? _ Mike and Max cannot lift the piano by themselves. 2. with no one else present; alone (of two or more people).  They are sitting there by themselves. Let’s sit with them. They enjoy spending the evening at home by themselves."
        },
        {
            "id": 237,
            "phrase": "by virtue of something",
            "definition": "because of something; due to something. She’s permitted to vote by virtue of her age. They are members of the club by virtue of their great wealth."
        },
        {
            "id": 238,
            "phrase": "by way of something",
            "definition": "1. passing through something (as a place); via something.  He came home by way of Toledo. She went to the bank by way of the drugstore. 2. in illustration; as an example.  By way of illustration, the professor drew a picture on the board.  He read them a passage from Shakespeare by way of example."
        },
        {
            "id": 239,
            "phrase": "by word of mouth",
            "definition": "by speaking rather than writing.  I learned about it by word of mouth.  I need it in writing. I don’t trust things I hear about by word of mouth."
        },
        {
            "id": 240,
            "phrase": "by yourself",
            "definition": "1. with no one else present; alone.  Do you want to sit here by yourself, or can I sit here too? _ Don’t sit at home by yourself. Come to the movie with me. 2. with the help of no one else.  Can you really do all this cooking by yourself ? _ Bill, can you lift this box by yourself ?"
        },
        {
            "id": 241,
            "phrase": "by yourselves",
            "definition": "1. with no one else present; alone (of two or more people). Are you two going to stand here by yourselves all evening? _ Don’t sit home by yourselves. Come to the party. 2. with the help of no one else. Can you three do this by yourselves? _ I expect you guys to get there by yourselves."
        },
        {
            "id": 242,
            "phrase": "Caesar ’s wife must be above suspicion.",
            "definition": "Prov. The associates of public figures must not even be suspected of wrongdoing. (The ancient Roman Julius Caesar is supposed to have said this when asked why he divorced his wife, Pompeia. Because she was suspected of some wrongdoing, he could not associate with her anymore.) _ Jill: I don’t think the mayor is trustworthy; his brother was charged with embezzlement. Jane: But the charges were never proved. Jill: That doesn’t matter. Caesar’s wife must be above suspicion.  When the newspapers reported the rumor that the lieutenant governor had failed to pay his taxes, the governor forced him to resign, saying, “Caesar’s wife must be above suspicion.”"
        },
        {
            "id": 243,
            "phrase": "cage someone or something in†",
            "definition": "to enclose someone or something in a cage.  We caged the monkey in, but it threw a fit.  We are going to have to cage in the dogs."
        },
        {
            "id": 244,
            "phrase": "cage someone or something up† (in something)",
            "definition": "to enclose or confine someone or something in something or someplace. They caged the lions up in strong containers for the trip across country.  How long did it take to cage up the lions securely?"
        },
        {
            "id": 245,
            "phrase": "cajole someone into something",
            "definition": "to coax or persuade someone to do something.  They tried to cajole us into helping them move.  You can’t cajole me into doing that!"
        },
        {
            "id": 246,
            "phrase": "cajole someone out of something",
            "definition": "1. to coax or persuade someone not to do something.  Try and cajole her out of going there. I cajoled her out of leaving so soon. 2. to coax or persuade someone to give up something or give away something. She tried to cajole him out of his inheritance."
        },
        {
            "id": 247,
            "phrase": "cake someone or something with something",
            "definition": "to cover someone or something with a thicker layer of clumps of a substance such as mud, dirt, blood, etc.  The attendant caked her with hot mud at the beginning of the arthritis treatment.  All the motocross racers were heavily caked with mud.  She caked herself with green mud to remove her wrinkles."
        },
        {
            "id": 248,
            "phrase": "calculate on something",
            "definition": "Rur. to think about or plan on something.  Let me calculate on this a little bit.  He’s busy calculating on a serious problem."
        },
        {
            "id": 249,
            "phrase": "call a halt to something",
            "definition": "to demand that something be stopped. We must call a halt to this childish behavior.  The manager called a halt to all overtime."
        }
    ]
}