{
    "dictionary": [
        {
            "id": 0,
            "phrase": "take the edge off ((of ) something)",
            "definition": "to dull a blade. (Of is usually retained before pronouns.) _ Cutting hard stuff like that will take the edge off your knife blade."
        },
        {
            "id": 1,
            "phrase": "take the fall",
            "definition": "Sl. to get arrested for a particular crime. (Especially when others are going unpunished for the same crime.  Walt and Tony pulled the job off together, but Tony took the fall. You did it, and I won’t take the fall!"
        },
        {
            "id": 2,
            "phrase": "take the floor",
            "definition": "1. Fig. to stand up and address the audience.  When I take the f loor, I’ll make a short speech.  The last time you had the f loor, you talked for an hour. 2. Fig. to go to the dance floor in order to dance.  They took the f loor for the foxtrot.  When the band played, everyone took the f loor."
        },
        {
            "id": 3,
            "phrase": "Take the goods the gods provide.",
            "definition": "Prov. If you have good fortune, enjoy it and use it to your advantage.  Frances: I feel I have an unfair advantage over other people in the violin contest. After all, my parents were able to give me lessons with the very best teachers when I was young. Alan: Frances, take the goods the gods provide."
        },
        {
            "id": 4,
            "phrase": "take the heat off (of ) someone or something",
            "definition": "to relieve the pressure on someone or something. (Of is usually retained before pronouns.) _ That really takes the heat off of all of us.  The change in the deadline takes the heat off the office staff."
        },
        {
            "id": 5,
            "phrase": "take the initiative (to do something)",
            "definition": "to activate oneself to do something even if one has not been asked to do it.  The door hinges squeak because no one will take the initiative to oil them. Sometimes, in order to get things done, you have to take the initiative."
        },
        {
            "id": 6,
            "phrase": "take the law into one’s own hands",
            "definition": "to attempt to administer the law; to pass judgment on someone who has done something wrong.  Citizens don’t have the right to take the law into their own hands.  The shopkeeper took the law into his own hands when he tried to arrest the thief."
        },
        {
            "id": 7,
            "phrase": "take the liberty of doing something",
            "definition": "to do something for someone voluntarily; to do something slightly personal for someone that would be more appropriate if one knew the person better. (Often used as an overly polite exaggeration in a request.) _ Do you mind if I take the liberty of f licking a bit of lint off your collar? _May I take the liberty of removing your coat? _ I took the liberty of ordering an entree for you. I hope you don’t mind."
        },
        {
            "id": 8,
            "phrase": "take the (long) count",
            "definition": "Sl. to die. (Fig. on a boxer being counted out and losing a fight.) _ The poor cat took the long count at last.  I’m too young to take the count."
        },
        {
            "id": 9,
            "phrase": "take the pledge",
            "definition": "to promise to abstain from drinking alcohol.  I’m not ready to take the pledge yet, but I will cut down. My aunt tried to get me to take the pledge."
        },
        {
            "id": 10,
            "phrase": "take the plunge",
            "definition": "to marry someone.  I’m not ready to take the plunge yet.  Sam and Mary took the plunge."
        },
        {
            "id": 11,
            "phrase": "take the pulse of something",
            "definition": "to sample or survey something to learn about its progress or state. Two executives came in to take the pulse of the local business unit."
        },
        {
            "id": 12,
            "phrase": "take the rap (for someone)",
            "definition": "Inf. to take the blame [for doing something] for someone else. I don’t want to take the rap for you.  John robbed the bank, but Tom took the rap for him."
        },
        {
            "id": 13,
            "phrase": "take the rap (for something)",
            "definition": "Inf. to take the blame for (doing) something.  I won’t take the rap for the crime. I wasn’t even in town.  Who’ll take the rap for it? Who did it?"
        },
        {
            "id": 14,
            "phrase": "Take the rough with the smooth.",
            "definition": "Prov. Accept difficult as well as easy times. Don’t give up on your business just because you lost money this month. You have to take the rough with the smooth."
        },
        {
            "id": 15,
            "phrase": "take the slack up†",
            "definition": "to tighten a rope that is holding something loosely.  Take the slack up if you can.  This clothesline is too loose. Do something to take up the slack."
        },
        {
            "id": 16,
            "phrase": "take the spear (in one’s chest)",
            "definition": "Sl. to accept full blame for something; to accept the full brunt of the punishment for something.  The CFO got the short straw and had to take the spear in his chest.  I sure didn’t want to take the spear."
        },
        {
            "id": 17,
            "phrase": "take the stage",
            "definition": "to become the center of attention; to become the focus of everyone’s attention.  Later in the day, the problems in the warehouse took the stage, and we discussed them until dinnertime."
        },
        {
            "id": 18,
            "phrase": "take the stand",
            "definition": "to go to and sit in the witness chair in a courtroom.  I was in court all day, waiting to take the stand.  The lawyer asked the witness to take the stand."
        },
        {
            "id": 19,
            "phrase": "take the starch out of someone",
            "definition": "1. Fig. to make someone less arrogant or stiff.  I told a joke that made Mr. Jones laugh very hard. It really took the starch out of him.  John is so arrogant. I’d really like to take the starch out of him! 2. Fig. to make someone tired and weak.  This hot weather really takes the starch out of me. What a long day! It sure took the starch out of me."
        },
        {
            "id": 20,
            "phrase": "take the trouble (to do something)",
            "definition": "to make an effort to do something (that one might not otherwise do). I wish I had taken the trouble to study this matter more carefully.  I just didn’t have enough time to take the trouble."
        },
        {
            "id": 21,
            "phrase": "take the wind out of someone’s sails",
            "definition": "to challenge someone’s boasting or arrogance.  John was bragging about how much money he earned until he learned that most of us make more. That took the wind out of his sails.  Learning that one has been totally wrong about something can really take the wind out of one’s sails."
        },
        {
            "id": 22,
            "phrase": "take the words out of someone’s mouth",
            "definition": "to say something just before someone else was going to say the same thing; to say something that someone who agrees with you might have said. That is exactly right! You took the words right out of my mouth! _When you said “expensive,” you took the words right out of my mouth!"
        },
        {
            "id": 23,
            "phrase": "take things easy",
            "definition": "1. to live well and comfortably.  I’ll be glad when I can make enough money to take things easy. I make enough to take things easy. 2. to relax temporarily and recuperate.  The doctor says I’m supposed to take things easy for a while.  I want you to take it easy until the stitches heal."
        },
        {
            "id": 24,
            "phrase": "take time out",
            "definition": "to spend time away from studying or working.  He’s taking time out between high school and starting at the university. Mary’s taking time out from her job to work abroad for a year."
        },
        {
            "id": 25,
            "phrase": "take to one’s bed",
            "definition": "to go to bed, as with an illness.  I feel a little ill, so I’ll take to my bed for a day or so.  Sam took to his bed with a fever."
        },
        {
            "id": 26,
            "phrase": "take to one’s heels",
            "definition": "to run away.  The little boy said hello and then took to his heels. The man took to his heels to try to get to the bus stop before the bus left."
        },
        {
            "id": 27,
            "phrase": "take too much on†",
            "definition": "to undertake to do too much work or too many tasks at one time.  Don’t take too much on, or you won’t be able to do any of it well. Ann tends to take on too much and get exhausted."
        },
        {
            "id": 28,
            "phrase": "take turns with someone",
            "definition": "to alternate [doing something] with someone.  We both can’t be there at the same time. I’ll take turns with you. You have to take turns with your brother."
        },
        {
            "id": 29,
            "phrase": "take umbrage at something",
            "definition": "to feel that one has been insulted by something.  The employee took umbrage at not getting a raise. Mary took umbrage at the suggestion that she was being unreasonable."
        },
        {
            "id": 30,
            "phrase": "take up arms (against someone or something)",
            "definition": "to prepare to fight against someone or something. Everyone in the town took up arms against the enemy.  They were all so angry that the leader convinced them to take up arms."
        },
        {
            "id": 31,
            "phrase": "take up one’s abode some place",
            "definition": "to make some place one’s home. I am going to take up my abode in a different city.  I will take up my abode in this place and hope to find a job close by."
        },
        {
            "id": 32,
            "phrase": "take up residence some place",
            "definition": "to make a residence of a place.  Ed took up residence in a small efficiency apartment.  It looks as if a family of mice has taken up residence in the cupboard."
        },
        {
            "id": 33,
            "phrase": "take up (someone’s) time",
            "definition": "to require too much of someone else’s time; to waste someone’s time. (Also with so much of or too much of, as in the examples.) _ You’re taking up my time. Please go away.  This problem is taking up too much of my time."
        },
        {
            "id": 34,
            "phrase": "take up the challenge",
            "definition": "to respond to a challenge and do what the challenge asks.  I am not prepared to take the challenge up.  Dave took up the challenge without much urging."
        },
        {
            "id": 35,
            "phrase": "take up where one left off",
            "definition": "to start up again in the very place that one has stopped.  I had to leave the room for a minute, but when I got back, I took up where I left off.  It’s time to stop for lunch. After lunch, we will take up where we left off."
        },
        {
            "id": 36,
            "phrase": "take up with someone",
            "definition": "to become close with someone; to become friends with someone.  I think that Albert may have taken up with the wrong people. I did not want Lefty to take up with Max, but he did, and look where it’s gotten him."
        },
        {
            "id": 37,
            "phrase": "take years off (of ) someone or something",
            "definition": "to make someone seem or look younger. (Of is usually retained before pronouns.) _My exciting vacation took years off of me.  Your shorter haircut has taken years off your face."
        },
        {
            "id": 38,
            "phrase": "Take your seat.",
            "definition": "Please sit down. (Often plural.) _Please take your seats so we can begin."
        },
        {
            "id": 39,
            "phrase": "taken aback",
            "definition": "Cliché surprised and confused.  When Mary told me the news, I was taken aback for a moment.  When I told my parents I was married, they were completely taken aback."
        },
        {
            "id": 40,
            "phrase": "taken for dead",
            "definition": "appearing to be dead; assumed to be dead.  I was so ill with the f lu that I was almost taken for dead.  The accident victims were so seriously injured that they were taken for dead at first."
        },
        {
            "id": 41,
            "phrase": "taken with someone or something",
            "definition": "highly attracted to someone or something.  She was really quite taken with the young man who escorted her to the ball.  The audience was taken with the stage setting."
        },
        {
            "id": 42,
            "phrase": "take-off artist",
            "definition": "Sl. a thief. (Underworld.) _ A take-off artist known as the Cat is cleaning out closets and jewelry boxes all over town.  He’s not a sales agent. He’s a takeoff artist, pure and simple."
        },
        {
            "id": 43,
            "phrase": "taking calls",
            "definition": "willing to receive telephone calls. I’m sorry, but she’s not taking calls at the moment. Can I have her call you later?"
        },
        {
            "id": 44,
            "phrase": "A tale never loses in the telling.",
            "definition": "Prov. When people tell stories, they tend to exaggerate. Johnny’s bicycle accident tale never loses in the telling; he convinced his friends that four semitrucks had been involved, when in fact he only ran into one parked car."
        },
        {
            "id": 45,
            "phrase": "tale of woe",
            "definition": "a sad story; a list of personal problems; an excuse for failing to do something.  I listened to her tale of woe without saying anything.  This tale of woe that we have all been getting from Kelly is just too much."
        },
        {
            "id": 46,
            "phrase": "talk a blue streak",
            "definition": "to talk very much and very rapidly.  Billy didn’t talk until he was two, and then he started talking a blue streak.  I can’t understand anything Bob says. He talks a blue streak, and I can’t follow his thinking."
        },
        {
            "id": 47,
            "phrase": "talk about someone or something",
            "definition": "to discuss someone or something.  I don’t want to talk about Jerry anymore.  Let’s not talk about it now."
        },
        {
            "id": 48,
            "phrase": "Talk about someone or something!",
            "definition": "If you think that thing or person is remarkable, then...  Talk about ugly buildings! This one is horrendous."
        },
        {
            "id": 49,
            "phrase": "talk around something",
            "definition": "to talk, but avoid talking directly about the subject.  You are just talking around the matter! I want a straight answer! _ He never really said anything. He just talked around the issue."
        },
        {
            "id": 50,
            "phrase": "talk at someone",
            "definition": "to say words at someone; to talk to someone in a desultory manner.  You are just talking at her and she isn’t paying attention.  Talk to me, not at me. I want to communicate with you."
        },
        {
            "id": 51,
            "phrase": "talk back (to someone)",
            "definition": "to challenge verbally a parent, an older person, or one’s superior. Please don’t talk back to me! _ I’ve told you before not to talk back!"
        },
        {
            "id": 52,
            "phrase": "talk big",
            "definition": "to brag; to make grandiose statements. She talks big but can’t produce anything.  He has some deep need to talk big, but it’s just talk—no action."
        },
        {
            "id": 53,
            "phrase": "talk down to someone",
            "definition": "to speak to someone in a patronizing manner; to speak to someone in the simplest way.  The manager insulted everyone in the office by talking down to them. Please don’t talk down to me. I can understand anything you have to say."
        },
        {
            "id": 54,
            "phrase": "talk in circles",
            "definition": "to talk in a confusing or roundabout manner. I couldn’t understand a thing he said. All he did was talk in circles. We argued for a long time and finally decided that we were talking in circles."
        },
        {
            "id": 55,
            "phrase": "Talk is cheap.",
            "definition": "Prov. It is easier to say you will do something than to actually do it. (Saying this in response to someone who promises you something implies that you do not believe that person will keep the promise.) _ My boss keeps saying she’ll give me a raise, but talk is cheap.  You’ve been promising me a new dishwasher for five years now. Talk is cheap."
        },
        {
            "id": 56,
            "phrase": "talk like a nut",
            "definition": "to say stupid things.  You’re talking like a nut! You don’t know what you are saying. Don’t talk like a nut! We can’t afford a trip to Florida!"
        },
        {
            "id": 57,
            "phrase": "the talk of a place",
            "definition": "someone or something who is the subject of a conversation somewhere, such as the town, the office, the community, etc.  The handsome new teacher was the talk of the town.  John’s new car is the talk of the office."
        },
        {
            "id": 58,
            "phrase": "talk of someone or something",
            "definition": "to speak about someone or something.  Weren’t we talking of old Mrs. Watson just now? _ We were just talking of old times—happier times."
        },
        {
            "id": 59,
            "phrase": "talk on",
            "definition": "to continue to talk.  The lecturer talked on for hours.  How can anyone talk on so long without saying anything useful?"
        },
        {
            "id": 60,
            "phrase": "talk on someone or something",
            "definition": "to speak on the subject of someone or something.  Today, I will talk on Abraham Lincoln.  Ann is going to talk on the subject of manners."
        },
        {
            "id": 61,
            "phrase": "talk one’s head off",
            "definition": "Inf. to talk endlessly; to argue vigorously.  I talked my head off trying to convince them.  Don’t waste time talking your head off to them."
        },
        {
            "id": 62,
            "phrase": "talk one’s way out of something",
            "definition": "to get out of something by verbal persuasion.  You are in a mess and you can’t talk your way out of it. If I get into some sort of problem, I will try to talk my way out of it."
        },
        {
            "id": 63,
            "phrase": "talk oneself out",
            "definition": "to talk until one can talk no more.  She talked herself out and was silent for the rest of the day.  I talked until I talked myself out."
        },
        {
            "id": 64,
            "phrase": "talk over someone’s head",
            "definition": "to say things that someone cannot understand; to speak on too high a level for one’s audience.  The speaker talked over our heads and we learned nothing.  It is not a good idea to talk over your audience’s heads."
        },
        {
            "id": 65,
            "phrase": "talk over something",
            "definition": "to use something, such as a microphone, intercom, or telephone, to talk. I don’t mind talking over the telephone.  I will talk to Jeff over the intercom and see what he thinks about the idea."
        },
        {
            "id": 66,
            "phrase": "talk shop",
            "definition": "to talk about business or work matters at a social event (where such talk is out of place).  All right, everyone, we’re not here to talk shop. Let’s have a good time.  Mary and Jane stood by the punch bowl, talking shop."
        },
        {
            "id": 67,
            "phrase": "talk someone down†",
            "definition": "1. to win at debating someone.  Liz was able to talk her opponent down. She talked down her opponent. 2. to direct a novice pilot to make a safe landing by giving spoken instructions over the airplane’s radio.  The people on the ground talked down the amateur pilot successfully.  I wonder how many movies have been made about someone talking a pilot down. 3. to convince someone to lower the price of something.  The price tag said $2,000 for the car, but I talked down the salesman by threatening to go elsewhere. This is my final offer. Don’t try to talk me down."
        },
        {
            "id": 68,
            "phrase": "talk someone into (doing) something",
            "definition": "to overcome someone’s objections to doing something; to convince someone to do something.  They talked me into going to the meeting, even though I didn’t really have the time.  No one can talk me into doing something illegal.  She finally talked herself into making the dive."
        },
        {
            "id": 69,
            "phrase": "talk someone or something over† (with someone)",
            "definition": "to discuss someone or something with someone.  I want to talk John over with my staff.  I will talk over this matter with Sam."
        },
        {
            "id": 70,
            "phrase": "talk someone or something up†",
            "definition": "to promote or speak in support of someone or something.  I’ve been talking the party up all day, trying to get people to come.  They keep taking up the candidate as if he represented a real change."
        },
        {
            "id": 71,
            "phrase": "talk someone out of doing something",
            "definition": "to convince someone not to do something.  I tried to talk her out of going, but she insisted.  Don’t try to talk me out of quitting school. My mind is made up."
        },
        {
            "id": 72,
            "phrase": "talk someone out of something",
            "definition": "to convince someone to give up or change something. They were trying to talk me out of my decision.  Timmy tried to talk Mary out of her ice cream cone."
        },
        {
            "id": 73,
            "phrase": "talk someone ragged",
            "definition": "to talk to someone too much; to bore someone. That was not an interview. She talked me ragged.  He always talks me ragged, but I always listen."
        },
        {
            "id": 74,
            "phrase": "talk someone’s ear off",
            "definition": "to talk to someone endlessly; to bore someone with too much talk.  My aunt always talks my ear off when she comes to visit.  Stay away from Mr. Jones. He will talk your ear off if he gets a chance."
        },
        {
            "id": 75,
            "phrase": "talk someone’s head off",
            "definition": "1. Fig. [for someone] to speak too much.  Why does John always talk his head off ? Doesn’t he know he bores people? _ She talks her head off and doesn’t seem to know what she’s saying. 2. Fig. to talk to and bore someone. John is very friendly, but watch out or he’ll talk your head off.  My uncle always talked my head off whenever I went to visit him."
        },
        {
            "id": 76,
            "phrase": "talk something out†",
            "definition": "to settle something by discussion.  Let’s not get mad. Let’s just talk it out.  Please, let’s talk out this matter calmly."
        },
        {
            "id": 77,
            "phrase": "talk something over†",
            "definition": "to discuss something.  Come into my office so we can talk this over. We talked over the plans for nearly an hour."
        },
        {
            "id": 78,
            "phrase": "talk something through†",
            "definition": "1. to discuss something in detail.  Let’s talk the issue through and get it decided. 2. to get something approved by talking convincingly. The board was reluctant to approve it, but I talked it through.  We will talk through this matter in the board meeting."
        },
        {
            "id": 79,
            "phrase": "talk something up†",
            "definition": "to promote or advertise something by saying good things about it to as many people as possible. Let’s talk the play up around campus so we can get a good audience.  I will talk up the play all I can."
        },
        {
            "id": 80,
            "phrase": "talk through one’s hat",
            "definition": "to brag or exaggerate; to talk nonsense.  That can’t be so! You are just talking through your hat! _ Pay no attention to Mary. She is just talking through her hat."
        },
        {
            "id": 81,
            "phrase": "talk to hear one’s own voice",
            "definition": "to talk far more than is necessary; to talk much, in an egotistical manner. Oh, he’s just talking to hear his own voice.  Am I just talking to hear my own voice, or are you listening to me?"
        },
        {
            "id": 82,
            "phrase": "talk turkey",
            "definition": "to talk business; to talk frankly.  Okay, Bob, we have business to discuss. Let’s talk turkey.  John wanted to talk turkey, but Jane just wanted to joke around."
        },
        {
            "id": 83,
            "phrase": "talk until one is blue in the face",
            "definition": "to talk until one is exhausted.  I talked until I was blue in the face, but I couldn’t change her mind.  She had to talk until she was blue in the face in order to convince him."
        },
        {
            "id": 84,
            "phrase": "talk with someone (about someone or something)",
            "definition": "to hold a discussion with someone or a group. Could I talk with you about Alice? _ Can I talk with you about my salary?"
        },
        {
            "id": 85,
            "phrase": "talked out",
            "definition": "tired of talking; unable to talk more.  I can’t go on. I’m all talked out.  She was talked out in the first hour of discussion."
        },
        {
            "id": 86,
            "phrase": "*a tall order",
            "definition": "a request that is difficult to fulfill. (*Typically: be ~; give someone ~.) _ That’s a tall order. Do you think anyone can do it? _Well, it’s a tall order, but I’ll do it."
        },
        {
            "id": 87,
            "phrase": "tall timber(s)",
            "definition": "some remote place in the country or the woods.  Oh, Chuck lives out in the tall timbers somewhere. He only has a post office box number.  You’re not going to move me out into the tall timber somewhere!"
        },
        {
            "id": 88,
            "phrase": "tally something up†",
            "definition": "to add something up.  Please tally everything up and tell me the total.  Let’s tally up everything and ask for donations."
        },
        {
            "id": 89,
            "phrase": "tally with something",
            "definition": "[for one set of figures] to match another set of figures. Your figures don’t tally with mine. Let’s add them up again.  The total Sam got didn’t tally with what the tax agent had come up with."
        },
        {
            "id": 90,
            "phrase": "tamp something down†",
            "definition": "to pat or pack something down.  Tamp the soil down over the seeds after you plant them.  Please tamp down the soil firmly."
        },
        {
            "id": 91,
            "phrase": "tamper with someone or something",
            "definition": "to fiddle with someone or something; to meddle with someone or something.  I’ve got him believing just what I want him to believe. Don’t tamper with him.  Please don’t tamper with the thermostat."
        },
        {
            "id": 92,
            "phrase": "tan someone’s hide",
            "definition": "to spank someone. Billy’s mother said she’d tan Billy’s hide if he ever did that again.  “I’ll tan your hide if you’re late!” said Tom’s father."
        },
        {
            "id": 93,
            "phrase": "tangle someone or something up†",
            "definition": "to entangle someone or something.  Please don’t tangle me up in your ropes.  I tangled up my feet in the cords on the f loor."
        },
        {
            "id": 94,
            "phrase": "tangle with someone or something (over someone or something)",
            "definition": "to battle against someone or something about someone or something. Tim tangled with Karen over the children.  I hope I don’t have to tangle with the bank over this loan.  I don’t want to tangle with city hall."
        },
        {
            "id": 95,
            "phrase": "tap at something",
            "definition": "to make one or more light blows on something.  Fred tapped at the door, but no one heard him.  Who is tapping at my window?"
        },
        {
            "id": 96,
            "phrase": "tap on something",
            "definition": "to make one or more light blows on something. Who is that tapping on my windowpane? _I wish you would stop tapping on the tabletop."
        },
        {
            "id": 97,
            "phrase": "tap out",
            "definition": "1. Sl. to lose one’s money in gambling or in the securities markets. I’m gonna tap out in about three more rolls—just watch.  I really tapped out on that gold-mining stock. 2. Sl. to die; to expire. My dog tapped out after being hit by a car. Mary was so tired that she thought she was going to tap out."
        },
        {
            "id": 98,
            "phrase": "tap someone (for something)",
            "definition": "to select someone for some purpose or position.  The committee tapped John to run for Congress.  I had thought they were going to tap Sally."
        },
        {
            "id": 99,
            "phrase": "tap someone or something on something",
            "definition": "to make one or more light blows on some part of someone or something.  Someone tapped me on the shoulder, and I turned around to see who it was. I tapped the drum on the top to find its pitch."
        },
        {
            "id": 100,
            "phrase": "tap something down†",
            "definition": "to pound something down with light blows.  Please tap that nail down so no one gets hurt on it.  Tap down the tack, if you would."
        },
        {
            "id": 101,
            "phrase": "tap something out†",
            "definition": "to clean something, as the ashes out of a pipe, by tapping.  He took the pipe out of his mouth and tapped the ashes out.  He tapped out the soil from the f lower pot."
        },
        {
            "id": 102,
            "phrase": "tap something with something",
            "definition": "to make light blows on something with something.  Alice tapped the table with her keys in an annoying fashion. Just tap the nail lightly with your hammer."
        },
        {
            "id": 103,
            "phrase": "tap-dance like mad",
            "definition": "Sl. to appear busy continuously; to have to move fast or talk cleverly to distract someone.  When things get tough, the whole Congress tap-dances like mad.  Any public official knows how to tap-dance like mad when the press gets too nosy."
        },
        {
            "id": 104,
            "phrase": "taper off (doing something)",
            "definition": "gradually to stop doing something; to do less and less of something until there is no more to do.  Bob tried to taper off smoking again.  I can’t taper off overeating. I have to stop all at once by going on a strict diet."
        },
        {
            "id": 105,
            "phrase": "tar and feather someone",
            "definition": "to punish or humiliate someone by coating them with tar and feathers.  The people of the village tarred and feathered the bank robber and chased him out of town.  They threatened to tar and feather me if I ever came back into their town."
        },
        {
            "id": 106,
            "phrase": "target someone or something as something",
            "definition": "to aim at someone or something as something; to choose someone or something as someone or something.  The board targeted Alice as a potential candidate. We targeted the first of August as the starting date."
        },
        {
            "id": 107,
            "phrase": "tarred with the same brush",
            "definition": "sharing the same characteristic( s); having the same good or bad points as someone else.  Jack and his brother are tarred with the same brush. They’re both crooks. The Smith children are tarred with the same brush. They’re all lazy."
        },
        {
            "id": 108,
            "phrase": "taste blood",
            "definition": "to experience something exciting, and perhaps dangerous, for the first time.  She had tasted blood once, and she knew that the life of a race-car driver was for her.  Once you taste blood, you’re hooked."
        },
        {
            "id": 109,
            "phrase": "*a taste for something",
            "definition": "a desire for a particular food, drink, or experience. (*Typically: get ~; have ~; give someone ~; acquire ~.) _The Smiths have a taste for adventure and take exotic vacations.  When she was pregnant, Mary often had a taste for pickles."
        },
        {
            "id": 110,
            "phrase": "taste like more",
            "definition": "to taste very good; to taste so good as to make one want to eat more.  This pie is great. It tastes like more.  Mom’s cooking always tastes like more."
        },
        {
            "id": 111,
            "phrase": "taste like something",
            "definition": "to have the same taste as something.  This stuff tastes like watermelon.  What do you think this tastes like?"
        },
        {
            "id": 112,
            "phrase": "taste of something",
            "definition": "1. to have a taste similar to something; to have the hint of a certain flavor. This ice cream tastes of apricots.  Why does this wine taste of vinegar? 2. to take a taste of something. (Typically southern.) _ Here, taste of this pie.  Can I taste of your apple?"
        },
        {
            "id": 113,
            "phrase": "a taste of something",
            "definition": "an experience; an example. Bill gave Sue a taste of her own rudeness.  My friend used a parachute and got a taste of what it’s like to be a bird."
        },
        {
            "id": 114,
            "phrase": "Tastes differ.",
            "definition": "Prov. Different people like different things.  Fred: Bill always goes out with such stupid girls. I can’t understand why. Alan: Tastes differ."
        },
        {
            "id": 115,
            "phrase": "tattle (on someone) (to someone)",
            "definition": "to tell on someone to someone. Are you going to tattle on me to my mother? _ Please don’t tattle on me."
        },
        {
            "id": 116,
            "phrase": "taunt someone about something",
            "definition": "to mock, tease, or torment someone about something.  Stop taunting me about something that happened years ago! _ Terry was being taunted about his gaudy tie, so he took it off."
        },
        {
            "id": 117,
            "phrase": "taunt someone into something",
            "definition": "to mock, tease, or torment someone into doing something.  The gang taunted Liz into taking unnecessary chances.  Don was taunted into leaving the room."
        },
        {
            "id": 118,
            "phrase": "taunt someone with something",
            "definition": "to tease or tantalize someone with something.  Jerry taunted Fran with the plate of fudge.  Please don’t taunt me with food I shouldn’t eat."
        },
        {
            "id": 119,
            "phrase": "tax someone or something with something",
            "definition": "to burden or tire someone or something with something. Please don’t tax me with any more requests for my immediate attention.  You are continuing to tax this committee with your constant complaints."
        },
        {
            "id": 120,
            "phrase": "tax-and-spend",
            "definition": "spending freely and taxing heavily. (Referring to a legislative body that repeatedly passes expensive new laws and keeps raising taxes to pay for the cost. Fixed order.) _I hope that people do not elect another tax-and-spend Congress this time.  The only thing worse than a tax-and-spend legislature is one that spends and runs up a worsening deficit."
        },
        {
            "id": 121,
            "phrase": "teach one’s grandmother to suck eggs",
            "definition": "to try to tell or show someone more knowledgeable or experienced than oneself how to do something. Don’t suggest showing Mary how to knit. It will be like teaching your grandmother to suck eggs.  Don’t teach your grandmother to suck eggs. Bob has been playing tennis for years."
        },
        {
            "id": 122,
            "phrase": "teach someone a lesson",
            "definition": "to get even with someone for bad behavior. John tripped me, so I punched him. That ought to teach him a lesson.  That taught me a lesson. I won’t do it again."
        },
        {
            "id": 123,
            "phrase": "*the teacher’s pet",
            "definition": "the teacher’s favorite student. (*Typically: be ~; become ~.) _ Sally is the teacher’s pet. She always gets special treatment.  The other students don’t like the teacher’s pet."
        },
        {
            "id": 124,
            "phrase": "a team player",
            "definition": "someone who works well with the group; someone who is loyal to the group. Ted is a team player. I am sure that he will cooperate with us."
        },
        {
            "id": 125,
            "phrase": "team up (with someone)",
            "definition": "to join with someone.  I teamed up with Jane to write the report.  I had never teamed up with anyone else before. I had always worked alone."
        },
        {
            "id": 126,
            "phrase": "tear a place apart†",
            "definition": "to search somewhere to the point of destruction. The cops came with a search warrant and tore your room apart.  If you don’t come up with the money you kept for us, we’ll tear apart your house!"
        },
        {
            "id": 127,
            "phrase": "tear across something",
            "definition": "to move rapidly across some area.  The boys tore across the lawn to the swimming pool.  As the plane tore across the sky it made a horrendous roar."
        },
        {
            "id": 128,
            "phrase": "tear along",
            "definition": "to go along very fast, as in running, driving, cycling, etc. The cars tore along the road, raising dust and making noise.  Andy tore along on his bicycle, trying to see how fast he could go."
        },
        {
            "id": 129,
            "phrase": "tear around (some place)",
            "definition": "to move or run around rapidly and perhaps recklessly.  The kids were tearing around through the house all day. They’ve made a real mess.  Please don’t tear around the house."
        },
        {
            "id": 130,
            "phrase": "tear at someone or something",
            "definition": "to rip at someone or something; to try to tear someone or something up. The badger tore at me, but I dodged it and ran away fast.  Timmy tore at the package, struggling to get the paper off."
        },
        {
            "id": 131,
            "phrase": "tear away (from someone or something)",
            "definition": "to leave someone or something, running.  Dave tore away from Jill, leaving her to find her own way home.  Roger tore away from the meeting, trying to make his train."
        },
        {
            "id": 132,
            "phrase": "tear down something",
            "definition": "to race down something very fast.  The girls tore down the hallway as fast as they could run.  They tore down the stairs and ran out the door."
        },
        {
            "id": 133,
            "phrase": "tear into some place",
            "definition": "to run or race into a place. The kids tore into the house and knocked over a lamp.  Kelly tore into the boss’s office and put the papers on the desk."
        },
        {
            "id": 134,
            "phrase": "tear into someone",
            "definition": "to scold someone severely; to attack someone with criticism. I was late, and the boss tore into me like a mad dog.  I don’t know why she tore into me. I was at work when the window was broken."
        },
        {
            "id": 135,
            "phrase": "tear into someone or something",
            "definition": "to attack someone or something; to attack someone or something with the intent of eating someone or something.  The wolves tore into the hunter and injured him severely.  The kids tore into the cake and ate it all."
        },
        {
            "id": 136,
            "phrase": "tear into something",
            "definition": "to begin eating food with gusto. The family tore into the mountain of food like they hadn’t eaten since breakfast—which was true, in fact.  Jimmy tore into the turkey leg and cleaned it off in no time."
        },
        {
            "id": 137,
            "phrase": "tear loose (from someone or something)",
            "definition": "to manage to break away from someone or something.  The quarterback tore loose and took twenty yards for a first down.  Barlowe tore loose from Bill and made for the door."
        },
        {
            "id": 138,
            "phrase": "tear off (from someone or something)",
            "definition": "to leave someone or something in a great hurry.  I hate to tear off from you guys, but I’m late for dinner. It’s time for me to go. I have to tear off."
        },
        {
            "id": 139,
            "phrase": "tear one’s hair (out)",
            "definition": "to be anxious, frustrated, or angry.  I was so nervous, I was about to tear my hair.  I had better get home. My parents will be tearing their hair out."
        },
        {
            "id": 140,
            "phrase": "tear (oneself) away (from someone or something)",
            "definition": "to force oneself to leave someone or something.  Do you think you can tear yourself away from your friends for dinner? _ I could hardly tear myself away from the concert."
        },
        {
            "id": 141,
            "phrase": "tear out (of some place)",
            "definition": "to leave a place in a great hurry.  The kids tore out of the house after they broke the window.  They saw what they had done and tore out."
        },
        {
            "id": 142,
            "phrase": "tear someone apart†",
            "definition": "to rip someone apart savagely.  Max threatened to tear Tom apart. The bear tore apart the hiker."
        },
        {
            "id": 143,
            "phrase": "tear someone or some animal limb from limb",
            "definition": "to rip someone or an animal to bits.  The explosion tore the workers limb from limb. The crocodiles attacked the wading zebras and tore them limb from limb."
        },
        {
            "id": 144,
            "phrase": "tear someone or something down†",
            "definition": "to criticize or degrade someone or something.  Tom is always tearing Jane down. I guess he doesn’t like her. It’s not nice to tear down the people who work in your office.  Why are you always tearing my projects down?"
        },
        {
            "id": 145,
            "phrase": "tear someone up†",
            "definition": "to cause someone much grief. The news of Tom’s death really tore Bill up.  Bad news tears up some people. Other people can take it calmly."
        },
        {
            "id": 146,
            "phrase": "tear something apart†",
            "definition": "1. to pull or rip something apart.  The bear tore the tent apart. The lions tore apart the wildebeest in minutes, and began eating it. 2. to criticize something mercilessly.  The critic tore apart the entire cast of the play. 3. to divide something or the members of a group, citizens of a country, etc.  The financial crisis tore the club apart.  The crisis tore apart the organization."
        },
        {
            "id": 147,
            "phrase": "tear something away† (from someone or something)",
            "definition": "to peel something from someone or something. The paramedic tore the clothing away from the burn victim and began to treat the wounds immediately. She tore away the clothing from the victim.  She tore the clothing away. 2. to quickly take something away from someone or something. I tore the firecracker away from the child and threw it in the lake.  Liz tore away the cover from the book.  She tore the wrapping paper away."
        },
        {
            "id": 148,
            "phrase": "tear something down†",
            "definition": "to dismantle or destroy something. They plan to tear the old building down and build a new one there.  They’ll tear down the building in about two weeks."
        },
        {
            "id": 149,
            "phrase": "tear something from something",
            "definition": "to rip or peel something from something.  He tore the wrapping from the gift.  The monkey tore the peel from the banana and took a bite of it."
        },
        {
            "id": 150,
            "phrase": "tear something on something",
            "definition": "to rip something on something sharp or jagged. I tore my pants on the corner of the desk.  Mary tore her new skirt on something sharp on the side of the car."
        },
        {
            "id": 151,
            "phrase": "tear something up†",
            "definition": "to rip someone or something to pieces.  The two drunks tore the bar up in their brawling.  The dog tore up the newspaper."
        },
        {
            "id": 152,
            "phrase": "tease someone about someone or something",
            "definition": "to make fun of someone about someone or something; to poke fun at someone about someone or something. The boys teased Don about his girlfriend.  Stop teasing me about it!"
        },
        {
            "id": 153,
            "phrase": "tease someone into doing something",
            "definition": "to force someone to do something through teasing or tormenting.  Sam teased her into doing what he wanted.  Perhaps you can tease him into leaving, but he won’t go if you ask him."
        },
        {
            "id": 154,
            "phrase": "tease something out†",
            "definition": "to separate threads or hairs by combing.  The hairdresser teased Jill’s hair out carefully.  The hairdresser teased out Jill’s hair."
        },
        {
            "id": 155,
            "phrase": "tee off",
            "definition": "to start the first hole in a game of golf.  It’s time to tee off. Let’s get on the course.  What time do we tee off ?"
        },
        {
            "id": 156,
            "phrase": "tee someone off†",
            "definition": "Sl. to make someone angry.  That really teed me off! _ Well, you sure managed to tee off everybody!"
        },
        {
            "id": 157,
            "phrase": "teed off",
            "definition": "Inf. angry. I’m not teed off! I’m enraged. I was so teed off I could have spit!"
        },
        {
            "id": 158,
            "phrase": "teed (up)",
            "definition": "Sl. intoxicated. She was totally teed up by midnight.  Tom was too teed to drive."
        },
        {
            "id": 159,
            "phrase": "teem with someone or something",
            "definition": "to swarm with someone or something; to be abundant with someone or something.  The porch was teeming with f lies, so we couldn’t eat there.  The beach teemed with people enjoying the sunny weather."
        },
        {
            "id": 160,
            "phrase": "teething troubles",
            "definition": "pain and crying on the part of a baby whose teeth are growing in. Billy has been whining because of teething troubles."
        },
        {
            "id": 161,
            "phrase": "telegraph one’s punches",
            "definition": "1. Fig. to signal, unintentionally, what blows one is about to strike. (Boxing.) _Wilbur used to telegraph his punches until his trainer worked with him.  Don’t telegraph your punches, kid! You’ll be f lat on your back in twenty seconds. 2. Fig. to signal, unintentionally, one’s intentions.  When you go in there to negotiate, don’t telegraph your punches. Don’t let them see that we’re in need of this contract.  The mediator telegraphed his punches, and we were prepared with a strong counterargument."
        },
        {
            "id": 162,
            "phrase": "telephone something in† (to someone)",
            "definition": "to call someone on the telephone, usually to give particular information. (The person called is in a special location, such as one’s workplace or headquarters.) _ I will telephone my report in to my secretary.  I telephoned in my report.  I will telephone it in tomorrow."
        },
        {
            "id": 163,
            "phrase": "telescope into something",
            "definition": "[for one cylindrical part of something] to fit down inside another part, thereby reducing the length of the whole. This part telescopes into this part. The tent poles telescoped into a small, compact unit."
        },
        {
            "id": 164,
            "phrase": "tell all",
            "definition": "to tell everything, even the secrets. Some reporter got hold of the actress’s maid who offered to tell all for a fee."
        },
        {
            "id": 165,
            "phrase": "Tell it like it is.",
            "definition": "Inf. Speak frankly.; Tell the truth no matter who is criticized or how much it hurts.  Come on man, tell it like it is! _ Well, I’ve got to tell it like it is."
        },
        {
            "id": 166,
            "phrase": "Tell it to the marines!",
            "definition": "Inf. I do not believe you (maybe the marines will)! _ Your excuse is preposterous. Tell it to the marines. I don’t care how good you think your reason is. Tell it to the marines!"
        },
        {
            "id": 167,
            "phrase": "Tell me another (one)!",
            "definition": "Inf. What you just told me was a lie, so go ahead and tell me another lie! (Indicates incredulity.) _ Bill: Did you know that the football coach was once a dancer in a movie? Tom: Go on! Tell me another one! _ “Tell me another one!” laughed Bill at Tom’s latest exaggeration."
        },
        {
            "id": 168,
            "phrase": "tell of someone or something",
            "definition": "to speak of someone or something.  The messenger told of great destruction, hunger, and disease in the northern part of the country.  I want you to tell of Jane and how she is doing."
        },
        {
            "id": 169,
            "phrase": "tell on someone",
            "definition": "to report someone’s bad behavior; to tattle on someone.  If you do that again, I’ll tell on you! _ Please don’t tell on me. I’m in enough trouble as it is."
        },
        {
            "id": 170,
            "phrase": "tell one to one’s face",
            "definition": "to tell [something] to someone directly.  I’m sorry that Sally feels that way about me. I wish she had told me to my face.  I won’t tell Tom that you’re mad at him. You should tell him to his face."
        },
        {
            "id": 171,
            "phrase": "tell people or things apart†",
            "definition": "to distinguish one from another. I can’t tell Bob and Bill apart. I find it easy to tell apart Bill and Bob.  The two cakes look different, but in taste, I can’t tell this one and that one apart."
        },
        {
            "id": 172,
            "phrase": "tell someone about someone or something",
            "definition": "to give information to someone about someone or something.  Please tell me about Wallace. You were going to tell me about the old neighborhood."
        },
        {
            "id": 173,
            "phrase": "tell someone off†",
            "definition": "to scold someone; to attack someone verbally. (This has a sense of finality about it.) _I was so mad at Bob that I told him off.  By the end of the day, I had told off everyone else, too."
        },
        {
            "id": 174,
            "phrase": "tell someone on someone",
            "definition": "to tattle to someone about someone.  I’m going to tell your mother on you! _ I’ll tell the teacher on you!"
        },
        {
            "id": 175,
            "phrase": "tell someone or something by something",
            "definition": "to identify someone or something by something.  You can tell Jim by the old-fashioned shoes he wears.  I can tell the new season’s fashions by how short the skirts are."
        },
        {
            "id": 176,
            "phrase": "tell someone what to do with something",
            "definition": "to reject someone’s idea by suggesting that someone do something rude with something. (With the unspoken notion that one should stick it up one’s ass.) _I’ll tell you what you can do with it.  If that’s the way he wants to be, you can just tell him what to do with it."
        },
        {
            "id": 177,
            "phrase": "tell someone where to get off",
            "definition": "to scold someone; to express one’s anger to someone; to tell someone off. Wait till I see Sally. I’ll tell her where to get off! _ She told me where to get off and then started in scolding Tom."
        },
        {
            "id": 178,
            "phrase": "tell something from something",
            "definition": "to know something because of something, such as evidence, signs, experience, etc.  I can tell that she’s lying from the way she holds her eyebrows.  I can’t tell anything from what you told me."
        },
        {
            "id": 179,
            "phrase": "tell tales out of school",
            "definition": "to tell secrets or spread rumors.  I wish that John would keep quiet. He’s telling tales out of school again.  If you tell tales out of school a lot, people won’t know when to believe you."
        },
        {
            "id": 180,
            "phrase": "tell the difference between someone and someone else or something and something else",
            "definition": "to recognize the things that distinguish people or things.  I can’t tell the difference between Billy and Bobby.  Sam can’t tell the difference between Granny Smith and Royal Gala apples."
        },
        {
            "id": 181,
            "phrase": "Tell the truth and shame the devil.",
            "definition": "Prov. To tell the truth even though you have strong reasons for concealing it. Jill: Have you been using my computer without asking permission? Jane: Uh . . . no. . . . Jill: Come on, Jane, tell the truth and shame the devil."
        },
        {
            "id": 182,
            "phrase": "tell the (whole) world",
            "definition": "to spread around someone’s private business.  Well, you don’t have to tell the whole world.  Go ahead, tell the world!"
        },
        {
            "id": 183,
            "phrase": "tell things apart",
            "definition": "to distinguish one thing or a group of things from another thing or group of things.  This one is gold, and the others are brass. Can you tell them apart? _ Without their labels, I can’t tell them apart."
        },
        {
            "id": 184,
            "phrase": "tell time",
            "definition": "to keep or report the correct time. This clock doesn’t tell time very accurately.  My watch stopped telling time, so I had to have it repaired."
        },
        {
            "id": 185,
            "phrase": "temper something with something",
            "definition": "1. Fig. to harden something, such as metal, with something.  You have to temper the metal pieces with very high heat.  The sheet of metal was tempered by the application of great pressure. 2. Fig. to soften the impact of something, such as news, with something.  We can temper this disaster story a bit with a picture of the happy survivors. The news story was tempered with a paragraph of explanation and justification."
        },
        {
            "id": 186,
            "phrase": "tempt someone into something",
            "definition": "to lure or seduce someone into something. Could I tempt you into going swimming? _ She would not be tempted into eating the rich and fattening cake."
        },
        {
            "id": 187,
            "phrase": "tempt someone to do something",
            "definition": "to entice someone to do something.  You can’t tempt me to eat any of that cake! _ I wasn’t even tempted to go into town with the others."
        },
        {
            "id": 188,
            "phrase": "tempt someone with something",
            "definition": "to entice someone with something. Can I tempt you with a bit of chocolate cake? _ I was tempted with a free book if I sent in my name, but I decided against it."
        },
        {
            "id": 189,
            "phrase": "tend to do something",
            "definition": "to have a tendency to do something.  Jill tends to play with her hair while she works.  Sam tends to say things like that when he is upset."
        },
        {
            "id": 190,
            "phrase": "tend toward something",
            "definition": "to have a tendency to display a certain characteristic.  Roger tends toward the dramatic.  We all tend toward bad humor during bad weather."
        },
        {
            "id": 191,
            "phrase": "the tender age of...",
            "definition": "the young age of...  She left home at the tender age of 17 and got married to a rock singer."
        },
        {
            "id": 192,
            "phrase": "tender something for something",
            "definition": "to offer something (of value) for something.  The shareholders were asked to tender one of their shares for two of the offering company’s.  I decided not to tender my shares."
        },
        {
            "id": 193,
            "phrase": "tender something (to someone) (for something)",
            "definition": "to offer or present something to someone for something.  Laura tendered payment to Gary for the tickets. Walter tendered the old shares to the company for new shares."
        },
        {
            "id": 194,
            "phrase": "tense up (for something)",
            "definition": "to become tense, anxious, and ready for something. Liz tensed up for the game and was very nervous. He tensed up and that made it hard to give him the injection he needed."
        },
        {
            "id": 195,
            "phrase": "terrify someone or an animal out of something",
            "definition": "1. to terrify someone or an animal to leave something or some place. The attackers terrified the farmers out of their homes.  The snake terrified the gophers out of their burrow. 2. to cause someone or an animal to lose something through fear.  They tried to terrify the old lady out of her money, but she refused to tell where it was. The eagle terrified the hawk out of the food it was holding."
        },
        {
            "id": 196,
            "phrase": "test for something",
            "definition": "to try to find out about something by testing. We are testing for weak places in your roof. That’s the noise you hear up there. They are testing for some sort of infection."
        },
        {
            "id": 197,
            "phrase": "test out (of something)",
            "definition": "to score high enough on a placement test that one does not need to take a particular course.  I tested out of calculus.  I don’t know enough Spanish to test out."
        },
        {
            "id": 198,
            "phrase": "test someone in something",
            "definition": "to test someone in a particular subject.  The committee decided to test her in her knowledge of the laws of the state.  We were all tested in math and English."
        },
        {
            "id": 199,
            "phrase": "test someone or something for something",
            "definition": "to apply a test to someone or something to try to determine something or identify something.  They tested me for all sorts of diseases.  Ken tested the roof for weak spots."
        },
        {
            "id": 200,
            "phrase": "test something out†",
            "definition": "to try something out; to test something to see if it works.  I can’t wait to test my new laptop out.  I will test out the new brakes on the car."
        },
        {
            "id": 201,
            "phrase": "testify against someone or something",
            "definition": "to be a witness against someone or something. Who will testify against him in court? _I cannot testify against the company I work for."
        },
        {
            "id": 202,
            "phrase": "testify for someone",
            "definition": "to present evidence in favor of someone; to testify on someone’s behalf. I agreed to testify for her at the trial. Max testified for Lefty, but they were both convicted."
        },
        {
            "id": 203,
            "phrase": "testify to something",
            "definition": "to swear to something. I will testify to your whereabouts if you wish. I think I know what happened, but I would not testify to it."
        },
        {
            "id": 204,
            "phrase": "Thank God for small favors.",
            "definition": "Rur. Be thankful that something good has happened in a bad situation. Charlie: We’re out of gas, but I think I see a gas station up ahead. Tom: Thank God for small favors. He had a heart attack, but it was right there in the doctor’s office, so they could take care of him right away. Thank God for small favors."
        },
        {
            "id": 205,
            "phrase": "thank one’s lucky stars",
            "definition": "to be thankful for one’s luck.  You can thank your lucky stars that I was there to help you. I thank my lucky stars that I studied the right things for the test."
        },
        {
            "id": 206,
            "phrase": "thank someone for something",
            "definition": "to show or state one’s gratitude to someone for something.  We would all like to thank you for coming tonight. Thank you for inviting me."
        },
        {
            "id": 207,
            "phrase": "Thank you for a lovely evening.",
            "definition": "an expression said by a departing guest to the host or hostess at the end of an evening. (Other adjectives, such as nice, can be used in place of lovely.) _Mary: Thank you for a lovely evening. John: Will I see you again? _Bill: Thank you for a nice evening. Mary: Thank you so much for coming. Good night."
        },
        {
            "id": 208,
            "phrase": "Thank you for a lovely time.",
            "definition": "an expression said by a departing guest to the host or hostess. (Other adjectives, such as nice, can be used in place of lovely.) _Bill: Thank you for a nice time. Mary: Thank you so much for coming. Bye now. John: Thank you so much for coming. Jane: Well, thank you for a lovely time. John: Don’t stay away so long next time."
        },
        {
            "id": 209,
            "phrase": "Thank you for calling.",
            "definition": "Thank you for calling on the telephone. (Said when the call is helpful or a bother to the caller.) _Mary: Good-bye. Sue: Good-bye, thanks for calling.  John: Okay. Well, I have to get off the phone. I just wanted you to know what was happening with your order. Jane: Okay. Bye. Thanks for calling."
        },
        {
            "id": 210,
            "phrase": "Thank you for sharing.",
            "definition": "Inf. a sarcastic remark made when someone tells something that is unpleasant, overly personal, disgusting, or otherwise annoying. Thank you for sharing. I really need to hear about your operation.  Thank you for sharing, Bob. I hope your parents’ divorce goes well."
        },
        {
            "id": 211,
            "phrase": "Thank you kindly.",
            "definition": "Thank you very much.  Tom: May I give you a lift? Jane: Why, yes. Thank you kindly. Mary: That’s a nice suit, and you wear it well. Charlie: Thank you kindly, ma’am."
        },
        {
            "id": 212,
            "phrase": "*thankful for small blessings",
            "definition": "grateful for any small benefits or advantages one has, especially in a generally difficult situation. (*Typically: be ~; become ~.) _ We have very little money, but we must be thankful for small blessings. At least we have enough food.  Bob was badly injured in the accident, but at least he’s still alive. Let’s be thankful for small blessings."
        },
        {
            "id": 213,
            "phrase": "thanks a bunch",
            "definition": "Inf. thanks.  Thanks a bunch for your help.  He said “thanks a bunch” and walked out."
        },
        {
            "id": 214,
            "phrase": "Thanks a million.",
            "definition": "Inf. Thank you a lot._Bill: Oh, thanks a million. You were very helpful. Bob: Just glad I could help.  John: Here’s your book. Jane: Thanks a million. Sorry I needed it back in such a rush."
        },
        {
            "id": 215,
            "phrase": "Thanks awfully.",
            "definition": "Thank you very much.  John: Here’s one for you. Jane: Thanks awfully.  Mary: Here, let me help you with all that stuff. Sue: Thanks awfully."
        },
        {
            "id": 216,
            "phrase": "Thanks, but no thanks.",
            "definition": "Inf. Thank you, but I am not interested. (A way of turning down something that is not very desirable.) _Alice: How would you like to buy my old car? Jane: Thanks, but no thanks.  John: What do you think about a trip over to see the Wilsons? Sally: Thanks, but no thanks. We don’t get along."
        },
        {
            "id": 217,
            "phrase": "Thanks loads.",
            "definition": "Inf. Thanks a lot.  Mary: Here, you can have these. And take these too. Sally: Thanks loads. John: Wow! You look great! Sally: Thanks loads. I try."
        },
        {
            "id": 218,
            "phrase": "thanks to someone or something",
            "definition": "due to someone or something; because of someone or something. (This does not necessarily suggest gratitude.) _ Thanks to the storm, we have no electricity.  Thanks to Mary, we have tickets to the game. She bought them early before they were sold out."
        },
        {
            "id": 219,
            "phrase": "That ain’t hay.",
            "definition": "Inf. That is not a small amount of money. (The highly informal word ain’t is built into the expression.) _I paid forty dollars for it, and that ain’t hay! _Bob lost his wallet with $200 in it—and that ain’t hay."
        },
        {
            "id": 220,
            "phrase": "That ain’t no lie.",
            "definition": "Rur. What was said is true. (The highly informal word ain’t is built into the expression.) _ Tom: Sure is hot today. Jane: That ain’t no lie.  I’m plumb exhausted, and that ain’t no lie."
        },
        {
            "id": 221,
            "phrase": "That ain’t the way I heard it.",
            "definition": "Rur. That is not the way I heard the story told. (The highly informal word ain’t is built into the expression.) _John: It seemed like a real riot, then Sally called the police and things calmed down. Sue: That ain’t the way I heard it. John: What? Sue: Somebody said the neighbors called the police. Fred: Four of us went fishing and were staying in this cabin. These women stopped and said they were having car trouble. What could we do? Sally: That ain’t the way I heard it."
        },
        {
            "id": 222,
            "phrase": "That (all) depends.",
            "definition": "My answer depends on factors that have yet to be discussed.  Tom: Will you be able to come to the meeting on Thursday night? Mary: That all depends.  Bob: Can I see you again? Sally: That depends."
        },
        {
            "id": 223,
            "phrase": "that beats something all to pieces",
            "definition": "Rur. that is much better than the person or thing named.  Mary’s layer cake beats mine all to pieces. I say the book beats the movie all to pieces."
        },
        {
            "id": 224,
            "phrase": "That brings me to the (main) point.",
            "definition": "a transitional expression that introduces the main point of a conversation. point.) _ Father: It’s true. All of us had to go through something like this when we were young, and that brings me to the point. Aren’t you old enough to be living on your own and making your own decisions and supporting yourself ? Tom: Well, yes, I guess so.  Fred: Yes, things are very expensive these days, and that brings me to the main point. You simply have to cut back on spending. Bill: You’re right. I’ll do it!"
        },
        {
            "id": 225,
            "phrase": "(That causes) no problem.",
            "definition": "That will not cause a problem for me or anyone else. (No problem is informal.) _ Mary: Do you mind waiting for just a little while? Bob: No problem.  Sue: Does this block your light? Can you still read? Jane: That causes no problem."
        },
        {
            "id": 226,
            "phrase": "That makes two of us.",
            "definition": "Inf. The same is true for me.  So you’re going to the football game? That makes two of us.  Bill: I just passed my biology test. Bob: That makes two of us!"
        },
        {
            "id": 227,
            "phrase": "That (really) burns me (up)!",
            "definition": "Inf. That makes me very angry! _Bob: Did you hear that interest rates are going back up? Mary: That really burns me up! _ Sue: Fred is telling everyone that you are the one who lost the party money. Mary: That burns me! It was John who had the money in the first place."
        },
        {
            "id": 228,
            "phrase": "That’s a fine how-do-you-do.",
            "definition": "Inf. That is a terrible situation.  Well, that’s a fine how-do-you-do! I tried to call Mary, and her number is disconnected! _That’s a fine howdo- you-do. I come home and find the kids are playing catch with my best crystal bowl."
        },
        {
            "id": 229,
            "phrase": "That’s a new one on me!",
            "definition": "Inf. I had not heard that before. Bob: Did you hear? They’re building a new highway that will bypass the town. Fred: That’s a new one on me! That’s terrible! _ Sue: All of us will have to pay our taxes monthly from now on. Mary: That’s a new one on me!"
        },
        {
            "id": 230,
            "phrase": "That’s about the size of it.",
            "definition": "Inf. That is the way it is. (Often a response to someone who has acknowledged bad news.) _ Bob: We only have a few hundred dollars left in the bank. Sally: That means that there isn’t enough money for us to go on vacation? Bob: That’s about the size of it.  Bob: I’m supposed to take this bill to the county clerk’s office and pay them four hundred dollars? Sally: That’s about the size of it."
        },
        {
            "id": 231,
            "phrase": "That’s all for someone.",
            "definition": "Inf. Someone will get no more chances to do things correctly.  That’s all for you, Tom. I’ve had all I can take from you. One disappointment after another.  You’ve gone too far, Mary. That’s all for you. Good-bye!"
        },
        {
            "id": 232,
            "phrase": "That’s easy for you to say.",
            "definition": "You can say that easily because it really does not affect you the way it affects others.  Waiter: Here’s your check. Mary: Thanks. (turning to others) I’m willing to just split the check evenly. Bob: That’s easy for you to say. You had lobster! _Sally: Let’s each chip in ten bucks and buy him a sweater. Sue: That’s easy for you to say. You make twice what I do."
        },
        {
            "id": 233,
            "phrase": "That’s enough!",
            "definition": "Inf. No more!; Stop that! _Sue: Here, I’ll stack another one on top. Mary: That’s enough! It will fall.  John: I could go on with complaint after complaint. I could talk all week, in fact. Bob: That’s enough!"
        },
        {
            "id": 234,
            "phrase": "That’s enough for now.",
            "definition": "No more of that for now.; Please stop for a while.  Mary: Here, have some more cake. Do you want a larger piece? Bill: Oh, no. That’s enough for now. Bill: Shall I cut a little more off this tree, lady, or save the rest till spring? Jane: No, that’s enough for now."
        },
        {
            "id": 235,
            "phrase": "(That’s) enough (of this) foolishness!",
            "definition": "1. Stop this foolish behavior.  Bill: Enough of this foolishness. Stop it! Sally: Sorry.  Father: That’s enough of this foolishness. You two stop fighting over nothing. Bob: Okay. Bill: Sorry. 2. I have had enough of this. (Does not refer to something that is actual foolishness.) _ Andy: Enough of this foolishness. I hate ballet. I’m leaving. Sue: Well, please leave quietly.  Sally: That’s enough foolishness. I’m leaving and I never want to see you again! Bob: Come on! I was only teasing."
        },
        {
            "id": 236,
            "phrase": "That’s for dang sure!",
            "definition": "Rur. That is quite certain! (The formulaic response to That’s for sure!. The accent is always on the dang.) _ Tom: That’s for sure! Jane: That’s for dang sure! _ Sally: We’ll be there and that’s for sure! Bill: Yup! That’s for dang sure!"
        },
        {
            "id": 237,
            "phrase": "That’s funny.",
            "definition": "That is strange or peculiar. Bill: Tom just called from Detroit and says he’s coming back tomorrow. Mary: That’s funny. He’s not supposed to. Sue: The sky is turning very gray. Mary: That’s funny. There’s no bad weather forecast."
        },
        {
            "id": 238,
            "phrase": "That’s it!",
            "definition": "1. Inf. That does it!; That’s the last straw! _ That’s it! I’m leaving! I’ve had enough! _ Okay. That’s it! I’m going to report you to human resources! 2. That is the answer! _ That’s it! You are right.  That’s it! You got the right answer."
        },
        {
            "id": 239,
            "phrase": "That’s (just) too much!",
            "definition": "1. Inf. That is unpleasant and unacceptable!; That is more than I can bear! _“That’s just too much!” exclaimed Sue, and she walked out.  Bill: I’m afraid this movie isn’t what we thought it was going to be. Sue: Did you see that? That’s too much! Let’s go! 2. Inf. That is just too funny. (Compare this with You’re too much.) _ After Fred finished the joke, and Bill had stopped howling with laughter, Bill said, “That’s too much! Your jokes are so hilarious.” _ When Tom stopped laughing, his sides ached and he had tears in his eyes. “Oh, that’s too much!” he moaned."
        },
        {
            "id": 240,
            "phrase": "That’s more like it.",
            "definition": "That is better.; That is a better response this time. Waiter: Here is your order, sir. Roast chicken as you requested. Sorry about the mix-up. John: That’s more like it. Clerk: Now, here’s one that you might like. Sally: Now, that’s more like it!"
        },
        {
            "id": 241,
            "phrase": "That’s news to me.",
            "definition": "I did not know that.; I had not been informed of that.  Bill: They’ve blocked off Maple Street for some repairs. Tom: That’s news to me. Sally: The telephones are out. None of them work. Bill: That’s news to me."
        },
        {
            "id": 242,
            "phrase": "That’s show business (for you).",
            "definition": "That is the way that life really is. (Also with biz and show biz.) _ And now the car won’t start. That’s show business for you.  Too bad about the bad investment. That’s show biz."
        },
        {
            "id": 243,
            "phrase": "That’s that!",
            "definition": "Inf. That is the end of that! Nothing more can be done.  Tom: Well, that’s that! I can do no more. Sally: That’s the way it goes.  Doctor (finishing an operation): That’s that! Would you close for me, Sue? Sue: Nice job, Doctor. Yes, I’ll close."
        },
        {
            "id": 244,
            "phrase": "That’s the spirit!",
            "definition": "That is the right attitude and preferred evidence of high motivation. A: I am sure I can do it! B: That’s the spirit!"
        },
        {
            "id": 245,
            "phrase": "That’s the stuff!",
            "definition": "Inf. That is the right attitude or action. Bob: I’m sure I can do it! Fred: That’s the stuff! _“That’s the stuff!” cried the coach as Mary crossed the finish line."
        },
        {
            "id": 246,
            "phrase": "That’s the ticket!",
            "definition": "Inf. That is what is required! _ Mary: I’ll just get ready and drive the package directly to the airport! Sue: That’s the ticket. Take it right to the airport post office. Bob: I’ve got it! I’ll buy a new computer! Bill: That’s the ticket!"
        },
        {
            "id": 247,
            "phrase": "(That’s the) way to go!",
            "definition": "Inf. a phrase encouraging someone to continue the good work. As John ran over the finish line, everyone cried, “That’s the way to go!” _ “Way to go!” said Mary when Bob finally got the car started."
        },
        {
            "id": 248,
            "phrase": "(That’s) too bad.",
            "definition": "It is unfortunate.; I’m sorry to hear that.  Tom: I hurt my foot on our little hike. Fred: That’s too bad. Can I get you something for it? Tom: No, I’ll live. Bob: My uncle just passed away. Tom: That’s too bad. I’m sorry to hear that. Bob: Thanks."
        },
        {
            "id": 249,
            "phrase": "That’s what I say.",
            "definition": "Inf. I agree with what was just said.  Tom: We’ve got to get in there and stand up for our rights! Mary: That’s what I say.  Bob: They shouldn’t do that! They should be put in jail! Mary: That’s what I say!"
        }
    ]
}