{
    "dictionary": [
        {
            "id": 0,
            "phrase": "clothe someone in something",
            "definition": "to dress someone in something. She clothed her children in the finest garments.  He clothed himself in his tuxedo for the wedding."
        },
        {
            "id": 1,
            "phrase": "Clothes make the man.",
            "definition": "Prov. People will judge you according to the way you dress.  Jim was always careful about how he dressed. He believed that clothes make the man."
        },
        {
            "id": 2,
            "phrase": "cloud over",
            "definition": "[for the sky] to fill with clouds; [for the sun] to be obscured by clouds.  It was beginning to cloud over, so we went inside.  The sky clouded over and it began to get chilly."
        },
        {
            "id": 3,
            "phrase": "cloud up",
            "definition": "[for the sky] to get cloudy, as if it were going to rain. All of a sudden it clouded up and began to rain.  It usually clouds up at the top of the mountain."
        },
        {
            "id": 4,
            "phrase": "clown around (with someone)",
            "definition": "to join with someone in acting silly; [for two or more people] to act silly together. The boys were clowning around with each other.  The kids are having fun clowning around."
        },
        {
            "id": 5,
            "phrase": "clue someone in† (on something)",
            "definition": "to inform someone of something.  Please clue me in on what’s been going on.  Clue in those guys before it’s too late."
        },
        {
            "id": 6,
            "phrase": "clunk down",
            "definition": "[for something] to drop or fall, making the sound “clunk.” _A large piece of metal clunked down right in front of me.  A tree branch clunked down on the roof and damaged a few shingles."
        },
        {
            "id": 7,
            "phrase": "clunk something down†",
            "definition": "to drop or place something heavily on something so that it makes a clunking noise.  He clunked the big box down on the table.  He clunked down all his school books on the table."
        },
        {
            "id": 8,
            "phrase": "cluster around someone or something",
            "definition": "[for a group of people or things] to bunch together, surrounding someone or something.  The birds clustered around the chimney top to keep warm.  The kids clustered around the police officer."
        },
        {
            "id": 9,
            "phrase": "cluster someone or something around someone or something",
            "definition": "to bunch people or things together around someone or something.  She clustered the cups around the punch bowl.  Karen clustered the children around the fire."
        },
        {
            "id": 10,
            "phrase": "cluster together",
            "definition": "to bunch or group together. All of the bats clustered together on the roof of the cave.  The children clustered together in small groups here and there on the playground."
        },
        {
            "id": 11,
            "phrase": "clutch at someone or something",
            "definition": "to grasp at or grab for someone or something.  He clutched at the roots of the trees along the bank, but the f lood swept him away.  Karen clutched at me, but lost her grip."
        },
        {
            "id": 12,
            "phrase": "clutch at straws",
            "definition": "to continue to seek solutions, ideas, or hopes that are insubstantial.  When you talk of cashing in quick on your inventions, you are just clutching at straws.  That is not a real solution to the problem. You are just clutching at straws."
        },
        {
            "id": 13,
            "phrase": "clutch someone or something to something",
            "definition": "to grasp and hold someone or something to something.  She clutched the baby to her bosom.  Lee clutched the ice pack to his head."
        },
        {
            "id": 14,
            "phrase": "clutch (up)",
            "definition": "to become very tense and anxious; to freeze with anxiety.  I have been known to clutch before a big game.  Just relax, play your game, and you won’t clutch!"
        },
        {
            "id": 15,
            "phrase": "clutter something up†",
            "definition": "to mess something up; to fill something or some place up with too many things.  Heaps of newspapers cluttered the room up and made it a fire hazard.  Who cluttered up this house?"
        },
        {
            "id": 16,
            "phrase": "coach someone for something",
            "definition": "to train or drill someone in preparation for doing something.  Elliott coached his roommate every night for the contest. Juan coached Alice for the play."
        },
        {
            "id": 17,
            "phrase": "coalesce into something",
            "definition": "[for two or more things] to blend or fuse and become one thing.  The fading colors coalesced into a gray blur.  In the distance, the crowd coalesced into a single blob."
        },
        {
            "id": 18,
            "phrase": "coast along",
            "definition": "to roll or move along with little or no effort.  We just coasted along on the f lat prairie.  We coasted along until we came to the bottom of the hill."
        },
        {
            "id": 19,
            "phrase": "The coast is clear.",
            "definition": "There is no visible danger. I’m going to stay hidden here until the coast is clear.  You can come out of your hiding place now. The coast is clear."
        },
        {
            "id": 20,
            "phrase": "coast-to-coast",
            "definition": "from the Atlantic to the Pacific Oceans (in the continental U.S.A.); all the land between the Atlantic and Pacific Oceans (considered in either direction). My voice was once heard on a coast-to-coast radio broadcast. Our car made the coast-to-coast trip in eighty hours."
        },
        {
            "id": 21,
            "phrase": "coat and tie",
            "definition": "[for men] a jacket or sports coat and necktie. (A respectable but less than formal standard of dress.) _ My brother was not wearing a coat and tie, and they would not admit him into the restaurant.  I always carry a coat and tie in my car just in case I have to dress up a little for something."
        },
        {
            "id": 22,
            "phrase": "coat someone or something with something",
            "definition": "to put a layer of something on someone or something.  Her manager coated her with grease before she began the Channel swim.  The cook coated the chicken with batter and dropped it into the hot fat."
        },
        {
            "id": 23,
            "phrase": "coax someone or an animal in(to something)",
            "definition": "1. to urge or persuade someone or an animal to go into something.  We coaxed the lion into the cage with fresh meat.  The teacher coaxed the child into the kindergarten classroom. 2. to urge or persuade someone or an animal into doing something.  We coaxed her into singing for us.  Janet coaxed the dog into sitting up and begging."
        },
        {
            "id": 24,
            "phrase": "coax someone or an animal out of something",
            "definition": "1. to urge or persuade someone or an animal to give something up.  He almost wouldn’t sell it, but I coaxed him out of it.  I coaxed the cat out of the canary it was holding in its mouth. 2. to urge or persuade someone or an animal to come out of something.  She coaxed the puppy out of the carton.  Janet coaxed the child out of the closet with a promise of a piece of cake."
        },
        {
            "id": 25,
            "phrase": "coax someone to do something",
            "definition": "to urge someone to do something.  The kids coaxed her to let them go swimming.  Can I coax you to try some of this pie?"
        },
        {
            "id": 26,
            "phrase": "cock a snook at someone",
            "definition": "to show or express defiance or scorn at someone.  He cocked a snook at the traffic cop and tore up the ticket. The boy cocked a snook at the park attendant and walked on the grass."
        },
        {
            "id": 27,
            "phrase": "cock of the walk",
            "definition": "someone who acts more important than others in a group.  The deputy manager was cock of the walk until the new manager arrived. He loved acting cock of the walk and ordering everyone about."
        },
        {
            "id": 28,
            "phrase": "cock-and-bull story",
            "definition": "a hard-to-believe, made-up story; a story that is a lie.  Don’t give me that cock-and-bull story.  I asked for an explanation, and all I got was your ridiculous cock-and-bull story!"
        },
        {
            "id": 29,
            "phrase": "*cocky as the king of spades",
            "definition": "boastful; overly proud. (*Also: as ~.) _ He’d challenge anyone to a fight. He’s as cocky as the king of spades.  She strutted in, cocky as the king of spades."
        },
        {
            "id": 30,
            "phrase": "coerce someone or an animal into something",
            "definition": "to force or compel someone or an animal to do something. I could not coerce her into coming along with us.  You cannot coerce a cat into anything."
        },
        {
            "id": 31,
            "phrase": "coexist with someone or something",
            "definition": "to exist agreeably or tolerably with or at the same time as someone or something.  I decided that I would have to coexist with your policies, despite my objections.  It is hard for cats to coexist with dogs."
        },
        {
            "id": 32,
            "phrase": "coffee and",
            "definition": "coffee and a doughnut or a pastry.  I’ll have coffee and.  We stopped at a little shop for coffee and."
        },
        {
            "id": 33,
            "phrase": "coffee and Danish",
            "definition": "a cup of coffee and a Danish sweet roll.  A few of us like to have coffee and Danish before we start work.  Coffee and Danish is not my idea of a good breakfast!"
        },
        {
            "id": 34,
            "phrase": "coffee-table book",
            "definition": "a book that is more suitable for display than for reading, typically, an oversize, illustrated book left on the coffee table for visitors to examine.  This book is more of a coffee-table book than an art book. I prefer something more scholarly.  We purchased a coffeetable book for Jan’s birthday."
        },
        {
            "id": 35,
            "phrase": "cogitate on something",
            "definition": "Rur. to think about something.  Cogitate on this idea for a while.  I will have to cogitate on this for a few days. I’ll get back to you."
        },
        {
            "id": 36,
            "phrase": "cohabit with someone",
            "definition": "1. [for an unmarried person] to live with a person of the opposite sex. They were cohabiting with one another for several years. 2. Euph. to copulate with someone.  She had been cohabiting with him, and she admitted it in court."
        },
        {
            "id": 37,
            "phrase": "coil (itself ) around someone or something",
            "definition": "[for something or an animal] to wrap itself around someone or something.  The monkey’s tail coiled itself around the branch.  The huge python coiled around poor Roger."
        },
        {
            "id": 38,
            "phrase": "coil (itself ) up",
            "definition": "[for something] to wrap or roll itself into a coil. The snake coiled itself up, trying to hide. It coiled up, ready to strike."
        },
        {
            "id": 39,
            "phrase": "coil (itself ) up into something",
            "definition": "[for something] to wrap or twist itself into a particular shape.  The frightened snaked coiled itself up into a knot.  The spring coiled up into its original shape."
        },
        {
            "id": 40,
            "phrase": "coil something up†",
            "definition": "to roll or twist something into a coil.  Maria coiled the strip of stamps up and put them in the little dispenser.  Please coil up the rope."
        },
        {
            "id": 41,
            "phrase": "coin a phrase",
            "definition": "to create a new expression that is worthy of being remembered and repeated. (Often jocular.) _ He is “worth his weight in feathers,” to coin a phrase."
        },
        {
            "id": 42,
            "phrase": "coincide with something",
            "definition": "to agree with or match something; [for something] to happen at the same time as something else.  This pattern coincides with the pattern we see in the carpet.  My birthday sometimes coincides with Thanksgiving Day."
        },
        {
            "id": 43,
            "phrase": "coldcock someone",
            "definition": "to knock someone unconscious.  He hit him once and looks like he coldcocked him.  She coldcocked him with her walking stick."
        },
        {
            "id": 44,
            "phrase": "cold comfort",
            "definition": "no comfort or consolation at all.  She knows there are others worse off than her, but that’s cold comfort. It was cold comfort to the student that others had failed as he had done."
        },
        {
            "id": 45,
            "phrase": "*cold feet",
            "definition": "fear of doing something; cowardice at the moment of action. (*Typically: get ~; have ~; give someone ~.) _ The bridegroom got cold feet on the day of the wedding.  Sally said I should try skydiving, but I had cold feet."
        },
        {
            "id": 46,
            "phrase": "*a cold fish",
            "definition": "a person who is distant and unfeeling. (*Typically: act like ~; be ~.) _Bob is so dull—a real cold fish.  She hardly ever speaks to anyone. She’s a cold fish."
        },
        {
            "id": 47,
            "phrase": "Cold hands, warm heart.",
            "definition": "Prov. People whose hands are usually cold have kind and loving personalities. Nancy: I don’t like holding hands with Joe. His hands are so cold. Jane: Cold hands, warm heart."
        },
        {
            "id": 48,
            "phrase": "cold, hard cash",
            "definition": "cash, not checks or credit. I want to be paid in cold, hard cash, and I want to be paid now! _ Pay me now! Cash on the barrelhead—cold, hard cash."
        },
        {
            "id": 49,
            "phrase": "cold-shoulder",
            "definition": "to ignore someone; to give someone a cool reception.  The hostess cold-shouldered me, so I spilt my appetizers in the swimming pool. Tiffany cold-shouldered the guy who was trying to f lirt with her."
        },
        {
            "id": 50,
            "phrase": "*the cold shoulder",
            "definition": "an attitude of rejection. (*Typically: get ~; give someone ~.) _ If you greet her at a party, you’ll just get the cold shoulder. I thought that Sally and I were friends, but lately I’ve been getting the cold shoulder."
        },
        {
            "id": 51,
            "phrase": "cold turkey",
            "definition": "Sl. immediately; without tapering off or cutting down gradually.  Tom stopped smoking cold turkey.  She gave up her drinking habit cold turkey and had no ill effects."
        },
        {
            "id": 52,
            "phrase": "collaborate with someone or something",
            "definition": "to work together on something with someone or a group.  I will collaborate with Amy on this research.  I was forced to collaborate with a totally uninformed committee."
        },
        {
            "id": 53,
            "phrase": "collapse into something",
            "definition": "to fall down into something with suddenness, as if out of energy.  She was so tired, she collapsed into the chair.  Juan collapsed into a chair and fell fast asleep."
        },
        {
            "id": 54,
            "phrase": "collapse under someone or something",
            "definition": "to cave in under the weight of someone or something.  The grandstand collapsed under the weight of the spectators. The bridge collapsed from the force of the f lood."
        },
        {
            "id": 55,
            "phrase": "collar-and-tie men",
            "definition": "Rur. businessmen who wear dress shirts and ties. After Jim graduated from college, he went off to join the collar-and-tie men.  Us working folks at the plant have an awful time getting the collar-and-tie men to see our point of view."
        },
        {
            "id": 56,
            "phrase": "collate something with something",
            "definition": "to compare or match something with something.  Try to collate these figures with that other list. I can’t collate these notations with the spreadsheet they go with."
        },
        {
            "id": 57,
            "phrase": "collect around someone or something",
            "definition": "to gather around someone or something; to accumulate around someone or something.  The guests collected around the table that held the birthday cake. The children collected around the birthday boy."
        },
        {
            "id": 58,
            "phrase": "collect (money) for someone or something",
            "definition": "to solicit money for the benefit of someone or something.  I would like to collect some money for Fred, who is in the hospital.  I am collecting for the church building fund."
        },
        {
            "id": 59,
            "phrase": "collect (money) for something",
            "definition": "to solicit money that is owed.  I’m collecting money for payment on your loan.  Someone is calling to collect for the newspaper delivery."
        },
        {
            "id": 60,
            "phrase": "collect on something",
            "definition": "to take or receive payment on a debt or promise.  I have come to collect on your debt.  I will have to assign your account to an agency to collect on this bill."
        },
        {
            "id": 61,
            "phrase": "collect one’s thoughts",
            "definition": "to take time to think through an issue; to give some thought to a topic.  I’ll speak to the visitors in a moment. I need some time to collect my thoughts."
        },
        {
            "id": 62,
            "phrase": "collect something from someone",
            "definition": "1. to gather up something from someone; to gather money from someone.  I’m here to collect used clothing from you.  She is out collecting donations from the neighbors. 2. to take a medical specimen from a person.  I am here to collect a urine specimen from the patient.  The phlebotomist collected the specimen from Todd and left the room."
        },
        {
            "id": 63,
            "phrase": "collect something up†",
            "definition": "to gather something up.  Collect your things up, and let’s go.  I collected up all my luggage and left."
        },
        {
            "id": 64,
            "phrase": "collide with someone or something",
            "definition": "to crash with or bump into someone or something.  The bus collided with a truck.  Maria collided with Alice, but neither was hurt."
        },
        {
            "id": 65,
            "phrase": "collude with someone or something",
            "definition": "to plot or conspire with someone or a group.  The CEO colluded with the board of directors in the stock scandal."
        },
        {
            "id": 66,
            "phrase": "color something in†",
            "definition": "to paint or draw color on a pattern or outline.  Here is a sketch. Please color it in.  Color in the sketch, please."
        },
        {
            "id": 67,
            "phrase": "comb something for someone or something",
            "definition": "to look all over or all through something for a particular person or thing. The police combed the entire neighborhood for the criminals. I combed the entire house for the missing paper."
        },
        {
            "id": 68,
            "phrase": "comb through something",
            "definition": "to look through something, examining it thoroughly.  I combed through all my belongings, looking for the lost papers.  The vet combed through the dog’s coat, looking for tick bites."
        },
        {
            "id": 69,
            "phrase": "combine something against someone or something",
            "definition": "to join something together in opposition to someone or something. We will combine forces against the enemy.  Our game plan combined our various talents against the opposite team."
        },
        {
            "id": 70,
            "phrase": "combine something with something",
            "definition": "to mix something with something else.  I want to combine the red f lowers with the pink ones for a bouquet.  First, combine the eggs with the sugar."
        },
        {
            "id": 71,
            "phrase": "come a cropper",
            "definition": "to have a misfortune; to fail. (Meaning ‘fall off one’s horse.’) _ Bob invested all his money in the stock market just before it fell. Boy, did he come a cropper.  Jane was out all night before she took her final. She really came a cropper."
        },
        {
            "id": 72,
            "phrase": "come about",
            "definition": "1. to happen.  How did this damage come about? _ This came about due to the windstorm. 2. [for a ship or boat] to turn.  Look how easily this boat comes about.  Now, practice making the boat come about."
        },
        {
            "id": 73,
            "phrase": "come across",
            "definition": "1. to be compliant. Oh, she’ll come across, just you wait; she’ll do what we want. 2. to agree; to yield.  How can we get him to come across?"
        },
        {
            "id": 74,
            "phrase": "come across (to something)",
            "definition": "to agree to something; to yield to someone else’s position.  He came across to our point of view.  Will a sign-on bonus get him to come across?"
        },
        {
            "id": 75,
            "phrase": "come across (with something)",
            "definition": "to deliver what is expected of one.  You had better come across with what you owe me.  You owe me money, and I wish you would come across."
        },
        {
            "id": 76,
            "phrase": "Come again.",
            "definition": "1. Please come back again sometime.  Mary: I had a lovely time. Thank you for asking me. Sally: You’re quite welcome. Come again.  “Come again,” said Mrs. Martin as she let Jimmy out the door. 2. Rur. (usually"
        },
        {
            "id": 77,
            "phrase": "Come again?",
            "definition": ") I didn’t hear what you said. Please repeat it.  Sally: Do you want some more carrots? Mary: Come again? Sally: Carrots. Do you want some more carrots?"
        },
        {
            "id": 78,
            "phrase": "come along (with someone)",
            "definition": "to come with or go with someone.  Please come along with me to the store.  Come along, let’s go."
        },
        {
            "id": 79,
            "phrase": "come apart",
            "definition": "to break apart; to break up.  The missile came apart in midair.  I was afraid our car would come apart on that rough road."
        },
        {
            "id": 80,
            "phrase": "come (a)round",
            "definition": "1. finally to agree or consent (to something). I thought he’d never agree, but in the end he came around. She came round only after we argued for an hour. 2. to return to consciousness; to wake up.  He came around after we threw cold water in his face.  The boxer was knocked out, but came round in a few seconds."
        },
        {
            "id": 81,
            "phrase": "come around (to doing something)",
            "definition": "to agree to do something eventually, after a long wait.  Finally, she came around to painting the kitchen.  She hesitated for a long time, but eventually we got Lynn to come around."
        },
        {
            "id": 82,
            "phrase": "come as no surprise",
            "definition": "will not be surprising [for someone] to learn [something]. It will come as no surprise for you to learn that the company is losing money this year.  It came as no surprise that the president had been lying."
        },
        {
            "id": 83,
            "phrase": "come at someone or something",
            "definition": "1. to make a threatening move toward someone or something.  The gorilla came at the cage and shook the bars.  Walter came at the cake as if he were going to snatch the whole thing. 2. to attack someone or something.  The elephant came at us and we moved away. The cat came at the mouse and pounced on it."
        },
        {
            "id": 84,
            "phrase": "come away empty-handed",
            "definition": "to return without anything.  All right, go gambling. Don’t come away empty-handed, though.  Go to the bank and ask for the loan again. This time don’t come away empty-handed."
        },
        {
            "id": 85,
            "phrase": "come away (from someone or something)",
            "definition": "to move away from someone or something. Please come away from the fire. You will get burned if you don’t.  Come away! You can walk with me for a while."
        },
        {
            "id": 86,
            "phrase": "come away with someone",
            "definition": "to go away or travel away with someone.  Come away with me for a ride in the country.  Come away with me and we’ll find a nice place to eat."
        },
        {
            "id": 87,
            "phrase": "come back",
            "definition": "to return; to return to an advantageous or favorable state or condition. Walter practiced every day, hoping to come back from his injury. When will the good old days come back?"
        },
        {
            "id": 88,
            "phrase": "Come back anytime.",
            "definition": "Please come and visit us again. You’re always welcome. (Often said by a host or hostess to departing guests.) _ Mary: So glad you could come. Bill: Thank you. I had a wonderful time. Mary: Come back anytime.  Bob: Thanks for the coffee and cake. Bye. Mary: We’re glad to have you. Please come back anytime."
        },
        {
            "id": 89,
            "phrase": "come back (from some place)",
            "definition": "to return from a place.  When will you come back from Detroit? _Please come back soon."
        },
        {
            "id": 90,
            "phrase": "come back (to someone)",
            "definition": "[for a memory] to return to someone’s consciousness.  Everything you said suddenly came back to me.  All the old memories came back to me and made me feel very sad."
        },
        {
            "id": 91,
            "phrase": "come back (to someone or something)",
            "definition": "to return to someone or something.  Please come back to me. I’m lonely.  Come back to your home!"
        },
        {
            "id": 92,
            "phrase": "Come back when you can stay longer.",
            "definition": "Come back again sometime when your visit can be longer. (Often said by a host or hostess to departing guests.) _ John: I really must go. Sue: So glad you could come. Please come back when you can stay longer. Bill: Well, I hate to eat and run, but I have to get up early tomorrow. Mary: Well, come back when you can stay longer."
        },
        {
            "id": 93,
            "phrase": "come before someone or something",
            "definition": "1. [of persons or things in an order or a line] to be in front of or in advance of someone or something.  This one comes before that one.  She comes before me. 2. [for one] to present oneself in the presence of someone or a group.  Thank you for coming before this committee with your testimony.  The judge said I would have to come before her again next month. 3. [for an issue] to be raised before someone, a board, committee, etc.; [for an issue] to appear on the agenda of someone or a deliberative body.  The matter of the broken windows came before the school board at last.  The question came before the business manager."
        },
        {
            "id": 94,
            "phrase": "come between someone and someone else",
            "definition": "to be in between two people.  That’s my place, there. I come between Maria and Lynn.  In the line of contestants, I come between Bob and Bill."
        },
        {
            "id": 95,
            "phrase": "come between something and something else",
            "definition": "to have a position between one thing and another.  April comes between March and May.  This volume comes between numbers fourteen and sixteen."
        },
        {
            "id": 96,
            "phrase": "come by (some place)",
            "definition": "to stop some place for a visit. Can you come by our place for a few minutes on the way home? _ Please come by sometime."
        },
        {
            "id": 97,
            "phrase": "come by something",
            "definition": "to travel by a specific means, such as a plane, a boat, or a car.  We came by train. It’s more relaxing. Next time, we’ll come by plane. It’s faster."
        },
        {
            "id": 98,
            "phrase": "come by something honestly",
            "definition": "1. Fig. to get something honestly.  Don’t worry. I came by this Swiss watch honestly.  I have a feeling she didn’t come by it honestly. 2. Fig. to inherit something— such as a character trait—from one’s parents.  I know I’m mean. I came by it honestly, though. She came by her kindness honestly."
        },
        {
            "id": 99,
            "phrase": "come clean (with someone) (about something)",
            "definition": "to be honest with somebody about something. I want you to come clean with me about your financial status.  Sam will come clean with me. I know he will."
        },
        {
            "id": 100,
            "phrase": "come close (to someone or something)",
            "definition": "to approach very near to someone or something.  Come close to me and keep me warm.  I didn’t touch it, but I really came close that time."
        },
        {
            "id": 101,
            "phrase": "come down",
            "definition": "1. Sl. to happen.  Hey, man! What’s coming down? _ When something like this comes down, I have to stop and think things over. 2. a letdown; a disappointment. (Usually comedown.) _ The loss of the race was a real comedown for Willard.  It’s hard to face a comedown like that. 3. Sl. to begin to recover from the effects of alcohol or drug intoxication.  She came down slow from her addiction, which was good.  It was hard to get her to come down. 4. [for something] to descend (to someone) through inheritance. All my silverware came down to me from my great-grandmother.  The antique furniture came down through my mother’s family."
        },
        {
            "id": 102,
            "phrase": "come down (from something)",
            "definition": "1. to come to a lower point from a higher one.  Come down from there this instant! _Come down, do you hear? 2. to move from a higher status to a lower one.  He has come down from his original position. Now he is just a clerk.  He has come down quite a bit."
        },
        {
            "id": 103,
            "phrase": "come down (hard) (on someone or something)",
            "definition": "[for someone] to scold or punish someone or a group severely.  The judge really came down on the petty crooks.  The critics came down much too hard on the performance."
        },
        {
            "id": 104,
            "phrase": "come down in the world",
            "definition": "to lose one’s social position or financial standing.  Mr. Jones has really come down in the world since he lost his job.  If I were unemployed, I’m sure I’d come down in the world, too."
        },
        {
            "id": 105,
            "phrase": "come down to earth",
            "definition": "to arrive on earth from above.  An angel came down to earth and made an announcement."
        },
        {
            "id": 106,
            "phrase": "come down to some place",
            "definition": "to come to some place in the south or in a lower altitude for a visit. (Assumes a perspective of a visitor from a northern state of the U.S.) _ Come down to our place in Florida this winter if you want."
        },
        {
            "id": 107,
            "phrase": "come down to something",
            "definition": "to be reduced to something; to amount to no more than something.  It comes down to whether you want to go to the movies or stay at home and watch television.  It came down to either getting a job or going to college."
        },
        {
            "id": 108,
            "phrase": "come down with something",
            "definition": "to become or to be sick with some illness. Susan came down with a bad cold and had to cancel her trip. I didn’t go to work because I came down with the f lu."
        },
        {
            "id": 109,
            "phrase": "come for someone",
            "definition": "to arrive to get someone. I have come for Amy. Is she ready? _ The mothers came for their children at about five o’clock."
        },
        {
            "id": 110,
            "phrase": "come forth",
            "definition": "to come out; to move forward and appear.  Please come forth and meet your cousins.  All the stage crew came forth and received some applause."
        },
        {
            "id": 111,
            "phrase": "come forward",
            "definition": "to move oneself forward.  Come forward and stand before the whole class."
        },
        {
            "id": 112,
            "phrase": "come forward (with something)",
            "definition": "to bring something, such as information, to someone’s attention.  Colleen came forward with a new idea. I hope you each can come forward with something useful."
        },
        {
            "id": 113,
            "phrase": "come from behind",
            "definition": "to advance from a losing position. (Alludes to being behind in a score or in a race.) _ Our team came from behind to win the game.  The horse I bet on came from behind and almost placed second."
        },
        {
            "id": 114,
            "phrase": "come from far and wide",
            "definition": "to arrive from everywhere; to arrive from many directions and great distances.  People came from far and wide to attend the annual meeting. The deer came from far and wide to lick the salt block we had put out."
        },
        {
            "id": 115,
            "phrase": "come from nowhere",
            "definition": "to come as a surprise with no warning.  The dogs came from nowhere and attacked my cat. The whole set of problems came from nowhere. There was no way we could have foreseen them."
        },
        {
            "id": 116,
            "phrase": "come from someone or something",
            "definition": "to arrive from someone or something; [for something] to have originated with someone or something.  Did this letter come from Alice? _ A notice came from the Internal Revenue Service."
        },
        {
            "id": 117,
            "phrase": "come full circle",
            "definition": "to return to the original position or state of affairs. The family sold the house generations ago, but things have come full circle and one of their descendants lives there now."
        },
        {
            "id": 118,
            "phrase": "come hell or high water",
            "definition": "no matter what happens. (Use hell with caution.) _I’ll be there tomorrow, come hell or high water.  Come hell or high water, I intend to own my own home."
        },
        {
            "id": 119,
            "phrase": "come home from some place",
            "definition": "to arrive home from another place.  The soldiers came home from the war.  When will you come home from the office?"
        },
        {
            "id": 120,
            "phrase": "come home (to roost)",
            "definition": "[for a fowl or other bird] to return to its home, as for a night’s rest.  The chickens come home to roost in the evening."
        },
        {
            "id": 121,
            "phrase": "come home to someone",
            "definition": "[for a fact] to be recognized suddenly by someone. Suddenly, it came home to me that you thought I was Ronald.  The importance of the events of the day finally came home to me."
        },
        {
            "id": 122,
            "phrase": "come home to someone or something",
            "definition": "to arrive home and find someone or something there.  I like to come home to a happy house.  I look forward to coming home to you."
        },
        {
            "id": 123,
            "phrase": "Come in and make yourself at home.",
            "definition": "Please come into my home and make yourself comfortable. Sue: Oh, hello, Tom. Come in and make yourself at home. Tom: Thanks. I will."
        },
        {
            "id": 124,
            "phrase": "come in for something",
            "definition": "to be eligible for something; to be due something.  You are going to come in for a nice reward.  Your report came in for a lot of criticism at the last board meeting."
        },
        {
            "id": 125,
            "phrase": "come in handy",
            "definition": "[for something] to be useful.  I think that this gadget will come in handy in the kitchen."
        },
        {
            "id": 126,
            "phrase": "come in out of the rain",
            "definition": "to seek shelter from the rain.  Come in out of the rain! You’ll get wet."
        },
        {
            "id": 127,
            "phrase": "come in useful",
            "definition": "to be useful.  Your report has come in useful a number of times."
        },
        {
            "id": 128,
            "phrase": "come into being",
            "definition": "to begin existence.  This idea came into being during the last decade.  When did this organization come into being?"
        },
        {
            "id": 129,
            "phrase": "come into conflict",
            "definition": "[for things or people] to conflict or to be at odds with one another. The various policies came into conf lict at the last moment.  Bill and Bob came into conf lict over almost everything."
        },
        {
            "id": 130,
            "phrase": "come in(to) contact (with someone or something)",
            "definition": "to touch someone or something, probably unknowingly.  How many people have come into contact with the sick man? _ He came in contact with almost no one."
        },
        {
            "id": 131,
            "phrase": "come into effect",
            "definition": "to become valid, effective, or operable. When did these rules come into effect? _They came into effect while you were on vacation."
        },
        {
            "id": 132,
            "phrase": "come into existence",
            "definition": "to begin existence; to begin to be.  This country came into existence in the early part of the fifteenth century.  When did this little town come into existence?"
        },
        {
            "id": 133,
            "phrase": "come into fashion",
            "definition": "to become stylish or fashionable.  Do you think that a design like this will ever come into fashion? _ That kind of dance will never come into fashion."
        },
        {
            "id": 134,
            "phrase": "come into one’s or its own",
            "definition": "to become independent; to be recognized as independent and capable, usually after much effort or time.  Maria is coming into her own as a concert pianist."
        },
        {
            "id": 135,
            "phrase": "come into play",
            "definition": "to become an important factor in something; to go into force. All your hard practice and preparation will now come into play in the finals."
        },
        {
            "id": 136,
            "phrase": "come into prominence",
            "definition": "to become notable; to become renowned. She first came into prominence during the late forties, when she starred in a few movies. Wally came into prominence when he won the state championship."
        },
        {
            "id": 137,
            "phrase": "come into season",
            "definition": "[for a game animal] to be subject to legal hunting. When do ducks come into season around here? _ Deer came into season just yesterday. "
        },
        {
            "id": 138,
            "phrase": "come into service",
            "definition": "to begin to be used; to begin to operate and function as designed.  When did this elevator come into service? _ I think that this machine came into service during World War II."
        },
        {
            "id": 139,
            "phrase": "come into the world",
            "definition": "to be born.  I came into this world nearly seventy years ago.  Little Timmy came into the world on a cold and snowy night."
        },
        {
            "id": 140,
            "phrase": "come Monday",
            "definition": "Rur. when Monday comes. (Can be used with other expressions for time, as in come next week, come December, come five o’clock. See the second example.) _ Joe plays so hard on the weekend that come Monday, he’s all worn out.  You may think that putting up storm windows is a bother, but come December, you’ll be glad you did it."
        },
        {
            "id": 141,
            "phrase": "come naturally (to someone)",
            "definition": "to be natural and easy for someone.  Her ability to deal easily with people comes naturally to her."
        },
        {
            "id": 142,
            "phrase": "come off",
            "definition": "Inf. to happen; to take place.  What time does this party come off ? _ How did your speech come off ? _ It came off very well."
        },
        {
            "id": 143,
            "phrase": "Come off it!",
            "definition": "1. Inf. Stop acting arrogantly! ) _ Come off it, Tiff. You’re not the Queen of England. 2. Inf. Give up your incorrect point of view! _ Come off it! You’re wrong, and you know it!"
        },
        {
            "id": 144,
            "phrase": "come off second best",
            "definition": "to be second to someone or something; to get the poorer end of a bargain. As usual, he came off second best with a little less prize money than the winner.  I don’t want to come off second best again."
        },
        {
            "id": 145,
            "phrase": "come on as something",
            "definition": "to appear to be something; to project one’s image as something.  The senator comes on as a liberal, but we all know better. He comes on as a happy guy, but he is miserable."
        },
        {
            "id": 146,
            "phrase": "Come on in, the water’s fine!",
            "definition": "Get into the water and swim! (Usually a polite command.) _ As Todd swam along, he said to Rachel, “Come on in. The water’s fine.”"
        },
        {
            "id": 147,
            "phrase": "come out",
            "definition": "to exit; to leave the inside of a place.  Please come out. We have to leave.  When do you think they will all come out?"
        },
        {
            "id": 148,
            "phrase": "come out against someone or something",
            "definition": "to announce or reveal that one is opposed to someone or something.  Our governor came out against the new tax bill."
        },
        {
            "id": 149,
            "phrase": "come out ahead",
            "definition": "to end up with a profit, benefit, or advantage.  It was a tricky deal, and no one came out ahead of anyone else.  I never come out ahead after paying my bills."
        },
        {
            "id": 150,
            "phrase": "come out badly",
            "definition": "[for efforts at something] to have a bad result. I hope trying to get back together with Joan doesn’t come out badly."
        },
        {
            "id": 151,
            "phrase": "come out in something",
            "definition": "to come outside wearing something in particular.  You shouldn’t come out in that skimpy jacket. I didn’t mean to come out in my pajamas. I just wanted to get the newspaper."
        },
        {
            "id": 152,
            "phrase": "come out in the wash",
            "definition": "to work out all right. (Alludes to a clothing stain that can be removed by washing.) _ Don’t worry about that problem. It’ll all come out in the wash. This trouble will go away. It’ll come out in the wash."
        },
        {
            "id": 153,
            "phrase": "come out in(to) the open with something",
            "definition": "to make something known publicly.  The auditors came out into the open with the story of the bankruptcy. After much fuss about its secret dealings, the city council came out in the open with the whole story."
        },
        {
            "id": 154,
            "phrase": "come out of left field",
            "definition": "[for a problem or dilemma] to come from an unexpected place.  This new problem came out of left field. We were really surprised.  Your remarks came out of left field. I can’t understand your complaint."
        },
        {
            "id": 155,
            "phrase": "come out of one’s shell",
            "definition": "to become more friendly; to be more sociable. (Alludes to a shy turtle putting its head out of its shell.) _ Come out of your shell, Tom. Go out and make some friends."
        },
        {
            "id": 156,
            "phrase": "come out (of someone or something)",
            "definition": "to emerge from someone or something. Did that pile of books really come out of just one office? _ The lion came out of its den."
        },
        {
            "id": 157,
            "phrase": "come out (of ) the little end of the horn",
            "definition": "Rur. to lose a great deal; to end with less than one started with.  After the stock market crash, plenty of folks came out the little end of the horn."
        },
        {
            "id": 158,
            "phrase": "come out on something",
            "definition": "[for someone] to do well or poorly on a business venture.  How did you come out on the Adams project? _ We came out ahead on the Adams project, but for the quarter we came out with a loss overall."
        },
        {
            "id": 159,
            "phrase": "come out on top",
            "definition": "to end up being the winner.  I knew that if I kept trying, I would come out on top. Harry came out on top as I knew he would."
        },
        {
            "id": 160,
            "phrase": "come out smelling like a rose",
            "definition": "to succeed; to do better than anyone else in some situation. Everyone else in the firm lost money in the real estate deal, but Bob came out smelling like a rose.  If I can just finish my research paper on time, I’ll come out smelling like a rose by the end of the school year."
        },
        {
            "id": 161,
            "phrase": "come out to be",
            "definition": "to end up being a certain way. I do not know what this sculpture will come out to be. When I start writing a poem, I never know what it will come out to be."
        },
        {
            "id": 162,
            "phrase": "come out well",
            "definition": "to end up well.  I hope things come out well.  Everything will come out well in the end."
        },
        {
            "id": 163,
            "phrase": "come out with something",
            "definition": "1. to publish something.  When are you going to come out with a new edition? _The publisher decided not to come out with the book. 2. to express or utter something.  He came out with a strong dissenting opinion.  It was over an hour before the president came out with an explanation."
        },
        {
            "id": 164,
            "phrase": "come over",
            "definition": "1. to join this party or side; to change sides or affiliation. Tom was formerly an enemy spy, but last year he came over. I thought that Bill was a Republican. When did he come over? 2. to come for a visit. See if Ann wants to come over.  I can’t come over to visit now. I’m busy."
        },
        {
            "id": 165,
            "phrase": "come over someone",
            "definition": "[for something] to affect a person, perhaps suddenly. I just don’t know what came over me. Something came over her just as she entered the room."
        },
        {
            "id": 166,
            "phrase": "come over someone or something",
            "definition": "to move over and above someone or something.  A cloud came over us and rained like fury.  Darkness came over the city and streetlights blinked on."
        },
        {
            "id": 167,
            "phrase": "Come right in.",
            "definition": "Come in, please, you are very welcome here. Fred (opening door): Well, hi, Bill. Bill: Hello, Fred. Good to see you. Fred: Come right in. Bill: Thanks."
        },
        {
            "id": 168,
            "phrase": "come (right) on top of something",
            "definition": "[for something] to happen immediately after something else.  The accident expenses came right on top of the costs of her illness.  The bad news came on top of some other problems we were having."
        },
        {
            "id": 169,
            "phrase": "come short of something",
            "definition": "to do something almost; to fail to achieve something completely. The workers came short of finishing the job on time.  We came short of our goal for the year."
        },
        {
            "id": 170,
            "phrase": "come someone’s way",
            "definition": "[for something] to come to someone.  I wish a large sum of money would come my way.  I hope that no bad luck comes my way."
        },
        {
            "id": 171,
            "phrase": "come through",
            "definition": "1. [for someone] to do what one is expected to do, especially under difficult conditions.  You can depend on Jane. She’ll always come through. Tom came through at the last minute with everything we needed. 2. [for something] to be approved; [for something] to gain approval. Our mortgage loan approval finally came through! _Your papers came through, and you can be sure that the matter has been taken care of.   "
        },
        {
            "id": 172,
            "phrase": "come through (for someone or something)",
            "definition": "to produce or perform as promised for someone or a group.  You knew I would come through for you, didn’t you? _The team came through for its loyal fans again."
        },
        {
            "id": 173,
            "phrase": "come through something (with flying colors)",
            "definition": "to survive something quite well.  Todd came through the test with f lying colors.  Mr. Franklin came through the operation with f lying colors."
        },
        {
            "id": 174,
            "phrase": "come through (with something)",
            "definition": "to produce or deliver something as promised. Finally, Bob came through with the money he had promised.  I knew he would come through."
        },
        {
            "id": 175,
            "phrase": "come to a bad end",
            "definition": "to have a disaster, perhaps one that is deserved or expected; to die an unfortunate death. My old car came to a bad end. Its engine seized up. The dishonest merchant came to a bad end."
        },
        {
            "id": 176,
            "phrase": "come to a boil",
            "definition": "[for a liquid] to reach the boiling point.  The soup came to a boil and the chef reduced the f lame."
        },
        {
            "id": 177,
            "phrase": "come to a conclusion",
            "definition": "1. to reach a decision.  We talked for a long time but never came to any conclusion.  Can we come to a conclusion today, or do we have to meet again? 2. [for a process] to reach the end and be finished.  At last, the yearlong ordeal of buying a house came to a conclusion. I was afraid that the opera would never come to a conclusion."
        },
        {
            "id": 178,
            "phrase": "come to a halt",
            "definition": "to stop; to slow down and stop.  Slowly, the train came to a halt. After the bus came to a halt, more people got on."
        },
        {
            "id": 179,
            "phrase": "come to a head",
            "definition": "[for a problem] to reach a critical or crucial stage. At the end of the week, everything came to a head and Sam was fired."
        },
        {
            "id": 180,
            "phrase": "come to a pretty pass",
            "definition": "to encounter a difficult situation. (This pretty expresses irony.) _ This project has come to a pretty pass. I don’t know how we can possibly finish on time.  Mary had come to a pretty pass. She quit her job to be with her husband, and then he left her."
        },
        {
            "id": 181,
            "phrase": "come to a standstill",
            "definition": "[for something] to slow down and finally stop; to stop completely. (Usually refers to something that is progressing, such as work, traffic, negotiations.) _ As the strike began, the production line came to a standstill.  At the height of rush hour, traffic comes to a standstill."
        },
        {
            "id": 182,
            "phrase": "come to a stop",
            "definition": "[for someone or something] to stop moving or happening.  The bus finally came to a stop so I could get off.  The dog’s barking finally came to a stop."
        },
        {
            "id": 183,
            "phrase": "come to an impasse",
            "definition": "to reach a deadlock, stalemate, etc., in a situation. (Alludes to a blocked roadway.) _The committee has come to an impasse in its deliberations."
        },
        {
            "id": 184,
            "phrase": "come to an untimely end",
            "definition": "to come to an early death.  Poor Mr. Jones came to an untimely end in a car accident.  Cancer caused Mrs. Smith to come to an untimely end."
        },
        {
            "id": 185,
            "phrase": "come to attention",
            "definition": "to assume a formal military posture, standing very straight.  Almost immediately, the soldiers came to attention."
        },
        {
            "id": 186,
            "phrase": "come to fruition",
            "definition": "to occur or turn out as suspected or intended.  When will all of these good things come to fruition? _Our hard work and the end we planned for will soon come to fruition."
        },
        {
            "id": 187,
            "phrase": "come to grief",
            "definition": "to experience something unpleasant or damaging.  In the end, he came to grief because he did not follow instructions."
        },
        {
            "id": 188,
            "phrase": "come to grips with someone or something",
            "definition": "to begin to deal with someone or something difficult or challenging in a sensible way. We must all come to grips with this tragedy. I cannot come to grips with Ed and his problems."
        },
        {
            "id": 189,
            "phrase": "come to harm",
            "definition": "to experience something bad; to get damaged or harmed.  I sincerely hope that you do not come to harm.  I hope no one comes to harm."
        },
        {
            "id": 190,
            "phrase": "come to life",
            "definition": "to act as if alive after a period of seeming not to be alive. As the anesthetic wore off, the patient came to life.  After CPR, the child came to life."
        },
        {
            "id": 191,
            "phrase": "come to light",
            "definition": "[for something] to become known or to be discovered. Many surprises have come to light since then.  Nothing new has come to light since we talked last."
        },
        {
            "id": 192,
            "phrase": "come to mind",
            "definition": "[for a thought or idea] to enter into one’s consciousness or be remembered.  Do I know a good barber? No one comes to mind right now.  Another idea comes to mind. Why not check in the phone book?"
        },
        {
            "id": 193,
            "phrase": "come to much",
            "definition": "1. to amount to a large amount of money. (Usually used with a negative.) _ The bill did not come to much, considering what we had for dinner and drinks. 2. to count for much; to be important or meaningful. (Usually negative.) _No one thought he would come to much. All that discussion did not come to much."
        },
        {
            "id": 194,
            "phrase": "come to no good",
            "definition": "to end up badly; to come to a bad end.  The street gang leaders came to no good in the end."
        },
        {
            "id": 195,
            "phrase": "come to one’s feet",
            "definition": "to stand up.  The audience came to its feet, cheering.  Fred came to his feet to greet Roger."
        },
        {
            "id": 196,
            "phrase": "come to one’s senses",
            "definition": "to begin thinking sensibly.  I’m glad he finally came to his senses and went on to college.  I wish you would come to your senses and look for a better job."
        },
        {
            "id": 197,
            "phrase": "come to pass",
            "definition": "to happen; to take place.  And when do you think all these good things will come to pass? _ Do you think it will really come to pass?"
        },
        {
            "id": 198,
            "phrase": "come to rest",
            "definition": "to stop; to slow down and stop.  The ball rolled and rolled and finally came to rest.  Where did the ball come to rest?"
        },
        {
            "id": 199,
            "phrase": "come to someone’s assistance",
            "definition": "to arrive and provide assistance to someone. A kindly truck driver came to our assistance, and we were able to call for help. I hope someone will come to my assistance soon."
        },
        {
            "id": 200,
            "phrase": "come to someone’s or something’s rescue",
            "definition": "to rescue or save someone or something. The paramedics came to our rescue at once.  A big donor came to the college’s rescue."
        },
        {
            "id": 201,
            "phrase": "come to terms (with someone or something)",
            "definition": "1. to come to an agreement with someone.  I finally came to terms with my lawyer about his fee.  Bob, you have to come to terms with your father. 2. to learn to accept someone or something. She had to come to terms with the loss of her sight. She couldn’t come to terms with her estranged husband."
        },
        {
            "id": 202,
            "phrase": "come to the fore",
            "definition": "to become prominent; to become important.  The question of salary has now come to the fore. Since his great successes as a prosecutor, he has really come to the fore in city politics."
        },
        {
            "id": 203,
            "phrase": "come to think of it",
            "definition": "I just remembered.  Come to think of it, I know someone who can help.  I have a screwdriver in the trunk of my car, come to think of it."
        },
        {
            "id": 204,
            "phrase": "come to this",
            "definition": "to result in this situation. (Usually said out of surprise.) _ Who would believe it would come to this? _ So, it has come to this?"
        },
        {
            "id": 205,
            "phrase": "come together",
            "definition": "1. to touch together; to meet. The ends of the boards just came together. They were almost too short. We came together in the park, just as we had agreed. 2. to attend something together; to arrive at an event together.  Alice and I are going to come together.  We will come to the party together."
        },
        {
            "id": 206,
            "phrase": "come together (on something)",
            "definition": "to discuss and agree on something.  I hope we can come together on a price.  I’m sure we can come together."
        },
        {
            "id": 207,
            "phrase": "come true",
            "definition": "to materialize as expected or hoped.  Jane’s wishes had come true.  Dave wondered if his dreams would ever come true."
        },
        {
            "id": 208,
            "phrase": "come under something",
            "definition": "to be classed in the category of something.  This request comes under the category of a plain nuisance.  Your proposal comes under the heading of new business and is out of order."
        },
        {
            "id": 209,
            "phrase": "come unglued",
            "definition": "to lose emotional control; to break out into tears or laughter.  When Sally heard the joke, she almost came unglued. When the bank took away my car, I came unglued and cried and cried."
        },
        {
            "id": 210,
            "phrase": "come up",
            "definition": "to come from a lower place to a higher one.  You can come up now. They are gone.  Come up and enjoy the view from the tallest rooftop in the county."
        },
        {
            "id": 211,
            "phrase": "come up a storm",
            "definition": "Rur. to become stormy.  It came up a storm as I was on my way home, and I got soaked to the skin."
        },
        {
            "id": 212,
            "phrase": "come up for air",
            "definition": "to lift one’s head out of the water to breathe. After staying under water for almost a minute, Jason had to come up for air."
        },
        {
            "id": 213,
            "phrase": "come up for something",
            "definition": "to be eligible for something; to be in line or sequence for something.  She comes up for reelection in April.  How soon does your driver’s license come up for renewal?"
        },
        {
            "id": 214,
            "phrase": "come (up) from behind",
            "definition": "to advance in competition; to improve one’s position relative to the positions of other things or people.  The horse was working hard to come up from behind.  Lee was losing in the election, but he began to come from behind in the last week."
        },
        {
            "id": 215,
            "phrase": "come up through the ranks",
            "definition": "to rise to a position of leadership by working up through the sequence of lower positions. He came up through the ranks to become a corporate executive. The general came up through the ranks. There is no other way to become a general."
        },
        {
            "id": 216,
            "phrase": "come up to someone’s expectations",
            "definition": "to be as good as someone expected. Sorry, but this product does not come up to my expectations and I want to return it."
        },
        {
            "id": 217,
            "phrase": "come up to someone’s standards",
            "definition": "to meet or be equal to someone’s standards or requirements.  Does this ice cream come up to your standards? _ Ann’s concert recital did not come up to her own standards."
        },
        {
            "id": 218,
            "phrase": "come up with someone or something",
            "definition": "to find or supply someone or something; to manage to find or improvise something.  I came up with a date at the last minute.  My mom is always able to come up with some yummy snack for me in the afternoon."
        },
        {
            "id": 219,
            "phrase": "come what may",
            "definition": "Cliché no matter what might happen.  I’ll be home for the holidays, come what may.  Come what may, the mail will get delivered."
        },
        {
            "id": 220,
            "phrase": "come with (someone or something)",
            "definition": "to depart in the company of someone or something; to travel with someone or a group.  Come with me. We’ll go to my place.  Are you going to come with the tour? _Are you going to come with?"
        },
        {
            "id": 221,
            "phrase": "come within an ace of something",
            "definition": "to come very close to [doing] something.  I came within an ace of leaving school. I’m glad you talked me out of it.  Donna came within an ace of having an accident."
        },
        {
            "id": 222,
            "phrase": "come within an inch of doing something",
            "definition": "almost to do something; to come very close to doing something.  I came within an inch of going into the army.  I came within an inch of falling off the roof."
        },
        {
            "id": 223,
            "phrase": "come within something",
            "definition": "1. to be in the category of something; to be under the domain of someone or something.  This comes within the domain of the treasurer.  This matter doesn’t come within my area of expertise. 2. to be inside a stated range, such as price, time, weight, range, etc.  This comes within my price range. I’ll take it."
        },
        {
            "id": 224,
            "phrase": "come-hither look",
            "definition": "an alluring or seductive look or glance, usually done by a woman. She blinked her bedroom eyes and gave him a come-hither look.  She had mastered the come-hither look, but was not ready for the next part."
        },
        {
            "id": 225,
            "phrase": "*comfortable as an old shoe",
            "definition": "Cliché very comfortable; very comforting and familiar. (*Also: as ~.) _ My old house may seem small to you, but I think it’s cozy. It’s as comfortable as an old shoe."
        },
        {
            "id": 226,
            "phrase": "Coming events cast their shadows before.",
            "definition": "Prov. Significant events are often preceded by signs that they are about to happen. (From Thomas Campbell’s poem, “Lochiel’s Warning.”) _ If you pay attention to the news, you can generally tell when something momentous is about to happen. Coming events cast their shadows before."
        },
        {
            "id": 227,
            "phrase": "coming out of one’s ears",
            "definition": "very numerous or abundant. (As if people or things were coming in great numbers from many sources including unlikely ones.) _ I’ve got phone and e-mail messages coming out of my ears.  We are very busy at the factory. We have orders coming out of our ears."
        },
        {
            "id": 228,
            "phrase": "Coming through(, please).",
            "definition": "Please let me pass through. (Often said by someone trying to get through a crowd of people, as in a passageway or an elevator. Compare this with Out, please.) _ Tom: Coming through, please. Sue: Give him some room. He wants to get by.  Mary (as the elevator stops): Well, this is my f loor. Coming through, please. I’ve got to get off."
        },
        {
            "id": 229,
            "phrase": "coming up a cloud",
            "definition": "Rur. getting ready to rain.  Look at that sky! It’s comin’ up a cloud!"
        },
        {
            "id": 230,
            "phrase": "commence with someone or something",
            "definition": "to start a procedure affecting a number of people or things by choosing a particular person or thing first.  Each meeting commences with a reading of the minutes of the last meeting.  The doctor interviews with Lynn and took everyone else in the order in which they had arrived."
        },
        {
            "id": 231,
            "phrase": "commend someone for something",
            "definition": "to praise someone for doing something. The committee commended Ralph for his good work."
        },
        {
            "id": 232,
            "phrase": "commend someone or something to someone or something",
            "definition": "to recommend or speak well of someone to someone or a group. I commend Walter to your organization. He would make a fine employee. We commended your organization to Martha, who may wish to become a member."
        },
        {
            "id": 233,
            "phrase": "commiserate with someone",
            "definition": "to share one’s misery with another person who is also miserable.  I stopped by Bruce’s house to commiserate with him on being laid off."
        },
        {
            "id": 234,
            "phrase": "commit oneself on something",
            "definition": "to agree to something; to promise or pledge to do something. I’m sorry, but I can’t commit myself on this matter until I know more details."
        },
        {
            "id": 235,
            "phrase": "commit oneself to someone or something",
            "definition": "to devote oneself to someone or something; to be faithful to someone or something. He committed himself to his wife. She settled down and committed herself to her job."
        },
        {
            "id": 236,
            "phrase": "commit oneself to something",
            "definition": "1. to agree to something; to promise or pledge to do something.  Yes, I will commit myself to the repair of the door frame.  Will you commit yourself to finishing on time? 2. to promise to support and assist something.  I can’t commit myself to your cause at the present time. Maybe next month when I am less busy.  She committed herself to being there on time."
        },
        {
            "id": 237,
            "phrase": "commit someone or something for something",
            "definition": "to promise someone or something for a particular purpose or time.  I can’t commit myself for Friday night. We are unable to commit any more funds for your project."
        },
        {
            "id": 238,
            "phrase": "commit someone or something to something",
            "definition": "to pledge or assign someone or something to something.  The boss committed Ralph to the task.  I cannot commit any more money to your project."
        },
        {
            "id": 239,
            "phrase": "commit something to memory",
            "definition": "to memorize something. Do we have to commit this poem to memory? _The dress rehearsal of the play is tomorrow night. Please make sure you have committed all your lines to memory by that time."
        },
        {
            "id": 240,
            "phrase": "commit to someone",
            "definition": "to marry or enter into an exclusive relationship with another person. Jane says she loves me, but she’s not ready to commit to any one person.  If you can’t commit to me, then this relationship is over."
        },
        {
            "id": 241,
            "phrase": "commode-hugging drunk",
            "definition": "Sl. heavily alcohol intoxicated; drunk and vomiting. Willie got commode-hugging drunk in the space of two hours."
        },
        {
            "id": 242,
            "phrase": "a common thread (to all this)",
            "definition": "a similar idea or pattern to a series of events.  All of these incidents are related. There is a common thread to all this."
        },
        {
            "id": 243,
            "phrase": "commune with something",
            "definition": "to experience wordless or spiritual communication with something.  She went on long walks to commune with nature. He enjoyed going off on a retreat to commune with his inner self."
        },
        {
            "id": 244,
            "phrase": "communicate something to someone",
            "definition": "to say or write something to someone; to tell someone something. Will you please communicate my regards to her? _ I intend to communicate your request to the front office this morning."
        },
        {
            "id": 245,
            "phrase": "communicate with someone",
            "definition": "to correspond or talk with a person.  I have to communicate with Wally first. As soon as I have communicated with Fred, I can give you an answer."
        },
        {
            "id": 246,
            "phrase": "commute between places",
            "definition": "to travel between the place where one works and the place where one lives.  I have to commute between Chicago and Detroit every week.  Mary has commuted between New York City and New Jersey for years."
        },
        {
            "id": 247,
            "phrase": "commute from some place",
            "definition": "to travel to work from some place.  I commute from way out in the country.  Betty commutes from only a few miles away and will be here very soon."
        },
        {
            "id": 248,
            "phrase": "commute something into something",
            "definition": "to change something into something.  No one, as it turns out, can commute lead into gold.  I had hoped to commute this argument into a sensible discussion, but it is hopeless."
        },
        {
            "id": 249,
            "phrase": "compare notes on someone or something",
            "definition": "to share observations on someone or something. We took a little time to compare notes on our ancestors and have discovered that we are cousins."
        }
    ]
}