{
    "dictionary": [
        {
            "id": 0,
            "phrase": "*beyond someone or something",
            "definition": "1. on the other side of something. (*Typically: be ~; get ~.) _ When we get beyond this bad road, I’ll have to check the tires.  I have to get beyond the large gentleman standing in the hall. 2. finished with someone or something; having solved the problems relating to someone or something. (*Typically: be ~; get ~; move ~.) _ Things will be better when we get beyond this financial crisis. When the country gets beyond the current situation, things will have to get better."
        },
        {
            "id": 1,
            "phrase": "beyond the pale",
            "definition": "unacceptable; outlawed. (A pale is a barrier made of wooden stakes.) _Your behavior is simply beyond the pale. Because of Tom’s rudeness, he’s considered beyond the pale and is never asked to parties anymore."
        },
        {
            "id": 2,
            "phrase": "beyond words",
            "definition": "more than one can say. (Especially preceded by grateful, shocked, and thankful.) _ Sally was thankful beyond words.  I don’t know how to thank you. I’m grateful beyond words."
        },
        {
            "id": 3,
            "phrase": "bias someone against someone or something",
            "definition": "to prejudice someone against someone or something.  Please avoid biasing everyone against me.  One bad experience biased all of us against that brand of sausage."
        },
        {
            "id": 4,
            "phrase": "bid adieu to someone or something",
            "definition": "Cliché to say good-bye to someone or something. (The word adieu is French for good-bye and should not be confused with ado.) _ Now it’s time to bid adieu to all of you gathered here.  He silently bid adieu to his favorite hat as the wind carried it down the street."
        },
        {
            "id": 5,
            "phrase": "bid something down†",
            "definition": "to lower the value of something, such as stock, by offering a lower price for it each time it comes up for sale.  We bid the price down and then bought all of it.  I could see that the traders were bidding down the price, but I didn’t want to take the risk."
        },
        {
            "id": 6,
            "phrase": "bid something up†",
            "definition": "to raise the price of something at an auction by offering higher and higher prices; to increase the value of something, such as shares of stock, by offering a higher price for it each time it comes up for sale.  Who is bidding the price up on that painting? _Someone bid up the price on each piece at auction and then backed off."
        },
        {
            "id": 7,
            "phrase": "bide one’s time",
            "definition": "to wait patiently.  I’ve been biding my time for years, just waiting for a chance like this.  He’s not the type just to sit there and bide his time. He wants some action now."
        },
        {
            "id": 8,
            "phrase": "big and bold",
            "definition": "large and capable of getting attention. (Usually refers to things, not people.) _ The big and bold lettering on the book’s cover got lots of attention, but the price was too high.  She wore a brightly colored dress. The pattern was big and bold and the skirt was very full."
        },
        {
            "id": 9,
            "phrase": "The Big Apple",
            "definition": "New York City. We spent the weekend in the Big Apple."
        },
        {
            "id": 10,
            "phrase": "*big around as a molasses barrel",
            "definition": "Rur. very big around. (*Also: as ~.) _ He ate till he was as big around as a molasses barrel.  The athlete’s chest was big around as a molasses barrel."
        },
        {
            "id": 11,
            "phrase": "*big as all outdoors",
            "definition": "Cliché very big, usually referring to an indoor space of some kind. (*Also: as ~.) _ You should see Bob’s living room. It’s as big as all outdoors! _ The new movie theater is as big as all outdoors."
        },
        {
            "id": 12,
            "phrase": "big bucks",
            "definition": "a very large amount of money.  He earns big bucks for doing almost nothing."
        },
        {
            "id": 13,
            "phrase": "*the big eye",
            "definition": "1. a flirtatious look or gaze; a long look to get another’s attention. (*Typically: get ~; give someone ~.) _ Look at that pretty girl giving you the big eye.  I thought she was cute, so I gave her the big eye. 2. obvious eye contact with someone. (*Typically: get ~; give someone ~.) _ Tom gave me the big eye to let me know he wanted to talk to me.  I tried to give her the big eye, but she never looked my way."
        },
        {
            "id": 14,
            "phrase": "a big frog in a small pond",
            "definition": "an important person in the midst of less important people. (Alludes to a large frog that dominates a small pond with few challengers.) _ I’d rather be a big frog in a small pond than the opposite. The trouble with Tom is that he’s a big frog in a small pond. He needs more competition."
        },
        {
            "id": 15,
            "phrase": "*a big hand for something",
            "definition": "lots of applause for something. (*Typically: get ~; have ~; give someone ~.) _ She got a big hand for singing so well.  They always give the acrobats a big hand."
        },
        {
            "id": 16,
            "phrase": "big man on campus",
            "definition": "Sl. an important male college student. (Often derisive or jocular.) _ Hank acts like such a big man on campus.  Let some big man on campus do the dirty work for a change."
        },
        {
            "id": 17,
            "phrase": "big of someone",
            "definition": "generous; kind or forgiving. (Sometimes sarcastic.) _ He gave me some of his apple. That was very big of him. It was big of Sally to come over and apologize like that."
        },
        {
            "id": 18,
            "phrase": "*the big picture",
            "definition": "the whole story of something; a complete view of something. (*Typically: get ~; have ~; give someone ~; know ~; see ~; show someone ~.) _ The sales manager gave us all the big picture this morning, and I’m more confused than ever."
        },
        {
            "id": 19,
            "phrase": "*a big send-off",
            "definition": "a happy celebration before departing. (*Typically: get ~; have ~; give someone ~.) _I had a wonderful send-off before I left.  John got a fine sendoff as he left for Europe."
        },
        {
            "id": 20,
            "phrase": "big with someone",
            "definition": "famous with or desired by someone or some group. This kind of pizza is supposed to be big with people in Chicago.  Rock concerts are big with the kids."
        },
        {
            "id": 21,
            "phrase": "The bigger they are, the harder they fall.",
            "definition": "Prov. When prominent people fail, their failure is more dramatic.  After the newspapers reported that the mayor cheated on his wife, he lost the election and he can’t get any kind of job. The bigger they are, the harder they fall.  Jackson used to be very wealthy, but he lost every cent in the stock market crash. The bigger they are, the harder they fall."
        },
        {
            "id": 22,
            "phrase": "bilk someone out of something",
            "definition": "to get something away from someone by deception.  The crooks bilked the old lady out of a fortune.  I was bilked out of my life’s savings!"
        },
        {
            "id": 23,
            "phrase": "bill someone for something",
            "definition": "to ask someone for payment for something in writing. Just bill me for the balance. She billed them for her expenses and then tried to deduct the expenses from her income tax."
        },
        {
            "id": 24,
            "phrase": "billow out",
            "definition": "1. [for something, such as smoke] to burst and flow outward.  At the site of the fire, smoke billowed out. Clouds of ash billowed out of the volcano. 2. [for a sheet of cloth] to fill with the wind. (Especially a ship’s sail.) _ The sail billowed out and we moved forward.  Her skirt billowed out when the wind caught it."
        },
        {
            "id": 25,
            "phrase": "bind someone or something down†",
            "definition": "to tie or secure someone or something to something.  Bind the tarpaulin so it won’t get away. We will bind down the patient tightly.  They bound the hatch down so it could not be opened."
        },
        {
            "id": 26,
            "phrase": "bind someone or something together†",
            "definition": "to tie the parts of something together; to tie a number of things or people together.  Can you bind together all three parts? _ Bind these two bandits together and lead them to jail."
        },
        {
            "id": 27,
            "phrase": "bind someone over† (to someone or something)",
            "definition": "to deliver someone to some legal authority; to deliver someone to some legal authority. (A legal usage.) _ They bound the suspect over to the sheriff.  The sheriff will bind over the suspect to the county jail."
        },
        {
            "id": 28,
            "phrase": "binge and purge",
            "definition": "to overeat and vomit, alternatively and repeatedly. (A symptom of the condition called bulimia.) _ She had binged and purged a number of times before she finally sought help from a doctor.  Terry had been bingeing and purging for a number of years and was very, very thin."
        },
        {
            "id": 29,
            "phrase": "A bird in the hand is worth two in the bush.",
            "definition": "Prov. Having something for certain is better than the possibility of getting something better. I might get a better offer, but a bird in the hand is worth two in the bush.  Bill has offered to buy my car for $3,000 cash. Someone else might pay more, but a bird in the hand is worth two in the bush."
        },
        {
            "id": 30,
            "phrase": "a bird’s-eye view",
            "definition": "a view seen from high above.  We got a bird’s-eye view of Cleveland as the plane began its descent. From the top of the church tower you get a splendid bird’s-eye view of the village."
        },
        {
            "id": 31,
            "phrase": "the birds and the bees",
            "definition": "Euph. sex and reproduction. My father tried to teach me about the birds and the bees.  He’s twenty years old and doesn’t understand about the birds and the bees!"
        },
        {
            "id": 32,
            "phrase": "Birds in their little nests agree.",
            "definition": "Prov. People who live together should try hard to get along peacefully. (Usually used to admonish children not to fight with each other.) _ Brother: She called me a name! Sister: I did not! He’s a liar! Father: Now, now, kids—birds in their little nests agree.  Let’s not argue about this, guys. Birds in their little nests agree."
        },
        {
            "id": 33,
            "phrase": "Birds of a feather flock together.",
            "definition": "Prov. Similar people tend to associate with each other.  I always thought Amy was pretentious, and now she’s going out with that snobbish boy, Louis. Birds of a feather f lock together.  George: Why do you think Donald is dishonest? Ned: All his friends are dishonest. Birds of a feather f lock together."
        },
        {
            "id": 34,
            "phrase": "a bit much",
            "definition": "beyond what is needed or tolerable.  The speech she gave in acceptance of the award was a bit much. She went on and on."
        },
        {
            "id": 35,
            "phrase": "bitch about someone or something",
            "definition": "Inf. to complain about someone or something. (Use discretion with bitch, a word many consider coarse or vulgar.) _ You are always bitching about your girlfriend. Stop bitching about your job so much."
        },
        {
            "id": 36,
            "phrase": "a bitch of a someone or something",
            "definition": "Inf. a really difficult person or thing. (Use discretion with bitch, a word many con- sider coarse or vulgar.) _ What a bitch of a day! _ He is really a bitch of a boss."
        },
        {
            "id": 37,
            "phrase": "bitch someone off†",
            "definition": "Sl. to make someone angry. (Use discretion with bitch, a word many consider coarse or vulgar.) _ You really bitch me off, do you know that? _ That foul temper of yours could bitch off anybody."
        },
        {
            "id": 38,
            "phrase": "bitch someone or something up†",
            "definition": "Inf. to mess someone or something up. (Use discretion with bitch, a word many consider coarse or vulgar.) _ Who bitched these cards up? _ I never bitch up anything!"
        },
        {
            "id": 39,
            "phrase": "bite back (at someone or something)",
            "definition": "to defend an attack by biting at someone or something. (Usually an animal.) _ I threatened the dog and the dog bit back."
        },
        {
            "id": 40,
            "phrase": "bite into something",
            "definition": "to press one’s teeth into something.  As he bit into the apple, the juices ran down his chin.  Lily bit into the sandwich and smiled."
        },
        {
            "id": 41,
            "phrase": "bite off more than one can chew",
            "definition": "to take a larger mouthful of food than one can chew easily or comfortably. I bit off more than I could chew, and nearly choked."
        },
        {
            "id": 42,
            "phrase": "bite on someone",
            "definition": "Sl. to copy something that someone else has done; to dress the same way someone else does.  Nobody will bite on Sally. She has terrible taste.  Jennifer is always biting on Anne, who is a careful dresser."
        },
        {
            "id": 43,
            "phrase": "bite on something",
            "definition": "1. to chew on something; to grasp something with the teeth. The injured cowboy bit on a leather strap while they tried to fix his dislocated shoulder. 2. to respond to a lure; to fall for something. (Can refer literally to fishing, or be used figuratively.) _Do you think the fish will bite on this? _ No one would bite on that bait. Try another approach."
        },
        {
            "id": 44,
            "phrase": "bite one’s nails",
            "definition": "1. to use one’s teeth to remove parts of one’s fingernails as a means of shortening them.  Stop biting your nails! Use clippers! 2. to literally bite one’s nails from nervousness or anxiety; to be nervous or anxious.  I spent all afternoon biting my nails, worrying about you.  We’ve all been biting our nails from worry."
        },
        {
            "id": 45,
            "phrase": "bite one’s tongue",
            "definition": "to bite down on one’s tongue by accident.  Ouch! I bit my tongue!"
        },
        {
            "id": 46,
            "phrase": "bite someone’s head off",
            "definition": "to speak sharply and with great anger to someone. (Fixed order.) _ Don’t bite my head off! Be patient.  I’m very sorry I lost my tempter. I didn’t mean to bite your head off."
        },
        {
            "id": 47,
            "phrase": "bite something off†",
            "definition": "to remove something in a bite.  Ann bit a piece off and chewed it up.  She bit off a piece."
        },
        {
            "id": 48,
            "phrase": "bite the big one",
            "definition": "Sl. to die.  I was so tired that I thought I was going to bite the big one.  I hope I am old and gray when I bite the big one."
        },
        {
            "id": 49,
            "phrase": "bite the bullet",
            "definition": "Sl. to accept something difficult and try to live with it.  You are just going to have to bite the bullet and make the best of it. Jim bit the bullet and accepted what he knew had to be."
        },
        {
            "id": 50,
            "phrase": "bite the dust",
            "definition": "1. Sl. to die. A shot rang out, and another cowboy bit the dust. The soldier was too young to bite the dust. 2. Sl. to break; to fail; to give out. My old car finally bit the dust. This pen is out of ink and has bitten the dust."
        },
        {
            "id": 51,
            "phrase": "bite the hand that feeds one",
            "definition": "to do harm to someone who does good things for you. (Does not involve biting.) _ I’m your mother! How can you bite the hand that feeds you? _She can hardly expect sympathy when she bites the hand that feeds her."
        },
        {
            "id": 52,
            "phrase": "*a bite (to eat)",
            "definition": "to get something to eat; to get food that can be eaten quickly. (*Typically: get ~; grab ~; have ~.) _ I need a few minutes to grab a bite to eat.  Bob often tries to get a bite between meetings."
        },
        {
            "id": 53,
            "phrase": "Bite your tongue!",
            "definition": "an expression said to someone who has just stated an unpleasant supposition that unfortunately may be true. Mary: I’m afraid that we’ve missed the plane already. Jane: Bite your tongue! We still have time. Mary: Marry him? But you’re older than he is! Sally: Bite your tongue!"
        },
        {
            "id": 54,
            "phrase": "bitten by the same bug",
            "definition": "having the same need, desire, or obsession.  Bob and I were both bitten by the same bug and ended up getting new cars at the same time."
        },
        {
            "id": 55,
            "phrase": "a bitter pill to swallow",
            "definition": "an unpleasant fact that has to be accepted. (Does not involve pills or swallowing.) _ It was a bitter pill for her brother to swallow when she married his enemy.  We found his deception a bitter pill to swallow."
        },
        {
            "id": 56,
            "phrase": "blab something around†",
            "definition": "Inf. to gossip something to others; to spread some news or secret.  It’s true, but don’t blab it around. Did you blab around everything I told you to keep to yourself ?"
        },
        {
            "id": 57,
            "phrase": "blab something out†",
            "definition": "Inf. to speak out freely about something that is a secret. Don’t just blab it out! _Don’t blab out the names of the people who were there!"
        },
        {
            "id": 58,
            "phrase": "black-and-blue",
            "definition": "bruised, physically or emotionally. I’m still black-and-blue from my divorce. What is that black-and-blue mark on your leg?"
        },
        {
            "id": 59,
            "phrase": "*black as one is painted",
            "definition": "as evil as described. (Usually negative. *Also: as ~.) _ The landlord is not as black as he is painted. He seems quite generous to me. Young people are rarely black as they are painted in the media."
        },
        {
            "id": 60,
            "phrase": "a black eye",
            "definition": "a bruise near the eye from being struck. (*Typically have ~; get ~; give someone ~.) _ I got a black eye from walking into a door.  I have a black eye where John hit me."
        },
        {
            "id": 61,
            "phrase": "*a black mark beside one’s name",
            "definition": "something negative associated with a person. (*Typically: get ~; have ~; give one ~.) _I did it again! Now I’ve got still another black mark beside my name!"
        },
        {
            "id": 62,
            "phrase": "black out",
            "definition": "[for lights] to go out.  Suddenly the lights blacked out.  The power went dead and everything blacked out from the heat."
        },
        {
            "id": 63,
            "phrase": "the black sheep of the family",
            "definition": "the worst member of the family. Mary is the black sheep of the family. She’s always in trouble with the police. He keeps making a nuisance of himself. What do you expect from the black sheep of the family?"
        },
        {
            "id": 64,
            "phrase": "black something out†",
            "definition": "to cut or turn out the lights or electric power. The lightning strike blacked the entire town out.  The manager blacked out the whole building during the emergency to prevent an explosion."
        },
        {
            "id": 65,
            "phrase": "blackmail someone into doing something",
            "definition": "to force a person to do something by threatening to reveal some secret about the person.  Are you trying to blackmail me into doing what you want? _ They blackmailed me into doing it."
        },
        {
            "id": 66,
            "phrase": "*the blame for something",
            "definition": "the responsibility of having done something wrong or caused something bad to happen. (*Typically: accept ~; bear ~; shoulder ~; take ~.) _I absolutely refuse to shoulder the blame for the entire fiasco!"
        },
        {
            "id": 67,
            "phrase": "blame someone for something",
            "definition": "to hold someone responsible for something; to name someone as the cause of something.  Please don’t blame Jill for it.  She blamed herself for everything that went wrong."
        },
        {
            "id": 68,
            "phrase": "blame something on someone",
            "definition": "to say that something is someone’s fault; to place the guilt for something on someone.  Don’t blame it on me.  I blamed it all on someone else."
        },
        {
            "id": 69,
            "phrase": "blanch at something",
            "definition": "to cringe at something; to become pale at the thought of something.  Jill blanched at the thought of swimming in that cold water. Lily blanched at the sight before her."
        },
        {
            "id": 70,
            "phrase": "blanch with something",
            "definition": "to become pale with some emotion, such as anger or fear.  He saw the injury and blanched with fear.  Lily blanched with anger as Max walked out."
        },
        {
            "id": 71,
            "phrase": "a blank check",
            "definition": "freedom or permission to act as one wishes or thinks necessary.  He’s been given a blank check with regard to reorganizing the work force.  The new manager has been given no detailed instructions about how to train the staff. He just has a blank check."
        },
        {
            "id": 72,
            "phrase": "blank something out†",
            "definition": "to erase something, as on a computer screen. Who blanked out the information that was on my screen? _Please blank your password out as soon as you type it."
        },
        {
            "id": 73,
            "phrase": "blanket someone or something with something",
            "definition": "to cover someone or something with something. They blanketed the flames with a layer of foam.  The children blanketed Jimmy with leaves and pretended he was lost."
        },
        {
            "id": 74,
            "phrase": "blast off (for some place)",
            "definition": "1. [for a space vehicle] to take off and head toward a destination.  The rocket blasted off for the moon.  Will it blast off on time? 2. Sl. [for someone] to leave for a destination quickly. Ann blasted off for the library so she could study.  I’ve got to blast off. It’s late."
        },
        {
            "id": 75,
            "phrase": "blast something off something else",
            "definition": "to remove something from something else with a powerful charge, pressure, or force. They blasted the writing off the wall with a stream of sand.  We will have to blast the paint off the wall."
        },
        {
            "id": 76,
            "phrase": "blaze a trail",
            "definition": "to make and mark a trail. The scout blazed a trail through the forest."
        },
        {
            "id": 77,
            "phrase": "blaze away (at someone or something)",
            "definition": "[for gunfire] to fire continually at someone or something.  The guns blazed away at the oncoming ducks. The cowboy blazed away at his opponent in the gunfight."
        },
        {
            "id": 78,
            "phrase": "blaze down (on someone or something)",
            "definition": "[for the sun or other hot light] to burn from above onto someone or something.  The sun blazed down on the people on the beach.  The stage lights blazed down on the set while the actors rehearsed."
        },
        {
            "id": 79,
            "phrase": "blaze up",
            "definition": "[for flames] to expand upward suddenly.  The fire blazed up and warmed all of us.  As the fire blazed up, we moved away from the fireplace."
        },
        {
            "id": 80,
            "phrase": "blaze with something",
            "definition": "to burn with some quality, such as great heat or sound.  The sun blazed with unbelievable heat.  The fire blazed with much crackling."
        },
        {
            "id": 81,
            "phrase": "bleach something out†",
            "definition": "to remove the color or stain from something.  Wally bleached his jeans out so they looked more stylish.  Can you bleach out this stain?"
        },
        {
            "id": 82,
            "phrase": "bleed for someone",
            "definition": "to feel the emotional pain that someone else is feeling; to sympathize or empathize with someone.  I just bled for him when I heard his sad story.  We bled for her as she related her recent woes."
        },
        {
            "id": 83,
            "phrase": "bleed from something",
            "definition": "for blood to emerge from a wound or other source.  He was bleeding from a number of wounds.  He bled from his mouth and nose."
        },
        {
            "id": 84,
            "phrase": "bleed to death",
            "definition": "to die from the loss of blood.  If something isn’t done, he will bleed to death.  I cut my finger. I hope I don’t bleed to death."
        },
        {
            "id": 85,
            "phrase": "bleeding heart",
            "definition": "someone, usually considered politically liberal or leftist, who is very emotional about certain political issues, such as endangered species, downtrodden people, the suffering poor, etc.  Bob is such a bleeding heart. No cause is too far out for him."
        },
        {
            "id": 86,
            "phrase": "bleep something out†",
            "definition": "to replace a word or phrase in a radio or television broadcast with some sort of covering tone. (This is sometimes done to prevent a taboo word or other information from being broadcast.) _ He tried to say the word on television, but they bleeped it out.  They tried to bleep out the whole sentence."
        },
        {
            "id": 87,
            "phrase": "blend in (with someone or something)",
            "definition": "to mix well with someone or something; to combine with someone or something.  Everyone there blended in with our group.  This color doesn’t blend in with the upholstery fabric I have chosen."
        },
        {
            "id": 88,
            "phrase": "blend in(to something)",
            "definition": "to combine nicely with something; to mix well with something.  The oil won’t blend into the water very well.  It simply won’t blend in."
        },
        {
            "id": 89,
            "phrase": "blend something together (with something)",
            "definition": "to mix something evenly with something else. Blend the egg together with the cream.  Blend the ingredients together and pour them into a baking pan."
        },
        {
            "id": 90,
            "phrase": "bless someone or something with something",
            "definition": "[for God or fate] to give someone or something a valuable gift. God has blessed us with a bountiful harvest.  Nature blessed the morning with a gentle rain."
        },
        {
            "id": 91,
            "phrase": "blessed event",
            "definition": "the birth of a child.  My sister is expecting a blessed event sometime in May.  The young couple anxiously awaited the blessed event."
        },
        {
            "id": 92,
            "phrase": "Blessed is he who expects nothing, for he shall never be disappointed.",
            "definition": "Prov. If you do not expect good things to happen, you will not be disappointed when they fail to happen.  Ellen: This is going to be the best vacation we’ve ever had; we’re going to have fun every minute of every day. Fred: Blessed is he who expects nothing, for he shall never be disappointed.  Jill: Do you think you’ll win the contest? Jane: I like to keep in mind that blessed is he who expects nothing, for he shall never be disappointed."
        },
        {
            "id": 93,
            "phrase": "a blessing in disguise",
            "definition": "something that at first seems bad, but later turns out to be beneficial.  Tony’s motorcycle accident was a blessing in disguise, because he got enough insurance money from the other driver to make a down payment on a house.  Dad’s illness was a blessing in disguise; it brought the family together for the first time in years."
        },
        {
            "id": 94,
            "phrase": "a blight on the land",
            "definition": "something that harms the land or the enviornment. Your garage is ugly! No, it’s a blight on the land!"
        },
        {
            "id": 95,
            "phrase": "blimp out",
            "definition": "to overeat; to eat too much and gain weight.  I blimp out almost every weekend.  If I could stop blimping out, I could lose some weight."
        },
        {
            "id": 96,
            "phrase": "*blind as a bat",
            "definition": "1. completely blind. (Bats are not really blind. *Also: as ~.) _He lost his sight in an accident and is as blind as a bat. 2. not able to see well.  I’m as blind as a bat without my glasses. 3. unwilling to recognize problems or bad things. Connie is blind as a bat when it comes to her daughter’s disgraceful behavior."
        },
        {
            "id": 97,
            "phrase": "The blind leading the blind",
            "definition": "Prov. Someone who is not capable of dealing with a situation is guiding someone else who is not capable of dealing with it.  Jill: Mike is helping me fill out my tax forms this year. Jane: Is he a tax expert? Jill: He read a book about income tax once. Jane: Sounds to me like the blind leading the blind.  Nathan offered to be my guide through Philadelphia, but since he’d never been there before either, it was a case of the blind leading the blind."
        },
        {
            "id": 98,
            "phrase": "blind someone to something",
            "definition": "to prevent someone from seeing or understanding something.  The king blinded his subjects to what was going on by controlling what appeared in the newspapers.  The lies and confusion blinded Jill to what was happening.  She blinded herself to all his faults."
        },
        {
            "id": 99,
            "phrase": "blink at something",
            "definition": "to open and close the eyelids quickly, one or more times.  I blinked at the bright light and finally had to close my eyes.  Don’t blink at me while I am trying to take your picture."
        },
        {
            "id": 100,
            "phrase": "blink one’s tears back†",
            "definition": "to try to keep from crying. She blinked back her tears and went on. He blinked his tears back and endured the pain."
        },
        {
            "id": 101,
            "phrase": "bliss out",
            "definition": "Sl. to be overcome with happiness. She blissed out at the concert, because she loves that kind of music."
        },
        {
            "id": 102,
            "phrase": "bliss someone out†",
            "definition": "Sl. to cause someone to be overcome with happiness.  This kind of sunny weather just blisses me out. The lovely weather blissed out everyone after the long winter."
        },
        {
            "id": 103,
            "phrase": "blitz someone out†",
            "definition": "Sl. to shock or disorient someone.  The accident blitzed her out for a moment.  The second act blitzed out the audience and thrilled them to pieces."
        },
        {
            "id": 104,
            "phrase": "blitzed out",
            "definition": "Sl. shocked or disoriented.  Ann was totally blitzed out by the events of the day.  They were totally blitzed out by the bad news."
        },
        {
            "id": 105,
            "phrase": "block someone up†",
            "definition": "to constipate someone.  That food always blocks me up.  He blocked himself up by eating something he shouldn’t.  That vile stuff would block up anybody!"
        },
        {
            "id": 106,
            "phrase": "block something off†",
            "definition": "to prevent movement through something by putting up a barrier; to close a passageway.  Sam blocked the corridor off with a row of chairs. He used some chairs to block off the hallway."
        },
        {
            "id": 107,
            "phrase": "block something out†",
            "definition": "1. to obscure a clear view of something.  The trees blocked the sun out.  The bushes blocked out my view of the car that was approaching. 2. to lay something out carefully; to map out the details of something.  She blocked it out for us, so we could understand.  Let me block out this project for you right now."
        },
        {
            "id": 108,
            "phrase": "block something up†",
            "definition": "to obstruct something; to stop the flow within a channel.  The heaps of debris blocked the channel up.  The leaves blocked up the drain."
        },
        {
            "id": 109,
            "phrase": "blood and guts",
            "definition": "1. Fig. strife; acrimony.  There is a lot of blood and guts around here, but we get our work done anyway.  Cut out the blood and guts and grow up. 2. Fig. acrimonious. (This is hyphenated before a nominal.) _ There are too many blood-and-guts arguments around here.  Old blood-and-guts Wally is making his threats again."
        },
        {
            "id": 110,
            "phrase": "blood, sweat, and tears",
            "definition": "the signs of great personal effort.  There will be much blood, sweat, and tears before we have completed this project.  After years of blood, sweat, and tears, Timmy finally earned a college degree."
        },
        {
            "id": 111,
            "phrase": "Blood will have blood.",
            "definition": "Prov. People will use violence to get revenge for violent acts; murderers will themselves be murdered.  Although no one suspected him of the murder he had committed, Parker lived in fear. He had heard that blood will have blood. I am afraid that the two gangs will never stop killing each other. Blood will have blood."
        },
        {
            "id": 112,
            "phrase": "Blood will tell.",
            "definition": "Prov. A person whose ancestors had certain characteristics, often bad ones, will eventually turn out to be similar.  Lisa’s father was a gambler, and now Lisa has started to gamble, too. Blood will tell.  William went to all the best schools, but he’s just as vulgar as the rest of his family. Blood will tell."
        },
        {
            "id": 113,
            "phrase": "bloody but unbowed",
            "definition": "showing signs of a struggle, but not defeated. (Originally referring to the head. From the poem Invictus by William Earnest Henley.) _ Liz emerged from the struggle, her head bloody but unbowed.  We are bloody but unbowed and will fight to the last."
        },
        {
            "id": 114,
            "phrase": "blossom forth",
            "definition": "[for a plant] to burst into flower.  All the trees blossomed forth at the same time.  Each spring my tulips blossom forth in all their glory."
        },
        {
            "id": 115,
            "phrase": "blossom into something",
            "definition": "[for a plant] to develop into full bloom.  The bush blossomed into beautiful red roses.  Imagine this brown old bulb blossoming into a lovely f lower."
        },
        {
            "id": 116,
            "phrase": "blossom out",
            "definition": "[for a plant or tree] to become covered with flowers.  The apple tree blossomed out for the last time."
        },
        {
            "id": 117,
            "phrase": "a blot on the landscape",
            "definition": "a sight that spoils the look of a place.  That monstrosity you call a house is a blot on the landscape. You should have hired a real architect!"
        },
        {
            "id": 118,
            "phrase": "blot someone or something out†",
            "definition": "to forget someone or something by covering up memories or by trying to forget.  I try to blot those bad thoughts out.  I tried to blot out those unhappy days."
        },
        {
            "id": 119,
            "phrase": "blot someone out†",
            "definition": "Sl. to kill someone. (Originally underworld slang.) _ Sorry, chum, we got orders to blot you out.  The gang blotted out the only living witness before the trial."
        },
        {
            "id": 120,
            "phrase": "blot something out†",
            "definition": "to make something invisible by covering it.  Don’t blot the name out on the application form.  Who blotted out the name on this form?"
        },
        {
            "id": 121,
            "phrase": "blow away",
            "definition": "[for something light] to be carried away by the wind.  The leaves blew away on the autumn winds.  My papers blew away!"
        },
        {
            "id": 122,
            "phrase": "blow hot and cold",
            "definition": "to be changeable or uncertain (about something).  He keeps blowing hot and cold on the question of moving to the country.  He blows hot and cold about this. I wish he’d make up his mind."
        },
        {
            "id": 123,
            "phrase": "blow in",
            "definition": "  [for something] to cave in to the pressure of moving air.  The door blew in during the storm.  The window blew in from the wind."
        },
        {
            "id": 124,
            "phrase": "blow in (from some place)",
            "definition": "[for a wind] to move air in from some place.  A huge mass of frigid air blew in from Canada.  When the cold air blew in, we were dressed in short sleeves."
        },
        {
            "id": 125,
            "phrase": "blow in(to some place) (from some place)",
            "definition": "Sl. [for someone] to arrive at a place suddenly, or surprisingly, or with a casual air.  We blew into town about midnight from Detroit.  It was late when we blew in from Detroit.  What time did you blow in?"
        },
        {
            "id": 126,
            "phrase": "blow into something",
            "definition": "to force air into something. He blew into the balloon.  I blew into the box, hoping to get some of the little bits of paper out."
        },
        {
            "id": 127,
            "phrase": "Blow it out your ear!",
            "definition": "Sl. Go away!; Leave me alone! _ Oh, blow it out your ear, you cornball! _ You are not cool, you’re just weird! Blow it out your ear!"
        },
        {
            "id": 128,
            "phrase": "blow itself out",
            "definition": "[for a storm or a tantrum] to lose strength and stop; to subside. (Fixed order.) _The storm blew itself out.  Eventually, the hurricane blew itself out."
        },
        {
            "id": 129,
            "phrase": "Blow on it!",
            "definition": "Sl. Cool it!; Take it easy! _ It’s all right, Tom. Blow on it! _ Hey, man. Relax. Blow on it!"
        },
        {
            "id": 130,
            "phrase": "blow on something",
            "definition": "to force air across something especially with a puff of breath.  Jill blew on the hot soup.  Blow on the fire to make it burn hotter."
        },
        {
            "id": 131,
            "phrase": "blow one’s nose",
            "definition": "to expel mucus and other material from the nose using air pressure from the lungs.  Excuse me, I have to blow my nose.  Bill blew his nose into his handkerchief."
        },
        {
            "id": 132,
            "phrase": "blow over",
            "definition": "[for something] to diminish; to subside. (As with a storm or a temper tantrum.) _ Her display of temper finally blew over.  The storm will blow over soon, I hope."
        },
        {
            "id": 133,
            "phrase": "blow someone a kiss",
            "definition": "to pantomine the sending of a kiss to a person visible nearby by kissing one’s hand and “blowing” the kiss off the hand toward the person.  As she boarded the train she blew him a kiss, and he waved back."
        },
        {
            "id": 134,
            "phrase": "blow someone away",
            "definition": "1. Sl. [for something shocking or exciting] to overwhelm a person; to excite a person very much.  The amount of the check blew me away.  The loud noise from the concert blew me away. 2. Sl. to murder someone, usually by gunfire.  Mr. Big ordered Lefty to blow Max away.  Max tried to blow Lefty away."
        },
        {
            "id": 135,
            "phrase": "blow someone or something away†",
            "definition": "[for the wind] to carry someone or something away.  The wind almost blew her away.  It nearly blew away all the houses."
        },
        {
            "id": 136,
            "phrase": "blow someone or something down†",
            "definition": "[for a rush of air] to knock someone or something over.  The wind blew Chuck down.  The tornado blew down many buildings."
        },
        {
            "id": 137,
            "phrase": "blow someone or something out of the water",
            "definition": "to destroy utterly someone or something, such as a plan. (Alludes to a torpedo or other weapon striking a ship and causing a great explosion that makes pieces of the ship fly out of the water.) _ I will blow him out of the water if he shows up around here.  The boss blew the whole idea out of the water."
        },
        {
            "id": 138,
            "phrase": "blow someone or something over",
            "definition": "[for the wind] to move strongly and upset someone or something.  The wind almost blew us over.  The tornado blew the shed over."
        },
        {
            "id": 139,
            "phrase": "blow someone or something to kingdom come",
            "definition": "to destroy someone or something by means of an explosion. You’d better get that gas leak fixed or it will blow you and your car to kingdom come."
        },
        {
            "id": 140,
            "phrase": "blow someone or something up†",
            "definition": "to destroy someone or something by explosion. The terrorists blew the building up at midday.  They blew up the bridge."
        },
        {
            "id": 141,
            "phrase": "blow someone out",
            "definition": "Sl. to kill someone, especially with gunshots. (Fixed order.) _ Lefty set out to blow Max out once and for all.  Lefty wanted to blow Max out too."
        },
        {
            "id": 142,
            "phrase": "blow someone over†",
            "definition": "[for the wind or an explosion] to knock someone over.  The force of the wind nearly blew me over.  The wind blew over the old tree."
        },
        {
            "id": 143,
            "phrase": "blow someone’s brains out†",
            "definition": "Sl. to kill someone with a gun.  Careful with that gun, or you’ll blow your brains out.  Max was so depressed that he wanted to blow out his brains."
        },
        {
            "id": 144,
            "phrase": "blow someone’s cover",
            "definition": "Sl. to reveal someone’s true identity; to ruin someone’s scheme for concealment.  The dog recognized me and blew my cover.  I didn’t mean to blow your cover by calling out to you."
        },
        {
            "id": 145,
            "phrase": "blow someone’s doors off†",
            "definition": "Sl. [for a driver] to speed past another vehicle.  Wow, he almost blew my doors off! _ The truck passed us and blew off our doors!"
        },
        {
            "id": 146,
            "phrase": "blow someone’s mind",
            "definition": "1. Sl. to disturb or distract; to destroy the function of one’s brain.  It was a terrible experience. It nearly blew my mind.  She blew her mind on drugs. 2. Sl. to overwhelm someone; to excite someone.  It was so beautiful, it nearly blew my mind.  The loud guitar music was so wild. It blew my mind."
        },
        {
            "id": 147,
            "phrase": "blow someone to something",
            "definition": "Sl. to pay for something or someone, such as a meal, a movie, a drink, etc.  Let me blow you to a meal.  I think I’ll blow myself to a fancy dessert."
        },
        {
            "id": 148,
            "phrase": "blow something out†",
            "definition": "to extinguish a flame with a puff of breath.  I blew the candle out.  I blew out the candles one by one."
        },
        {
            "id": 149,
            "phrase": "blow something up†",
            "definition": "1. to inflate something.  He didn’t have enough breath to blow the balloon up. They all blew up their own balloons. 2. to have a photograph enlarged.  How big can you blow this picture up? _ I will blow up this snapshot and frame it."
        },
        {
            "id": 150,
            "phrase": "blow the joint",
            "definition": "Sl. to get out of a place, usually in a hurry or without delay.  Come on, let’s blow the joint before there’s trouble.  They blew the joint about an hour ago."
        },
        {
            "id": 151,
            "phrase": "blow the lid off (something)",
            "definition": "Sl. to expose something to public view. The police inspector blew the lid off the work of the gang of thugs. The investigation blew the lid off the scandal."
        },
        {
            "id": 152,
            "phrase": "blow the whistle (on someone)",
            "definition": "1. Fig. to report someone’s wrongdoing to someone (such as the police) who can stop the wrongdoing. (Alludes to blowing a whistle to attract the police.) _ The citizens’ group blew the whistle on the street gangs by calling the police.  The gangs were getting very bad. It was definitely time to blow the whistle. 2. Fig. to report legal or regulatory wrongdoing of a company, especially one’s employer, to authorities.  She was fired for blowing the whistle on the bank’s mismanagement of accounts, but she then sued the bank."
        },
        {
            "id": 153,
            "phrase": "blow up",
            "definition": "[for something] to explode.  The bomb might have blown up if the children had tried to move it.  The firecracker blew up."
        },
        {
            "id": 154,
            "phrase": "blow up in someone’s face",
            "definition": "to blow up or explode suddenly. The bomb blew up in the terrorist’s face. The firecracker blew up in his face and injured him."
        },
        {
            "id": 155,
            "phrase": "blue blood",
            "definition": "1. Fig. the blood [heredity] of a noble family; aristocratic ancestry.  The earl refuses to allow anyone who is not of blue blood to marry his son.  Although Mary’s family is poor, she has blue blood in her veins. 2. Fig. a person of aristocratic or wealthy ancestry. Because his great-grandparents made millions, he is regarded as one of the city’s blue bloods."
        },
        {
            "id": 156,
            "phrase": "blue collar",
            "definition": "of the lower class or working class; of a job or a worker, having to do with manual labor. (Also, when used as an attributive adjective, often blue-collar. Com- pare this with white collar. Alludes to the typical color of work shirts worn by mechanics, laborers, etc.) _His parents were both blue-collar workers. He was the first person in his family to go to college.  They bought a house in a nice, settled, blue-collar neighborhood."
        },
        {
            "id": 157,
            "phrase": "*the blues",
            "definition": "1. sadness; a mood of depression. (*Typically: get ~; have ~.) _ You’ll have to excuse Bill. He’s getting the blues thinking about Jane.  I get the blues every time I hear that song. 2. a traditional style of popular music characterized by lyrics expressing hardship, lost love, etc. Buddy had been singing the blues ever since the Depression."
        },
        {
            "id": 158,
            "phrase": "bluff one’s way out (of something)",
            "definition": "to get out of a difficult situation by deception or cunning. I will try to bluff my way out of this mess."
        },
        {
            "id": 159,
            "phrase": "bluff someone into something",
            "definition": "to mislead or deceive someone into doing something.  Are you trying to bluff me into giving up without a fight? _ I won’t be bluffed into revealing the whereabouts of the safe."
        },
        {
            "id": 160,
            "phrase": "bluff someone out (of something)",
            "definition": "to get something away from someone through deception. We bluffed her out of her share of the pie.  I bluffed Liz out of her rightful turn to drive."
        },
        {
            "id": 161,
            "phrase": "blurt something out† (at someone)",
            "definition": "to say something to someone without thinking. (Usually to say something that should not be said.) _ It was a secret. Why did you blurt it out? _ Why did you blurt out our hiding place?"
        },
        {
            "id": 162,
            "phrase": "blush with something",
            "definition": "[for someone’s cheeks] to redden from a particular emotion or reaction. She blushed with shame.  You could see that Lily was blushing with anger, even though she tried to conceal it."
        },
        {
            "id": 163,
            "phrase": "board someone or an animal out†",
            "definition": "to send someone or an animal away to live, temporarily. (Usually said of a schoolage child or a pet.) _ They decided to board Billy out.  They boarded out the dog while they were on vacation."
        },
        {
            "id": 164,
            "phrase": "board something up†",
            "definition": "to enclose or seal a building or part of a building with boards or panels.  We will have to board this house up if we can’t sell it.  Should I board up the house while I am away that season?"
        },
        {
            "id": 165,
            "phrase": "board with someone",
            "definition": "to live with someone temporarily, usually while paying to do so. I will board with my aunt when I go to school in Adamsville. I do not wish to board with relatives."
        },
        {
            "id": 166,
            "phrase": "bode somehow for someone or something",
            "definition": "to foretell or portend fortune or misfortune for someone or something. (Typically with ill or well.) _ Things do not bode well for the stock market. Things do not bode well for your future at this job."
        },
        {
            "id": 167,
            "phrase": "bodily functions",
            "definition": "Euph. anything the body does automatically or as a normal occurrence, especially urinating and defecating.  The dog needed to go outside and perform her bodily functions.  It is not polite to discuss bodily functions at the dinner table."
        },
        {
            "id": 168,
            "phrase": "the body politic",
            "definition": "the people of a country or state considered as a political unit.  The body politic was unable to select between the candidates."
        },
        {
            "id": 169,
            "phrase": "bog down",
            "definition": "to become encumbered and slow. (As if one were walking through a bog and getting stuck in the mud. Often preceded by a form of get.) _ The process bogged down and almost stopped. The truck got bogged down in the mud soon after it started."
        },
        {
            "id": 170,
            "phrase": "*bogged down",
            "definition": "stuck; prevented from making progress. (*Typically: be ~; get ~; become ~.) _The students became bogged down with the algebra problems.  The Smiths really got bogged down in decorating their house."
        },
        {
            "id": 171,
            "phrase": "boggle at something",
            "definition": "to be amazed at something, particularly something large or surprising.  The audience boggled at the size of the loss.  I boggled at the damage to my car."
        },
        {
            "id": 172,
            "phrase": "boggle someone’s mind",
            "definition": "to confuse someone; to overwhelm someone; to blow someone’s mind. The immense size of the house boggles my mind. She said that his arrogance boggled her mind."
        },
        {
            "id": 173,
            "phrase": "boil over",
            "definition": "[for a liquid] to overflow while being boiled.  The sauce boiled over and dripped onto the stove.  Don’t let the stew boil over!"
        },
        {
            "id": 174,
            "phrase": "boil over (with something)",
            "definition": "[for someone] to erupt in great anger.  The boss boiled over with anger.  Things got out of hand and the crowd’s passions boiled over."
        },
        {
            "id": 175,
            "phrase": "boil something away†",
            "definition": "to boil a liquid until it is gone altogether.  She left the kettle on and boiled the water away.  Boil away some of that water."
        },
        {
            "id": 176,
            "phrase": "boil something down†",
            "definition": "to condense or thicken something, such as a liquid. I have to boil this gravy down for a while before I can serve it. You boil down the sauce and I’ll set the table."
        },
        {
            "id": 177,
            "phrase": "boil something up†",
            "definition": "Rur. to cook a batch of food by boiling.  She boiled some beans up for dinner.  She boiled up some potatoes."
        },
        {
            "id": 178,
            "phrase": "boil with something",
            "definition": "to show the heat or intensity of one’s anger.  You could see that she was just boiling with anger.  Tom was boiling with rage when we got there."
        },
        {
            "id": 179,
            "phrase": "*bold as brass",
            "definition": "very bold; bold to the point of rudeness. (*Also: as ~.) _ Lisa marched into the manager’s office, bold as brass, and demanded her money back.  The tiny kitten, as bold as brass, began eating the dog’s food right under the dog’s nose."
        },
        {
            "id": 180,
            "phrase": "bollix something up†",
            "definition": "Inf. to ruin something; to mess something up.  Please don’t bollix my stereo up.  Who bollixed up the folded laundry?"
        },
        {
            "id": 181,
            "phrase": "bolster someone up†",
            "definition": "to give someone emotional support and encouragement.  We bolstered her up the best we could, but she was still unhappy.  I don’t mind bolstering up people who are depressed."
        },
        {
            "id": 182,
            "phrase": "bolster something up†",
            "definition": "to give added support to something.  The carpenter bolstered the shelf up with a nail or two.  I had to bolster up the door or it would have fallen in."
        },
        {
            "id": 183,
            "phrase": "a bolt from the blue",
            "definition": "a sudden surprise. (Alludes to a stroke of lightning from a cloudless sky.) _ Joe’s return to Springfield was a bolt from the blue.  The news that Mr. and Mrs. King were getting a divorce struck all their friends as a bolt from the blue."
        },
        {
            "id": 184,
            "phrase": "bolt out (of some place)",
            "definition": "to run out of some place very quickly.  Frank bolted out of the room in a f lash.  I bolted out after him."
        },
        {
            "id": 185,
            "phrase": "bolt something down†",
            "definition": "to fasten something down securely with bolts.  Did anyone bolt the washing machine down? _ Someone should bolt down this washing machine."
        },
        {
            "id": 186,
            "phrase": "bomb out (of something)",
            "definition": "Sl. to flunk out of or fail at something, especially school or a job.  She was afraid she would bomb out of school.  Her brother bombed out the year before."
        },
        {
            "id": 187,
            "phrase": "bomb someone out†",
            "definition": "to cause people to flee by bombing their homes and towns. The planes bombed the villagers out.  The attack bombed out everyone for miles around."
        },
        {
            "id": 188,
            "phrase": "bomb something out†",
            "definition": "to destroy a place by bombing.  I hope they don’t bomb the village out. The planes bombed out the factory."
        },
        {
            "id": 189,
            "phrase": "bombard someone or something with something",
            "definition": "to cast or shoot something at someone or something.  The boys bombarded their friends with snowballs.  Gerald bombarded his friends with criticism."
        },
        {
            "id": 190,
            "phrase": "bombard someone with questions",
            "definition": "to ask someone many questions, one after another. The press bombarded the president with questions. The company spokesperson was bombarded with leading questions."
        },
        {
            "id": 191,
            "phrase": "bone of contention",
            "definition": "the subject or point of an argument; an unsettled point of disagreement. We’ve fought for so long that we’ve forgotten what the bone of contention is. The question of a fence between the houses has become quite a bone of contention."
        },
        {
            "id": 192,
            "phrase": "bone up (on something)",
            "definition": "to study something thoroughly; to review the facts about something.  I have to bone up on the state driving laws because I have to take my driving test tomorrow. I take mine next month, so I’ll have to bone up, too."
        },
        {
            "id": 193,
            "phrase": "booby prize",
            "definition": "a mock prize given to the worst player or performer. Bob should get the booby prize for the worst showing in the race."
        },
        {
            "id": 194,
            "phrase": "boogie down (to somewhere)",
            "definition": "Sl. to hurry (to somewhere); to go (somewhere).  So, why don’t you boogie down to the store and load up with goodies for the weekend? _ I’m gonna boogie down and see what’s going on."
        },
        {
            "id": 195,
            "phrase": "book (on) out",
            "definition": "Sl. to leave in a hurry; to depart very suddenly and rapidly.  I’m in a hurry, so I’ve got to book out right now.  Let’s book on out of this place as soon as we can."
        },
        {
            "id": 196,
            "phrase": "book someone on something",
            "definition": "to reserve a place for someone on some travel conveyance.  They booked us on a direct f light to San Juan.  He booked himself on a f light to Manaus."
        },
        {
            "id": 197,
            "phrase": "book someone through (to some place)",
            "definition": "to make transportation arrangements for someone that involve a number of changes and transfers.  The travel agent booked me through to Basra.  I would be happy to book you through if you would like."
        },
        {
            "id": 198,
            "phrase": "book something up†",
            "definition": "to reserve all the available places.  The travel agency booked all the good seats up.  Who booked up all these seats?"
        },
        {
            "id": 199,
            "phrase": "boom out",
            "definition": "[for a loud sound] to sound out like thunder.  His voice boomed out such that everyone could hear.  An explosion boomed out and frightened us all."
        },
        {
            "id": 200,
            "phrase": "boom something out†",
            "definition": "[for someone] to say something very loud; to shout. Will someone with a loud voice boom the names out? _ The announcer boomed out the names of the players."
        },
        {
            "id": 201,
            "phrase": "boost someone up†",
            "definition": "to give someone a helpful lift up to something. She boosted me up so I could get into the window.  They boosted up the child for a better view."
        },
        {
            "id": 202,
            "phrase": "*the boot",
            "definition": "dismissal from employment or from a place that one is in. (*Typically: get ~; give someone ~.) _I guess I wasn’t dressed well enough to go in there. They gave me the boot.  I’ll work harder at my job today. I nearly got the boot yesterday."
        },
        {
            "id": 203,
            "phrase": "boot something up†",
            "definition": "to start up a computer.  She booted her computer up and started writing.  Please go boot up your computer so we can get started."
        },
        {
            "id": 204,
            "phrase": "boot up",
            "definition": "[of a computer] to begin operating; to start up one’s computer. He turned on the computer and it booted up.  Try to boot up again and see what happens."
        },
        {
            "id": 205,
            "phrase": "booze it up",
            "definition": "Sl. to drink heavily; to drink to get drunk. (Fixed order.) _ She wanted to get home and booze it up by herself.  He boozes it up every Friday after work."
        },
        {
            "id": 206,
            "phrase": "booze up",
            "definition": "Sl. to drink heavily.  Those guys are always boozing up.  Stop boozing up and go home."
        },
        {
            "id": 207,
            "phrase": "border (up)on something",
            "definition": "[for something] to touch upon a boundary. (Upon is more formal and less commonly used than on.) _ Our property borders on the lakeshore.  The farm borders upon the railroad tracks."
        },
        {
            "id": 208,
            "phrase": "bore the pants off of someone",
            "definition": "to be exceedingly dull and uninteresting to someone.  You bore the pants off of me! _ The lecture bored the pants off of everybody."
        },
        {
            "id": 209,
            "phrase": "bore through someone",
            "definition": "[for someone’s gaze] to seem to penetrate the person being gazed or stared at.  Her stare bored right through me."
        },
        {
            "id": 210,
            "phrase": "bore through something",
            "definition": "to pierce or drill through something. The drill bit could not bore through the steel plate."
        },
        {
            "id": 211,
            "phrase": "born on the wrong side of the blanket",
            "definition": "Rur. [of a child] illegitimate.  All his life, Edward felt that people looked down on him because he was born on the wrong side of the blanket.  Just between you and me, I suspect Mrs. Potter’s oldest child was born on the wrong side of the blanket."
        },
        {
            "id": 212,
            "phrase": "born out of wedlock",
            "definition": "born to an unmarried mother.  The child was born out of wedlock. In the city many children are born out of wedlock."
        },
        {
            "id": 213,
            "phrase": "born with a silver spoon in one’s mouth",
            "definition": "born into wealth and privilege.  James doesn’t know anything about working for a living; he was born with a silver spoon in his mouth.  Most of the students at the exclusive private college were born with silver spoons in their mouths."
        },
        {
            "id": 214,
            "phrase": "borrow something",
            "definition": "Euph. to steal something.  The bank robber borrowed a car to drive out of state.  I discovered that my office mate had been borrowing money out of my wallet when I wasn’t looking."
        },
        {
            "id": 215,
            "phrase": "borrow something from someone",
            "definition": "to request and receive the use of something from someone.  Can I borrow a hammer from you? _ Sorry, this hammer was borrowed from my father."
        },
        {
            "id": 216,
            "phrase": "borrow trouble",
            "definition": "to worry needlessly; to make trouble for oneself.  Worrying too much about death is just borrowing trouble.  Do not get involved with politics. That’s borrowing trouble."
        },
        {
            "id": 217,
            "phrase": "boss someone around†",
            "definition": "to give orders to someone; to keep telling someone what to do. Stop bossing me around. I’m not your employee.  Captain Smith bosses around the whole crew. That’s his job."
        },
        {
            "id": 218,
            "phrase": "botch something up†",
            "definition": "to mess something up; to do a bad job of something.  You really botched this up.  I did not botch up your project."
        },
        {
            "id": 219,
            "phrase": "both sheets in the wind",
            "definition": "intoxicated. (A ship’s sheets are the ropes or lines that control the sails. See also three sheets in the wind.) _She’s both sheets in the wind at the moment.  She’s not just both sheets in the wind—they’re all in the wind."
        },
        {
            "id": 220,
            "phrase": "bother about something",
            "definition": "to care about something; to take the trouble to deal with something.  Please don’t bother about this mess. I’ll clean it up.  Don’t bother about it."
        },
        {
            "id": 221,
            "phrase": "bother one’s (pretty little) head about someone or something",
            "definition": "Rur. to worry about something. (Stereotypically polite Southern talk to a woman; often said facetiously or patronizingly.) _ Now, don’t bother your pretty little head about all this.  Don’t bother your head about me."
        },
        {
            "id": 222,
            "phrase": "bother with someone or something",
            "definition": "to take the time or trouble to deal with someone or something. (Usually negative.) _ Please don’t bother with Jill. She can take care of herself.  Don’t bother me with your problems."
        },
        {
            "id": 223,
            "phrase": "the bottle",
            "definition": "drinking alcohol.  His friends thought he was a bit too fond of the bottle.  She tried to stay away from the bottle, but she never could manage it for long."
        },
        {
            "id": 224,
            "phrase": "the bottom fell out (of something)",
            "definition": "a much lower limit or level of something was reached.  The bottom fell out of the market and I lost a lot of money."
        },
        {
            "id": 225,
            "phrase": "the bottom line",
            "definition": "the last figure on a financial profitand- loss statement, or on a bill. What’s the bottom line? How much do I owe you? _ Don’t tell me all those figures! Just tell me the bottom line."
        },
        {
            "id": 226,
            "phrase": "bottom out",
            "definition": "to reach the lowest or worst point of something.  All my problems seem to be bottoming out. They can’t get much worse.  Interest rates bottomed out last February."
        },
        {
            "id": 227,
            "phrase": "bounce along",
            "definition": "to move along bouncing. (As might be done by a ball.) _ The ball bounced along and finally came to rest.  The beach ball sort of bounced along until it came to the water."
        },
        {
            "id": 228,
            "phrase": "bounce off ((of ) something)",
            "definition": "to rebound from something. (Of is usually retained before pronouns.) _ The ball bounced off the wall and struck a lamp.  It hit the wall and bounced off."
        },
        {
            "id": 229,
            "phrase": "bounce out (of something)",
            "definition": "to rebound out of or away from something. The ball bounced out of the corner into my hands.  The ball bounced out of the box it had fallen into."
        },
        {
            "id": 230,
            "phrase": "bounce something around† (with someone)",
            "definition": "to discuss something with a number of people; to move an idea from person to person like a ball. I need to bounce this around with my family. I need to bounce around something with you."
        },
        {
            "id": 231,
            "phrase": "bounce something back and forth",
            "definition": "to bat, toss, or throw something alternately between two people. (Usually a ball.) _The two guys bounced the ball back and forth.  John and Timmy bounced it back and forth."
        },
        {
            "id": 232,
            "phrase": "bounce up and down",
            "definition": "to spring up and down due to natural elasticity or from being jostled or thrown. The ball bounced up and down for an amazingly long time.  I bounced up and down in the back of that truck for almost an hour."
        },
        {
            "id": 233,
            "phrase": "bound and determined",
            "definition": "Cliché very determined; very committed or dedicated (to something). We were bound and determined to get there on time.  I’m bound and determined that this won’t happen again."
        },
        {
            "id": 234,
            "phrase": "bound for somewhere",
            "definition": "headed for a specific goal or destination.  Bill accidentally got on a bus bound for Miami.  Our baseball team is bound for glory."
        },
        {
            "id": 235,
            "phrase": "bound hand and foot",
            "definition": "with hands and feet tied up.  The robbers left us bound hand and foot.  We remained bound hand and foot until the police found us and untied us."
        },
        {
            "id": 236,
            "phrase": "bound to do something",
            "definition": "certain to do something; destined to do something.  Jill’s bound to do a good job.  We are bound to tell the truth."
        },
        {
            "id": 237,
            "phrase": "bound up with someone or something",
            "definition": "deeply concerned or involved with someone or something. He’s so bound up with his work, he has time for nothing else.  Andrew is bound up with his girlfriend and has time for no one else."
        },
        {
            "id": 238,
            "phrase": "bow and scrape",
            "definition": "to be very humble and subservient. Please don’t bow and scrape. We are all equal here. The salesclerk came in, bowing and scraping, and asked if he could help us."
        },
        {
            "id": 239,
            "phrase": "bow before someone or something",
            "definition": "to bend or curtsy in respect to someone or something.  I will not bow before any king or queen. Henry insisted that I bow before him."
        },
        {
            "id": 240,
            "phrase": "bow out (of some place)",
            "definition": "to bow as one departs from a place. The servant bowed out of the room. The servant departed, bowing out as he left."
        },
        {
            "id": 241,
            "phrase": "bow out (of something)",
            "definition": "to retire or resign as something. It’s time to bow out as mayor. I think I will bow out and leave this job to someone else."
        },
        {
            "id": 242,
            "phrase": "bow to someone’s demands",
            "definition": "to yield to someone’s demands; to agree to do something that someone has requested.  In the end, they had to bow to our demands. We refused to bow to their demands that we abandon the project."
        },
        {
            "id": 243,
            "phrase": "bow to the porcelain altar",
            "definition": "Sl. to vomit, especially as a result of drinking too much alcohol. (The porcelain altar is a euphemism for a toilet bowl.) _ He spent the whole night bowing to the porcelain altar. I have the feeling that I will be bowing to the porcelain altar before morning."
        },
        {
            "id": 244,
            "phrase": "bowl someone over",
            "definition": "to knock someone over. (Fixed order.) _ We were bowled over by the wind.  Bob hit his brother and bowled him over."
        },
        {
            "id": 245,
            "phrase": "bowl up",
            "definition": "to fill a pipe bowl with smokable material. The detective bowled up and struck a match.  Roger bowled up, but forgot to light his pipe."
        },
        {
            "id": 246,
            "phrase": "box someone in†",
            "definition": "to put someone into a bind; to reduce the number of someone’s alternatives.  I don’t want to box you in, but you are running out of options.  I want to box in the whole staff, so they’ll have to do it my way."
        },
        {
            "id": 247,
            "phrase": "box someone or something in†",
            "definition": "to trap or confine someone or something.  He boxed her in so she could not get away from him.  They tried to box in the animals, but they needed more space.  Don’t try to box me in."
        },
        {
            "id": 248,
            "phrase": "box someone up†",
            "definition": "to confine someone in a small area.  Please don’t box me up in that little office. The boss boxed up Fred in a tiny office.  Why the president boxes himself up in such a little office is beyond me."
        },
        {
            "id": 249,
            "phrase": "box something up†",
            "definition": "to place something in a box.  Please box the books up and put them into the trunk of the car.  Please box up four of these for me."
        }
    ]
}