{
    "dictionary": [
        {
            "id": 0,
            "phrase": "press (up)on someone or something",
            "definition": "to put pressure on someone or something. (Upon is formal and less commonly used than on.) _The crowd pressed upon the child, squeezing out all his breath. The load presses on your car’s springs very heavily."
        },
        {
            "id": 1,
            "phrase": "pressure someone into something",
            "definition": "to force someone into doing something.  Please don’t try to pressure me into taking that promotion.  You can’t pressure me into it. I won’t do it!"
        },
        {
            "id": 2,
            "phrase": "presume (up)on someone or something",
            "definition": "to take unwelcome advantage of someone or something.  I didn’t mean to seem to presume upon you. I apologize. I did not feel that you presumed on me."
        },
        {
            "id": 3,
            "phrase": "pretend to something",
            "definition": "to claim to have a skill or quality.  I can hardly pretend to the artistry that Wally has, but I can play the piano a bit.  I can’t pretend to that level of skill."
        },
        {
            "id": 4,
            "phrase": "*pretty as a picture",
            "definition": "very pretty. (*Also: as ~.) _Sweet little Mary is as pretty as a picture.  Their new house is pretty as a picture."
        },
        {
            "id": 5,
            "phrase": "Pretty is as pretty does.",
            "definition": "Prov. It is more important to treat people well than to be good-looking; just because you are good-looking does not mean you are a good person. (Said only of girls and women.) _ Janice may have a pretty face, but pretty is as pretty does; the way she behaves isn’t pretty at all."
        },
        {
            "id": 6,
            "phrase": "pretty oneself or something up†",
            "definition": "Rur. to make oneself or something more attractive; to tidy oneself or something up.  I tried to pretty myself up for him, but he didn’t notice.  Let’s try to pretty up this room."
        },
        {
            "id": 7,
            "phrase": "a pretty pickle",
            "definition": "a difficult situation. (Pickle = a bad situation.) _ Well, this is a pretty pickle you’ve gotten us into."
        },
        {
            "id": 8,
            "phrase": "Pretty please?",
            "definition": "an emphasised form of please? _ Pretty please? I need an answer! _ Can I have my book back? Pretty please?"
        },
        {
            "id": 9,
            "phrase": "prevail against someone or something",
            "definition": "to win out over someone or something; to dominate someone or something.  You will not prevail against me! _ I am sure that our team will prevail against the challengers."
        },
        {
            "id": 10,
            "phrase": "prevail (up)on someone or something (to do something)",
            "definition": "to appeal to someone or a group to do something. (Upon is formal and less commonly used than on.) _ I will prevail upon her to attend the meeting.  I prevailed on the committee to no avail."
        },
        {
            "id": 11,
            "phrase": "prevent someone from doing something",
            "definition": "to keep someone from doing something. You can’t prevent me from doing it! _ We must try to prevent her from going back there."
        },
        {
            "id": 12,
            "phrase": "Prevention is better than cure.",
            "definition": "Prov. It is better to try to keep a bad thing from happening than it is to fix the bad thing once it has happened.  If we spend more money on education, so that children learn to be responsible citizens, we won’t have to spend so much money on prisons. Prevention is better than cure."
        },
        {
            "id": 13,
            "phrase": "prey on something",
            "definition": "[for an animal] to feed on another animal as a matter of habit or preference.  Owls prey on mice.  Many birds prey on snakes."
        },
        {
            "id": 14,
            "phrase": "prey (up)on someone or something",
            "definition": "to take advantage of someone or something.  The people of that island prey on tourists and do not give them good treatment.  I really don’t want to seem to prey upon your kindness."
        },
        {
            "id": 15,
            "phrase": "*a price on one’s head",
            "definition": "a reward for one’s capture. (*Typically: get ~; have ~; put ~; place ~.) _ We captured a thief who had a price on his head, and the sheriff gave us the reward.  The crook was so mean, he turned in his own brother, who had a price on his head."
        },
        {
            "id": 16,
            "phrase": "the price one has to pay",
            "definition": "the sacrifice that one has to make; the unpleasantness that one has to suffer.  Being away from home a lot is the price one has to pay for success."
        },
        {
            "id": 17,
            "phrase": "price someone or something out of the market",
            "definition": "to raise or lower a price and drive someone or something out of the marketplace.  You are a very good singer, but your agent has priced you out of the market.  The discount prices posted by the chain store were meant to price us out of the market."
        },
        {
            "id": 18,
            "phrase": "price something down†",
            "definition": "to lower the price of something.  When they start pricing this stuff down at the end of the season, I’ll come in and buy something.  I hope to price down the merchandise soon."
        },
        {
            "id": 19,
            "phrase": "price something out",
            "definition": "to list and total all the component prices of goods and services for a complex project.  I have finished listing all the materials required for the project, and now I have to price it out so that we can decide if we can afford it."
        },
        {
            "id": 20,
            "phrase": "price something up†",
            "definition": "to raise the price of something. They have priced oranges up so high that I can’t afford any.  Why do they price up these common foods so high?"
        },
        {
            "id": 21,
            "phrase": "pride and joy",
            "definition": "something or someone that one is very proud of. (Often in reference to a baby, a car, a house, etc. Fixed order.) _ And this is our little pride and joy, Roger.  Fred pulled up in his pride and joy and asked if I wanted a ride."
        },
        {
            "id": 22,
            "phrase": "prime mover",
            "definition": "the force that sets something going; someone or something that starts something off.  The assistant manager was the prime mover in getting the manager sacked. Discontent with his job was the prime mover in John’s deciding to retire early."
        },
        {
            "id": 23,
            "phrase": "prime something with something",
            "definition": "to enable something to start working or functioning with something.  Larry primed the pump with a little water, and it began to do its work. We will prime the market for our new product with a free coupon offer."
        },
        {
            "id": 24,
            "phrase": "primp (oneself) up",
            "definition": "to get dressed up; to fix oneself up by combing, brushing, adjusting, etc.  Let me stop in the powder room and primp myself up a bit.  I have to go in here and primp up."
        },
        {
            "id": 25,
            "phrase": "the primrose path",
            "definition": "earthly delights that come to an end.  She led him down the primrose path until she got tired of him."
        },
        {
            "id": 26,
            "phrase": "print something in something",
            "definition": "1. to make block letters in a specific location on a paper.  Please print your name in the box.  Would you please print the information in the space provided? 2. to publish something in a publication.  They printed my letter in today’s paper.  Her stories have been printed in several magazines."
        },
        {
            "id": 27,
            "phrase": "print something out†",
            "definition": "1. to write something out by using block letters.  Please print it out. I can’t read your handwriting.  Print out your name, please. 2. to use a com- puter printer to print something.  I will print a copy out and send it to you.  Please print out another copy."
        },
        {
            "id": 28,
            "phrase": "print something up†",
            "definition": "to set something in type and print it; to print something by any process.  This looks okay to me. Let’s print it up now.  Print up the final version."
        },
        {
            "id": 29,
            "phrase": "privy to something",
            "definition": "knowledgeable about something secret or private.  The reporter became privy to the senator’s evil plan.  Why are you privy to this secret information?"
        },
        {
            "id": 30,
            "phrase": "prize someone or something above someone or something",
            "definition": "to value someone or something more than anyone or anything else.  He prized his only daughter above everyone else in the world. Scott seemed to prize his sports car above all the members of his family."
        },
        {
            "id": 31,
            "phrase": "probe into something",
            "definition": "to investigate something.  The police will probe into the matter and report to the commissioner.  We will take some time and probe into that for you."
        },
        {
            "id": 32,
            "phrase": "probe something for something",
            "definition": "to poke around in something for something.  He probed his memory for some clue as to where he had been on that date.  Sam probed the darkened space for the tool that he had mislaid."
        },
        {
            "id": 33,
            "phrase": "proceed against someone or something",
            "definition": "1. to begin to move against someone or something. The entire platoon proceeded against the single enemy soldier who refused to surrender.  The army proceeded against the fortress as planned. 2. to start legal action against someone or something.  The district attorney will proceed against the suspect next week.  The state prosecutor will proceed against the company as soon as one of the witnesses is located."
        },
        {
            "id": 34,
            "phrase": "proceed (from something) (to something)",
            "definition": "to go from something or some place to something or some place.  Next, we will proceed from Vienna to Budapest. We proceeded from Detroit, passing through rural Michigan."
        },
        {
            "id": 35,
            "phrase": "proceed with something",
            "definition": "to move ahead with something; to continue something.  Now, we will proceed with the reading of the minutes of the last meeting. When will you proceed with the needed action?"
        },
        {
            "id": 36,
            "phrase": "Procrastination is the thief of time.",
            "definition": "Prov. If you put off doing what you ought to do, you will end up not having enough time to do it properly. Jim: Have you started looking for a job yet? Jane: Oh, that can wait till tomorrow. Jim: Procrastination is the thief of time."
        },
        {
            "id": 37,
            "phrase": "procure something (from someone or something) (for someone or something)",
            "definition": "to get something from someone or something for someone or some purpose.  I will procure a copy of the paper from Kelly for you.  I have to procure a book for my sister."
        },
        {
            "id": 38,
            "phrase": "prod at someone or something",
            "definition": "to poke at someone or something.  The boys prodded at the prone body of the man to see if he was dead or sleeping.  If you prod at the turtle, it will never come out of its shell."
        },
        {
            "id": 39,
            "phrase": "prod someone into something",
            "definition": "to motivate someone into doing something; to provoke someone into action.  Do I have to prod you into going? Can’t you volunteer for once? _ We will prod her into getting it done on time."
        },
        {
            "id": 40,
            "phrase": "produce something for something",
            "definition": "1. to make something for some purpose.  This production line produces brackets for the installation of the circuit boards in the next production line. We produce the seats for the trucks that they assemble on the other side of town. 2. to bring something out for some purpose.  Lee quickly produced a penknife for cutting the string on the package.  Ruth can always produce the right tool for the job."
        },
        {
            "id": 41,
            "phrase": "produce something from something",
            "definition": "to create something from something; to make something out of something.  We are able to produce a high-quality writing paper from the scraps we trim off the edges of the books as we bind them. Jane produces an excellent jelly from the grapes she grows in her backyard."
        },
        {
            "id": 42,
            "phrase": "progress to something",
            "definition": "to reach all the way to something or some place. The crisis has progressed to its final stage.  Things had progressed to a serious stage where nothing more could be done for him."
        },
        {
            "id": 43,
            "phrase": "progress toward something",
            "definition": "to move partway toward some goal.  Nancy is progressing toward her degree quite nicely.  We are progressing toward the end of the project."
        },
        {
            "id": 44,
            "phrase": "progress with something",
            "definition": "to continue to move toward something or completing something.  I can’t seem to progress with this project.  How are you progressing with the building of your model ship?"
        },
        {
            "id": 45,
            "phrase": "prohibit someone from something",
            "definition": "1. to prevent someone from doing something. The committee voted to prohibit people from leaving before the meeting was over.  They prohibit anyone from being seated after the first act has started. 2. to keep someone out of some place. Our policy is to prohibit people from the beach area after dark.  State law prohibits children from this dangerous area while the machines are running."
        },
        {
            "id": 46,
            "phrase": "prohibit something from something",
            "definition": "1. to prevent something from happening or from doing something.  My mother prohibits me from going out with friends on school nights.  Why do you want to prohibit the cars from traveling on this street during rush hour? 2. to keep something out of or away from something or some place.  The law prohibited bicycles from the sidewalks.  The city council prohibits unleashed dogs from the public parks."
        },
        {
            "id": 47,
            "phrase": "project into something",
            "definition": "to extend into something.  The end of the grand piano projected into the next room, but she had to have a grand, nonetheless. The front of the car projected into the flower bed when it was parked, but that was all right."
        },
        {
            "id": 48,
            "phrase": "project something onto someone",
            "definition": "to imagine that someone else experiences one’s feelings, especially one’s guilt or anger.  Since you project your anger onto your best friends, you imagine you have gathered a number of angry people around you.  You should not project your feelings onto other people."
        },
        {
            "id": 49,
            "phrase": "promise something to someone",
            "definition": "to pledge something to someone. I promised this vase to my niece. Is this book promised to anyone?"
        },
        {
            "id": 50,
            "phrase": "Promises are like piecrust, made to be broken.",
            "definition": "Prov. It is useless to make promises, because people always break their promises.  Lisa made Andrew promise not to drink anymore, but promises are like piecrust, made to be broken."
        },
        {
            "id": 51,
            "phrase": "promote someone (from something) (to something)",
            "definition": "to raise someone’s rank from something to something.  They promoted her from teller to vice president. Carl promoted his daughter to supervisor."
        },
        {
            "id": 52,
            "phrase": "prone to something",
            "definition": "likely to [do] something; apt to have something. My boss is prone to anger when my work isn’t done on schedule.  My sister is prone to sneezing because of her allergies."
        },
        {
            "id": 53,
            "phrase": "pronounce something on someone or something",
            "definition": "to make a statement, usually a judgment, about someone or something. The judge pronounced final judgment on the prisoner. The family all pronounced a positive opinion on the cake."
        },
        {
            "id": 54,
            "phrase": "The proof is in the pudding.",
            "definition": "Prov. You cannot be sure that you have succeeded until you have examined the result of your efforts.  Jill: I think we’ve done a good job of fixing the lawn mower. Jane: Well, the proof is in the pudding. We haven’t tried to mow the lawn with it yet."
        },
        {
            "id": 55,
            "phrase": "prop someone or something up† (against someone or something)",
            "definition": "to stand or lean someone or something against someone or something.  He was so tired I had to prop him up against the wall while I looked for the door key.  I propped up the man against the wall.  I propped the mop up against the wall."
        },
        {
            "id": 56,
            "phrase": "A prophet is not without honor save in his own country.",
            "definition": "Prov. Everyone recognizes that a wise person is wise, except for the people close to him or her. (Biblical.) _No one in the novelist’s country would publish her books, but last year she won the Nobel Prize. A prophet is not without honor save in his own country."
        },
        {
            "id": 57,
            "phrase": "propose a toast",
            "definition": "to make a toast before a celebratory drink.  I’d like to propose a toast in honor of your birthday. At the wedding reception, the bride’s father proposed a toast to the new couple."
        },
        {
            "id": 58,
            "phrase": "propose something to someone",
            "definition": "to suggest something to someone.  I have an idea I would like to propose to you.  Sam wanted to propose a new plan to Sarah."
        },
        {
            "id": 59,
            "phrase": "propose to someone",
            "definition": "to suggest marriage to someone, usually a male to a female.  Guess who proposed to me last night? _ Do you think that Sam will propose to Mary?"
        },
        {
            "id": 60,
            "phrase": "prospect for something",
            "definition": "to search for something, especially for metals or minerals.  The old men said they were prospecting for gold.  What are they prospecting for out in the desert?"
        },
        {
            "id": 61,
            "phrase": "prosper from something",
            "definition": "to gain wealth from something.  Carla prospered from trading on the options exchange.  I hope you prosper from your new enterprise."
        },
        {
            "id": 62,
            "phrase": "prostrate oneself before someone or something",
            "definition": "to lay oneself out in respect or obedience in front of someone or something.  The members of the cult prostrated themselves before their leader. They prostrated themselves before the altar."
        },
        {
            "id": 63,
            "phrase": "protrude from someone or something",
            "definition": "to stick out from someone or something. Even in the dark, I knew he was hurt because I could see the knife protruding from him.  A knife protruded from the victim’s back."
        },
        {
            "id": 64,
            "phrase": "prove oneself as something",
            "definition": "to demonstrate that one can serve in a certain office or capacity. It’s time to promote her. She has proved herself as a teller.  I proved myself as an investor by making a lot of money in the stock market."
        },
        {
            "id": 65,
            "phrase": "prove something to someone",
            "definition": "to substantiate a claim about something to someone; to make someone believe or accept a statement about something.  What do I have to do to prove my innocence to you? _Nothing you say will prove it to me."
        },
        {
            "id": 66,
            "phrase": "prove to be something",
            "definition": "to be shown to be someone or something; to be found to be someone or something.  Susan proved to be a good friend when she lent me some money.  The food proved to be spoiled when I smelled it."
        },
        {
            "id": 67,
            "phrase": "provide against something",
            "definition": "to plan against something happening.  Have you provided against the possible collapse of the agreement? _ We have not provided against financial disaster."
        },
        {
            "id": 68,
            "phrase": "provide for someone or something",
            "definition": "to supply the needs of someone or something. Don’t worry, we will provide for you.  We will provide for the committee in the budget."
        },
        {
            "id": 69,
            "phrase": "provide someone with something",
            "definition": "to supply something to someone.  I will provide you with an escort to your car. Jane provided herself with just enough food to get through the weekend."
        },
        {
            "id": 70,
            "phrase": "provide something for someone or something",
            "definition": "to supply something for someone or something.  I will provide salad for the guests.  Ted provided food for his dog."
        },
        {
            "id": 71,
            "phrase": "provide something under something",
            "definition": "to supply something in keeping with a contract, rule, guideline, agreement, etc.  We have agreed to provide two tons of coal per month under our contract. Do you want more? _We will agree to provide ample insurance for our employees under union guidelines."
        },
        {
            "id": 72,
            "phrase": "provided that",
            "definition": "on the condition that.  I will come, provided that I am invited. I will help you, provided that you pay me."
        },
        {
            "id": 73,
            "phrase": "provoke someone into something",
            "definition": "to incite someone into doing something.  The soldiers sought to provoke the demonstrators into starting a riot. They provoked us into leaving."
        },
        {
            "id": 74,
            "phrase": "prune something away†",
            "definition": "to cut away something unwanted or unneeded. Please prune the lower branches of the trees away. They are starting to annoy pedestrians. We pruned away the dead branches."
        },
        {
            "id": 75,
            "phrase": "prune something of something",
            "definition": "to clear, clean, or groom something of something by pruning.  Sally was out in the orchard pruning the apple trees of dead branches.  They pruned the roses of their unneeded branches."
        },
        {
            "id": 76,
            "phrase": "pry around",
            "definition": "to sneak or prowl around looking for something. Why are you prying around? Mind your own business! _ Please don’t pry around. You might find out something you don’t want to know."
        },
        {
            "id": 77,
            "phrase": "pry into something",
            "definition": "to snoop into something; to get into someone else’s business.  Why are you prying into my affairs all the time? _I wish you wouldn’t pry into my personal life."
        },
        {
            "id": 78,
            "phrase": "pry something up†",
            "definition": "to raise something with or as with a lever.  See if you can pry that trapdoor up.  Pry up that lid."
        },
        {
            "id": 79,
            "phrase": "psych out",
            "definition": "1. Inf. to have a nervous or emotional trauma; to go mad for a brief time.  Another day like this one and I’ll psych out for sure.  He looked at the bill and psyched out. 2. Inf. to become very excited; to lose mental control. I was so angry, I almost psyched out. The kids were psyching out over the rock star."
        },
        {
            "id": 80,
            "phrase": "psych someone out†",
            "definition": "1. Inf. to get someone very excited; to cause someone to lose mental control.  Wow! What you just said really psyched me out! _ He psyched out his friends. 2. Inf. to figure someone out; to know how someone thinks.  It took me a while to psych out Fred, but I have him figured out now.  Don’t waste time trying to psych me out. I am an enigma."
        },
        {
            "id": 81,
            "phrase": "psych someone up†",
            "definition": "Inf. to get someone excited or mentally prepared for something.  I psyched myself up to sing in front of all those people.  The coach psyched up the team for the game."
        },
        {
            "id": 82,
            "phrase": "psych up",
            "definition": "Inf. to get mentally ready for something. I have to psych up before the big game tonight. We want to psych up so we can play a good game."
        },
        {
            "id": 83,
            "phrase": "psyched (out)",
            "definition": "1. Inf. excited; overwhelmed; thrilled.  She’s really psyched out.  That’s great. I’m really psyched about my new job! 2. Inf. intoxicated.  She’s just lying there psyched out.  Two beers and a shot of whiskey and he was psyched out."
        },
        {
            "id": 84,
            "phrase": "psyched (up)",
            "definition": "Inf. completely mentally ready (for something).  I’m really psyched for this test.  The team isn’t psyched up enough to do a good job."
        },
        {
            "id": 85,
            "phrase": "psyched up (for something)",
            "definition": "Inf. excited and enthusiastic.  I can play a great tennis game if I’m psyched up.  She is really psyched up for the game."
        },
        {
            "id": 86,
            "phrase": "publish or perish",
            "definition": "[for a professor] to try to publish scholarly books or articles to prevent getting released from a university or falling into disfavor in a university. (Also occurs as other parts of speech. See the examples.) _Alice knew she would have to publish or perish if she took the teaching job. This is a major research university and publish or perish is the order of the day."
        },
        {
            "id": 87,
            "phrase": "pucker something up†",
            "definition": "to cause something to wrinkle up, especially the edges of the mouth, as when tasting something very sour.  She puckered her lips up and pouted for a while.  She puckered up her lips when she tasted the lemon juice."
        },
        {
            "id": 88,
            "phrase": "pucker up",
            "definition": "to tighten one’s lips together into a circle as if to kiss. He puckered up and kissed her once, and then again."
        },
        {
            "id": 89,
            "phrase": "puff along",
            "definition": "1. [for someone] to run along, puffing to breathe. Sam puffed along, jogging on his morning route.  As Wally puffed along, he thought again about going on a diet. 2. [for an engine] to move along, putting out puffs of smoke or steam. The old engine puffed along, driving the small boat slowly up the river. The locomotive puffed along, not making very much headway up the hill."
        },
        {
            "id": 90,
            "phrase": "puff out",
            "definition": "to swell out.  The frog’s throat puffed out, and we expected to hear a croak.  The sail puffed out, and the boat began to move."
        },
        {
            "id": 91,
            "phrase": "puff someone or something up†",
            "definition": "to boost or promote someone or something. Judy puffed Nell up so much that Nell could not begin to live up to her reputation.  Don’t puff up your own accomplishments so much."
        },
        {
            "id": 92,
            "phrase": "puff something out†",
            "definition": "to cause something to swell out or expand outward.  The frog puffed its throat out and croaked.  The frog puffed out its throat and croaked a mighty croak."
        },
        {
            "id": 93,
            "phrase": "puff up",
            "definition": "to swell up. Her finger puffed up and she thought she might have an infection.  His eyelids had puffed up during the night."
        },
        {
            "id": 94,
            "phrase": "puff up (into something)",
            "definition": "to assume a larger shape by filling up with air or water; to swell up into something.  The strange-looking fish puffed up into a round ball. The fish puffed up and stuck out its spines."
        },
        {
            "id": 95,
            "phrase": "pull a boner",
            "definition": "Inf. to do something stupid or silly.  Boy, I really pulled a boner! I’m so dumb.  If you pull a boner like that again, you’re fired!"
        },
        {
            "id": 96,
            "phrase": "pull a fast one",
            "definition": "Inf. to succeed in an act of deception.  She was pulling a fast one when she said she had a headache and went home.  Don’t try to pull a fast one with me! I know what you’re doing."
        },
        {
            "id": 97,
            "phrase": "pull a job",
            "definition": "Sl. to carry out a crime, especially a robbery. (Police and underworld. Note the variations in the examples.) _Richard decided that it was not a good time to pull a bank job. Willie and Richard left town after they pulled the job."
        },
        {
            "id": 98,
            "phrase": "pull a muscle",
            "definition": "to strain a muscle and suffer the attendant pain.  I pulled a muscle in my back and can’t play golf today."
        },
        {
            "id": 99,
            "phrase": "pull ahead (of someone or something)",
            "definition": "to pass someone or something and continue moving.  The runner pulled ahead of the rest of the field.  Our car pulled ahead of theirs."
        },
        {
            "id": 100,
            "phrase": "pull all the stops out†",
            "definition": "to use everything available; to not hold back. (Alludes to pulling out all of the stops on an organ so that it will sound as loud as possible.) _ The mayor decided to pull out all the stops and campaign in every district. Todd pulled all the stops out for his exhibition and impressed everyone with his painting artistry."
        },
        {
            "id": 101,
            "phrase": "pull around to something",
            "definition": "to drive around to something or some place. Please pull around to the back and deliver the furniture there.  We told the driver to pull around to the service entrance."
        },
        {
            "id": 102,
            "phrase": "pull at someone",
            "definition": "to vie for someone’s attention or concern.  There are too many demands pulling at me. I need to cut down on my responsibilities.  I don’t see how I can function with so many different things pulling at me."
        },
        {
            "id": 103,
            "phrase": "pull at someone or something",
            "definition": "to tug at someone or something.  The child kept pulling at her mother to get her attention.  Don’t keep pulling at your hair. It will come out."
        },
        {
            "id": 104,
            "phrase": "pull away from someone or something",
            "definition": "to jerk away or draw away from someone or something. Suddenly, she pulled away from me and fled.  The car pulled away from the curb and drove off."
        },
        {
            "id": 105,
            "phrase": "pull back (from someone or something)",
            "definition": "to move back from someone or something.  When I saw how sick he looked, I pulled back from him in shock.  I took one look at the snake and pulled back."
        },
        {
            "id": 106,
            "phrase": "pull down (an amount of money)",
            "definition": "Inf. to earn a stated amount of money. (“An amount of money” is expressed as a figure or other indication of an actual amount.) _She pulls down about $40,000 a year.  They pull down pretty good salaries."
        },
        {
            "id": 107,
            "phrase": "pull for someone or something",
            "definition": "to support and cheer for someone, a group, or something. We’re pulling for you. We know you can do it! _ All the students were pulling for the team."
        },
        {
            "id": 108,
            "phrase": "pull in one’s ears",
            "definition": "to stop listening in on someone or something. (The opposite of prick up one’s ears.) _Now, pull in your ears. This is none of your business.  Pull in your ears and mind your own business."
        },
        {
            "id": 109,
            "phrase": "pull in some place",
            "definition": "[for a wheeled vehicle] to steer or drive to a point off the main route.  Let’s pull in at the next motel and get some rest. I want to pull in at a service station and have my tires checked."
        },
        {
            "id": 110,
            "phrase": "pull in(to some place)",
            "definition": "to drive into some place. A strange car just pulled into our driveway.  Some stranger just pulled in."
        },
        {
            "id": 111,
            "phrase": "pull off (something)",
            "definition": "to steer or turn a vehicle off the road.  I pulled off the road and rested for a while.  I had to pull off and rest."
        },
        {
            "id": 112,
            "phrase": "pull on something",
            "definition": "to tug something. I pulled on the rope, hoping to get it loose.  Please help me pull on the anchor chain so we can raise the anchor."
        },
        {
            "id": 113,
            "phrase": "pull one over on someone",
            "definition": "to deceive someone.  Don’t try to trick me! You can’t pull one over on me."
        },
        {
            "id": 114,
            "phrase": "pull one’s punches",
            "definition": "1. [for a boxer] to strike with light blows to enable the other boxer to win.  Bill has been barred from the boxing ring for pulling his punches.  “I never pulled punches in my life!” cried Tom. 2. Fig. to hold back in one’s criticism. (Usually in the negative. The one’s can be replaced with any in the negative.) _ I didn’t pull any punches. I told her exactly what I thought of her. The teacher doesn’t pull any punches when it comes to discipline."
        },
        {
            "id": 115,
            "phrase": "pull oneself together",
            "definition": "1. Fig. to compose oneself; to gather one’s wits about one.  I have to pull myself together and try it again.  Now try to pull yourself together and get through this crisis. 2. Fig. to gather up one’s things; to pull one’s things together.  I’ll be ready to leave as soon as I pull myself together.  I want to pull myself together and leave."
        },
        {
            "id": 116,
            "phrase": "pull oneself up by one’s (own) bootstraps",
            "definition": "to improve or become a success by one’s own efforts.  If Sam had a little encouragement, he could pull himself up by his bootstraps.  Given a chance, I’m sure I can pull myself up by my own bootstraps."
        },
        {
            "id": 117,
            "phrase": "pull (out) in front of someone or something",
            "definition": "to drive out into the road in front of someone or some vehicle.  A car pulled out in front of me, and I almost hit it.  The car pulled in front of a truck and there was a terrible wreck."
        },
        {
            "id": 118,
            "phrase": "pull out (of something)",
            "definition": "1. to withdraw from something.  For some reason, he pulled out of the coalition and went his own way. The other side got impatient with the negotiations and pulled out. 2. to drive out of something, such as a driveway, parking space, garage, etc. The car pulled out of the driveway and nearly hit a truck.  Look out! A car is about to pull out!"
        },
        {
            "id": 119,
            "phrase": "pull over (to something)",
            "definition": "to steer over to something, such as the side of the road.  Betty pulled over to the side of the road and waited for the traffic to thin. The police officer ordered her to pull over."
        },
        {
            "id": 120,
            "phrase": "pull rank (on someone)",
            "definition": "to assert one’s rank, authority, or position over someone when making a request or giving an order.  Don’t pull rank on me! I don’t have to do what you say! _ When she couldn’t get her way politely, she pulled rank and really got some action."
        },
        {
            "id": 121,
            "phrase": "pull someone about",
            "definition": "to drag someone around.  The boys were pulling one another about and playing very rough.  Don’t pull your little brother about so!"
        },
        {
            "id": 122,
            "phrase": "pull someone apart",
            "definition": "to separate people who are entangled. The teacher pulled the fighting boys apart and sent them home.  They hugged each other so tightly that no one could have pulled them apart."
        },
        {
            "id": 123,
            "phrase": "pull someone aside†",
            "definition": "to grasp and pull a person to one side. I pulled the child aside and scolded him for trying to sneak into the theater.  I pulled aside the child to say something to him."
        },
        {
            "id": 124,
            "phrase": "pull someone down†",
            "definition": "to degrade someone; to humiliate someone.  I’m afraid that your so-called friends are pulling you down behind your back.  There is no need to pull down everyone."
        },
        {
            "id": 125,
            "phrase": "pull someone or an animal down†",
            "definition": "to drag or force someone or an animal down.  The wolves pulled the hunter down and set upon him.  They pulled down the hunter."
        },
        {
            "id": 126,
            "phrase": "pull someone or an animal through (something)",
            "definition": "to manage to get someone or an animal through an opening.  Do you think you can pull the cow through this narrow door to the shed?"
        },
        {
            "id": 127,
            "phrase": "pull someone or something apart†",
            "definition": "to separate or dismember someone or something. The murderer pulled his victim apart and sought to dispose of the parts.  He pulled apart his victim.  Nick pulled the parts of the box apart."
        },
        {
            "id": 128,
            "phrase": "pull someone or something around†",
            "definition": "to drag or haul someone or something around.  The woman had pulled her children around all day while she did the shopping. All of them were glad to get home.  Nick pulled around his wagon and collected discarded aluminum cans."
        },
        {
            "id": 129,
            "phrase": "pull someone or something back† (from someone or something)",
            "definition": "to grasp and haul someone or something away from someone or something. The cop pulled the kid away from the other kid and made them stop fighting.  I pulled back the child from the dangerous hole."
        },
        {
            "id": 130,
            "phrase": "pull someone or something by something",
            "definition": "to grasp someone or something by something and tug or haul.  I pulled him by the hand, trying to get him to follow me.  Timmy pulled the toy duck by its string and it quacked as it waddled along."
        },
        {
            "id": 131,
            "phrase": "pull someone or something over (to something)",
            "definition": "[for someone] to cause someone or a vehicle to drive over to something, such as the side of the road. The cop pulled Betty over to the side of the road.  I pulled the car over to the side."
        },
        {
            "id": 132,
            "phrase": "pull someone or something to pieces",
            "definition": "to pull someone or something apart; to separate someone or something into pieces. The machine almost pulled him to pieces when he got his arm caught in it."
        },
        {
            "id": 133,
            "phrase": "pull someone or something under",
            "definition": "to drag someone or something beneath the surface of something.  The strong undertow pulled John under the surface.  The whirlpool nearly pulled the boat under."
        },
        {
            "id": 134,
            "phrase": "pull someone or something up†",
            "definition": "to drag or haul someone or something upward or to an upright position.  Bob had slipped down into the creek, so I reached down and pulled him up. I pulled up Bob and nearly fell in myself. Nick pulled the cushion up and propped it against the back of the sofa."
        },
        {
            "id": 135,
            "phrase": "pull someone’s leg",
            "definition": "to kid, fool, or trick someone.  You don’t mean that. You’re just pulling my leg.  Don’t believe him. He’s just pulling your leg."
        },
        {
            "id": 136,
            "phrase": "pull someone’s or something’s teeth",
            "definition": "to reduce the power or efficacy of someone or something.  The mayor tried to pull the teeth of the new law.  The city council pulled the teeth of the new mayor."
        },
        {
            "id": 137,
            "phrase": "pull someone through (something)",
            "definition": "to help someone survive or get through something difficult.  With the help of the doctor, we pulled her through her illness. With lots of encouragement, we pulled her through."
        },
        {
            "id": 138,
            "phrase": "pull someone up short",
            "definition": "to cause someone to stop short.  My scream pulled him up short. The sudden thought that everything might not be all right pulled Tom up short."
        },
        {
            "id": 139,
            "phrase": "pull something down†",
            "definition": "1. to demolish something; to raze something. Why do they want to pull the building down? Why not remodel it? _ They are going to pull down the old building today. 2. to lower or reduce the amount of something.  That last test pulled my grade down.  Let’s see if we can pull down your temperature with aspirin."
        },
        {
            "id": 140,
            "phrase": "pull something down over someone or something",
            "definition": "to draw something down over someone or something.  Lucy’s mother pulled the dress down over Lucy and buttoned it up in back.  Sarah pulled the cover down over the birdcage and turned out the lights."
        },
        {
            "id": 141,
            "phrase": "pull something on†",
            "definition": "to draw on an article of clothing.  He pulled his pants on.  He pulled on his pants quickly and ran outside while putting on his shirt."
        },
        {
            "id": 142,
            "phrase": "pull something on someone",
            "definition": "to play a trick on someone; to deceive someone with a trick. (The word something is often used.) _You wouldn’t pull a trick on me, would you? _ Who would pull something like that on an old lady?"
        },
        {
            "id": 143,
            "phrase": "pull something out of someone",
            "definition": "to draw or force information out of someone. The cops finally pulled a confession out of Max.  I thought I would never pull her name out of her."
        },
        {
            "id": 144,
            "phrase": "pull something out of the fire",
            "definition": "to drag or take something out of a fire before it is consumed.  The fire was too big, so he pulled a few logs out of the fire."
        },
        {
            "id": 145,
            "phrase": "pull something over someone or something",
            "definition": "to draw something over someone or something.  The doctor pulled a sheet over Gerald and left the room.  Sharon pulled the cover over the birdcage for the night."
        },
        {
            "id": 146,
            "phrase": "pull something to",
            "definition": "to close something, usually a door of some type.  The door is open a little. Pull it to so no one will hear us.  Please pull the door to."
        },
        {
            "id": 147,
            "phrase": "pull something together",
            "definition": "to close something, such as a pair of drapes or sliding doors. Please pull the doors together when you finish in the closet. Would you pull the drapes together before you turn on the lights?"
        },
        {
            "id": 148,
            "phrase": "pull something toward oneself",
            "definition": "to draw something closer to oneself.  He pulled his plate toward himself and began eating like a starving man. Mary pulled the basket of fruit toward herself and chose a nice juicy peach."
        },
        {
            "id": 149,
            "phrase": "pull something up† (out of something)",
            "definition": "to draw something upward out of something.  The worker pulled a cold wet dog up out of the pond.  He pulled up the dog out of the pond."
        },
        {
            "id": 150,
            "phrase": "pull the plug (on someone)",
            "definition": "to turn off someone’s life-support system in a hospital. (Based on pull the plug (on something) Q. This results in the death of the person whose life support has been terminated.) _ They had to get a court order to pull the plug on their father.  Fred signed a living will making it possible to pull the plug on him without a court order."
        },
        {
            "id": 151,
            "phrase": "pull the plug (on something)",
            "definition": "to terminate the functions of something by pulling a connector from a socket.  While she was working at the computer, I accidentally pulled the plug.  I pulled the plug on the vacuum because the switch was broken."
        },
        {
            "id": 152,
            "phrase": "pull the rug out† (from under someone)",
            "definition": "to make someone or someone’s plans fall through; to upset someone’s plans.  Don pulled the rug out from under me in my deal with Bill Franklin. I was close to getting the contract until Don came along and pulled out the rug."
        },
        {
            "id": 153,
            "phrase": "pull the wool over someone’s eyes",
            "definition": "to deceive someone.  You can’t pull the wool over my eyes. I know what’s going on.  Don’t try to pull the wool over her eyes. She’s too smart."
        },
        {
            "id": 154,
            "phrase": "pull through (something)",
            "definition": "to survive something.  I am sure that your uncle will pull through the illness. I’m glad he pulled through."
        },
        {
            "id": 155,
            "phrase": "pull together (as a team)",
            "definition": "to cooperate; to work well together.  Let’s all pull together and get this done.  If we pull together as a team, we can get this job done on time."
        },
        {
            "id": 156,
            "phrase": "Pull up a chair.",
            "definition": "Please get a chair and sit down and join us. (Assumes that there is seating available. The speaker does not necessarily mean that the person spoken to actually has to move a chair.) _Tom: Well, hello, Bob! Bob: Hi, Tom. Pull up a chair. The three men were sitting at a table for four. Bob came up and said hello. Bill said, “Pull up a chair.” Bob sat in the fourth chair at the table."
        },
        {
            "id": 157,
            "phrase": "pull (up) alongside ((of ) someone or something)",
            "definition": "to move to a point beside someone or something. (Of is usually retained before pronouns.) _ The car pulled up alongside the truck and honked and the people inside waved and waved.  Please pull alongside the curb."
        },
        {
            "id": 158,
            "phrase": "pull up stakes",
            "definition": "to pull up tent stakes to take down a tent in preparation to leaving.  Let’s pull up stakes and head home before the storm hits."
        },
        {
            "id": 159,
            "phrase": "pull up to something",
            "definition": "to drive up close to something.  I pulled up to the drive-in window and placed my order.  When the taxi pulls up to the curb, open the door and get in."
        },
        {
            "id": 160,
            "phrase": "pulse through someone or something",
            "definition": "to flow or surge through someone or something.  A jolt of electricity pulsed through Sam, causing him to jerk his hand away from the wire.  They repaired the power lines and electricity began to pulse through the wires again."
        },
        {
            "id": 161,
            "phrase": "pump (some) iron",
            "definition": "Sl. to lift weights for exercise. Andy went down to the gym to pump some iron.  Mary’s hobbies are pumping iron and running."
        },
        {
            "id": 162,
            "phrase": "pump someone for something",
            "definition": "Inf. to try to get information about something out of someone.  The representative of the other company pumped Harry for information, but he refused to say anything.  Are you trying to pump me for company secrets?"
        },
        {
            "id": 163,
            "phrase": "pump someone up (for something)",
            "definition": "Inf. to get someone, including oneself, mentally ready for something.  The coach tried to pump the team up so they would win.  The coach talked and talked to pump them up."
        },
        {
            "id": 164,
            "phrase": "pump something through something",
            "definition": "to force something, such as a gas or fluid, through something. They pumped crude oil through this pipeline, all the way to the south shore. They pumped fresh air through the sewers while the workers were working inside."
        },
        {
            "id": 165,
            "phrase": "pump something up†",
            "definition": "1. to inflate something.  Do you have something with which I can pump my basketball up? _ I pumped up the ball just an hour ago. 2. Sl. to exercise to make muscles get bigger and stronger.  The bodybuilder pumped her muscles up in preparation for the competition.  She pumped up her muscles."
        },
        {
            "id": 166,
            "phrase": "pumped (up)",
            "definition": "Sl. excited; physically and mentally ready.  The team is really pumped up for Friday’s game.  She really plays well when she’s pumped!"
        },
        {
            "id": 167,
            "phrase": "punch a hole in something",
            "definition": "to make a hole in something with something. John punched a hole in the wall with his fist.  Mary punched a hole in the paper with her pencil."
        },
        {
            "id": 168,
            "phrase": "punch in",
            "definition": "to record one’s arrival at one’s workplace at a certain time.  What time did you punch in? _ I punched in at the regular time."
        },
        {
            "id": 169,
            "phrase": "punch out",
            "definition": "to record that one has left one’s workplace at a certain time.  Why didn’t you punch out when you left last night? _ I punched out at the regular time."
        },
        {
            "id": 170,
            "phrase": "punch someone in something",
            "definition": "to strike someone in some body part. Tony punched Nick in the side. Why didn’t you punch that mean guy in the nose?"
        },
        {
            "id": 171,
            "phrase": "punch someone on something",
            "definition": "to strike someone on some body part, typically the shoulder. (Not with the intention of causing harm.) _ Sally punched Frank on the shoulder just to show they were still friends. Tom punched Fred on the shoulder in a friendly way."
        },
        {
            "id": 172,
            "phrase": "punch someone out†",
            "definition": "Sl. to overcome or beat someone by punching.  He threatened to punch me out.  The thug punched out the cop and ran down an alley."
        },
        {
            "id": 173,
            "phrase": "punch someone’s lights out",
            "definition": "Sl. to knock someone out with a fist. You had better stop that, or I will punch your lights out! _ Do you want me to punch your lights out?"
        },
        {
            "id": 174,
            "phrase": "punch something down†",
            "definition": "to press something down.  Punch this lever down and then try to place your telephone call.  Punch down this lever and push this button."
        },
        {
            "id": 175,
            "phrase": "punch something in†",
            "definition": "to crush or smash something in.  Who punched the cereal box in? _ Who punched in the cereal box?"
        },
        {
            "id": 176,
            "phrase": "punch something into something",
            "definition": "to stick or press something into something. She punched her finger into the cake and ruined my lovely icing job.  He finally punched a spoon into the cereal box to get it open."
        },
        {
            "id": 177,
            "phrase": "punch something up†",
            "definition": "to register a figure on a cash register or calculator. Jake punched the total up, and the register drawer opened.  He punched up the total too carelessly."
        },
        {
            "id": 178,
            "phrase": "Punctuality is the soul of business.",
            "definition": "Prov. You should be on time for all your business appointments.  The office manager insisted on everyone’s coming to work on time, not a minute late. “Punctuality is the soul of business,” she said."
        },
        {
            "id": 179,
            "phrase": "punctuate something with something",
            "definition": "1. to add a particular punctuation mark to a piece of writing.  You have punctuated this ad with too many exclamation points.  This letter is punctuated with dashes to emphasize the key points. 2. to add emphasis to one’s speaking by adding phrases, exclamations, or other devices.  Her comments were punctuated with a few choice swear words.  Tom punctuated his address with a few choice comments about politicians."
        },
        {
            "id": 180,
            "phrase": "punish someone by something",
            "definition": "to discipline someone by doing something. The headmaster punished the children by forcing them to go to bed early.  She punished herself by not eating."
        },
        {
            "id": 181,
            "phrase": "punish someone for something",
            "definition": "to discipline someone for [doing] something.  Someone will punish you for what you did.  Please don’t punish me for doing it. I’m sorry."
        },
        {
            "id": 182,
            "phrase": "punish someone with something",
            "definition": "to use something to discipline someone.  The captain punished the sailor with the lash. Sally threatened to punish Timmy with a spanking."
        },
        {
            "id": 183,
            "phrase": "punk out",
            "definition": "Sl. to chicken out (of something); to withdraw from something in cowardice. He was supposed to ask her out, but he punked out at the last minute.  Come on! Stick with it! Don’t punk out!"
        },
        {
            "id": 184,
            "phrase": "puppy love",
            "definition": "mild infatuation; infatuation as in a crush. (Used especially of adolescent relationships.) _Is it really love or just puppy love? _ Look at them together. It may be puppy love, but it looks wonderful."
        },
        {
            "id": 185,
            "phrase": "purchase something for someone",
            "definition": "to buy something for someone else; to buy something to give to someone.  Tony purchased a number of toys for the children in the orphanage.  Who did you purchase this gift for?"
        },
        {
            "id": 186,
            "phrase": "*pure as the driven snow",
            "definition": "pure and chaste. (Often used ironically. *Also: as ~.) _Jill: Sue must have gone to bed with every man in town. Jane: And I always thought she was as pure as the driven snow.  Robert was notoriously promiscuous, but tried to convince all his girlfriends that he was pure as the driven snow."
        },
        {
            "id": 187,
            "phrase": "purge someone or something from something",
            "definition": "to rid something of someone or something.  We are going to purge the delinquent members from the list.  The court purged her arrest from the records."
        },
        {
            "id": 188,
            "phrase": "purge someone or something of someone or something",
            "definition": "to rid someone or something of someone or something.  The medicine is designed to purge the patient of the deadly toxin.  We purged the list of the delinquent members."
        },
        {
            "id": 189,
            "phrase": "purge something away†",
            "definition": "to wash or flush something away. We will purge the rusty water away and then start up the pump again. We will have fresh, clean water again in no time.  Laura purged away the rusty water."
        },
        {
            "id": 190,
            "phrase": "purse something up†",
            "definition": "to bunch or pucker something up. (Usually the lips.) _ When he tasted the lemon juice, he pursed his lips up and spat it out.  Don pursed up his lips as if to spit it out."
        },
        {
            "id": 191,
            "phrase": "push along",
            "definition": "to move along; to travel along as with a purpose. We must push along. We have a long way to travel before morning.  They pushed along at a steady clip until they arrived at their destination."
        },
        {
            "id": 192,
            "phrase": "push at someone or something",
            "definition": "to apply pressure to and try to move someone or something. She pushed at him, trying to get him to get out of the way, but he wouldn’t budge.  Mary pushed at the door, trying to open it against the wind.  There is no need for you to push at me so hard."
        },
        {
            "id": 193,
            "phrase": "push down on something",
            "definition": "to press down on something, such as a button, stamp, lever, etc.  Push down on this button if you want room service.  Don’t push down on the door handle too hard. It will break. push push for something to request or demand something.  The citizens are pushing for an investigation of the police department.  My secretary is pushing for a raise."
        },
        {
            "id": 194,
            "phrase": "push forward",
            "definition": "to move forward; to move onward toward a goal. We have lots to do. We must push forward! _They are pushing forward, hoping to complete the project on time."
        },
        {
            "id": 195,
            "phrase": "push on someone or something",
            "definition": "to put pressure on someone or something. Don’t push on me! I can’t move any faster than the person in front of me! _ Push on this button if you want the steward to come.  Push on the door a little. It will open."
        },
        {
            "id": 196,
            "phrase": "push on (to something)",
            "definition": "1. to move on to another topic; to stop doing one thing and move on to another.  Okay. Let’s push on to the next topic.  Let us push on. We are nearly finished with the list. 2. to travel onward to something or some place.  We left Denver and pushed on to Omaha.  Let us push on. We are nearly there."
        },
        {
            "id": 197,
            "phrase": "push on (with something)",
            "definition": "to continue to try to make progress with something. Let’s push on with this project. We must finish it soon.  Yes, let’s push on and finish."
        },
        {
            "id": 198,
            "phrase": "push (oneself) away (from something)",
            "definition": "to move oneself back and away from something. The skater pushed herself away from the wall.  Tom pushed himself away from the table when he had eaten enough."
        },
        {
            "id": 199,
            "phrase": "push (oneself) by (someone or something)",
            "definition": "to shove or thrust oneself past someone or something. In a hurry, I pushed myself by the security guard, and almost got arrested for doing so.  I pushed by Jane and went in first."
        },
        {
            "id": 200,
            "phrase": "push (oneself) off (on something)",
            "definition": "[for someone in a boat] to apply pressure to something on the shore, thus propelling the boat and oneself away.  The weekend sailor pushed himself off on the boat he had been moored to.  We pushed off on the dock."
        },
        {
            "id": 201,
            "phrase": "push out",
            "definition": "to spread out; to expand outward.  The sides of the box pushed out, and I was afraid it would break.  His little tummy pushed out when he was full."
        },
        {
            "id": 202,
            "phrase": "push past (someone or something)",
            "definition": "to force one’s way past someone or something. (Considered a rude act.) _ Nick pushed past the others and made himself first in line.  I pushed past the gate and went right in."
        },
        {
            "id": 203,
            "phrase": "push someone around",
            "definition": "to harass someone physically; to jostle someone.  I wish you would stop pushing me around all the time.  Stop pushing Max around if you know what’s good for you."
        },
        {
            "id": 204,
            "phrase": "push someone or something across (something)",
            "definition": "to move or propel someone or something across something.  Jill pushed Fred across the ice. He simply could not skate at all.  The old car stalled just before the bridge, so we pushed it across."
        },
        {
            "id": 205,
            "phrase": "push someone or something ahead of someone",
            "definition": "to push someone or something forward from behind.  I pushed Gerald ahead of me so he could get a better view.  Sally pushed the cart ahead of her and filled it from the supermarket shelves."
        },
        {
            "id": 206,
            "phrase": "push someone or something along",
            "definition": "to apply pressure to move someone or something along.  The mother tried to push her child along, but he wouldn’t go.  Jane pushed the cart along, down the supermarket aisle."
        },
        {
            "id": 207,
            "phrase": "push someone or something aside†",
            "definition": "to shove someone or something to one side.  Martha pushed Bill aside and went in ahead of him.  He pushed aside the papers and laid his books on the desk."
        },
        {
            "id": 208,
            "phrase": "push someone or something (away) (from someone or something)",
            "definition": "to move or force someone or something away from someone or something.  The police pushed the crowd away from the movie star.  They pushed away the hecklers from the stage."
        },
        {
            "id": 209,
            "phrase": "push someone or something back† (from someone or something)",
            "definition": "to move or force someone or something back from someone or something.  I quickly pushed her back from the edge. She almost fell over. There wasn’t enough room, so we pushed back the furniture.  Tony pushed Jane back from the edge."
        },
        {
            "id": 210,
            "phrase": "push someone or something down†",
            "definition": "to force someone or something downward. Every time he tried to get up, the other boys pushed him down again.  I pushed down the button and the machine began to operate."
        },
        {
            "id": 211,
            "phrase": "push someone or something forward",
            "definition": "to shove or move someone or something to the front.  Mary’s mother pushed her forward where she would be seen. Let me push the piano bench forward for you."
        },
        {
            "id": 212,
            "phrase": "push someone or something into someone or something",
            "definition": "to cause someone or something to bump into someone or something.  Todd accidentally pushed Marlene into Bill.  I pushed the lawn mower into the tree by accident."
        },
        {
            "id": 213,
            "phrase": "push someone or something on (ahead) (of someone or something)",
            "definition": "to move or propel someone or something ahead.  He did not want to go in with me, but I pushed him on forward or ahead of me.  I went into each room to clean it, pushing the laundry cart on ahead. She paused for a moment to rest, and then pushed the baby stroller on."
        },
        {
            "id": 214,
            "phrase": "push someone or something over†",
            "definition": "to make someone or something fall over or fall down. When you ran into me, you nearly pushed me over.  You nearly pushed over your friend."
        },
        {
            "id": 215,
            "phrase": "push someone or something over (something)",
            "definition": "to cause someone or something to move over something. The convict pushed his buddy over the wall and followed after him.  He climbed up to the top of the fence and I pushed him over."
        },
        {
            "id": 216,
            "phrase": "push someone or something to someone or something",
            "definition": "to propel someone or something to or as far as someone or something.  Max pushed Lefty to the window and made him look out.  I pushed the chair to the window."
        },
        {
            "id": 217,
            "phrase": "push someone or something toward someone or something",
            "definition": "to propel someone or something to someone or something.  The drama coach got behind the shy young actor playing Romeo and pushed him toward Juliet.  Clyde pushed his victim toward the edge of the cliff."
        },
        {
            "id": 218,
            "phrase": "push someone or something up†",
            "definition": "to raise or lift someone or something.  Jake is sliding down again. Push him up.  Push up the window, please."
        },
        {
            "id": 219,
            "phrase": "push someone, something, or an animal into something",
            "definition": "to guide, shove, or press someone, something, or an animal inside of something.  I pushed the lawn mower into the garage and closed the door. I opened the garage door and pushed the dog in."
        },
        {
            "id": 220,
            "phrase": "push someone to something",
            "definition": "to try to drive or force a person to do something.  After the bankruptcy the board pushed the president to resign.  We pushed her to reconsider, but her mind was made up."
        },
        {
            "id": 221,
            "phrase": "push someone too far",
            "definition": "to antagonize someone too much; to be too confrontational with someone.  I guess I pushed him too far, because he began shouting at me and threatening to hit me."
        },
        {
            "id": 222,
            "phrase": "push something in†",
            "definition": "to crush something in; to make something cave in.  He ran at the door and pushed it in.  He pushed in the door."
        },
        {
            "id": 223,
            "phrase": "push something off on(to) someone",
            "definition": "to place one’s task onto another person; to make someone else do an unwanted job. Don’t push the dirty work off onto me.  Kelly pushed some of her workload off on me. or something)"
        },
        {
            "id": 224,
            "phrase": "push something through (something)",
            "definition": "to force something to penetrate something.  Tony pushed the needle through the cloth, and drew the thread tight.  He pushed the needle through just like a tailor."
        },
        {
            "id": 225,
            "phrase": "push something to",
            "definition": "to close or nearly close something, such as a door.  The door is open a little. Please push it to.  Todd came in and pushed the door to."
        },
        {
            "id": 226,
            "phrase": "push something (up) against someone or something",
            "definition": "to press something against someone or something.  I pushed the chair up against the door to prevent the robber from getting in.  Accidentally, I pushed the door against Donna and hurt her sore elbow."
        },
        {
            "id": 227,
            "phrase": "push the envelope",
            "definition": "to expand the definition, categorization, dimensions, or perimeters of something.  The engineers wanted to completely redesign the product, but couldn’t push the envelope because of a very restricted budget."
        },
        {
            "id": 228,
            "phrase": "push through (something)",
            "definition": "to work through or force one’s way through something. I pushed through the snow, trying to get to the post office on time.  The snow was very deep, but I pushed through."
        },
        {
            "id": 229,
            "phrase": "push toward someone or something",
            "definition": "to move or struggle toward someone or something.  The crowd pushed toward the convicted man, but the police held them back.  The horses pushed toward the corral gate."
        },
        {
            "id": 230,
            "phrase": "push (up) against someone or something",
            "definition": "to put pressure on someone or something.  The small dog pushed up against me, wagging its tail.  Push up against the ceiling tile while I try to tack it back in place."
        },
        {
            "id": 231,
            "phrase": "push up on something",
            "definition": "to raise something upward; to push something up from below. Larry pushed up on the trapdoor and lifted it so he could climb out.  Push up on this lever if you want the lights to get brighter."
        },
        {
            "id": 232,
            "phrase": "pushing up (the) daisies",
            "definition": "dead and buried. (Usually in the future tense.) _I’ll be pushing up daisies before this problem is solved.  If you talk to me like that again, you’ll be pushing up the daisies."
        },
        {
            "id": 233,
            "phrase": "pussyfoot around",
            "definition": "to go about timidly and cautiously. (Alludes to a cat walking carefully.) _Stop pussyfooting around! Get on with it! _I wish that they would not pussyfoot around when there are tough decisions to be made."
        },
        {
            "id": 234,
            "phrase": "put a bee in someone’s bonnet (about someone or something)",
            "definition": "to give someone an idea about someone or something; to urge someone to do something. Julie put a bee in my bonnet about a way to solve our money problems.  Sam put a bee in my bonnet about having a party for Jane.  He put a bee in my bonnet about Jane.  I’m glad he put a bee in my bonnet."
        },
        {
            "id": 235,
            "phrase": "put a cap on something",
            "definition": "to put a limit on something.  We need to put a cap on spending in every department.  The city put a cap on the amount each landlord could charge."
        },
        {
            "id": 236,
            "phrase": "put a contract out on someone",
            "definition": "[for an underworld character] to order someone to kill someone else.  The mob put out a contract on some crook from Detroit."
        },
        {
            "id": 237,
            "phrase": "put a damper on something",
            "definition": "to have a dulling or numbing influence on something.  The bad news really put a damper on everything.  The rainy weather put a damper on our picnic."
        },
        {
            "id": 238,
            "phrase": "put a dog off the scent",
            "definition": "to distract a dog from trailing the scent of someone or an animal. The odor of a skunk put the dogs off the scent."
        },
        {
            "id": 239,
            "phrase": "put a hold on something",
            "definition": "to place restriction on something so that it is reserved, delayed, or inactivated.  The bank put a hold on my credit card until I paid my bill. The committee agreed to put a hold on the troublesome piece of business."
        },
        {
            "id": 240,
            "phrase": "put a horse out to pasture",
            "definition": "to retire a horse by allowing it to live out its days in a pasture with no work.  The horse could no longer work, so we put it out to pasture."
        },
        {
            "id": 241,
            "phrase": "put a plug in† (for someone or something)",
            "definition": "to say something favoring someone or something; to advertise someone or something.  I hope that when you are in talking to the manager, you put a plug in for me. I could use some help. While you’re there, put in a plug."
        },
        {
            "id": 242,
            "phrase": "put a premium on something",
            "definition": "to make something harder or more expensive to obtain or do.  The recent action of the bank directors put a premium on new home loans.  The scarcity of steel put a premium on the cost of new cars."
        },
        {
            "id": 243,
            "phrase": "put a smile on someone’s face",
            "definition": "to please someone; to make someone happy.  We are going to give Andy a pretty good raise, and I know that’ll put a smile on his face. The surprise birthday party really put a smile on my dad’s face."
        },
        {
            "id": 244,
            "phrase": "put a spin on something",
            "definition": "to twist a report or story to one’s advantage; to interpret an event to make it seem favorable or beneficial to oneself or one’s cause.  The mayor tried to put a positive spin on the damaging polls.  The pundit’s spin on the new legislation was highly critical."
        },
        {
            "id": 245,
            "phrase": "put a strain on someone or something",
            "definition": "to burden or overload someone or something. All this bad economic news puts a strain on everyone’s nerves.  The epidemic put a strain on the resources of the hospital."
        },
        {
            "id": 246,
            "phrase": "put all one’s eggs in one basket",
            "definition": "to make everything dependent on only one thing; to place all one’s resources in one place, account, etc. (If the basket is dropped, all is lost.) _ Don’t invest all your money in one company. Never put all your eggs in one basket.  I advise you to diversify and not to put all your eggs in one basket."
        },
        {
            "id": 247,
            "phrase": "put an amount of time in on something",
            "definition": "to spend an amount of time (doing something).  You put how much time in? _ I put in four months on that project."
        },
        {
            "id": 248,
            "phrase": "put an animal down†",
            "definition": "Euph. to take the life of an animal mercifully. We put down our old dog last year. It’s kind to put fatally ill animals down."
        },
        {
            "id": 249,
            "phrase": "put an animal out†",
            "definition": "to send an animal, such as a pet, outdoors.  Did you put the cat out? _ Yes, I put out the cat."
        }
    ]
}