{
 "Idioms": [
  {
   "phrase": "I'm good to go",
   "definition": "Which means, i am ready to participate."
  },
  {
   "phrase": "If it's not one thing, it's another",
   "definition": "Which means, said after more than one thing goes wrong."
  },
  {
   "phrase": "In cahoots with",
   "definition": "Which means, to be in a partnership with, often for unscrupulous purposes."
  },
  {
   "phrase": "In a nutshell",
   "definition": "Which means, in a few words. Concisely stated."
  },
  {
   "phrase": "In like flynn",
   "definition": "Which means, to be easily successful, especially concerning sex or romance."
  },
  {
   "phrase": "In limbo",
   "definition": "Which means, in an uncertain situation, over which you have no control (a reference to the state of being outside both heaven and hell)."
  },
  {
   "phrase": "In the bag",
   "definition": "Which means, something that is secured."
  },
  {
   "phrase": "In the buff",
   "definition": "Which means, naked."
  },
  {
   "phrase": "In the heat of the moment",
   "definition": "Which means, in an overwhelming situation, causing you to act rashly."
  },
  {
   "phrase": "In the same boat",
   "definition": "Which means, jointly facing the same predicament."
  },
  {
   "phrase": "In your face",
   "definition": "Which means, aggressive confrontation."
  },
  {
   "phrase": "Inside job",
   "definition": "Which means, a crime committed by or with the help of someone living or working in the place that it took place."
  },
  {
   "phrase": "It never rains but it pours",
   "definition": "Which means, when troubles come they often come together."
  },
  {
   "phrase": "It takes two to tango",
   "definition": "Which means, it takes two people to cause a problem between them."
  },
  {
   "phrase": "It's a small world",
   "definition": "Which means, said when people meet unexpectedly, away from their usual haunts."
  },
  {
   "phrase": "It's all gone pete tong",
   "definition": "Which means, cockney rhyming slang for gone wrong."
  },
  {
   "phrase": "It's not rocket science",
   "definition": "Which means, said of something that isn't complex or difficult to understand."
  },
  {
   "phrase": "Ivy league",
   "definition": "Which means, the joint name given to Columbia, Brown, Cornell, Dartmouth, Yale, Pennsylvania, Princeton, and Harvard universities."
  },
  {
   "phrase": "Jack palancing",
   "definition": "Which means, cockney rhyming slang for dancing."
  },
  {
   "phrase": "Jam jar",
   "definition": "Which means, cockney rhyming slang for car."
  },
  {
   "phrase": "Jelly belly",
   "definition": "Which means, an overweight person."
  },
  {
   "phrase": "Jimmy riddle",
   "definition": "Which means, cockney rhyming slang for piddle."
  },
  {
   "phrase": "Joshing me",
   "definition": "Which means, tricking me."
  },
  {
   "phrase": "Jump on the bandwagon",
   "definition": "Which means, join a popular trend."
  },
  {
   "phrase": "Jump the shark",
   "definition": "Which means, introduce a ridiculous or unbelievable plot device into a TV series in order to boost flagging ratings."
  },
  {
   "phrase": "Just deserts",
   "definition": "Which means, the result which is deserved. A reward for what has been done - good or bad."
  },
  {
   "phrase": "Keep an eye on",
   "definition": "Which means, observe carefully to make sure something bad isn't done."
  },
  {
   "phrase": "Keep at bay",
   "definition": "Which means, keep something away."
  },
  {
   "phrase": "Keep body and soul together",
   "definition": "Which means, earn sufficient money in order to keep yourself alive."
  },
  {
   "phrase": "Keep your chin up",
   "definition": "Which means, remain positive in a tough situation."
  },
  {
   "phrase": "Khyber pass",
   "definition": "Which means, cockney rhyming slang for arse."
  },
  {
   "phrase": "Kick the bucket",
   "definition": "Which means, die."
  },
  {
   "phrase": "Kill two birds with one stone",
   "definition": "Which means, accomplish two things with a single action."
  },
  {
   "phrase": "Knee jerk reaction",
   "definition": "Which means, a quick and automatic response."
  },
  {
   "phrase": "Knee trembler",
   "definition": "Which means, sexual intercourse between two people standing up."
  },
  {
   "phrase": "Knock on wood",
   "definition": "Which means, knuckle tapping on wood in order to avoid bad luck or to continue having good luck."
  },
  {
   "phrase": "Know the ropes",
   "definition": "Which means, to understand how to do something."
  },
  {
   "phrase": "Lame duck",
   "definition": "Which means, a person or thing that is no longer properly able to function. Also, more specifically, a person in authority, for example a president or prime minister, in their final period of office after a successor has already been elected."
  },
  {
   "phrase": "Last but not least",
   "definition": "Which means, an introduction, intended to let the audience know that the last person mentioned is not the least important."
  },
  {
   "phrase": "Last straw",
   "definition": "Which means, the last of a series of problems, which pushes one's endurance beyond its limits."
  },
  {
   "phrase": "Lend me your ear",
   "definition": "Which means, politely ask for someones full attention."
  },
  {
   "phrase": "Let bygones be bygones",
   "definition": "Which means, allow a disagreement or argument to be put in the past."
  },
  {
   "phrase": "Let sleeping dogs lie",
   "definition": "Which means, avoid restarting a conflict."
  },
  {
   "phrase": "Let the cat out of the bag",
   "definition": "Which means, share a secret that wasn't intended to be shared."
  },
  {
   "phrase": "Let your hair down",
   "definition": "Which means, behave in a free an uninhibited manner. Usually applied to women."
  },
  {
   "phrase": "Let's rewind",
   "definition": "Which means, a suggestion that the thing under consideration has gone along unproductive lines and should be looked at again from the beginning."
  },
  {
   "phrase": "Level playing field",
   "definition": "Which means, fair competition where no side has an advantage."
  },
  {
   "phrase": "Like a chicken with its head cut off",
   "definition": "Which means, in a frenzied manner."
  },
  {
   "phrase": "Link rot",
   "definition": "Which means, the tendency of WWW addresses to become out of date and point to unavailable pages."
  },
  {
   "phrase": "Link farm",
   "definition": "Which means, a website that exists primarily to display links to another website, with the intention of improving the search status of the second site."
  },
  {
   "phrase": "Liquor someone up",
   "definition": "Which means, to supply or to drink alcoholic drink."
  },
  {
   "phrase": "Little devil",
   "definition": "Which means, an exclamation of surprise and annoyance, directed at someone who has behaved badly or performed some kind of prank. Often applied to children."
  },
  {
   "phrase": "Little fish in a big pond",
   "definition": "Which means, someone considered unimportant compared to their more significant peers."
  },
  {
   "phrase": "Loaf of bread",
   "definition": "Which means, cockney rhyming slang for head."
  },
  {
   "phrase": "Long in the tooth",
   "definition": "Which means, old."
  },
  {
   "phrase": "Loose cannon",
   "definition": "Which means, someone who is unpredictable and can cause damage by being reckless."
  },
  {
   "phrase": "Lord fred",
   "definition": "Which means, cockney rhyming slang for bed."
  },
  {
   "phrase": "Lose your head",
   "definition": "Which means, overcome by emotion and out of control."
  },
  {
   "phrase": "Lose your touch",
   "definition": "Which means, lose an ability that you used to possess."
  },
  {
   "phrase": "Magic mushroom",
   "definition": "Which means, a type of mushroom with hallucinogenic properties - sometimes known as 'shrooms'."
  },
  {
   "phrase": "Make a scene",
   "definition": "Which means, cause a disturbance."
  },
  {
   "phrase": "Make no bones about",
   "definition": "Which means, to state a fact so there are no doubts about it."
  },
  {
   "phrase": "Man cave",
   "definition": "Which means, a shed or some other retreat that men decorate in the way they choose (with or without their male friends) and use to relax in traditional male pursuits."
  },
  {
   "phrase": "Many happy returns",
   "definition": "Which means, a toast given to someone on their birthday."
  },
  {
   "phrase": "Mate's rates",
   "definition": "Which means, a discount price offered to friends."
  },
  {
   "phrase": "Mea culpa",
   "definition": "Which means, i'm to blame."
  },
  {
   "phrase": "Mellow yellow",
   "definition": "Which means, dried banana peel, used as an intoxicant."
  },
  {
   "phrase": "Men in suits",
   "definition": "Which means, conventionally minded and dressed men who hold positions of authority. Also called just 'suits'."
  },
  {
   "phrase": "Method to my madness",
   "definition": "Which means, odd actions that appear meaningless but are done for a good reason."
  },
  {
   "phrase": "Mince pies",
   "definition": "Which means, cockney rhyming slang for eyes."
  },
  {
   "phrase": "Mind your language",
   "definition": "Which means, an admonition not to swear."
  },
  {
   "phrase": "Miss the boat",
   "definition": "Which means, missed the chance to take an opportunity."
  },
  {
   "phrase": "Mrs. mop",
   "definition": "Which means, traditional English name for a cleaning woman."
  },
  {
   "phrase": "Mumbo jumbo",
   "definition": "Which means, nonsense or meaningless speech."
  },
  {
   "phrase": "Mum's the word",
   "definition": "Which means, keep quiet. Say nothing."
  },
  {
   "phrase": "Mutt and jeff",
   "definition": "Which means, cockney rhyming slang for deaf."
  },
  {
   "phrase": "My old china",
   "definition": "Which means, cockney rhyming slang for mate."
  },
  {
   "phrase": "My old dutch",
   "definition": "Which means, cockney rhyming slang for duchess."
  },
  {
   "phrase": "Nail it",
   "definition": "Which means, to perform something particularly well."
  },
  {
   "phrase": "Nest egg",
   "definition": "Which means, savings set aside for future use."
  },
  {
   "phrase": "Never-never land",
   "definition": "Which means, a utopian dreamland."
  },
  {
   "phrase": "New arrival",
   "definition": "Which means, colloquial term for a new-born baby."
  },
  {
   "phrase": "New kid on the block",
   "definition": "Which means, someone new to the group or area."
  },
  {
   "phrase": "New york minute",
   "definition": "Which means, a short space of time."
  },
  {
   "phrase": "Nine to five",
   "definition": "Which means, a standard office day, between 9am and 5pm. Often used to denote the boring nature of the weekly working routine."
  },
  {
   "phrase": "Nip slip",
   "definition": "Which means, the inadvertent exposure of a womans nipple."
  },
  {
   "phrase": "Nitty-gritty",
   "definition": "Which means, the important aspects of a situation; the heart of the matter."
  },
  {
   "phrase": "No dice",
   "definition": "Which means, a refusal to accept a proposition."
  },
  {
   "phrase": "No room to swing a cat",
   "definition": "Which means, an awkward or confined space."
  },
  {
   "phrase": "No rush",
   "definition": "Which means, said to someone to indicate that you aren't in a hurry for them to complete their task."
  },
  {
   "phrase": "No saint",
   "definition": "Which means, someone who might claim to be of good behaviour but has in fact a sordid past."
  },
  {
   "phrase": "No spring chicken",
   "definition": "Which means, said of people who are no longer young but may behave as though they were."
  },
  {
   "phrase": "Nose around",
   "definition": "Which means, investigate in an off-hand manner."
  },
  {
   "phrase": "North and south",
   "definition": "Which means, cockney rhyming slang for mouth."
  },
  {
   "phrase": "Not all there",
   "definition": "Which means, not in possession of one's mental faculties."
  },
  {
   "phrase": "Not playing with a full deck",
   "definition": "Which means, someone who lacks intelligence."
  },
  {
   "phrase": "Off one's rocker",
   "definition": "Which means, crazy; out of one's mind."
  },
  {
   "phrase": "Off the hook",
   "definition": "Which means, no longer having to deal with something."
  },
  {
   "phrase": "Off the record",
   "definition": "Which means, something said in confidence that the one speaking doesn't want repeated."
  },
  {
   "phrase": "Old chestnut",
   "definition": "Which means, a story that has been told repeatedly and which has lost any originality."
  },
  {
   "phrase": "On a hiding to nothing",
   "definition": "Which means, faced with a hopeless situation, even after making one's best efforts."
  }
 ]
}