{
 "Idioms": [
  {
   "phrase": "Ballpark figure",
   "definition": "A number which is only approximate, but quite close to the correct number.. As in this example, Please get me the ballpark figure for the cost of the renovation."
  },
  {
   "phrase": "It's all greek to me",
   "definition": "Used to convey that you cannot understand something that is written or said.. As in this example, I tried reading that science journal, but it was all Greek to me."
  },
  {
   "phrase": "All bark and no bite",
   "definition": "Full of big talk but lacking action, power, or substance; pretentious.. As in this example, He has these grand plans of being an entrepreneur and owning a big business, but he never takes any action. Guess he is all bark and no bite."
  },
  {
   "phrase": "A bird in the hand (is worth two in the bush)",
   "definition": "It's better to be content with what you have than to risk losing everything by seeking to get more.. As in this example, If I were you I'd accept the offer rather than waiting for a better one. After all, a bird in the hand is worth two in the bush."
  },
  {
   "phrase": "A whole new ball game",
   "definition": "A completely different situation, often one which is difficult or which you know very little about.. As in this example, We'd done a lot of climbing in Scotland, but the Himalayas were a whole new ball game."
  },
  {
   "phrase": "Never in the wildest dreams",
   "definition": "Used to convey something that has happened was so strange that one never thought it would happen.. As in this example, Never in my wildest dreams did I imagine that she'd leave me for someone else."
  },
  {
   "phrase": "Desperate times call for desperate measures",
   "definition": "Extreme circumstances or situations that can only be resolved by resorting to equally extreme actions.. As in this example, Government actions during the recession are unpopular, but desperate times call for desperate measures."
  },
  {
   "phrase": "Mumbo jumbo",
   "definition": "Confusing, meaningless, nonsensical language, especially related to a speech or religious ritual.. As in this example, The politician made a right fool of himself with all that mumbo jumbo on the stage.,It is often people who do not understand the full meaning of religion that end up in such mumbo jumbo."
  },
  {
   "phrase": "Running on fumes",
   "definition": "Continuing to do something when you have almost no energy left.. As in this example, Have you had any rest? You seem to be running on fumes."
  },
  {
   "phrase": "From the horse's mouth",
   "definition": "If you get information about something from the horse's mouth, you get it from someone who is involved in it and knows a lot about it.. As in this example, I know it's true! I heard it straight from the horse's mouth!"
  },
  {
   "phrase": "Work like a beaver",
   "definition": "To work very hard, very energetically.. As in this example, She has an important deadline coming up, so she's been working like a beaver."
  },
  {
   "phrase": "Zero hour",
   "definition": "The time at which a planned operation, typically a military one, is set to begin.. As in this example, as zero hour approached, thirty ships swung into position"
  },
  {
   "phrase": "Yoke around neck",
   "definition": "Something of trouble, burden or oppressive to someone.. As in this example, His kids are a yoke around his neck.,My manager is sometimes a yoke around my neck."
  },
  {
   "phrase": "Wash dirty linen in public",
   "definition": "To discuss private or embarrassing matters in public.. As in this example, Listen, our relationship may have real problems, but it's unfortunate that you have chosen to wash our dirty linen in public."
  },
  {
   "phrase": "Cut to the chase",
   "definition": "Talk about the important point without causing any delays by discussing the preliminaries.. As in this example, After a few introductory comments, we cut to the chase and began negotiating."
  },
  {
   "phrase": "Below the belt",
   "definition": "To be mean, unfair, insulting or not following the rules.. As in this example, I do not believe in fighting below the belt. The dignity of a fight is lost when people do that."
  },
  {
   "phrase": "Dry run",
   "definition": "A rehearsal of a performance or procedure before the real one.. As in this example, Today is only a dry run so we will not be using the actual costumes."
  },
  {
   "phrase": "Every cloud has a silver lining",
   "definition": "There's something good even in bad, unpleasant situations.. As in this example, I'm sorry your business is going badly, but don't despair. Every cloud has a silver lining."
  },
  {
   "phrase": "Flesh and blood",
   "definition": "Used to emphasize that a person is a physical, living being with human emotions or frailties, often in contrast to something abstract, spiritual, or mechanical.. As in this example, I can't do everything tirelessly like a computer, I'm only flesh and blood"
  },
  {
   "phrase": "Green around the gills",
   "definition": "Used to describe a person looking sick or feeling ill or nauseous; may also refer to drool seen before vomiting.. As in this example, You have had so much to eat at the party that you look green about the gills now."
  },
  {
   "phrase": "Give the devil his due",
   "definition": "Give credit to what is good in a disagreeable or disliked person.. As in this example, I don't like what the new management has done, but give the devil his due, sales has improved"
  },
  {
   "phrase": "Head in the clouds",
   "definition": "To be unaware of what is going on around.. As in this example, She works in the office from 9 to 5 with her head in the clouds"
  },
  {
   "phrase": "In your face",
   "definition": "Directly at or against one in an aggressive, annoying, provocative manner that is difficult to ignore.. As in this example, \"In your faces, kids\" shouted the footballer to his opponents after having scored his third goal of the match.,Unable to tolerate his in your face attitude anymore, his boss fired him from the job."
  },
  {
   "phrase": "Jump the gun",
   "definition": "Act before the proper or appropriate time.. As in this example, We do not want to jump the gun by making a statement about what caused the explosion before the investigation is completed."
  },
  {
   "phrase": "Knee jerk reaction",
   "definition": "An automatic or reflex reaction to something without thinking.. As in this example, It was a typical knee jerk reaction. He said no immediately without considering our proposal."
  },
  {
   "phrase": "Keen as mustard",
   "definition": "Extremely eager or enthusiastic.. As in this example, Little kids are always as keen as mustard to learn new things around them."
  },
  {
   "phrase": "Leave at the altar",
   "definition": "Decide not to marry someone at the very last moment.. As in this example, Rachel left Barry at the altar on the day of the wedding."
  },
  {
   "phrase": "Let bygones be bygones",
   "definition": "Forget past offences or causes of conflict and be reconciled.. As in this example, The two international rivals shook hands and agreed to let bygones be bygones."
  },
  {
   "phrase": "Monkey business",
   "definition": "Mischievous or deceitful behaviour.. As in this example, Do not get involved in monkey business over the internet. Cyber Laws are stricter than before."
  },
  {
   "phrase": "Off the record",
   "definition": "Not intended to be known publicly or recorded officially. As in this example, This is off the record, but I disagree with the mayor on this matter."
  },
  {
   "phrase": "Throw saddle on a gift horse",
   "definition": "Accept a gift gladly without inspecting it for defects.. As in this example, It's so refreshing to work with someone who will throw a saddle on a gift horse rather than look it in the mouth."
  },
  {
   "phrase": "Look a gift-horse in the mouth",
   "definition": "To be ungrateful to someone who gives you something, a gift especially. As in this example, It's so refreshing to work with someone who will throw a saddle on a gift horse rather than look it in the mouth."
  },
  {
   "phrase": "Scrape all the shit of the shoe",
   "definition": "To know when you are really done or finished with something. As in this example, Investigator said \"I would let you go when I've scraped all the shit off the shoe\", when the suspect tried to leave the interrogation."
  },
  {
   "phrase": "Live (from) hand to mouth",
   "definition": "To have just enough money to live on and nothing extra.. As in this example, My father earned very little and there were four kids, so we lived from hand to mouth."
  },
  {
   "phrase": "To the moon and back",
   "definition": "More than anything else; in a great quantity. As in this example, He leaned over and kissed him goodnight. Then he lay down close by and whispered with a smile, \"I love you to the moon and back.\""
  },
  {
   "phrase": "As nice as ninepence",
   "definition": "Very tidy, neat, and well-organized; in good order.. As in this example, Her desk looks as nice as ninepence.,The college library is as nice as ninepence."
  },
  {
   "phrase": "As calm as a toad in the sun",
   "definition": "To be very calm and content, even in unnerving situations.. As in this example, The girl was as calm as a toad in the sun during the speech contest."
  },
  {
   "phrase": "At the crack of dawn",
   "definition": "A time very early in the morning; daybreak.. As in this example, It's a long drive, we'll leave at the crack of dawn."
  },
  {
   "phrase": "Alive and kicking",
   "definition": "All well and active as far as health is concerned.. As in this example, The old man was all alive and kicking even in the nineties"
  },
  {
   "phrase": "Before one can say jack robinson",
   "definition": "Very quickly or suddenly.. As in this example, She cam back from college, threw her bag on the couch and left before I could say Jack Robinson."
  },
  {
   "phrase": "Between the devil and the deep blue sea",
   "definition": "Having only two very unpleasant choices.. As in this example, For most people a visit to the dentist is the result of a choice between the devil and the deep blue sea - if you go you suffer, and if you don't go you suffer."
  },
  {
   "phrase": "Bark up the wrong tree",
   "definition": "To make the wrong choice; to ask the wrong person; to follow the wrong course.. As in this example, If you think I'm the guilty person, you're barking up the wrong tree."
  },
  {
   "phrase": "Come hell or high water",
   "definition": "No matter what happens. As in this example, I'll be there tomorrow, come hell or high water."
  },
  {
   "phrase": "Dot the i's and cross the t's",
   "definition": "To pay a great deal of attention to the details of something, especially when you are trying to complete a task.. As in this example, When you are up against Chuck, it is absolutely vital that we dot our i's and cross our t's."
  },
  {
   "phrase": "Everything but the kitchen sink",
   "definition": "Almost all that you can imagine of something.. As in this example, Joey orders everything but the kitchen sink when he goes out to dinner, especially if Chandler is paying for it."
  },
  {
   "phrase": "Fall on deaf ears",
   "definition": "To be ignored by the persons they were intended for.. As in this example, He had already made up his mind, her advice fell on deaf ears."
  },
  {
   "phrase": "Go to hell in a handbasket",
   "definition": "To be in an extremely bad state and becoming worse.. As in this example, After a student committed suicide, the school is going to hell in handbasket."
  },
  {
   "phrase": "Hit the nail on the head",
   "definition": "To do exactly the right thing; to describe exactly what is causing a situation or problem. As in this example, His speech at the farewell ceremony hit the nail on the head about the company's situation."
  },
  {
   "phrase": "Hold all the aces",
   "definition": "To be in a favorable position; in total control. As in this example, We held all the aces in the election."
  },
  {
   "phrase": "If wishes were horses, beggars would ride",
   "definition": "If you could achieve your aims simply by wishing for them, life would be very easy.. As in this example, I wish to go on a trip to Mars, but alas! if wishes were horses, beggars would ride."
  },
  {
   "phrase": "Zonk out",
   "definition": "To fall asleep, esp from physical exhaustion or the effects of alcohol or drugs. As in this example, The driver zonked out behind the wheel and ran off the road."
  },
  {
   "phrase": "When the chips are down",
   "definition": "When a very serious situation arises.. As in this example, I knew you would come and help when the chips were down."
  },
  {
   "phrase": "Volte-face",
   "definition": "An abrupt and complete reversal of attitude, opinion, or position.. As in this example, After losing the election, he made a very public and dramatic political volte-face from Left to Right."
  },
  {
   "phrase": "Beyond the veil",
   "definition": "In a mysterious or hidden place or state, especially the unknown state of life after death.. As in this example, Mike realized that his father had passed irrevocably beyond the veil."
  },
  {
   "phrase": "Nurse a viper in one's bosom",
   "definition": "To befriend, look after, or take care of someone who proves to be traitorous, untrustworthy, deceitful, or ungrateful.. As in this example, I got my friend a good position in my company and all he did is convinced my manger to fire me, that's when I realized I nursed a viper in my bosom."
  },
  {
   "phrase": "Up the ante",
   "definition": "Increase what is at stake or under discussion, especially in a conflict or dispute.. As in this example, Pete upped the ante on that the poker game to $100 per hand."
  },
  {
   "phrase": "Use your loaf",
   "definition": "Use one's common sense.. As in this example, You haven't even switched the thing on. Come on, Jamie, use your loaf!"
  },
  {
   "phrase": "Take the bull by the horns",
   "definition": "Deal decisively with a difficult or dangerous situation.. As in this example, It's time to take the bull by the horns and get this job done."
  },
  {
   "phrase": "Suit someone to a t",
   "definition": "To be very appropriate for someone. As in this example, This kind of job suits me to a T."
  },
  {
   "phrase": "Take a rain check",
   "definition": "Used to refuse an offer politely, with the implication that one may take it up at a later date.. As in this example, They wanted me to come along for the ride but I took a rain check"
  },
  {
   "phrase": "Scrape the bottom of the barrel",
   "definition": "To select from among the worst; to choose from what is left over.. As in this example, The worker you sent over was the worst I've ever seen. Send me another—and don't scrape the bottom of the barrel."
  },
  {
   "phrase": "Put/set the cat among the pigeons",
   "definition": "To do or say something that causes trouble and makes a lot of people angry or worried. As in this example, Tell them all they've got to work on Saturday. That should set the cat among the pigeons."
  },
  {
   "phrase": "Spitting image",
   "definition": "A precise resemblance, especially in closely related persons.. As in this example, People have told me that I look like him, act like him, that my kids are the spitting image of him."
  },
  {
   "phrase": "Red letter day",
   "definition": "A day that is pleasantly noteworthy or memorable.. As in this example, The day I first set foot in America was a red-letter day for me."
  },
  {
   "phrase": "The queensberry rules",
   "definition": "Standard rules of polite or acceptable behavior; code of conduct. As in this example, HR handed over the sheet that listed the Queensberry rules of the company on the first day at work."
  },
  {
   "phrase": "Pull a rabbit out of your hat",
   "definition": "To do something surprising. As in this example, GRR Martin pulls a rabbit out of the hat at the end of the story."
  },
  {
   "phrase": "New kid on the block",
   "definition": "The newest person in a group. As in this example, I'm just the new kid on the block. I've only been working here for a month."
  },
  {
   "phrase": "New york minute",
   "definition": "An extremely short period of time. As in this example, I'll have that ready for you in a New York Minute."
  },
  {
   "phrase": "Make no bones about",
   "definition": "Have no hesitation in stating or dealing with (something), however unpleasant or awkward it is.. As in this example, He made no bones about how bad he thought the food was."
  },
  {
   "phrase": "Let sleeping dogs lie",
   "definition": "Do not instigate trouble.; leave something alone if it might cause trouble.. As in this example, I thought I would ask Jill if she wanted me to pay her back right away, but then I decided to let sleeping dogs lie."
  },
  {
   "phrase": "Jot or tittle",
   "definition": "A tiny portion of something. As in this example, I don’t want a jot or tittle of the cake, I want the whole thing."
  },
  {
   "phrase": "Kangaroo court",
   "definition": "An unofficial court set up by a group of people. As in this example, Is this a staff meeting or a kangaroo court?"
  },
  {
   "phrase": "Leave no stone unturned",
   "definition": "Try every possible course of action in order to achieve something. As in this example, He left no stone unturned in his search for his natural mother."
  },
  {
   "phrase": "No room to swing a cat",
   "definition": "Very little space, cramped quarters. As in this example, There's not enough room to swing a cat in this tent."
  },
  {
   "phrase": "Burn the midnight oil",
   "definition": "Read or work late into the night. As in this example, I've got to get this report finished by tomorrow so I guess I'll be burning the midnight oil tonight."
  },
  {
   "phrase": "Banana republic",
   "definition": "A small, poor country with a weak or dishonest government. As in this example, People fear that the country will become a banana republic if the economy doesn't pick up."
  },
  {
   "phrase": "Put the cart before the horse",
   "definition": "To do things in the wrong order. As in this example, If you're starting to write code without thinking out the logic, you're putting the cart before the horse."
  },
  {
   "phrase": "Double whammy",
   "definition": "A twofold blow or setback. As in this example, Increasing taxes and falling prices of grains is a double whammy for poor farmers."
  },
  {
   "phrase": "Easy come, easy go",
   "definition": "Loss of something that required only a small amount of effort to acquire in the first place. As in this example, I lost 10k at the casino last night, but that's life - easy come, easy go."
  },
  {
   "phrase": "Good samaritan",
   "definition": "A charitable or helpful person. As in this example, An anonymous good Samaritan rescued a child from the river yesterday, but left the area before he could be thanked."
  },
  {
   "phrase": "A bad break",
   "definition": "Which means, 1. a misfortune. 2. a serious bone fracture.."
  },
  {
   "phrase": "A bad hair day",
   "definition": "Which means, A day on which everything seems to go wrong.."
  },
  {
   "phrase": "A bad workman always blames his tools",
   "definition": "Which means, A proverb that suggests a poor workman tends to look for an excuse for his poor work.."
  },
  {
   "phrase": "A big ask",
   "definition": "Which means, A favour which is a lot to ask of someone.."
  },
  {
   "phrase": "A bigger bang for your buck",
   "definition": "Which means, Better value for your money.."
  },
  {
   "phrase": "A bird in the hand is worth two in the bush",
   "definition": "Which means, Itâs better to have a lesser but certain advantage than the possibility of a greater one that may come to nothing.."
  },
  {
   "phrase": "A bite to eat",
   "definition": "Which means, A small meal, possibly taken quickly when time is short.."
  },
  {
   "phrase": "A blessing in disguise",
   "definition": "Which means, An apparent misfortune that works to the eventual benefit of the recipient.."
  },
  {
   "phrase": "A bull and cow",
   "definition": "Which means, Cockney rhyming slang for a row or argument.."
  },
  {
   "phrase": "A bunch of fives",
   "definition": "Which means, A fist, as used in a fight.."
  },
  {
   "phrase": "A chip on your shoulder",
   "definition": "Which means, A sense of inferiority characterized by a quickness to take offence.."
  },
  {
   "phrase": "A diamond in the rough",
   "definition": "Which means, A person or thing having good underlying qualities while appearing to be coarse and unpolished.."
  },
  {
   "phrase": "A dime a dozen",
   "definition": "Which means, So commonplace as to be of little consequence.."
  },
  {
   "phrase": "A doubting thomas",
   "definition": "Which means, A sceptic who wonât accept a widely believed truth until seeing the evidence in person.."
  },
  {
   "phrase": "A drop in the bucket",
   "definition": "Which means, A very small part of a bigger whole.."
  },
  {
   "phrase": "A fate worse than death",
   "definition": "Which means, The reputed opinion of sexual intercourse by prim victorian ladies.."
  },
  {
   "phrase": "A feather in one's cap",
   "definition": "Which means, A symbol of achievement.."
  },
  {
   "phrase": "A fish out of water",
   "definition": "Which means, Someone in an unfamiliar circumstance.."
  },
  {
   "phrase": "A flash in the pan",
   "definition": "Which means, Something that fails to deliver long-term benefit after an initial success.."
  },
  {
   "phrase": "A fly in the ointment",
   "definition": "Which means, A small flaw that spoils the whole.."
  },
  {
   "phrase": "A fly on the wall",
   "definition": "Which means, 1. an unperceived observer - able to see and hear but not be seen or heard. 2 - a form of cinema in which events are recorded without direction.."
  }
 ]
}