{
 "Idioms": [
  {
   "phrase": "A fool and his money are soon parted",
   "definition": "Which means, A foolish person is very likely to lose his money.."
  },
  {
   "phrase": "A fool's paradise",
   "definition": "Which means, A state of euphoria with no basis in reality.."
  },
  {
   "phrase": "A foot in the door",
   "definition": "Which means, An initial inroad that may lead to greater influence in future.."
  },
  {
   "phrase": "A golden key can open any door",
   "definition": "Which means, Money always has a telling influence.."
  },
  {
   "phrase": "A hot potato",
   "definition": "Which means, A current issue which many people are talking about and which is controversial.."
  },
  {
   "phrase": "A house divided against itself cannot stand",
   "definition": "Which means, Failure is certain if those on the same side argue amongst themselves.."
  },
  {
   "phrase": "A knight in shining armour",
   "definition": "Which means, A person who comes to the aid of another when other hopes have faded, like the knights in romantic stories.."
  },
  {
   "phrase": "A leopard can't change his spots",
   "definition": "Which means, You cannot change your innate self.."
  },
  {
   "phrase": "A little bird told me",
   "definition": "Which means, I was told by an undisclosed source.."
  },
  {
   "phrase": "A load of cobblers",
   "definition": "Which means, Nonsense.."
  },
  {
   "phrase": "A load of codswallop",
   "definition": "Which means, Nonsense.."
  },
  {
   "phrase": "A lot on your plate",
   "definition": "Which means, Having many responsibilities.."
  },
  {
   "phrase": "A man after my own heart",
   "definition": "Which means, A kindred spirit. someone who thinks as i do.."
  },
  {
   "phrase": "A miss is as good as a mile",
   "definition": "Which means, Some endeavours either succeed or they don’t - to miss narrowly is still failure.."
  },
  {
   "phrase": "A penny for your thoughts",
   "definition": "Which means, A way of asking what someone is thinking.."
  },
  {
   "phrase": "A penny saved is a penny earned",
   "definition": "Which means, Anything you save has the same effect as adding to your income.."
  },
  {
   "phrase": "A picture paints a thousand words",
   "definition": "Which means, Pictures are far more descriptive than words.."
  },
  {
   "phrase": "A piece of cake",
   "definition": "Which means, A task that can be accomplished very easily.."
  },
  {
   "phrase": "A pig in a poke",
   "definition": "Which means, A commodity that is bought without first examining it.."
  },
  {
   "phrase": "A place in the sun",
   "definition": "Which means, An idealistic dream of a sunny hideaway.."
  },
  {
   "phrase": "A red rag to a bull",
   "definition": "Which means, A deliberate provocation.."
  },
  {
   "phrase": "A safe pair of hands",
   "definition": "Which means, A reliable person, who can be trusted not to fail in a a task.."
  },
  {
   "phrase": "A sea change",
   "definition": "Which means, A radical change.."
  },
  {
   "phrase": "A sight for sore eyes",
   "definition": "Which means, A welcome sight that you weren’t expecting.."
  },
  {
   "phrase": "A skeleton in the closet",
   "definition": "Which means, A secret and possibly ruinous source of shame.."
  },
  {
   "phrase": "A shot in the arm",
   "definition": "Which means, A boost or encouragement.."
  },
  {
   "phrase": "A slap on the wrist",
   "definition": "Which means, A mild rebuke, often given when a more severe punishment might be expected.."
  },
  {
   "phrase": "A sledgehammer to crack a nut",
   "definition": "Which means, The use of excessive resources to overcome a small problem.."
  },
  {
   "phrase": "A sorry sight",
   "definition": "Which means, 1. something sadly neglected. 2. a person or thing of untidy appearance.."
  },
  {
   "phrase": "A stitch in time saves nine",
   "definition": "Which means, A small effort made at the right time might save a calamity later on.."
  },
  {
   "phrase": "A stone's throw",
   "definition": "Which means, A short distance.."
  },
  {
   "phrase": "A taste of your own medicine",
   "definition": "Which means, Mistreatment you receive in retaliation to that you gave to others.."
  },
  {
   "phrase": "A thorn in my flesh",
   "definition": "Which means, A persistent and difficult to ignore annoyance.."
  },
  {
   "phrase": "A toss up",
   "definition": "Which means, 1. the flip of a coin to decide on something. 2. a result, usually between two courses of action, which is uncertain and could go either way.."
  },
  {
   "phrase": "A wolf in sheep's clothing",
   "definition": "Which means, Someone who uses the pretence of kindliness to disguise their evil intent.."
  },
  {
   "phrase": "About face",
   "definition": "Which means, 1. a military command to turn when on parade. 2. a change from one’s previous position.."
  },
  {
   "phrase": "About time",
   "definition": "Which means, 1. almost time. 2. high time.."
  },
  {
   "phrase": "Absence makes the heart grow fonder",
   "definition": "Which means, Our feelings for people and things grows when we are apart from them.."
  },
  {
   "phrase": "Abso-bloody-lutely",
   "definition": "Which means, A more emphatic version of ’absolutely’.."
  },
  {
   "phrase": "Ace in the hole",
   "definition": "Which means, A saved, hidden advantage that can supply a victory when revealed.."
  },
  {
   "phrase": "Achilles' heel",
   "definition": "Which means, A fatal weakness in an otherwise strong person or thing.."
  },
  {
   "phrase": "Across the board",
   "definition": "Which means, Applying everywhere and to all classes of thing.."
  },
  {
   "phrase": "Act your age",
   "definition": "Which means, Behave in a manner appropriate to your stage in life.."
  },
  {
   "phrase": "Actions speak louder than words",
   "definition": "Which means, Actions show one’s character more than what you say.."
  },
  {
   "phrase": "Adam's ale",
   "definition": "Which means, A reference to water - often used to emphasize the purity of water compared to other drinks.."
  },
  {
   "phrase": "Add fuel to the fire",
   "definition": "Which means, Make a bad situation even worse than it is.."
  },
  {
   "phrase": "Add insult to injury",
   "definition": "Which means, To further a loss. to make a bad situation worse.."
  },
  {
   "phrase": "Against the clock",
   "definition": "Which means, In a great hurry to complete something before a set deadline.."
  },
  {
   "phrase": "Ain't my first rodeo",
   "definition": "Which means, Said by someone who has experience of a situation.."
  },
  {
   "phrase": "Al fresco",
   "definition": "Which means, In the open air.."
  },
  {
   "phrase": "Al desko",
   "definition": "Which means, Eating one’s lunch while still working. (a pun on ’al fresco’.).."
  },
  {
   "phrase": "All at sea",
   "definition": "Which means, In a confused, disordered state.."
  },
  {
   "phrase": "All kidding aside",
   "definition": "Which means, Said when you want people to realise you are speaking seriously, when they might otherwise think you were joking.."
  },
  {
   "phrase": "All bark and no bite",
   "definition": "Which means, Having lots to say but not willing to engage in a fight.."
  },
  {
   "phrase": "All greek to me",
   "definition": "Which means, Incomprehensible, as greek is to someone who cannot speak it.."
  },
  {
   "phrase": "All in all",
   "definition": "Which means, On the whole - when everything is considered.."
  },
  {
   "phrase": "All in a day's work",
   "definition": "Which means, Typical; a normal set of circumstances.."
  },
  {
   "phrase": "All set",
   "definition": "Which means, Ready to go.."
  },
  {
   "phrase": "All the way",
   "definition": "Which means, Referring to something that is done fully, especially as a euphemism for full sexual activity.."
  },
  {
   "phrase": "All thumbs",
   "definition": "Which means, Clumsy or physically inept.."
  },
  {
   "phrase": "All to cock",
   "definition": "Which means, Ruined or shambolic.."
  },
  {
   "phrase": "All together now",
   "definition": "Which means, Invitation to join in communal singing.."
  },
  {
   "phrase": "Alley cat",
   "definition": "Which means, 1. a cat that lives wild in a town. 2. slang term for a prostitute.."
  },
  {
   "phrase": "Alpha mom",
   "definition": "Which means, An ambitious mother who aims to excel at work while raising children.."
  },
  {
   "phrase": "Alphabet soup",
   "definition": "Which means, A jumble of words or letters, often referring to organisations known by their initials, like cia or bbc.."
  },
  {
   "phrase": "Amber nectar",
   "definition": "Which means, A slang term for lager.."
  },
  {
   "phrase": "Amped up",
   "definition": "Which means, Excited and ready for action.."
  },
  {
   "phrase": "An act of god",
   "definition": "Which means, Some event that is considered to be outside human control. commonly used in insurance policies to refer to events that the insured cannot be held responsible for.."
  },
  {
   "phrase": "An arm and a leg",
   "definition": "Which means, Very expensive. a large amount of money.."
  },
  {
   "phrase": "An axe to grind",
   "definition": "Which means, A dispute with someone.."
  },
  {
   "phrase": "An open and shut case",
   "definition": "Which means, A straightforward legal case in which the outcome is clear.."
  },
  {
   "phrase": "Ankle biter",
   "definition": "Which means, A slang term for small child.."
  },
  {
   "phrase": "Apples and pears",
   "definition": "Which means, Cockney rhyming slang for stairs.."
  },
  {
   "phrase": "As high as a kite",
   "definition": "Which means, 1. very high up in the sky. 2. high on drugs or excitement.."
  },
  {
   "phrase": "At the drop of a hat",
   "definition": "Which means, With no delay.."
  },
  {
   "phrase": "Away with the fairies",
   "definition": "Which means, Not facing reality; in a dream world.."
  },
  {
   "phrase": "Baby brain",
   "definition": "Which means, Confusion or forgetfulness caused by lack of sleep when caring for a new-born.."
  },
  {
   "phrase": "Baby bump",
   "definition": "Which means, The protruding belly of a pregnant woman. also used to describe the unborn child itself.."
  },
  {
   "phrase": "Baby snatcher",
   "definition": "Which means, Someone who enters into an amorous relationship with a much younger person.."
  },
  {
   "phrase": "Back seat driver",
   "definition": "Which means, Someone who criticizes from the side-lines without being directly involved.."
  },
  {
   "phrase": "Back to square one",
   "definition": "Which means, Back to the beginning.."
  },
  {
   "phrase": "Back to the drawing board",
   "definition": "Which means, Said when a plan fails and it's time to start again and make a new plan.."
  },
  {
   "phrase": "Bag lady",
   "definition": "Which means, A homeless woman, who carries all her possessions in shopping bags.."
  },
  {
   "phrase": "Baker's dozen",
   "definition": "Which means, Thirteen.."
  },
  {
   "phrase": "Barking up the wrong tree",
   "definition": "Which means, Responding to something which isn't the important issue.."
  },
  {
   "phrase": "Barnet fair",
   "definition": "Which means, Cockney rhyming slang for hair.."
  },
  {
   "phrase": "Basket case",
   "definition": "Which means, A person or thing that is no longer able to function effectively, either through disability or misfortune.."
  },
  {
   "phrase": "Bat from the pavilion end",
   "definition": "Which means, Slang term for a homosexuality.."
  },
  {
   "phrase": "Be a sport",
   "definition": "Which means, Be generous and/or sportsmanlike.."
  },
  {
   "phrase": "Be glad to see the back of",
   "definition": "Which means, Be happy when a person leaves or when an unpleasant situation is ended.."
  },
  {
   "phrase": "Beach bum",
   "definition": "Which means, Someone, usually a youngster, who spends all their time hanging out at the beach surfing and partying.."
  },
  {
   "phrase": "Bean counter",
   "definition": "Which means, A disparaging term for an accountant or anyone who compiles statistics.."
  },
  {
   "phrase": "Beat around the bush",
   "definition": "Which means, Avoiding the main topic.."
  },
  {
   "phrase": "Beauty contest / beauty parade",
   "definition": "Which means, A political contest in which the result is influenced by personality and image more than by policy.."
  },
  {
   "phrase": "Bedroom tax",
   "definition": "Which means, Slang term for uk's removal of spare room subsidy.."
  },
  {
   "phrase": "Bells and whistles",
   "definition": "Which means, Attractive additional features or trimmings.."
  },
  {
   "phrase": "Bend over backwards",
   "definition": "Which means, Make extravagant efforts to avoid bias.."
  },
  {
   "phrase": "Between a rock and a hard place",
   "definition": "Which means, Between two unwelcome options.."
  },
  {
   "phrase": "Between the wars",
   "definition": "Which means, The period between wwi and wwii.."
  },
  {
   "phrase": "Beyond price",
   "definition": "Which means, To be so prized and valuable as to not be obtainable by money.."
  },
  {
   "phrase": "Big fish in a small pond",
   "definition": "Which means, An important person but only so within a small area of influence.."
  }
 ]
}