{
 "Idioms": [
  {
   "phrase": "Take a butchers",
   "definition": "Which means, Cockney rhyming slang for look.."
  },
  {
   "phrase": "Take a raincheck",
   "definition": "Which means, An offer that is declined now but may be reconsidered later.."
  },
  {
   "phrase": "Take with a grain of salt",
   "definition": "Which means, Don't take what someone says too seriously - the the implication that it isn't true.."
  },
  {
   "phrase": "Talk of the devil!",
   "definition": "Which means, Said when someone that you have just been talking about arrives.."
  },
  {
   "phrase": "Tea leaf",
   "definition": "Which means, Cockney rhyming slang for thief.."
  },
  {
   "phrase": "That friday feeling",
   "definition": "Which means, Anticipation of the weekend after a hard working week.."
  },
  {
   "phrase": "That sucks",
   "definition": "Which means, 1. an expression of sympathy. 2. said of something that the speaker rates very lowly.."
  },
  {
   "phrase": "The acid test",
   "definition": "Which means, 1. a scientific test to distinguish between gold and base metals. 2. a conclusive test to determine the validity of a claim.."
  },
  {
   "phrase": "The apple of my eye",
   "definition": "Which means, Someone who is cherished above all others.."
  },
  {
   "phrase": "The author of your own misfortune",
   "definition": "Which means, Be to blame for one's own problems.."
  },
  {
   "phrase": "The ball is in your court",
   "definition": "Which means, It is your turn to make a decision.."
  },
  {
   "phrase": "The best of both worlds",
   "definition": "Which means, The benefits available from two apparently conflicting options.."
  },
  {
   "phrase": "The best thing since sliced bread",
   "definition": "Which means, An outstandingly good idea or plan.."
  },
  {
   "phrase": "The big pond",
   "definition": "Which means, Nickname of the atlantic ocean between the uk and the usa.."
  },
  {
   "phrase": "The bull in the bowler hat",
   "definition": "Which means, Jokey term for artificial insemination.."
  },
  {
   "phrase": "The empty chair",
   "definition": "Which means, The perceived absense of someone who is recently deceased.."
  },
  {
   "phrase": "The fog of war",
   "definition": "Which means, Confusion caused by the chaos of battle.."
  },
  {
   "phrase": "The glorious twelfth",
   "definition": "Which means, The 12th of august - the start of the british grouse shooting season.."
  },
  {
   "phrase": "The hair of the dog",
   "definition": "Which means, An alcoholic drink, intended to cure a hangover. it is mistakenly believed that a small measure of the same drink that made a person drunk will sober them up and cure the drinks ill effects. the expression is also used in other contexts, whenever an additional dose of whatever caused a problem is thought to be an appropriate remedy.."
  },
  {
   "phrase": "Heebie-jeebies",
   "definition": "Which means, A state of nervous anxiety or fear.."
  },
  {
   "phrase": "The god squad",
   "definition": "Which means, Enthusiastic christian believers.."
  },
  {
   "phrase": "The icing on the cake",
   "definition": "Which means, Something that makes a good situation even better.."
  },
  {
   "phrase": "The last straw",
   "definition": "Which means, The last of a series of problems, which pushes one's endurance beyond its limits.."
  },
  {
   "phrase": "Nitty-gritty",
   "definition": "Which means, The important aspects of a situation; the heart of the matter.."
  },
  {
   "phrase": "The sound of leather on willow",
   "definition": "Which means, The sound of the ball on the bat in cricket.."
  },
  {
   "phrase": "The tail is wagging the dog",
   "definition": "Which means, A small and usually insignificant factor (or person) dominates over one that is normally more powerful and influential.."
  },
  {
   "phrase": "The town bike",
   "definition": "Which means, Promiscuous woman.."
  },
  {
   "phrase": "The whole nine yards",
   "definition": "Which means, The full entirety of something.."
  },
  {
   "phrase": "The wheels have come off",
   "definition": "Which means, Said when a previously promising enterprise goes irretrievably wrong.."
  },
  {
   "phrase": "Third time lucky",
   "definition": "Which means, Said when trying something for the third time.."
  },
  {
   "phrase": "Third time's a charm",
   "definition": "Which means, The third try is often successful.."
  },
  {
   "phrase": "Throw the towel in",
   "definition": "Which means, Give up, especially to avoid further punishment when facing certain defeat.."
  },
  {
   "phrase": "Tie the knot",
   "definition": "Which means, Get married.."
  },
  {
   "phrase": "Til the cows come home",
   "definition": "Which means, A long time to wait.."
  },
  {
   "phrase": "Titfer tat",
   "definition": "Which means, Cockney rhyming slang for hat.."
  },
  {
   "phrase": "To cut a long story short",
   "definition": "Which means, Said when a storyteller doesn't want to bore his audience with a long involved account.."
  },
  {
   "phrase": "Tongue in cheek",
   "definition": "Which means, Humorously, not to be taken seriously.."
  },
  {
   "phrase": "Top banana",
   "definition": "Which means, The leading, most important, person in a group or organisation.."
  },
  {
   "phrase": "Tour de force",
   "definition": "Which means, A feat of strength power or skill.."
  },
  {
   "phrase": "Toy-boy",
   "definition": "Which means, A woman's much younger male lover.."
  },
  {
   "phrase": "Trouble and strife",
   "definition": "Which means, Cockney rhyming slang for wife.."
  },
  {
   "phrase": "Turn a blind eye",
   "definition": "Which means, Refuse to acknowledge something that you know is genuine.."
  },
  {
   "phrase": "Twist someone's arm",
   "definition": "Which means, Persuade someone to do something they don't really want to do.."
  },
  {
   "phrase": "Twenty three skidoo",
   "definition": "Which means, Invitation to go away.."
  },
  {
   "phrase": "Two and eight",
   "definition": "Which means, Cockney rhyming slang for state.."
  },
  {
   "phrase": "Uncle dick",
   "definition": "Which means, Cockney rhyming slang for sick.."
  },
  {
   "phrase": "Uncle tom",
   "definition": "Which means, A derogatory term for a black man who is servile towards white men.."
  },
  {
   "phrase": "Under the weather",
   "definition": "Which means, Feeling ill.."
  },
  {
   "phrase": "Unlucky in love",
   "definition": "Which means, Having been unable to find a long-term romantic partner.."
  },
  {
   "phrase": "Up a blind alley",
   "definition": "Which means, On a fruitless course of action.."
  },
  {
   "phrase": "Up shit creek without a paddle",
   "definition": "Which means, In serious difficulty, with no hope of respite.."
  },
  {
   "phrase": "Ups a daisy",
   "definition": "Which means, A saying, usually to a child, after a stumble or fall, to encourage them to get up. (ups is a variant of whoops).."
  },
  {
   "phrase": "Us versus them",
   "definition": "Which means, Denoting the enmity between two opposing groups.."
  },
  {
   "phrase": "Use your loaf",
   "definition": "Which means, Think smart.."
  },
  {
   "phrase": "Van gogh's ear for music",
   "definition": "Which means, Tone deaf.."
  },
  {
   "phrase": "Variety is the spice of life",
   "definition": "Which means, Increased experience makes for a more exciting life.."
  },
  {
   "phrase": "Vatican roulette",
   "definition": "Which means, The rhythm method of birth control.."
  },
  {
   "phrase": "Wardrobe malfunction",
   "definition": "Which means, Referring to an item of clothing slipping out of place to expose part of the body.."
  },
  {
   "phrase": "Washed up",
   "definition": "Which means, 1. deposited on a beach by the tide. 2. finished and failed, with no further chance of success.."
  },
  {
   "phrase": "Water under the bridge",
   "definition": "Which means, A past experience that you prefer not to affect your current life.."
  },
  {
   "phrase": "Wear your heart on your sleeve",
   "definition": "Which means, Openly express your emotions.."
  },
  {
   "phrase": "Well hung",
   "definition": "Which means, Said of a man with large genitals.."
  },
  {
   "phrase": "Wet behind the ears",
   "definition": "Which means, Young and naive, like a new-born baby.."
  },
  {
   "phrase": "Where there's muck there's brass",
   "definition": "Which means, Dirt and muddle are evidence of products being manufactured and money (brass) being made.."
  },
  {
   "phrase": "Whipper snapper",
   "definition": "Which means, A child or impertinent youth.."
  },
  {
   "phrase": "Whistle and flute",
   "definition": "Which means, Cockney rhyming slang for suit.."
  },
  {
   "phrase": "White elephant",
   "definition": "Which means, An object that appears magnificent but which is a burdensome financial liability.."
  },
  {
   "phrase": "Wild and woolly",
   "definition": "Which means, Uncultured and lawless.."
  },
  {
   "phrase": "Wind someone up",
   "definition": "Which means, Deliberately draw attention to something with the intention of causing trouble.."
  },
  {
   "phrase": "Wine and dine",
   "definition": "Which means, Entertain in a high class restaurant.."
  },
  {
   "phrase": "Winter drawers on",
   "definition": "Which means, British euphemistic joke.."
  },
  {
   "phrase": "Work out",
   "definition": "Which means, 1. calculate using arithmetic. 2. take exercise (also spelled 'workout').."
  },
  {
   "phrase": "Word for word",
   "definition": "Which means, An exact, precisely corresponding to, copy of another's words.."
  },
  {
   "phrase": "Worse for wear",
   "definition": "Which means, Either 1. shabby and worn out, or 2. drunk.."
  },
  {
   "phrase": "Would you adam and eve it?",
   "definition": "Which means, Cockney rhyming slang for would you believe it?."
  },
  {
   "phrase": "Wouldn't be caught dead",
   "definition": "Which means, Referring to something you absolutely refuse to do.."
  },
  {
   "phrase": "X marks the spot",
   "definition": "Which means, Said of a location that indicates something significant - like a pirate's mark on a treasure map.."
  },
  {
   "phrase": "Yarn bombing",
   "definition": "Which means, The adorning of public buildings with knitted or crocheted material - either for fun or to make a political point.."
  },
  {
   "phrase": "Yellow belly",
   "definition": "Which means, A coward.."
  },
  {
   "phrase": "You are what you eat",
   "definition": "Which means, What you eat affects you health.."
  },
  {
   "phrase": "You can lead a horse to water",
   "definition": "Which means, You can encourage someone to to do something but, in the end, what they do is their own choice.."
  },
  {
   "phrase": "You can't judge a book by its cover",
   "definition": "Which means, Decisions can't be made solely on appearance.."
  },
  {
   "phrase": "You can't teach and old dog new tricks",
   "definition": "Which means, Once animals (and people) are set in their ways they struggle to assimilate new ideas.."
  },
  {
   "phrase": "You can't take it with you",
   "definition": "Which means, Suggestion that you should spend money and live life now as it will be no use to you after you die.."
  },
  {
   "phrase": "Your guess is as good as mine",
   "definition": "Which means, I have no idea.."
  },
  {
   "phrase": "Your name is mud",
   "definition": "Which means, You are discredited or in disgrace. the very mention of your name produces scorn.."
  },
  {
   "phrase": "Your number is up",
   "definition": "Which means, It is now your turn. for instance, if 1. you are about to die. or 2. you have won a lottery.."
  },
  {
   "phrase": "Zip your lip",
   "definition": "Which means, Say nothing; keep your mouth shut. often shortened to 'zip it'.."
  },
  {}
 ]
}