{
 "Idioms": [
  {
   "phrase": "Elbow grease",
   "definition": "Which means, energetic labour, especially in the polishing of household items."
  },
  {
   "phrase": "Elephant's trunk",
   "definition": "Which means, cockney rhyming slang for drunk."
  },
  {
   "phrase": "Elvis has left the building",
   "definition": "Which means, the primary performer has left. There's no point waiting around."
  },
  {
   "phrase": "Enhanced interrogation techniques",
   "definition": "Which means, euphemism for torture."
  },
  {
   "phrase": "Ethnic cleansing",
   "definition": "Which means, the singling out and killing of a specific ethnic group."
  },
  {
   "phrase": "Every cloud has a silver lining",
   "definition": "Which means, an encouragement to be optimistic. Even bad events have a good side to them."
  },
  {
   "phrase": "Everything but the kitchen sink",
   "definition": "Which means, everything imaginable."
  },
  {
   "phrase": "Evil twin",
   "definition": "Which means, an imaginary double, humorously referred to in order to explain the uncharacteristic bad behaviour of a normally moral person. Usually used light-heartedly. The expression formed as an allusion to plots in films involving actual evil twins."
  },
  {
   "phrase": "Excuse my french",
   "definition": "Which means, please forgive me for swearing."
  },
  {
   "phrase": "Eyebrow raising",
   "definition": "Which means, something that creates shock or surprise."
  },
  {
   "phrase": "Face card",
   "definition": "Which means, the jack queen or king in a set of playing cards."
  },
  {
   "phrase": "Face the music",
   "definition": "Which means, accept he unwelcome consequences of one's own actions."
  },
  {
   "phrase": "Factory farming",
   "definition": "Which means, rearing livestock under industrial conditions."
  },
  {
   "phrase": "Fairytale ending",
   "definition": "Which means, a happy simplistic ending to a story similar to those found in fairy tales."
  },
  {
   "phrase": "Far cry from",
   "definition": "Which means, very different from."
  },
  {
   "phrase": "Feeding frenzy",
   "definition": "Which means, a frantic competition or exploitation - like a group shark attack."
  },
  {
   "phrase": "Fell off the back of a lorry",
   "definition": "Which means, a coy reference to an item that has been stolen."
  },
  {
   "phrase": "Field day",
   "definition": "Which means, a day noted for remarkable or exciting events."
  },
  {
   "phrase": "Fiddlesticks",
   "definition": "Which means, an exclamation meaning 1. Nonsense; rubbish. 2. An indication of mild annoyance."
  },
  {
   "phrase": "Find your feet",
   "definition": "Which means, to become conscious of and develop one's expertise."
  },
  {
   "phrase": "Fire the imagination",
   "definition": "Which means, inspire with enthusiasm."
  },
  {
   "phrase": "First among equals",
   "definition": "Which means, the most senior person in a group of equal rank."
  },
  {
   "phrase": "First footing",
   "definition": "Which means, making a round of visits at New Year."
  },
  {
   "phrase": "First world problem",
   "definition": "Which means, a relatively trivial problem only affecting the affluent."
  },
  {
   "phrase": "First world",
   "definition": "Which means, the industrialised affluent and wealthy nations."
  },
  {
   "phrase": "Fixed in your ways",
   "definition": "Which means, unwilling to change from your habitual way of doing things."
  },
  {
   "phrase": "Flea market",
   "definition": "Which means, a market used to buy and sell inexpensive goods. The kind of place that might sell carpets infested with fleas."
  },
  {
   "phrase": "Flea pit",
   "definition": "Which means, a downmarket cinema - allegedly verminous."
  },
  {
   "phrase": "Flesh and blood",
   "definition": "Which means, 1 - One's family. 2 - the bodily stuff we are made of."
  },
  {
   "phrase": "Flip the bird",
   "definition": "Which means, to aggressively raise your middle finger at someone as a sign of displeasure."
  },
  {
   "phrase": "Flog a dead horse",
   "definition": "Which means, to attempt to make progress with something that has no future."
  },
  {
   "phrase": "Flotsam and jetsam",
   "definition": "Which means, assorted bits and pieces of rubbish; especially items that are found in the sea."
  },
  {
   "phrase": "Foam at the mouth",
   "definition": "Which means, to show vehement rage."
  },
  {
   "phrase": "Food fight",
   "definition": "Which means, chaotic collective behaviour where items of food are thrown about wildly."
  },
  {
   "phrase": "Fools' gold",
   "definition": "Which means, something that appears valuable but really isn't, like iron pyrites - a worthless mineral that resembles gold."
  },
  {
   "phrase": "Frock up",
   "definition": "Which means, wear a smart or formal dress for a special occasion."
  },
  {
   "phrase": "Frog and toad",
   "definition": "Which means, cockney rhyming slang for road."
  },
  {
   "phrase": "Fuddy-duddy",
   "definition": "Which means, an old-fashioned and foolish type of person."
  },
  {
   "phrase": "Full monty",
   "definition": "Which means, everything possible. The whole thing."
  },
  {
   "phrase": "Full of bull",
   "definition": "Which means, talking hot air."
  },
  {
   "phrase": "Funny farm",
   "definition": "Which means, a mental hospital."
  },
  {
   "phrase": "Gee gee",
   "definition": "Which means, childish term for a horse."
  },
  {
   "phrase": "Gender bender",
   "definition": "Which means, a person who adopts a deliberately androgynous appearance, by use of uni-sex make-up, hair-style and clothing. Probably influenced by 'bender' being an earlier slang term for homosexual."
  },
  {
   "phrase": "George raft",
   "definition": "Which means, cockney rhyming slang for daft."
  },
  {
   "phrase": "Get a gold star",
   "definition": "Which means, earn a merit point for doing well."
  },
  {
   "phrase": "Get down to brass tacks",
   "definition": "Which means, concern yourself with the basic and important realities."
  },
  {
   "phrase": "Get off on the wrong foot",
   "definition": "Which means, make a bad start in a relationship or task."
  },
  {
   "phrase": "Get on board",
   "definition": "Which means, accept and participate with an idea or project."
  },
  {
   "phrase": "Get out of hand",
   "definition": "Which means, become chaotic and uncontrollable."
  },
  {
   "phrase": "Get out of the wrong side of the bed",
   "definition": "Which means, "
  },
  {
   "phrase": "Get over it",
   "definition": "Which means, move beyond something that is bothering you."
  },
  {
   "phrase": "Get your head around",
   "definition": "Which means, understand something, especially something difficult to comprehend because it is complex or surprising."
  },
  {
   "phrase": "Ginger beer",
   "definition": "Which means, cockney rhyming slang for queer."
  },
  {
   "phrase": "Give him an inch and he'll take a mile",
   "definition": "Which means, allow someone a small concession and they will take advantage and try to take more."
  },
  {
   "phrase": "Give the benefit of the doubt",
   "definition": "Which means, decide to believe a statement which isn't proven."
  },
  {
   "phrase": "Give the slip",
   "definition": "Which means, to get away from. To escape."
  },
  {
   "phrase": "Glass ceiling",
   "definition": "Which means, an unacknowledged or unseen discriminatory barrier that prevents women and minorities from rising to positions of power."
  },
  {
   "phrase": "Gnat's bollock",
   "definition": "Which means, a very small (imaginary) unit of measurement."
  },
  {
   "phrase": "Go ape shit",
   "definition": "Which means, become excessively agitated and excited."
  },
  {
   "phrase": "Go belly (or tits) up",
   "definition": "Which means, become badly and permanently inoperative."
  },
  {
   "phrase": "Go for broke",
   "definition": "Which means, put every resource into getting a particular result."
  },
  {
   "phrase": "Go out on a limb",
   "definition": "Which means, take a risk to support someone or something."
  },
  {
   "phrase": "Go the extra mile",
   "definition": "Which means, going beyond what is usually required. Make an extra effort."
  },
  {
   "phrase": "Going to hell in a handbasket",
   "definition": "Which means, deteriorating and headed for complete disaster."
  },
  {
   "phrase": "Good samaritan",
   "definition": "Which means, someone who compassionately helps another who is in need."
  },
  {
   "phrase": "Graveyard shift",
   "definition": "Which means, working hours that extend overnight."
  },
  {
   "phrase": "Greasy spoon",
   "definition": "Which means, a small cheap cafe selling fried food."
  },
  {
   "phrase": "Great minds think alike",
   "definition": "Which means, said ironically when two people have matching thoughts."
  },
  {
   "phrase": "Great scot",
   "definition": "Which means, exclamation of surprise."
  },
  {
   "phrase": "Gregory peck",
   "definition": "Which means, cockney rhyming slang for neck."
  },
  {
   "phrase": "Gut feeling",
   "definition": "Which means, a personal intuition, based on feeling rather than fact."
  },
  {
   "phrase": "Had a good war",
   "definition": "Which means, to have been successful during a military campaign."
  },
  {
   "phrase": "Hair of the dog",
   "definition": "Which means, an alcoholic drink, intended to cure a hangover. It is mistakenly believed that a small measure of the same drink that made a person drunk will sober them up and cure the drinks ill effects. The expression is also used in other contexts, whenever an additional dose of whatever caused a problem is thought to be an appropriate remedy."
  },
  {
   "phrase": "Half inch",
   "definition": "Which means, cockney rhyming slang for pinch."
  },
  {
   "phrase": "Happy sad",
   "definition": "Which means, a bittersweet feeling combining both happiness and sadness."
  },
  {
   "phrase": "Harry spankers",
   "definition": "Which means, brand spanking new."
  },
  {
   "phrase": "Has the cat got your tongue?",
   "definition": "Which means, a question addressed to someone who is inexplicably silent. The implication is that the person's tongue is missing."
  },
  {
   "phrase": "Haste makes waste",
   "definition": "Which means, doing things in a rush makes for a poor result."
  },
  {
   "phrase": "Hat trick",
   "definition": "Which means, a threefold feat in sports or some other activity."
  },
  {
   "phrase": "Have a blast",
   "definition": "Which means, have an especially good time."
  },
  {
   "phrase": "Have a captain cook",
   "definition": "Which means, cockney rhyming slang for look."
  },
  {
   "phrase": "He makes my flesh (or skin) crawl (or creep)",
   "definition": "Which means, said of someone who the speaker has a deep dislike of."
  },
  {
   "phrase": "Head over heels",
   "definition": "Which means, very excited, especially when in love."
  },
  {
   "phrase": "Hear it on the grapevine",
   "definition": "Which means, hear rumors about something from an anonymous informal contact."
  },
  {
   "phrase": "Heebie-jeebies",
   "definition": "Which means, a state of nervous anxiety or fear."
  },
  {
   "phrase": "Hell bent",
   "definition": "Which means, determined to achieve something at all costs."
  },
  {
   "phrase": "Help yourself",
   "definition": "Which means, invitation to take something freely."
  },
  {
   "phrase": "Hidden in plain sight",
   "definition": "Which means, something that defies apprehension by being too obvious."
  },
  {
   "phrase": "High and mighty",
   "definition": "Which means, proud and arrogant."
  },
  {
   "phrase": "High on the hog",
   "definition": "Which means, luxurious."
  },
  {
   "phrase": "High season",
   "definition": "Which means, the most popular time to visit a resort or attraction - when prices are highest."
  },
  {
   "phrase": "Hit the books",
   "definition": "Which means, to study, especially for a test or exam."
  },
  {
   "phrase": "Hit the hay",
   "definition": "Which means, "
  },
  {
   "phrase": "Hit the nail on the head",
   "definition": "Which means, make the precise correct point."
  },
  {
   "phrase": "Hit the sack",
   "definition": "Which means, retire to bed."
  },
  {
   "phrase": "Hobson's choice",
   "definition": "Which means, 1. A choice forced upon someone. 2. Cockney rhyming slang for voice."
  },
  {
   "phrase": "Hocus pocus",
   "definition": "Which means, a term used to denote magic or trickery."
  },
  {
   "phrase": "Hold your horses",
   "definition": "Which means, be patient."
  },
  {
   "phrase": "Holy shit",
   "definition": "Which means, an expression of extreme surprise or disbelief."
  },
  {
   "phrase": "I can't be doing with it",
   "definition": "Which means, i am unwilling to tolerate it."
  },
  {
   "phrase": "I can't think straight",
   "definition": "Which means, i'm overwhelmed and stressed and it is affecting my ability to think."
  }
 ]
}