{
 "Idioms": [
  {
   "phrase": "Binge watch",
   "definition": "Which means, Watch multiple episodes of a television programme in succession.."
  },
  {
   "phrase": "Bitch slap",
   "definition": "Which means, An open-handed slap in the face intended to be humiliating.."
  },
  {
   "phrase": "Bite off more than you can chew",
   "definition": "Which means, Take on a task that is more than one can manage.."
  },
  {
   "phrase": "Bite the dust",
   "definition": "Which means, Die, especially in a violent or sudden way.."
  },
  {
   "phrase": "Bite your tongue",
   "definition": "Which means, Avoid speaking.."
  },
  {
   "phrase": "Blood blister",
   "definition": "Which means, Cockney rhyming slang for sister.."
  },
  {
   "phrase": "Blood is thicker than water",
   "definition": "Which means, Family loyalties are stronger than those to other people.."
  },
  {
   "phrase": "Blow a raspberry",
   "definition": "Which means, Cockney rhyming slang for fart.."
  },
  {
   "phrase": "Blue plate special",
   "definition": "Which means, A set meal provided at a reduced price.."
  },
  {
   "phrase": "Boat race",
   "definition": "Which means, Cockney rhyming slang for face.."
  },
  {
   "phrase": "Bottle and glass",
   "definition": "Which means, Cockney rhyming slang for arse.."
  },
  {
   "phrase": "Bought the farm",
   "definition": "Which means, Died, especially in a violent way which may give rise to an insurance claim.."
  },
  {
   "phrase": "Brahms and lizst",
   "definition": "Which means, Cockney rhyming slang for pissed.."
  },
  {
   "phrase": "Brass monkey weather",
   "definition": "Which means, Extremely cold weather. the full expression is 'cold enough to freeze the balls off a brass monkey'.."
  },
  {
   "phrase": "Brass tacks",
   "definition": "Which means, Cockney rhyming slang for facts.."
  },
  {
   "phrase": "Break a leg",
   "definition": "Which means, A superstitious way to wish 'good luck' to an actor before a performance while avoiding saying 'good luck' out loud, which is considered unlucky.."
  },
  {
   "phrase": "Breast is best",
   "definition": "Which means, Slogan of breastfeeding campaign.."
  },
  {
   "phrase": "Bricks and mortar",
   "definition": "Which means, Cockney rhyming slang for daughter.."
  },
  {
   "phrase": "Brighton pier",
   "definition": "Which means, Cockney rhyming slang for queer (i.e. homosexual).."
  },
  {
   "phrase": "Bring your a game",
   "definition": "Which means, Perform to the best of your ability.."
  },
  {
   "phrase": "Brown bread",
   "definition": "Which means, Cockney rhyming slang for dead.."
  },
  {
   "phrase": "Brown out",
   "definition": "Which means, 1. a partial failure of the electricity supply. 2. the exposing of one's buttocks in public.."
  },
  {
   "phrase": "Brum brum",
   "definition": "Which means, Child's play idiom expressing the sound of a vehicle.."
  },
  {
   "phrase": "Bucket list",
   "definition": "Which means, A list of things you plan to do before you 'kick the bucket' (die). often a list of fanciful ideas rather than of concrete plans.."
  },
  {
   "phrase": "Burn the midnight oil",
   "definition": "Which means, To work late into the night.."
  },
  {
   "phrase": "Bust a move",
   "definition": "Which means, Dance in a stylish way.."
  },
  {
   "phrase": "Buy a lemon",
   "definition": "Which means, Waste money by purchasing a car that is frequently faulty.."
  },
  {
   "phrase": "Calendar year",
   "definition": "Which means, Twelve months beginning from the first of january.."
  },
  {
   "phrase": "Can't cut the mustard",
   "definition": "Which means, Unable to meet the demands put upon you.."
  },
  {
   "phrase": "Canteen culture",
   "definition": "Which means, Boorish behaviour by rank and file police or soldiers.."
  },
  {
   "phrase": "Carbon footprint",
   "definition": "Which means, A measure of the amount of carbon dioxide (co2) emitted during an industrial or domestic process.."
  },
  {
   "phrase": "Carpe diem",
   "definition": "Which means, Latin expression meaning seize the day.."
  },
  {
   "phrase": "Cast iron stomach",
   "definition": "Which means, Said to be possessed by someone who is able to eat anything with no ill effects.."
  },
  {
   "phrase": "Cat got your tongue?",
   "definition": "Which means, A question addressed to someone who is inexplicably silent. the implication is that the person's tongue is missing.."
  },
  {
   "phrase": "Caught between two stools",
   "definition": "Which means, Finding it difficult to choose between two alternatives.."
  },
  {
   "phrase": "Caught by the short hairs (or short and curlies)",
   "definition": "Which means, Trapped by an opponent in a situation you can't escape.."
  },
  {
   "phrase": "Chaise lounge",
   "definition": "Which means, The american spelling for the piece of furniture known elsewhere as a chaise longue.."
  },
  {
   "phrase": "Charley horse",
   "definition": "Which means, Stiffness or cramp in the arm or leg.."
  },
  {
   "phrase": "Chasing tail",
   "definition": "Which means, Of a man pursuing women.."
  },
  {
   "phrase": "Cheek by jowl",
   "definition": "Which means, Side by side; close together.."
  },
  {
   "phrase": "Chicken feed",
   "definition": "Which means, Something of little importance, especially a small sum of money.."
  },
  {
   "phrase": "Cherry ripe",
   "definition": "Which means, Cockney rhyming slang for pipe.."
  },
  {
   "phrase": "Chew someone out",
   "definition": "Which means, Verbally scold someone.."
  },
  {
   "phrase": "Children should be seen and not heard",
   "definition": "Which means, Old proverb suggesting that children should not impinge on the adult world.."
  },
  {
   "phrase": "China plate",
   "definition": "Which means, Cockney rhyming slang for mate.."
  },
  {
   "phrase": "Chow down",
   "definition": "Which means, Begin to eat.."
  },
  {
   "phrase": "City bike",
   "definition": "Which means, A bicycle designing especially for urban riding.."
  },
  {
   "phrase": "Click bait",
   "definition": "Which means, An eye catching word or image on a website.."
  },
  {
   "phrase": "Close but no cigar",
   "definition": "Which means, Very near to success but falling short.."
  },
  {
   "phrase": "Cloud cuckoo land",
   "definition": "Which means, An imaginary idealistic state where everything is perfect. it is usually used with reference to someone who has an overly optimistic and unrealistic belief.."
  },
  {
   "phrase": "Cock and bull story",
   "definition": "Which means, An unbelievable tale.."
  },
  {
   "phrase": "Code monkey",
   "definition": "Which means, Slang term for a computer programmer.."
  },
  {
   "phrase": "Cold enough to freeze the balls off a brass monkey",
   "definition": "Which means, Extremely cold weather. the full expression is 'cold enough to freeze the balls off a brass monkey'.."
  },
  {
   "phrase": "Come hell or high water",
   "definition": "Which means, Despite any great difficult or obstacle.."
  },
  {
   "phrase": "Comfort women",
   "definition": "Which means, Women forced into sexual slavery by the japanese in wwii.."
  },
  {
   "phrase": "Company man",
   "definition": "Which means, A worker especially loyal to the employer he works for.."
  },
  {
   "phrase": "Cop an attitude",
   "definition": "Which means, Adopt an aggressive stance.."
  },
  {
   "phrase": "Corduroy road",
   "definition": "Which means, A road that is ridged and furrowed like the fabric.."
  },
  {
   "phrase": "Country house hotel",
   "definition": "Which means, An upmarket hotel located in a revamped rural mansion.."
  },
  {
   "phrase": "Crack someone up",
   "definition": "Which means, Make someone laugh.."
  },
  {
   "phrase": "Cream crackered",
   "definition": "Which means, Cockney rhyming slang for knackered. - note, when this term was coined, cream crackers were a popular snack in the uk.."
  },
  {
   "phrase": "Cross that bridge when you come to it",
   "definition": "Which means, Deal with a problem if and when it becomes necessary, not before.."
  },
  {
   "phrase": "Cross your fingers",
   "definition": "Which means, To hope that something happens.."
  },
  {
   "phrase": "Crunch time",
   "definition": "Which means, The period of time just before a project has to be completed.."
  },
  {
   "phrase": "Cry wolf",
   "definition": "Which means, Intentionally raise a false alarm.."
  },
  {
   "phrase": "Curiosity killed the cat",
   "definition": "Which means, Being inquisitive can lead you into a dangerous situation.."
  },
  {
   "phrase": "Currant bun",
   "definition": "Which means, Cockney rhyming slang for sun.."
  },
  {
   "phrase": "Cut corners",
   "definition": "Which means, Doing things in a slipshod way, to avoid expense or effort.."
  },
  {
   "phrase": "Cut to the chase",
   "definition": "Which means, Leave out all the unnecessary details and get straight to the point.."
  },
  {
   "phrase": "Daily grind",
   "definition": "Which means, The dull daily routine.."
  },
  {
   "phrase": "Daisy roots",
   "definition": "Which means, Cockney rhyming slang for boots.."
  },
  {
   "phrase": "Date rape",
   "definition": "Which means, The rape by a man of his partner on a date.."
  },
  {
   "phrase": "Day surgery",
   "definition": "Which means, Minor surgery that does not require the patient to stay in hospital overnight.."
  },
  {
   "phrase": "Daylight saving time",
   "definition": "Which means, The adjustment of clocks to provide longer evening daylight.."
  },
  {
   "phrase": "Dead ringer",
   "definition": "Which means, An exact duplicate.."
  },
  {
   "phrase": "Dead white european male",
   "definition": "Which means, Derogatory reference to someone who has an unjustified reputation.."
  },
  {
   "phrase": "Designated driver",
   "definition": "Which means, Someone who agrees not to drink alcohol at a social event in order to be sober enough to drive others home.."
  },
  {
   "phrase": "Dial down",
   "definition": "Which means, 1. adjust a device to reduce sound or temperature. 2. reduce one's emotional reaction to something.."
  },
  {
   "phrase": "Dicky dirt",
   "definition": "Which means, Cockney rhyming slang for shirt.."
  },
  {
   "phrase": "Discussing uganda",
   "definition": "Which means, Euphemism for sex.."
  },
  {
   "phrase": "Dog and bone",
   "definition": "Which means, Cockney rhyming slang for telephone.."
  },
  {
   "phrase": "Dog days of summer",
   "definition": "Which means, The hottest days of the summer season.."
  },
  {
   "phrase": "Donkey's years",
   "definition": "Which means, 1. cockney rhyming slang for ears. 2. a very long time.."
  },
  {
   "phrase": "Don't bite the hand that feeds you",
   "definition": "Which means, Don't hurt someone that helps you.."
  },
  {
   "phrase": "Don't count your chickens before they hatch",
   "definition": "Which means, Don't count on receiving some benefit until you actually have it.."
  },
  {
   "phrase": "Don't cry over spilt milk",
   "definition": "Which means, Don't fret pointlessly about some mistake or loss when it can't be remedied.."
  },
  {
   "phrase": "Don't give up the day job",
   "definition": "Which means, Said to someone who is a poor performer at a task - suggesting that they wouldn't be able to succeed at it professionally.."
  },
  {
   "phrase": "Don't look a gift horse in the mouth",
   "definition": "Which means, When you receive a gift accept it with good grace and don't find fault with it.."
  },
  {
   "phrase": "Don't put all your eggs in one basket",
   "definition": "Which means, Don't risk all your property on a single venture.."
  },
  {
   "phrase": "Double denim",
   "definition": "Which means, Denim jeans worn with a denim shirt or jacket.."
  },
  {
   "phrase": "Double header",
   "definition": "Which means, A sports expression denoting two events held at the same time.."
  },
  {
   "phrase": "Down to the wire",
   "definition": "Which means, Not decided until the very last minute.."
  },
  {
   "phrase": "Dressed to the nines",
   "definition": "Which means, Very smartly dressed, in one's best clothes.."
  },
  {
   "phrase": "Drink like a fish",
   "definition": "Which means, Drink very heavily.."
  },
  {
   "phrase": "Drive someone up the wall",
   "definition": "Which means, Irritate or annoy very much.."
  },
  {
   "phrase": "Dropping like flies",
   "definition": "Which means, Many people either falling ill or dying.."
  },
  {
   "phrase": "Dry run",
   "definition": "Which means, A rehearsal.."
  },
  {
   "phrase": "Duvet day",
   "definition": "Which means, A work day which an employee is allowed to spend at home relaxing.."
  },
  {
   "phrase": "Ear popping",
   "definition": "Which means, Sound that is loud or that catches the attention.."
  },
  {
   "phrase": "Easy-peasy",
   "definition": "Which means, Something that is extremely easy. often used by children. sometimes used by adults to demote an achievement that was accomplished with little apparent effort.."
  },
  {
   "phrase": "Eighty six",
   "definition": "Which means, Referring to an item on a menu that is no longer available.."
  }
 ]
}